var list3 = new YTList('唯識學概要', 'PLbHDOn5U0Fa1TYylZCxTFBIP9BZtRXe29')
  .add('16:47', 'vAOV4SkYrjI', '心理學的最高峰！ 01~02')
  .add('22:21', 'kfBVrFX-G7o', '印度本宗的緣起 03~04')
  .add('19:45', 'ZTGdxJnj9x8', '中國本宗的緣起 05~06')
  .add('17:27', 'cIM-BIfpLlk', '衆生八識？「我」的概念是怎麽來的？果報是如何變現的？#阿賴耶識  #末那識 06~08')
  .add('13:37', 'GT0Cqkhx8fo', '「第八識」記錄你無量劫所造業，再變現成果報 #阿賴耶識 09~10')
  .add('21:04', 'LwuMZdrVDCc', '想往生淨土？請注意「第七識」！#末那識 11~14')
  .add('19:20', 'hripZ4HYFDM', '生死業力 + 顛倒妄想 = 輪迴的力量 15~17')
  .add('12:57', 'qn2QdHOFOgY', '脫離輪迴要在「第六識」下功夫，成敗關鍵看「第七識」18~19')
  .add('21:41', 'V9292UlL24Y', '妄求主宰命運，反落輪迴之中！ 20~21')
  .add('7:29', 'Kz7aCULArzQ', '與彌陀本願相應：淨土修行的精髓 22')
  .add('13:55', 'kXzBJ1TPO94', '性相圓融：融通「空性智慧」與「淨土念佛」 23')
  .add('18:49', 'IL9ypMNOeJk', '爲什麼有些人臨命終看到「地獄火」會撲過去? 24~25')
  .add('19:34', 'LLKz6VvD8z0', '臨命終一旦被「第八識」主導，你就不可能往生！ 26~27')
  .add('12:52', 'MnYvvidsL0E', '智慧的選擇：放棄今生的果報，開始把心帶回家 28')
  .add('17:22', 'R2DezvH0W9o', '法性本來空寂，因果絲毫不爽！#阿賴耶識 29~30')
  .add('18:17', 'pBzesfFKk3k', '今生想要離開三界，一定要對治第七識！ | 只有「空正見」和「菩提心」可對治第七識 31~32')
  .add('32:08', 'JDcY__WGXfQ', '「第七識」決定你是凡夫或聖人! | 改變第七識的方法 33~36')
  .add('31:35', 'PYSjtVXvmgk', '「第六意識」 做夢造業會得果報嗎? | 臨終的正念，你只要在第二念覺悟就夠了！37~42')
  .add('24:52', 'OuWtkEl0tV8', '人臨終時，第六意識要保持清醒，因為你是隨念往生的！43~47')
  .add('36:47', 'nWBzeJdH4aY', '萬法唯識：所有的外境，都是你内心的影像 48~50')
  .add('19:06', 'hbhHBUW8ccU', '業力是如何形成的？爲什麽夢中造業不算？ 51~52')
  .add('34:52', 'vLm3eD7h5A8', '爲什麽你造了一次罪業，會很想再造第二次？ 53~55')
  .add('11:44', '1qzISpWcI7c', '爲什麼要靠發願來對治第七識？ 56~57')
  .add('29:29', 'hFJHTdUCeYo', '如何淨化阿賴耶識的惡業種子？ 58~60')
  .add('21:25', 'DsefaXqM1WI', '這樣訓練第六意識，往生極樂更有把握 | 往生全靠第六意識 95~97')
  .add('25:18', 'E-U6VIvde-c', '人生最愚蠢交易 | 佛陀警告 | 佛教智慧 | 快樂陷阱 | 人生真相 | 現代啟示 | 心靈成長 103~104')
  .add('30:07', '9luzqHiZhCA', '我們所經歷者業力釋放而已！ | 無我 | 佛教智慧 | 成唯識論 | 熏習力 | 因緣力 | 楞嚴咒 105~108')
  .add('37:44', 'hddXGhJ2vhQ', '為什麼它八萬大劫還是螞蟻？ 你卻可以做人？ | 我執 | 法執 | 放下主宰 109~112')
  .add('33:07', 'CX5OPuIssxM', '萬法唯識：你所遇見的一切，其實都是你自己！ | 即空即假即中 | 阿賴耶識 | 轉識成智 113~116')
  .add('26:22', 'P6G4cSlPwx8', '這些揮之不去的影像，才是生死輪迴的根本！| 輪迴 | 文昌帝君 | 佛教因果 117')
  .add('38:29', 'gsWrjKUK4ko', '唯識觀人生：所有遭遇都是你自導自演！| 命運 | 佛教心理學 | 淨土與唯識 | 臨終正念 | 心靈覺醒 118~122')
  .add('38:34', 'MM9vQEZqUy4', '空怎麼會變成色？佛法最難的一關，其實超有邏輯！| 空即是色 | 色即是空 123~125')
;

var list3a = [ '《唯識學概要講義》科判',
`<table cellpadding="10px" cellspacing="0" bgcolor=white>
<caption><h3>《唯識學概要講義》科判</h3></caption>
<tr><td style="border-right:1px solid gray" valign=top>
<pre>
<b>甲一、法脈源流</b>
    乙一、法門緣起
    乙二、諸師傳承
    乙三、所依經論

<b>甲二、主要教義</b>
    乙一、總標述義
        丙一、心識分類
        丙二、修學內涵
        丙三、性相圓融
    乙二、別明八識
        丙一、明第八識——釋名、述義、結示
        丙二、明第七識——釋名、述義、結示
        丙三、明前六識——釋名、述義、結示
    乙三、結示法要
        丙一、依唯識相安立緣起
            丁一、業果形成
                戊一、總說
                戊二、別明
                    己一、成就業力
                        庚一、業道成就
                        庚二、暫時潛伏
                        庚三、業力輕重
                            己二、顯現果報
                                庚一、果報種類
                                庚二、識變理論
                                庚三、識變差別
            丁二、業果相續
            丁三、業果轉變
        丙二、依唯識性發明空性
            丁一、引頌述義
            丁二、問答釋疑
            丁三、唯識正義
</pre>
</td><td style="border-right:1px solid gray" valign=top>
<pre>
<b>甲三、修行方法</b>
    乙一、理觀
        丙一、通達三性
        丙二、正修止觀
        丙三、修學次第
            丁一、道前基礎
            丁二、成就觀行
    乙二、事修
        丙一、依聖道門修學六度
            丁一、因緣
                戊一、對治障礙
                戊二、成就功德
                戊三、成辦利他
            丁二、殊勝
            丁三、方便
                戊一、總標
                戊二、別明
                    己一、意樂所攝愛重作意
                    己二、意樂所攝隨喜作意
                    己三、意樂所攝欣樂作意
                戊三、結示
            丁四、利益
                戊一、世間利益
                戊二、出世間利益
            丁五、助成
        丙二、依淨土門成就信願
            丁一、建立信心
            丁二、依觀發願
            丁三、會歸佛號
    乙三、結示
        丙一、相由心生
        丙二、相隨心轉
        丙三、善用其心
            丁一、一心二門
            丁二、轉凡成聖
</pre>
</td><td valign=top>
<pre>
<b>甲四、果地功德</b>
    乙一、果位差別
        丙一、資糧位
        丙二、加行位
        丙三、通達位
        丙四、修習位
        丙五、究竟位
    乙二、會通異說

<b>甲五、總結勸修</b>
    乙一、總結法要
    乙二、舉頌勸修
</pre>
</td></tr></table>`];
