function m(n) { return ''; }

new MyBookInfo('大佛頂首楞嚴經•卷七', '唐天竺‧沙門般剌密帝譯')
//.setImage(window['IMAGE_SAKYAMUNI'])
.addContent(

`阿難。汝問攝心。我今先說入三摩地，修學妙門，求菩薩道。要先持此四種律儀，皎如冰霜。自不能生一切枝葉。心三口四，生必無因。阿難。如是四事，若不遺失。心尚不緣色香味觸。一切魔事，云何發生。若有宿習不能滅除。汝教是人，一心誦我佛頂光明摩訶薩怛多般怛囉無上神咒。斯是如來無見頂相，無為心佛從頂發輝，坐寶蓮華所說心咒。且汝宿世與摩登伽，歷劫因緣恩愛習氣，非是一生及與一劫。我一宣揚，愛心永脫，成阿羅漢。彼尚婬女，無心修行。神力冥資速證無學。云何汝等在會聲聞，求最上乘決定成佛。譬如以塵揚於順風，有何艱險。若有末世欲坐道場。先持比丘清淨禁戒。要當選擇戒清淨者，第一沙門，以為其師。若其不遇真清淨僧，汝戒律儀必不成就。戒成已後，著新淨衣，然香閒居，誦此心佛所說神咒一百八遍，然後結界，建立道場。求於十方現住國土無上如來，放大悲光來灌其頂。阿難。如是末世清淨比丘，若比丘尼，白衣檀越，心滅貪婬，持佛淨戒。於道場中發菩薩願。出入澡浴。六時行道。如是不寐，經三七日。我自現身至其人前，摩頂安慰，令其開悟。

阿難白佛言：世尊。我蒙如來無上悲誨，心已開悟。自知修證無學道成。末法修行建立道場，云何結界，合佛世尊清淨軌則。

佛告阿難。若末世人願立道場。先取雪山大力白牛。食其山中肥膩香草。此牛唯飲雪山清水。其糞微細。可取其糞，和合栴檀，以泥其地。若非雪山，其牛臭穢，不堪塗地。別於平原，穿去地皮五尺已下，取其黃土，和上栴檀、沈水、蘇合、薰陸、鬱金、白膠、青木、零陵、甘松、及雞舌香。以此十種細羅為粉。合土成泥，以塗場地。方圓丈六，為八角壇。壇心置一金銀銅木所造蓮華。華中安砵。砵中先盛八月露水。水中隨安所有華葉。取八圓鏡，各安其方，圍繞華砵。鏡外建立十六蓮華。十六香鑪，間華鋪設。莊嚴香鑪，純燒沈水，無令見火。取白牛乳，置十六器。乳為煎餅，并諸砂糖、油餅、乳糜、蘇合、蜜薑、純酥、純蜜。於蓮華外，各各十六圍繞華外。以奉諸佛及大菩薩。每以食時，若在中夜，取蜜半升，用酥三合。壇前別安一小火爐。以兜樓婆香，煎取香水，沐浴其炭，然令猛熾。投是酥蜜於炎爐內，燒令煙盡，享佛菩薩。令其四外遍懸幡華。於壇室中，四壁敷設十方如來及諸菩薩所有形像。應於當陽，張盧舍那、釋迦、彌勒、阿閦、彌陀。諸大變化觀音形像，兼金剛藏，安其左右。帝釋、梵王、烏芻瑟摩、并藍地迦、諸軍茶利、與毗俱胝、四天王等，頻那夜迦，張於門側，左右安置。又取八鏡覆懸虛空，與壇場中所安之鏡，方面相對，使其形影重重相涉。於初七中，至誠頂禮十方如來，諸大菩薩，阿羅漢號。恒於六時誦咒圍壇，至心行道。一時常行一百八遍。第二七中，一向專心發菩薩願，心無間斷。我毗奈耶先有願教。第三七中，於十二時，一向持佛般怛囉咒。至第七日，十方如來一時出現。鏡交光處，承佛摩頂。即於道場修三摩地。能令如是末世修學，身心明淨猶如琉璃。阿難。若此比丘本受戒師，及同會中十比丘等，其中有一不清淨者，如是道場多不成就。從三七後，端坐安居，經一百日。有利根者，不起於座，得須陀洹。縱其身心聖果未成。決定自知成佛不謬。汝問道場，建立如是。

阿難頂禮佛足，而白佛言：自我出家，恃佛憍愛。求多聞故，未證無為。遭彼梵天邪術所禁心雖明了，力不自由。賴遇文殊，令我解脫。雖蒙如來佛頂神咒，冥獲其力，尚未親聞。惟願大慈重為宣說，悲救此會諸修行輩，末及當來在輪迴者，承佛密音，身意解脫。

於時會中一切大眾，普皆作禮，佇聞如來秘密章句。爾時世尊從肉髻中。涌百寶光。光中涌出千葉寶蓮。有化如來，坐寶華中。頂放十道百寶光明。一一光明。皆遍示現十恒河沙金剛密跡，擎山持杵，遍虛空界。大眾仰觀，畏愛兼抱，求佛哀祐。一心聽佛無見頂相放光如來宣說神咒。

南無薩怛他 蘇伽多耶 阿羅訶帝 三藐三菩陀寫 薩怛他 佛陀俱胝、瑟尼釤 " +

m('I') +
m(1) +"南無薩婆 勃陀勃地 薩跢鞞弊 " +
m(2) +"南無薩多南 三藐三菩陀 俱知喃 娑舍囉、婆迦 僧伽喃 " +
m(3) +"南無盧雞、阿羅漢、跢喃 " +
m(4) +"南無蘇盧多、波那喃 " +
m(5) +"南無娑羯唎陀、伽彌喃　" +
m(7) +"南無盧雞、三藐、伽跢喃 三藐、伽波囉 底波、多那喃 " +
m(8) +"南無提婆、離瑟赧 " +
m(9) +"南無悉陀耶 毗地耶 陀囉離瑟赧 舍波奴 揭囉訶 娑訶娑囉、摩他喃 " +
m(10)+"南無跋囉訶、摩泥 " +
m(11)+"南無因陀囉耶 " +
m(12)+"南無婆伽婆帝 嚧陀囉耶 烏摩般帝 娑醯夜耶 " +
m(13)+"南無婆伽婆帝 那囉野 拏耶 槃遮摩訶、三慕陀囉 南無悉羯唎多耶 " +
m(14)+"南無婆伽婆帝 摩訶迦羅耶 地唎、般剌那 伽囉毗陀囉 波拏、迦囉耶 阿地目帝 尸摩舍那泥 婆悉泥 摩怛唎伽拏 南無悉羯唎多耶 " +
m(15)+"南無婆伽婆帝 多他伽跢、俱囉耶 " +
m(16)+"南無般頭摩、俱囉耶 " +
m(17)+"南無跋闍囉、俱囉耶 " +
m(18)+"南無摩尼、俱囉耶 " +
m(19)+"南無伽闍、俱囉耶 " +
m(20)+"南無婆伽婆帝 帝唎茶 輸囉西那 波囉訶囉、拏囉闍耶 跢他伽多耶 " +
m(21)+"南無婆伽婆帝南無阿彌、多婆耶 跢他伽多耶 阿囉訶帝 三藐三菩陀耶 " +
m(22)+"南無婆伽婆帝 阿芻鞞耶 跢他伽多耶 阿囉訶帝 三藐三菩陀耶 " +
m(23)+"南無婆伽婆帝 鞞沙闍耶 俱盧、吠柱唎耶 般囉婆、囉闍耶 跢他伽多耶 " +
m(24)+"南無婆伽婆帝 三補師、毖多 薩憐捺囉剌闍耶 跢他伽多耶 阿囉訶帝 三藐三菩陀耶 " +
m(25)+"南無婆伽婆帝 舍雞野、母那曳 跢他伽多耶 阿囉訶帝 三藐三菩陀耶 " +
m(26)+"南無婆伽婆帝 剌怛那、雞都、囉闍耶 跢他伽多耶 阿囉訶帝 三藐三菩陀耶 " +
m(27)+"帝瓢 南無薩羯唎多 " +
m(28)+"翳曇、婆伽婆多 薩怛他、伽都瑟尼釤 薩怛多、般怛藍 南無 阿婆囉視耽 般囉帝 揚歧囉 " +
m(29)+"薩囉婆 部多、揭囉訶 尼羯囉訶 羯迦囉訶尼 " +
m(30)+"跋囉、毖地耶 叱陀你 " +
m(31)+"阿迦囉 密唎柱 般唎 怛囉耶 儜揭唎 " +
m(32)+"薩囉婆 槃陀那 目叉尼 " +
m(33)+"薩囉婆 突瑟吒 突悉乏般那 你伐囉尼" +
m(34)+"赭都囉 失帝南 羯囉訶 娑訶、薩囉、若闍 毗多崩娑那、羯唎 " +
m(35)+"阿瑟吒、冰舍帝南 那叉剎怛囉、若闍 波囉、薩陀那、羯唎 " +
m(36)+"阿瑟吒南 摩訶羯囉訶、若闍 毗多崩、薩那、羯唎 " +
m(37)+"薩婆、舍都嚧 你婆囉、若闍 " +
m(38)+"呼藍、突悉乏難 遮 那舍尼 " +
m(39)+"毖沙 舍悉怛囉 阿吉尼 烏陀迦囉、若闍 " +
       "阿般囉視多、具囉 " +
       "摩訶般囉、戰持 摩訶疊多 " +
m(40)+"摩訶帝闍 摩訶稅多、闍婆囉 摩訶跋囉、槃陀囉 婆悉你 " +
m(41)+"阿唎耶、多囉 毗唎俱知 誓婆、毗闍耶 跋闍囉、摩禮底 毗舍嚧多 " +
m(42)+"勃騰罔迦 跋闍囉、制喝那、阿遮 摩囉制婆 般囉質多 跋闍囉、擅持 毗舍囉 遮 " +
       "扇多舍 鞞提婆 補視多" +
m(43)+"蘇摩嚧波 摩訶稅多" +
m(44)+"阿唎耶、多囉 摩訶婆囉、阿般囉 跋闍囉、商羯囉、制婆" +
m(45)+"跋闍囉、俱摩唎 俱藍陀唎 跋闍囉、喝薩多 遮" +
       "毗地耶 乾遮那 摩唎迦" +
m(46)+"啒蘇母婆羯 囉跢那 鞞嚧遮那 俱唎耶 夜囉菟 瑟尼釤 毗折藍婆、摩尼 遮 " +
m(47)+"跋闍囉、迦那迦、波囉婆 嚧闍那 跋闍囉、頓稚 遮 " +
       "稅多 遮 迦摩囉 剎奢尸 波囉婆 " +
m(48)+"翳帝夷帝 母陀囉 羯拏 娑鞞囉懺 掘梵都 印兔那、麼麼 寫

m('II') +
m(1) +"烏(合牛) 唎瑟、揭拏 般剌、舍悉多 薩怛他 伽都瑟尼釤 虎(合牛)都嚧雍 " +
m(2) +"|瞻婆那 虎(合牛)都嚧雍 " +
m(3) +"|悉眈婆那 虎(合牛)都嚧雍 " +
m(6) +"|波囉瑟地耶 三般叉 拏羯囉虎(合牛)都嚧雍 " +
m(8) +"|薩婆藥叉 喝囉剎裟 揭囉訶、若闍 毗騰崩、薩那羯囉 虎(合牛)都嚧雍 " +
m(9) +"|者都囉 尸底南 揭囉訶 娑訶薩囉南 毗騰崩、薩那囉 虎(合牛)都嚧雍 " +
m(12)+"|囉叉 " +
m(13)+"婆伽梵 薩怛他 伽都瑟尼釤 波囉點 闍吉唎 摩訶、娑訶薩囉 勃樹、娑訶薩囉 室唎沙 俱知、娑訶薩泥 帝隸、" +
m(14)+"阿弊提視、婆唎多 吒吒甖迦 摩訶、跋闍嚧陀囉 帝唎 菩婆那 曼茶囉 " +
m(15)+"烏(合牛) 娑悉帝 薄婆都 麼麼 印兔那、麼麼寫

m('III') +
m(1) +"囉闍婆夜 主囉跋夜 阿祇尼、婆夜 烏陀迦、婆夜 毗沙、婆夜 舍薩多囉、婆夜婆囉、斫羯囉、婆夜 突瑟叉、婆夜 阿舍你、婆夜 阿迦囉 密唎柱、婆夜 陀囉尼、部彌劍 波伽波陀、婆夜 烏囉迦、婆多、婆夜 剌闍壇茶、婆夜 那伽婆夜毗條怛、婆夜 蘇波囉拏、婆夜 藥叉、揭囉訶 囉叉私、揭囉訶 畢唎多、揭囉訶 毗舍遮、揭囉訶 部多、揭囉訶 鳩槃茶、揭囉訶 補丹那、揭囉訶 迦吒補丹那、揭囉訶 悉乾度、揭囉訶 阿播悉摩囉、揭囉訶 烏檀摩陀、揭囉訶 車夜揭囉訶 醯唎婆帝、揭囉訶 社多、訶唎南 揭婆 訶唎南 嚧地囉、訶唎南 忙娑 訶唎南 謎陀、訶唎南 摩闍、訶唎南 闍多、訶唎女 視比多、訶唎南 毗多、訶唎南 婆多 訶唎南 阿輸遮、訶唎女 質多、訶唎女 帝釤、薩鞞釤 薩婆、揭囉訶南毗陀、夜闍 瞋陀、夜彌 雞囉、夜彌 波唎、跋囉、者迦 訖唎擔 毗陀、夜闍瞋陀、夜彌 雞囉夜彌 茶演尼 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 摩訶般輸、般怛夜 嚧陀囉 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 那囉夜拏 訖唎擔毗陀夜闍 瞋陀夜彌 雞囉夜彌 怛埵伽嚧、茶西 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 摩訶迦囉 摩怛唎伽拏 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 迦波唎迦訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 闍耶羯囉 摩度、羯囉 薩婆、囉他、娑達那 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 赭咄囉 婆耆你 訖唎擔 毗陀夜闍瞋陀夜彌 雞囉夜彌 毗唎羊、訖唎知 難陀、雞沙囉 伽拏、般帝 索醯夜 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 那揭、那舍囉、婆拏 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 阿羅漢 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 毗多囉伽 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 跋闍囉波你 具醯夜、具醯夜 迦地、般帝 訖唎擔 毗陀夜闍 瞋陀夜彌 雞囉夜彌 囉叉罔 婆伽梵 印兔那、麼麼寫婆伽梵 薩怛多、般怛囉 南無粹都帝 阿悉多、那囉剌迦 波囉婆 悉普吒 毗迦、薩怛多、砵帝唎 什佛囉、什佛囉 陀囉陀囉 頻陀囉、頻陀囉 瞋陀瞋陀 虎(合牛)虎(合牛) 泮吒、泮吒、泮吒、泮吒、泮吒 娑訶 " +

醯醯泮 " +
阿牟迦耶泮 " +
阿波囉、提訶多泮 " +
婆囉、波囉陀泮 " +
阿素囉 毗陀囉 波迦泮 " +
薩婆、提鞞、弊泮薩婆、那伽、弊泮 " +
薩婆、藥叉、弊泮 " +
薩婆、乾闥婆、弊泮 " +
薩婆、補丹那、弊泮 " +
迦吒補丹那、弊泮 " +
薩婆、突狼枳帝、弊泮 " +
薩婆、突澀比犁 訖瑟帝、弊泮 " +
薩婆、什婆唎、弊泮 " +
薩婆、阿播悉摩犁、弊泮 " +
薩婆、舍囉、婆拏、弊泮 " +
薩婆、地帝雞、弊泮 " +
薩婆、怛摩陀繼、弊泮 " +
薩婆、毗陀耶 囉誓、遮犁、弊泮 " +
闍夜羯囉 摩度羯囉 薩婆、囉他娑陀雞、弊泮 " +
毗地夜 遮唎、弊泮 " +
者都囉 縛耆你、弊泮 " +
跋闍囉 俱摩唎 毗陀夜 囉誓、弊泮 " +
摩訶波囉、丁羊 叉耆唎、弊泮 " +
跋闍囉、商羯囉夜 波囉丈耆、囉闍耶泮 " +
摩訶迦囉夜 摩訶、末怛唎迦拏 南無、娑羯唎多、夜泮 " +
毖瑟拏婢、曳泮 " +
勃囉訶、牟尼、曳泮 " +
阿耆尼、曳泮 " +
摩訶羯唎、曳泮 " +
羯囉檀持、曳泮 " +
蔑怛唎、曳泮 " +
嘮怛唎、曳泮 " +
遮文茶、曳泮 " +
m(53)+"羯邏囉怛唎、曳泮 " +
m(54)+"迦般唎、曳泮 " +
m(55)+"阿地目、質多 迦尸摩、舍那 婆私你、曳泮 " +
m(56)+"演吉質 薩埵、婆寫 麼麼 印兔那、麼麼 寫

m('V') +
突瑟吒、質多 阿末怛唎、質多 烏闍、訶囉 伽婆、訶囉 嚧地囉、訶囉 婆娑、訶囉 摩闍、訶囉闍多、訶囉 視毖多、訶囉 跋略夜、訶囉 乾陀、訶囉 布史波、訶囉 頗囉、訶囉 婆寫、訶囉 般波、質多 突瑟吒、質多 嘮陀囉、質多藥叉、揭囉訶 囉剎娑、揭囉訶 閉隸多、揭囉訶 毗舍遮、揭囉訶 部多、揭囉訶 鳩槃茶、揭囉訶 悉乾陀、揭囉訶 烏怛摩陀、揭囉訶 車夜、揭囉訶 阿播薩摩囉、揭囉訶 宅袪革 茶耆尼、揭囉訶 唎佛帝、揭囉訶 闍彌迦、揭囉訶 舍俱尼、揭囉訶 姥陀囉 難地迦、揭囉訶 阿藍婆、揭囉訶 乾度波尼、揭囉訶 什佛囉 堙迦醯迦 墜帝藥迦 怛隸帝藥迦 者突託迦 昵提、什伐囉 毖釤摩、什伐囉薄底迦 鼻底迦 室隸、瑟密迦 娑你、般帝迦 薩婆、什伐囉 室嚧吉帝 末陀、鞞達、嚧制劍 阿綺嚧鉗 目佉嚧鉗 羯唎突嚧鉗 揭囉訶 揭藍、羯拏、輸藍 憚多、輸藍 迄唎夜、輸藍 末麼、輸藍 跋唎室婆、輸藍 毖栗瑟吒、輸藍 烏陀囉、輸藍 羯知輸藍 跋悉帝輸藍 鄔嚧輸藍 常伽輸藍 喝悉多輸藍 跋陀輸藍 娑房盎伽 般囉、丈伽、輸藍 部多、毖跢茶 茶耆尼 什婆囉 陀突嚧迦 建咄嚧吉知 婆路多毗 薩般嚧 訶凌伽 輸沙怛囉 娑那羯囉 毗沙喻迦 阿耆尼 烏陀迦 末囉、鞞囉 建跢囉 阿迦囉 密唎咄 怛斂部迦 地栗剌吒 毖唎瑟質迦 薩婆那俱囉肆引伽弊 揭囉唎、藥叉 怛囉芻 末囉視 吠帝釤 娑鞞釤 悉怛多、砵怛囉 摩訶跋闍嚧 瑟尼釤 摩訶般賴、丈耆藍 夜波突陀 舍喻闍那 辮怛隸拏 毗陀耶 槃曇迦嚧彌 帝殊 槃曇迦嚧彌 般囉毗陀 槃曇迦嚧彌 跢姪他 唵 阿那隸 毗舍提 鞞囉 跋闍囉 陀唎 槃陀槃陀你 跋闍囉 謗尼泮 虎(合牛)都嚧甕泮 莎婆訶。

阿難。是佛頂光聚，悉怛多般怛羅，祕密伽陀，微妙章句。出生十方一切諸佛。十方如來，因此咒心，得成無上正遍知覺。十方如來，執此咒心，降伏諸魔，制諸外道。十方如來，乘此咒心，坐寶蓮華，應微塵國。十方如來，含此咒心，於微塵國轉大法輪。十方如來，持此咒心，能於十方摩頂授記。自果未成，亦於十方蒙佛授記。十方如來，依此咒心，能於十方拔濟群苦。所謂地獄餓鬼畜生，盲聾瘖啞，怨憎會苦、愛別離苦、求不得苦、五陰熾盛，大小諸橫同時解脫。賊難兵難、王難獄難、風火水難、飢渴貧窮，應念銷散。十方如來，隨此咒心，能於十方事善知識，四威儀中供養如意。恒沙如來會中，推為大法王子。十方如來，行此咒心，能於十方攝受親因，令諸小乘聞祕密藏，不生驚怖。十方如來，誦此咒心，成無上覺，坐菩提樹，入大涅槃。十方如來，傳此咒心，於滅度後付佛法事，究竟住持，嚴淨戒律，悉得清淨。若我說是佛頂光聚般怛羅咒，從旦至暮，音聲相聯，字句中間，亦不重疊，經恒沙劫終不能盡。亦說此咒名如來頂。汝等有學，未盡輪迴，發心至誠取阿羅漢，不持此咒而坐道場，令其身心遠諸魔事，無有是處。

阿難。若諸世界，隨所國土所有眾生，隨國所生樺皮貝葉紙素白(疊毛)書寫此咒，貯於香囊。是人心昏，未能誦憶。或帶身上。或書宅中。當知是人盡其生年，一切諸毒所不能害。

阿難。我今為汝更說此咒，救護世間得大無畏，成就眾生出世間智。若我滅後，末世眾生，有能自誦，若教他誦，當知如是誦持眾生，火不能燒，水不能溺，大毒小毒所不能害。如是乃至天龍鬼神，精祇魔魅，所有惡咒，皆不能著。心得正受。一切咒詛厭蠱毒藥、金毒銀毒、草木蟲蛇萬物毒氣，入此人口，成甘露味。一切惡星并諸鬼神，磣心毒人，於如是人不能起惡。頻那夜迦諸惡鬼王，并其眷屬，皆領深恩，常加守護。

阿難當知。是咒常有八萬四千那由他恒河沙俱胝金剛藏王菩薩種族，一一皆有諸金剛眾而為眷屬，晝夜隨侍。設有眾生，於散亂心，非三摩地，心憶口持。是金剛王，常隨從彼諸善男子。何況決定菩提心者。此諸金剛菩薩藏王，精心陰速，發彼神識。是人應時心能記憶八萬四千恒河沙劫，周遍了知，得無疑惑。從第一劫乃至後身，生生不生藥叉羅剎，及富單那，迦吒富單那，鳩槃茶，毗舍遮等，并諸餓鬼，有形無形、有想無想、如是惡處。是善男子，若讀若誦、若書若寫、若帶若藏，諸色供養，劫劫不生貧窮下賤不可樂處。此諸眾生，縱其自身不作福業，十方如來所有功德，悉與此人。由是得於恒河沙阿僧祇不可說不可說劫，常與諸佛同生一處。無量功德，如惡叉聚。同處熏修，永無分散。是故能令破戒之人，戒根清淨。未得戒者，令其得戒。未精進者，令得精進。無智慧者，令得智慧。不清淨者，速得清淨。不持齋戒，自成齋戒。

阿難。是善男子持此咒時。設犯禁戒於未受時。持咒之後。眾破戒罪，無問輕重，一時銷滅。縱經飲酒，食噉五辛，種種不淨，一切諸佛菩薩金剛天仙鬼神不將為過。設著不淨破弊衣服。一行一住悉同清淨。縱不作壇，不入道場，亦不行道，誦持此咒，還同入壇行道功德，無有異也。若造五逆無間重罪，及諸比丘比丘尼四棄八棄，誦此咒已，如是重業，猶如猛風吹散沙聚悉皆滅除，更無毫髮。

阿難。若有眾生，從無量無數劫來，所有一切輕重罪障，從前世來未及懺悔。若能讀誦書寫此咒，身上帶持，若安住處莊宅園館。如是積業，猶湯銷雪。不久皆得悟無生忍。復次阿難。若有女人，未生男女，欲求孕者，若能至心憶念斯咒，或能身上帶此悉怛多般怛囉者，便生福德智慧男女。求長命者，即得長命，欲求果報速圓滿者，速得圓滿。身命色力，亦復如是。命終之後，隨願往生十方國土，必定不生邊地下賤，何況雜形。

阿難。若諸國土州縣聚落，饑荒疫癘。或復刀兵賊難鬥諍。兼餘一切厄難之地。寫此神咒，安城四門，并諸支提，或脫闍上。令其國土所有眾生，奉迎斯咒，禮拜恭敬，一心供養。令其人民各各身佩。或各各安所居宅地。一切災厄悉皆銷滅。阿難。在在處處，國土眾生，隨有此咒，天龍歡喜，風雨順時，五穀豐殷，兆庶安樂。亦復能鎮一切惡星，隨方變怪。災障不起。人無橫夭。杻械枷鎖不著其身。晝夜安眠，常無惡夢。

阿難。是娑婆界，有八萬四千災變惡星。二十八大惡星而為上首。復有八大惡星以為其主。作種種形出現世時，能生眾生種種災異。有此咒地，悉皆銷滅。十二由旬成結界地。諸惡災祥永不能入。是故如來宣示此咒，於未來世，保護初學諸修行者，入三摩提，身心泰然，得大安隱。更無一切諸魔鬼神，及無始來冤橫宿殃，舊業陳債，來相惱害。汝及眾中諸有學人，及未來世諸修行者，依我壇場如法持戒，所受戒主，逢清淨僧，持此咒心，不生疑悔。是善男子，於此父母所生之身，不得心通，十方如來便為妄語。

說是語已。會中無量百千金剛，一時佛前合掌頂禮，而白佛言：如佛所說。我當誠心保護如是修菩提者。爾時梵王、并天帝釋、四天大王，亦於佛前同時頂禮，而白佛言：審有如是修學善人，我當盡心至誠保護，令其一生所作如願。復有無量藥叉大將、諸羅剎王、富單那王、鳩槃茶王、毗舍遮王、頻那夜迦、諸大鬼王、及諸鬼帥，亦於佛前合掌頂禮。我亦誓願護持是人，令菩提心速得圓滿。復有無量日月天子，風師雨師，雲師雷師，并電伯等，年歲巡官，諸星眷屬，亦於會中頂禮佛足，而白佛言：我亦保護是修行人，安立道場，得無所畏。復有無量山神海神，一切土地水陸空行，萬物精祇，并風神王，無色界天，於如來前，同時稽首而白佛言：我亦保護是修行人，得成菩提，永無魔事。爾時八萬四千那由他恒河沙俱胝金剛藏王菩薩，在大會中，即從座起，頂禮佛足而白佛言：世尊。如我等輩所修功業，久成菩提，不取涅槃，常隨此咒，救護末世修三摩提正修行者。世尊。如是修心求正定人，若在道場及餘經行，乃至散心遊戲聚落，我等徒眾，常當隨從侍衛此人。縱令魔王大自在天，求其方便，終不可得。諸小鬼神，去此善人十由旬外。除彼發心樂修禪者。世尊。如是惡魔若魔眷屬，欲來侵擾是善人者。我以寶杵殞碎其首，猶如微塵。恒令此人，所作如願。

阿難即從座起，頂禮佛足而白佛言：我輩愚鈍，好為多聞於諸漏心未求出離。蒙佛慈誨，得正熏修，身心快然，獲大饒益。世尊。如是修證佛三摩提，未到涅槃。云何名為乾慧之地，四十四心，至何漸次，得修行目。詣何方所，名入地中。云何名為等覺菩薩。作是語已，五體投地。大眾一心，佇佛慈音，瞪瞢瞻仰。

爾時世尊讚阿難言：善哉善哉。汝等乃能普為大眾，及諸末世一切眾生，修三摩提求大乘者，從於凡夫終大涅槃，懸示無上正修行路。汝今諦聽。當為汝說，阿難大眾，合掌刳心，默然受教。佛言：阿難當知。妙性圓明，離諸名相，本來無有世界眾生。因妄有生。因生有滅。生滅名妄。滅妄名真。是稱如來無上菩提，及大涅槃，二轉依號。阿難。汝今欲修真三摩地，直詣如來大涅槃者，先當識此眾生世界二顛倒因。顛倒不生，斯則如來真三摩地。阿難。云何名為眾生顛倒。阿難。由性明心，性明圓故。因明發性，性妄見生。從畢竟無成究竟有。此有所有，非因所因，住所住相，了無根本。本此無住，建立世界，及諸眾生。迷本圓明，是生虛妄。妄性無體，非有所依。將欲復真，欲真已非真真如性。非真求復，宛成非相。非生非住，非心非法，展轉發生。生力發明，熏以成業。同業相感。因有感業相滅相生。由是故有眾生顛倒。阿難。云何名為世界顛倒。是有所有，分段妄生，因此界立。非因所因，無住所住，遷流不住，因此世成。三世四方，和合相涉，變化眾生成十二類。是故世界因動有聲。因聲有色。因色有香。因香有觸。因觸有味。因味知法。六亂妄想成業性故。十二區分由此輪轉。是故世間聲香味觸，窮十二變為一旋復。乘此輪轉顛倒相故。是有世界卵生、胎生、濕生、化生、有色、無色、有想、無想、若非有色、若非無色、若非有想、若非無想。阿難。由因世界虛妄輪迴，動顛倒故，和合氣成八萬四千飛沈亂想。如是故有卵羯邏藍，流轉國土。魚鳥龜蛇，其類充塞。由因世界雜染輪迴，欲顛倒故，和合滋成八萬四千橫豎亂想。如是故有胎遏蒲曇，流轉國土。人畜龍仙，其類充塞。由因世界執著輪迴，趣顛倒故，和合煖成八萬四千翻覆亂想。如是故有濕相蔽尸，流轉國土。含蠢蝡動，其類充塞。由因世界變易輪迴，假顛倒故。和合觸成八萬四千新故亂想。如是故有化相羯南，流轉國土。轉蛻飛行，其類充塞。由因世界留礙輪迴，障顛倒故，和合著成八萬四千精耀亂想。如是故有色相羯南，流轉國土。休咎精明，其類充塞。由因世界銷散輪迴，惑顛倒故。和合暗成八萬四千陰隱亂想。如是故有無色羯南，流轉國土。空散銷沈，其類充塞。由因世界罔象輪迴，影顛倒故，和合憶成八萬四千潛結亂想。如是故有想相羯南，流轉國土。神鬼精靈，其類充塞。由因世界愚鈍輪迴，癡顛倒故，和合頑成八萬四千枯槁亂想。如是故有無想羯南，流轉國土。精神化為土木金石，其類充塞。由因世界相待輪迴，偽顛倒故，和合染成八萬四千因依亂想。如是故有非有色相，成色羯南，流轉國土。諸水母等，以蝦為目，其類充塞。由因世界相引輪迴，性顛倒故，和合咒成八萬四千呼召亂想。由是故有非無色相，無色羯南，流轉國土。咒詛厭生，其類充塞。由因世界合妄輪迴，罔顛倒故，和合異成八萬四千迴互亂想。如是故有非有想相，成想羯南，流轉國土。彼蒲盧等異質相成，其類充塞。由因世界怨害輪迴，殺顛倒故，和合怪成八萬四千食父母想。如是故有非無想相，無想羯南，流轉國土。如土梟等附塊為兒，及破鏡鳥以毒樹果，抱為其子，子成，父母皆遭其食，其類充塞。是名眾生十二種類。`

);
