var 禪波羅蜜KP =
`
1.000|修禪波羅蜜大意            // 第一卷上
1.001|　簡非                # 十種行人
     |　　一為利養故                # 多屬發地獄心
     |　　邪偽心生為名聞稱歎故      # 多屬發鬼神心
     |　　為眷屬故                  # 多屬發畜生心
     |　　為嫉妬勝他故              # 多屬發修羅心
     |　　為畏惡道苦報息諸不善業故  # 多屬發人心
     |　　為善心安樂故              # 多屬發六欲天心
     |　　為得勢力自在故            # 多屬發魔羅心
     |　　為得利智捷疾故            # 多屬發外道心
     |　　為生梵天處故              # 屬發色無色界心
     |　　為度老病死苦疾得涅槃故    # 屬發二乘心
1.002|　正明所為
     |　　明菩薩發心之相    # 發菩提心
1.003|　　正明菩薩修禪所為  # 行菩薩道

2.000|釋禪波羅蜜名
2.001|　共不共名
2.002|　翻譯
     |　〰翻釋共名          # 禪
     |　〰　翻名
     |　〰　　三翻          # 思惟修。定。功德叢林
2.003|　〰　　釋三翻
     |　〰　　　別          # 對因。對果。對因果
2.004|　〰　　　通          # 三翻並對因果
2.005|　〰翻釋不共名        # 波羅蜜
     |　〰　翻名            # 到彼岸。云事究竟。度無極
2.006|　〰　　釋三翻
     |　〰　　　別          # 约理。事行。約事理行滿
2.007|　〰　　　通          # 三翻同對事理。俱隨緣化物
2.008|　〰　釋禪名波羅蜜
     |　〰　　禪攝一切勝妙功德
     |　〰　　四禪中智定等
     |　〰　　約禪說波羅蜜攝一切諸定
2.009|　〰　　釋疑
     |　料簡

3.000|明禪波羅蜜門
3.001|　標禪門
3.002|　〰色門二
     |　〰　不淨觀門
     |　〰　阿那波那門
     |　〰心門一
     |　〰　觀心性
     |　〰禪門三種
     |　〰　世間禪門        # 凡夫禪門
     |　〰　出世間禪門      # 二乘禪門
     |　〰　出世間上上禪門  # 菩薩禪門
3.003|　解釋
     |　〰別明門            # 以息。色。心為禪門
     |　〰　以息為禪門      # 往據凡夫禪門
     |　〰　以色為禪門      # 往據二乘禪門
     |　〰　以心為禪門      # 往據菩薩禪門
3.004|　〰立三法為門
     |　〰　如法相          # 一命二暖三識
     |　〰　　出入息名為壽命
     |　〰　　不臭不爛名為暖
     |　〰　　心意名為識命
3.005|　〰　隨便易
     |　〰　息為禪門二便
     |　〰　　疾得禪定
     |　〰　　易悟無常
     |　〰　色為禪門二便
     |　〰　　能斷貪欲
     |　〰　　易了虛假
     |　〰　心為禪門二便
     |　〰　　能降一切煩惱
     |　〰　　易悟空理
3.006|　〰　攝法盡
     |　〰　　三門攝一切禪門
3.007|　〰通名三門
     |　〰　三門通得作世間。出世間。出世間上上等禪門
3.008|　料簡通別二門
     |　〰　釋疑

4.000|辨禪波羅蜜詮次            // 第一卷下
4.001|　正明諸禪次第
     |　〰初
     |　〰　持戒清淨厭患欲界
     |　〰　入欲界定            # 得未到地
     |　〰十二門有漏禪
     |　〰　內色界定
     |　〰　　初禪
     |　〰　　二禪
     |　〰　　三禪
     |　〰　　四禪
     |　〰　外色界定
     |　〰　　大功德
     |　〰　　緣外眾生
     |　〰　　受樂歡喜
     |　〰　　得四無量心
     |　〰　無色界定
     |　〰　　滅內色
     |　〰　　滅外色
     |　〰　　一心緣空得度色難
     |　〰　　得四空處定
4.002|　〰亦有漏亦無漏禪
     |　〰　修六妙門
4.003|　〰　修十六特勝      # 橫對四念處。竪從欲界乃至非想
4.004|　〰淨禪              # 細觀。亦從欲界至非想乃至入滅定
     |　〰　別觀
     |　〰　　欲界至非想
     |　〰　　入滅定
4.005|　〰無漏禪
     |　〰　行行次第        # 觀鍊熏修
4.006|　〰　〰初修九想
     |　〰　〰觀禪次第
     |　〰　〰　八念
     |　〰　〰　十想
     |　〰　〰　八背捨
     |　〰　〰　八勝處
     |　〰　〰　十一切處
     |　〰　〰　六神通
4.007|　〰　〰鍊禪次第
     |　〰　〰　九次第定
4.008|　〰　〰熏禪次第
     |　〰　〰　師子奮迅三昧
4.009|　〰　〰修禪次第
     |　〰　〰　超越三昧
4.010|　〰　慧行次第
     |　〰　　聲聞無漏慧行次第
     |　〰　　辟支迦羅無漏慧行次第
     |　〰　　菩薩無漏慧行次第
4.011|　〰　菩薩不共禪次第
     |　〰　　自性禪
     |　〰　　一切義禪
     |　〰　　難禪
     |　〰　　一切門禪
     |　〰　　善人禪
     |　〰　　一切行禪
     |　〰　　除惱禪
     |　〰　　此世他世樂禪
     |　〰　　清淨淨禪
     |　〰　　乃至佛地。名住大涅槃深禪定窟
4.012|　簡非次第
     |　〰菩薩修禪或一向次第或非次第
     |　〰　次第
4.013|　〰　非次第
4.014|　〰　次第非次第
4.015|　〰　非次第次第
4.016|　〰此四句亦通二乘

5.000|簡禪波羅蜜法心
     |　諸禪法心之相
5.001|　〰辨法
5.002|　〰　有漏法
5.003|　〰　無漏法
5.004|　〰　亦有漏亦無漏法
5.005|　〰　非有漏非無漏法
5.006|　〰　釋疑
5.007|　〰明心
5.008|　〰　有漏心
5.009|　〰　無漏心
5.010|　〰　亦有漏亦無漏心
5.011|　〰　非有漏非無漏心
5.012|　〰料簡法心

6.000|分別禪波羅蜜前方便
6.001|　外方便                  // 第二卷
6.002|　〰具五緣
6.003|　〰　持戒清淨
6.004|　〰　〰有戒無戒
     |　〰　〰　發戒機緣不同    # 凡有十種
6.005|　〰　〰　戒之體相        # 教門不同
     |　〰　〰　　小乘教        # 戒是無作善法
     |　〰　〰　　大乘教        # 說戒從心起
6.006|　〰　〰　戒相不同
     |　〰　〰　　小乘          # 七眾發心。受戒作法不同
6.007|　〰　〰　　沙彌          # 十戒相
6.008|　〰　〰持犯
6.009|　〰　〰　略明持犯
     |　〰　〰　〰持相。十利
     |　〰　〰　〰　攝僧故
     |　〰　〰　〰　極好攝故
     |　〰　〰　〰　僧安樂住故
     |　〰　〰　〰　折伏高心人故
     |　〰　〰　〰　慚愧得安樂住故
     |　〰　〰　〰　不信令信故
     |　〰　〰　〰　已信增長信故
     |　〰　〰　〰　遮今世漏故
     |　〰　〰　〰　斷後世惡故
     |　〰　〰　〰　令梵行人久住故
6.010|　〰　〰　〰犯相
6.011|　〰　〰　歷別廣明持犯
     |　〰　〰　〰世間戒淨
     |　〰　〰　〰　時不缺戒    # 謂持初四重不犯
     |　〰　〰　〰　持不破戒    # 謂對僧殘不犯
     |　〰　〰　〰　持不穿戒    # 謂對下三篇不犯
     |　〰　〰　〰　持無瑕戒    # 亦名不雜戒。亦名定共戒
     |　〰　〰　〰出世間戒淨
     |　〰　〰　〰　持隨道戒    # 即心行十六行觀。發苦忍智慧。亦名道共戒
     |　〰　〰　〰　持無著戒    # 即阿那含人。若斷欲界九品思惟盡。名斷律儀戒
     |　〰　〰　〰出世間上上戒淨
     |　〰　〰　〰　持智所讚戒  # 持菩薩十重四十八輕戒。能至佛果。為智所讚歎
     |　〰　〰　〰　持自在戒    # 菩薩持戒。於種種破戒緣中。而得自在
     |　〰　〰　〰　持具足戒    # 菩薩能具一切眾生戒法。及上地戒
     |　〰　〰　〰　持隨定戒    # 不起滅定現種種威儀戒法。以度眾生
6.012|　〰　〰　明覆發
     |　〰　〰　〰正明覆發      # 戒持發禪。毀則覆禪
     |　〰　〰　〰簡定覆發      # 俱宿世淵源
     |　〰　〰　〰　犯戒而發定
     |　〰　〰　〰　持戒而不發定
     |　〰　〰　〰　俱發
     |　〰　〰　〰　俱不發
6.013|　〰　〰懺悔
     |　〰　〰　明運懺悔心
6.014|　〰　〰　正明懺悔方法
6.015|　〰　〰　〰　作法懺悔    # 多是小乘懺悔法
6.016|　〰　〰　〰　觀相懺悔    # 次二多是大乘懺悔法
     |　〰　〰　〰　釋疑
6.017|　〰　〰　〰　觀無生懺悔
6.018|　〰　〰　〰明罪滅階降
     |　〰　〰　〰　罪有三品
     |　〰　〰　〰　　違無作起障道罪
     |　〰　〰　〰　　體性罪
     |　〰　〰　〰　　無明煩惱根本罪
     |　〰　〰　〰　懺法有別
     |　〰　〰　〰　　作法懺悔者。破違無作障道罪
     |　〰　〰　〰　　觀相懺者。破除體性惡業罪
     |　〰　〰　〰　　觀無生懺悔罪滅者。破除無明一切煩惱習因之罪
6.019|　〰　〰　〰明復本不復本相
     |　〰　〰　〰　釋疑
6.020|　〰　衣食具足
     |　〰　　衣具足
     |　〰　　食具足
6.021|　〰　閑居靜處
     |　〰　　深山絕人處
     |　〰　　頭陀蘭若處
     |　〰　　清淨伽藍
6.022|　〰　息諸緣務
     |　〰　　息生活緣務
     |　〰　　息人事緣務
     |　〰　　息工巧技術緣務
     |　〰　　息工巧技術緣務
6.023|　〰　得善知識
     |　〰　　外護善知識
     |　〰　　同行善知識
     |　〰　　教授善知識
6.024|　〰訶五欲
     |　〰　訶色欲
     |　〰　訶聲欲
     |　〰　訶香欲
     |　〰　訶味欲
     |　〰　訶觸欲
     |　〰　釋疑
6.025|　〰棄五蓋
6.026|　〰　棄貪欲蓋
6.027|　〰　棄瞋恚蓋
6.028|　〰　棄睡眠蓋
6.029|　〰　棄掉悔
6.030|　〰　棄疑蓋
6.031|　〰　釋疑。不善法塵無量。何故但棄五法
6.050|　〰調五法
6.051|　〰　調食
6.052|　〰　調睡眠
6.053|　〰　調身。調息。調心
6.054|　〰　　入禪調三事
     |　〰　　　調身法
     |　〰　　　　七支坐
     |　〰　　　　不寬不急
6.055|　〰　　　調息法
     |　〰　　　　不澁不滑
6.056|　〰　　　調心法
     |　〰　　　　不沈不浮
     |　〰　　　　不寬不急
6.057|　〰　　住坐中調三事
     |　〰　　　善識三事調不調相
     |　〰　　　用前法調三事令常調適
6.058|　〰　　欲出定時
     |　〰　　　放心異緣開口放氣
     |　〰　　　散息百脈
     |　〰　　　動身肩頭足悉令柔軟
     |　〰　　　手遍摩諸毛孔
     |　〰　　　摩手令暖掩眼開目
     |　〰　　　身熱汗歇方可出入
6.080|　〰行五法
     |　〰　欲
     |　〰　　內心志願好樂諸禪定
6.081|　〰　精進
     |　〰　　身精進
     |　〰　　心精進
     |　〰　　十二頭陀身心精進
     |　〰　　　阿蘭若處
     |　〰　　　常行乞食
     |　〰　　　次第乞食
     |　〰　　　受一食法
     |　〰　　　節量食
     |　〰　　　中後不飲漿
     |　〰　　　著弊衣
     |　〰　　　但三衣
     |　〰　　　塚間住
     |　〰　　　樹下止
     |　〰　　　露地坐
     |　〰　　　常坐不臥
6.082|　〰　念
     |　〰　　六行觀
     |　〰　　　厭下苦麁障
     |　〰　　　攀上勝妙出
6.083|　〰　　明果中六行
     |　〰　　　約欲界果明
     |　〰　　　　欲界報身種種所逼故名苦
     |　〰　　　　身為三十六臭穢所成故名麁
     |　〰　　　　身為山河石壁所隔故名障
6.084|　〰　　　約色界果明
     |　〰　　　　得色界樂勝欲界苦故名上勝
     |　〰　　　　色界身有形色無質礙故名妙
     |　〰　　　　得五通見障外山壁無礙故名出
6.085|　〰　　明因中六行
     |　〰　　　約欲界明因
     |　〰　　　　報身起心數緣貪故名苦
     |　〰　　　　欲界五塵散動起惡故名麁
     |　〰　　　　為煩惱蓋覆故名障
6.086|　〰　　　約色界明因
     |　〰　　　　初禪上勝之樂內發故名上勝
     |　〰　　　　禪定之樂樂法成就故名妙
     |　〰　　　　心得出離蓋障至初禪故名出
6.087|　〰　巧慧
     |　〰　　籌量欲界樂初禪樂得失輕重之相
     |　〰　　或言行人善識巧用方便疾得禪定者名巧慧也
6.088|　〰　一心
     |　〰　　專心守一而行
     |　〰　　非智不禪非禪不智

6.100|　內方便
     |　〰明止門               # 正釋因 // 第三卷上
     |　〰　止為初門
     |　〰　　釋疑。廣明修止淺深麁細入定之相
     |　〰　　釋疑。於諸禪中止為通門
     |　〰　　心在定故。即發善惡根性。應機授法
6.101|　〰　分別止門不同
6.102|　〰　〰約行論止
     |　〰　〰　繫緣止         # 繫心鼻柱臍間等處。不令馳蕩故
     |　〰　〰　制心止         # 心若覺觀。即制令不起故
     |　〰　〰　體真止         # 體諸法空。息諸妄慮故
6.103|　〰　〰約義論止
     |　〰　〰　隨緣止         # 隨心起時。悉有三摩提數
     |　〰　〰　入定止         # 證定之時。定法持心。心息止住
     |　〰　〰　真性止         # 心性之理常自不動
6.104|　〰　立止大意
     |　〰　〰明淺深
     |　〰　〰明三止對治相破
     |　〰　〰　以深破淺
     |　〰　〰　　制心止破繫緣止
     |　〰　〰　　體真止破制心止
     |　〰　〰　迴互相破
     |　〰　〰　　互取一止對治破之細尋可解
     |　〰　〰隨樂欲
     |　〰　〰隨機宜
6.105|　〰　明修止方法
     |　〰　〰修繫緣止         # 外國金齒三藏說。此為五門禪
     |　〰　〰　繫緣五處
     |　〰　〰　　繫心頂上
     |　〰　〰　　繫心髮際
     |　〰　〰　　繫心鼻柱
     |　〰　〰　　繫心臍間
     |　〰　〰　　繫心在地輪
6.106|　〰　〰　釋疑。身分皆可繫心。云何的說五處
6.107|　〰　〰　凝心止
6.108|　〰　〰修制心止
     |　〰　〰　為治沈浮上下安之
     |　〰　〰　下著安心利益眾多
     |　〰　〰　　心易得定
     |　〰　〰　　眾病不生
6.109|　〰　〰修體真止
     |　〰　〰　諸法皆空
     |　〰　〰　　一切陰入界
     |　〰　〰　　三毒九十八使
     |　〰　〰　　十二因緣
     |　〰　〰　　三界因果
     |　〰　〰　以正智體諸法皆空
6.118|　〰　〰　　一切諸法非因有非緣有非因緣合有非不無因緣有
6.110|　〰　〰　　　若宿業因父母緣得諸法果報。業是何法
6.111|　〰　〰　　　　心滅業滅。何得感果
6.112|　〰　〰　　　　業隨心來不隨心來。何得感果
6.113|　〰　〰　　　　業有相無相。何得感果
6.114|　〰　〰　　　　業不可得。何言法因業生非緣生
6.115|　〰　〰　　　　　果報非外緣生
6.116|　〰　〰　　　　　因緣合時果報不各有生
6.117|　〰　〰　　　　　非離因緣而生
6.119|　〰　〰　　一切法皆空。無明顛倒妄計為有
     |　〰　〰　　　言語道斷心行處滅
     |　〰　〰　體真止
6.120|　〰　〰　　心無取捨依倚住著    # 一切諸法中　因緣空無主
     |　〰　〰　　止無所止無止之止    # 息心達本源　故號為沙門
6.121|　〰　辯證止之相
     |　〰　〰諸師各論
     |　〰　〰　止無別證。能作諸禪前方便
     |　〰　〰　止非但通發諸禪。亦自有證法
6.122|　〰　〰因止證五輪
6.123|　〰　〰　地輪
     |　〰　〰　　住持不動      # 因止若證未到地定。忽湛心自覺身心相空泯然入定
     |　〰　〰　　出生萬物      # 因未到地出生初禪種種功德事。同出生萬物
6.124|　〰　〰　水輪
     |　〰　〰　　潤漬生長      # 若證水輪三昧。即是發諸禪種種功德
     |　〰　〰　　體性柔軟      # 
6.125|　〰　〰　風輪
     |　〰　〰　　遊空無礙      # 若因禪定發相。似智慧無礙方便
     |　〰　〰　　鼓動萬物      # 得方便道。即能擊發種種出世善根。功德生長
     |　〰　〰　　能破壞        # 智慧方便。能摧破一切諸見煩惱
     |　〰　〰　　行者成就
     |　〰　〰　　　二乘人得五方便相
     |　〰　〰　　　菩薩入鐵輪十信
6.126|　〰　〰　金沙輪
     |　〰　〰　　金則譬真沙諭無著
     |　〰　〰　　行者成就
     |　〰　〰　　　若發見思真慧無染無著。得三道果
     |　〰　〰　　　菩薩入三賢十地位中。破一切塵沙煩惱
6.127|　〰　〰　金剛輪
     |　〰　〰　　第九無礙道名金剛輪三昧
     |　〰　〰　　行者成就
     |　〰　〰　　　成阿羅漢
     |　〰　〰　　　　不為妄惑所侵
     |　〰　〰　　　　能斷一切結使
     |　〰　〰　　　若在菩薩心
     |　〰　〰　　　　即金剛般若破無明細惑
     |　〰　〰　　　　證一切種智。亦名清淨禪
     |　〰　〰　　　　得大菩提果

6.200|　〰明驗善惡根性
     |　〰　止為初門
     |　〰　〰善惡二事必有其一
     |　〰　〰當識其相取捨不乖
6.201|　〰　明驗善根性
     |　〰　〰列善法章門
     |　〰　〰　外善            # 略出五種
     |　〰　〰　　布施
     |　〰　〰　　持戒
     |　〰　〰　　孝順父母師長
     |　〰　〰　　信敬三寶精勤供養
     |　〰　〰　　讀誦聽學
     |　〰　〰　內善
     |　〰　〰　　五門禪        # 通攝一切諸禪
     |　〰　〰　　　阿那波那門  # 通至根本及特勝通明等。諸禪三昧
     |　〰　〰　　　不淨觀門    # 通九想背捨超越等。諸禪三昧
     |　〰　〰　　　慈心門      # 通四無量等。諸禪三昧
     |　〰　〰　　　因緣門      # 通至十二因緣四諦等。慧行諸禪三昧
     |　〰　〰　　　念佛三昧門  # 通至九種禪。及百八三昧
6.202|　〰　〰　　釋疑。內善無量何得但說五門
     |　〰　〰　　　五名行通諸禪
     |　〰　〰　　　　數息門即世間凡夫禪
     |　〰　〰　　　　不淨門即聲聞人出世間禪
     |　〰　〰　　　　慈心門即凡聖為大福德修慈。入四無量心
     |　〰　〰　　　　因緣門即辟支佛人所行
     |　〰　〰　　　　念佛門即諸菩薩所行
     |　〰　〰　　　五門對治四分煩惱
     |　〰　〰　　　　出八萬四千法門
     |　〰　〰　　　　攝一切內善具足
6.203|　〰　〰正明善根發相
     |　〰　〰　明外善根發相
     |　〰　〰　　依前章門略出五種
6.204|　〰　〰　　　過去今生布施習報
6.205|　〰　〰　　　過去今生戒忍習報
6.206|　〰　〰　　　過去今生孝順尊長習報
6.207|　〰　〰　　　過去今生信敬三寶精勤供養習報
6.208|　〰　〰　　　過去今生讀誦聽說習報
6.209|　〰　〰　　釋疑
     |　〰　〰　　　散心善根。何得於靜心中現
     |　〰　〰　　　見此等諸相。亦有是魔所作不
     |　〰　〰　　　　若眾多妨難不利定心。悉是魔作
     |　〰　〰　　　　善根發者行人自覺。諸根清淨身有色力
     |　〰　〰　　　　報因之相暫現便謝。若是魔作久久不滅
     |　〰　〰　　　此諸善根為當一向前發。亦得證諸禪時於深定中發也
6.210|　〰　〰　明內善根發相
     |　〰　〰　　五門各開為三。合十五種善根發
6.211|　〰　〰　〰　阿那波那門
6.212|　〰　〰　〰　　數息善根
6.213|　〰　〰　〰　　隨息善根
6.214|　〰　〰　〰　　觀息善根
6.215|　〰　〰　〰　不淨觀
6.216|　〰　〰　〰　　九想
6.217|　〰　〰　〰　　背捨
6.218|　〰　〰　〰　　大不淨觀
6.219|　〰　〰　〰　慈心觀
6.220|　〰　〰　〰　　眾生緣慈
6.221|　〰　〰　〰　　法緣慈
6.222|　〰　〰　〰　　無緣慈
6.223|　〰　〰　〰　因緣觀
6.224|　〰　〰　〰　　三世十二緣
6.225|　〰　〰　〰　　果報十二緣
6.226|　〰　〰　〰　　一念十二緣
6.227|　〰　〰　〰　念佛
6.228|　〰　〰　〰　　念應佛
6.229|　〰　〰　〰　　念報佛
6.230|　〰　〰　〰　　念法佛
6.231|　〰　〰　〰概論
     |　〰　〰　〰　一切禪定證相不可具以文傳
     |　〰　〰　〰　行人過去習因不同故發禪不等
     |　〰　〰　〰　種種諸禪三昧境界不同其相眾多
6.250|　〰　〰驗知虛實真偽      // 第三卷下
6.251|　〰　〰　正明驗知虛實
6.252|　〰　〰　〰相驗知
     |　〰　〰　〰　邪
     |　〰　〰　〰　　略出觸中十雙邪法。以明邪相
6.253|　〰　〰　〰　　　觸體增減
6.254|　〰　〰　〰　　　定亂
6.255|　〰　〰　〰　　　空有
6.256|　〰　〰　〰　　　明闇
6.257|　〰　〰　〰　　　憂喜
6.258|　〰　〰　〰　　　苦樂
6.259|　〰　〰　〰　　　善惡
6.260|　〰　〰　〰　　　愚智
6.261|　〰　〰　〰　　　縛脫
6.262|　〰　〰　〰　　　心強軟
6.263|　〰　〰　〰　　二十邪法隨有所發
     |　〰　〰　〰　　　若不別邪偽心生愛著。種種障惱
6.264|　〰　〰　〰　　　若與一鬼神法相應而不覺識。鬼神隨念便入證其法門
6.265|　〰　〰　〰　　釋疑。邪法相應行惡之者
     |　〰　〰　〰　　　是人命終未必墮惡趣。而隨相應之法共彼鬼神生一處為彼眷屬
6.266|　〰　〰　〰　　　雖生天人。冥密常係屬魔邪之道。樂近邪師樂聞邪法樂行邪道
6.267|　〰　〰　〰　　更有異禪門邪法。所謂餘禪門境界邪法
6.268|　〰　〰　〰　正
     |　〰　〰　〰　　略出觸中十雙善法。以明正相
     |　〰　〰　〰　　　觸相如法
     |　〰　〰　〰　　　定相如法
     |　〰　〰　〰　　　空相如法
     |　〰　〰　〰　　　明相如法
     |　〰　〰　〰　　　喜相如法
     |　〰　〰　〰　　　樂相如法
     |　〰　〰　〰　　　善相如法
     |　〰　〰　〰　　　智相如法
     |　〰　〰　〰　　　解脫相如法
     |　〰　〰　〰　　　心調相如法
6.269|　〰　〰　〰　　釋疑
     |　〰　〰　〰　　　欲明出世正法。必先明世間正法
     |　〰　〰　〰　　　欲修根本禪定悉不得取是相。若謝不謝無妨於根本禪
     |　〰　〰　〰　　　末世行者善根微薄。證觸之時多不發諸餘事理禪
6.270|　〰　〰　〰法驗知
     |　〰　〰　〰　定心研磨
     |　〰　〰　〰　用本法修治
     |　〰　〰　〰　智慧破析
6.271|　〰　〰　簡是魔非魔
6.272|　〰　〰　〰是魔相
     |　〰　〰　〰　禪非是魔
     |　〰　〰　〰　一向魔作禪定
6.273|　〰　〰　〰非魔相
     |　〰　〰　〰　罪障於禪
     |　〰　〰　〰　方便不巧
6.280|　〰　〰料揀發禪不定
     |　〰　〰　正料揀事理兩修發禪不定
     |　〰　〰　〰　釋疑
     |　〰　〰　〰　　事理兩修隨行人根緣是以發法不同
6.281|　〰　〰　〰料揀事理兩修發禪不定
6.282|　〰　〰　〰　事理兩修具足分別
     |　〰　〰　〰　　約止門明四修      # 所謂息二邊分別止。即是非事非理修
     |　〰　〰　〰　　　事止
     |　〰　〰　〰　　　　係緣止
     |　〰　〰　〰　　　　制心止
     |　〰　〰　〰　　　理止
     |　〰　〰　〰　　　　體真止
     |　〰　〰　〰　　　事理止
     |　〰　〰　〰　　　　緣俗體真止
     |　〰　〰　〰　　　非事非理止
     |　〰　〰　〰　　　　息二邊分別止
     |　〰　〰　〰　　約觀門明四修      # 即是非事非理修
     |　〰　〰　〰　　　事觀
     |　〰　〰　〰　　　　安般
     |　〰　〰　〰　　　　不淨觀
     |　〰　〰　〰　　　理觀
     |　〰　〰　〰　　　　空無相等觀
     |　〰　〰　〰　　　事理觀
     |　〰　〰　〰　　　　雙觀二諦
     |　〰　〰　〰　　　非事非理觀      # 所謂中道正觀
     |　〰　〰　〰　　　　中道正觀
6.283|　〰　〰　〰　　一一修中各有四種發禪不定。合十六種發禪不定
6.284|　〰　〰　〰　　釋疑。若修事止。何得發理及非事理等諸禪三昧
     |　〰　〰　〰　　　發禪有二。現前方便修得。發宿世善根
6.285|　〰　〰　〰　　釋疑。若爾何故。一切十方諸佛殷勤稱歎般若波羅蜜
6.286|　〰　〰　〰　　釋疑。此與前何別
     |　〰　〰　〰　　　因強緣弱。能發非事非理諸禪三昧不共之法。如前分別
     |　〰　〰　〰　　　因弱緣強。能發非事非理諸禪三昧不共之法。今之所明
     |　〰　〰　〰　　　因緣俱強。能發非事非理諸禪三昧不共之法者。以前合今
     |　〰　〰　〰　　　因緣俱弱。今世或發或不。設得發禪微羸淺薄亦不牢固多好退失
6.287|　〰　〰　〰料揀理修發禪不定
     |　〰　〰　〰　四種不同
6.288|　〰　〰　〰料揀事理修發禪不定     # 四種不同
     |　〰　〰　〰　四種不同
6.289|　〰　〰　〰料揀非事非理修發禪不定 # 四種不同
     |　〰　〰　〰　四種不同
6.290|　〰　〰　明發諸禪三昧所由
     |　〰　〰　〰　宿世經習諸禪善根為因
     |　〰　〰　〰　今世修止得定為緣
     |　〰　〰　〰　是故異發不同
6.291|　〰　〰　辨發禪多少
     |　〰　〰　〰　發法優劣不同。殊途萬品之異
6.292|　〰　〰　明發宿善根盡相
     |　〰　〰　〰　宿世已經修。今於止中具足發者名為盡。否則不盡
     |　〰　〰　〰　若過去所習勢分已盡。今世善巧精勤修習成就非關過去習因善發
6.293|　〰　〰　約有漏無漏分別
     |　〰　〰　〰有漏
     |　〰　〰　〰無漏
     |　〰　〰　〰　行行無漏
     |　〰　〰　〰　　對治事法。不的據緣真得
     |　〰　〰　〰　慧行無漏
     |　〰　〰　〰　　緣理修習以明慧行
     |　〰　〰　〰　　發慧見理緣真以明慧行
     |　〰　〰　〰　　　發相似慧
     |　〰　〰　〰　　　發真實慧
     |　〰　〰　〰　　　　發苦忍等見諦無漏
     |　〰　〰　〰　　　　發無礙解脫等三界思惟無漏
6.294|　〰　〰　〰　釋疑
6.300|　〰　驗惡根性          // 第四卷
     |　〰　〰煩惱數量
     |　〰　〰　略約五種不善惡法
     |　〰　〰　　覺觀不善法
     |　〰　〰　　貪欲不善法
     |　〰　〰　　瞋恚不善法
     |　〰　〰　　愚癡不善法
     |　〰　〰　　惡業不善法    # 或覺觀惡業合為一法。成四分
6.301|　〰　〰惡根性發
6.302|　〰　〰　覺觀發相
6.303|　〰　〰　　明利心中覺觀
     |　〰　〰　　半明半昏心中覺觀
     |　〰　〰　　一向昏迷心中覺觀
6.304|　〰　〰　貪欲發相
6.305|　〰　〰　　外貪欲
     |　〰　〰　　內外貪欲
     |　〰　〰　　遍一切處貪欲
6.306|　〰　〰　瞋恚發相
6.307|　〰　〰　　非理瞋
     |　〰　〰　　順理瞋
     |　〰　〰　　諍論瞋
6.308|　〰　〰　愚癡發相
6.309|　〰　〰　　計斷常
     |　〰　〰　　計有無
     |　〰　〰　　計世性
6.310|　〰　〰　惡業障道發相
6.311|　〰　〰　　沈昏闇蔽障
     |　〰　〰　　惡念思惟障
     |　〰　〰　　境界逼迫障
6.312|　〰　〰立對治法
6.313|　〰　〰　對治治        # 對治十五前善惡根性發
6.314|　〰　〰　　治覺觀多病
6.315|　〰　〰　　治貪欲多病
6.316|　〰　〰　　治瞋恚多病
6.317|　〰　〰　　治愚癡多病
6.318|　〰　〰　　治惡業障道多病
6.319|　〰　〰　　釋疑
6.320|　〰　〰　轉治
     |　〰　〰　　病轉法亦轉
     |　〰　〰　　病不轉而法轉
6.321|　〰　〰　　釋疑
6.322|　〰　〰　不轉治
     |　〰　〰　　病不轉觀亦不轉
     |　〰　〰　　病轉觀不轉
6.323|　〰　〰　兼治
6.324|　〰　〰　兼轉兼不轉治
6.325|　〰　〰　非對非轉非兼治
     |　〰　〰　　第一義悉檀波若正觀
     |　〰　〰　　　能治貪欲
     |　〰　〰　　　能治瞋
     |　〰　〰　　　能破治癡
     |　〰　〰　　　能治覺觀
     |　〰　〰　　　能治罪障
6.326|　〰　〰結成悉檀廣攝佛法

6.400|　〰明安心法
6.401|　〰　隨便宜
6.402|　〰　隨對治成就
6.403|　〰　隨樂欲
6.404|　〰　隨次第
6.405|　〰　隨第一義

6.450|　〰明治病患
     |　〰　病發相
6.451|　〰　〰　病發
     |　〰　〰　四大增動病相
     |　〰　〰　從五臟生病
     |　〰　〰　五根中病
6.452|　〰　〰得病
     |　〰　〰　四大增損故病
     |　〰　〰　鬼神所作及因魔事觸惱故得病
     |　〰　〰　業報所得病
6.453|　〰　治病方法
     |　〰　〰治病舉要
6.454|　〰　〰　氣息治病
6.455|　〰　〰　假想治病
6.456|　〰　〰　呪術治病
6.457|　〰　〰　用心主境治病
6.458|　〰　〰　觀析治病
6.459|　〰　〰用心坐中治病
     |　〰　〰　若具十法無有不益
     |　〰　〰　　信
     |　〰　〰　　用
     |　〰　〰　　勤
     |　〰　〰　　恒住緣中
     |　〰　〰　　別病因起
     |　〰　〰　　方便
     |　〰　〰　　久行
     |　〰　〰　　知取捨
     |　〰　〰　　善將護
     |　〰　〰　　識遮障

6.500|　〰明覺魔事
     |　〰　分別魔法不同
     |　〰　　煩惱魔            # 三毒九十八使取有流扼縛蓋纏惱結等
6.501|　〰　　陰入界魔          # 五陰十二入十八界一切名色繫縛眾生
6.502|　〰　　死魔              # 一切生死業報。輪轉不息
6.503|　〰　　欲界天子魔        # 波旬
6.504|　〰　魔事發相
     |　〰　　煩惱魔
     |　〰　　陰入界魔
     |　〰　　死魔
     |　〰　　鬼神魔
     |　〰　　　精媚
     |　〰　　　垖惕鬼
6.505|　〰　　　魔羅
     |　〰　　　　多作三種相
     |　〰　　　　　違情事
     |　〰　　　　　順情事
     |　〰　　　　　非違非順事
     |　〰　　　　射五情。各有三境
     |　〰　　　　　色          # 以色為例
     |　〰　　　　　　順情色
     |　〰　　　　　　色中違
     |　〰　　　　　　色中非違非順
6.506|　〰　壞魔之法
     |　〰　　了知所見聞覺知皆無所有
     |　〰　　但反觀能見聞覺知之心。不見生處。何所惱亂
     |　〰　　若作觀不去。但當正念勿生懼想。正心不動

7.000|釋禪波羅蜜修證
7.001|　修證世間禪相
7.002|　〰四禪                  // 第五卷

7.003|　〰　初禪
7.004|　〰　〰釋名
     |　〰　〰　支林
7.005|　〰　〰修習
7.006|　〰　〰　所修之法        # 阿那波那。修習根本初禪之法
     |　〰　〰　〰釋息名
7.007|　〰　〰　〰辨息相
7.008|　〰　〰　〰用息不同
     |　〰　〰　〰　數出息
     |　〰　〰　〰　數入息      # 有如是等勝利非一。應數入息
     |　〰　〰　〰　　易入定隨息內歛故
     |　〰　〰　〰　　斷外境故
     |　〰　〰　〰　　易見內三十六物故
     |　〰　〰　〰　　身力輕盛故
     |　〰　〰　〰　　內實息貪恚故
     |　〰　〰　〰　其他
7.009|　〰　〰　能修之心
     |　〰　〰　〰能數之心      # 以細念之心。攝心對息。從一至十。令心不散
7.010|　〰　〰　〰轉緣
     |　〰　〰　〰　數          # 初數於息
     |　〰　〰　〰　隨          # 若覺息微微。當置數隨息任運出入
     |　〰　〰　〰　還          # 心動則還
     |　〰　〰　〰　淨          # 若心欲靜。捨隨凝心止住。名淨
7.011|　〰　〰　〰料揀          # 阿那波那是三世諸佛入道初門
7.012|　〰　〰明證禪相
7.013|　〰　〰　證欲界定相
     |　〰　〰　〰明證相
     |　〰　〰　〰　欲界有三
     |　〰　〰　〰　　麁住心
     |　〰　〰　〰　　細住心
     |　〰　〰　〰　　證欲界定
7.014|　〰　〰　〰　麁住相      # 當得此麁細住時。或將得時。必有持身法起
     |　〰　〰　〰　細住相      # 此法發時。身心自然正直。坐不疲倦
     |　〰　〰　〰　證欲界定    # 於覺心自然明淨與定相應。定法持心任運不動從淺入深
7.015|　〰　〰　〰明得失        # 法心既淺未有支持。難得易失
     |　〰　〰　〰　從外緣失    # 不善用心。內外方便。中途違犯。不覺外事。退失禪定
7.016|　〰　〰　〰　內論得失    # 六法能失禪定
     |　〰　〰　〰　　希望心    # 未得禪有此一
     |　〰　〰　〰　　疑心      # 入禪有四。疑
     |　〰　〰　〰　　驚怖      # 　　　　　怖
     |　〰　〰　〰　　大喜      # 　　　　　喜
     |　〰　〰　〰　　重愛      #　　 　　　愛
     |　〰　〰　〰　　憂悔      # 出禪多有憂悔
7.017|　〰　〰　證未到定相      # 此欲界定後。身心泯然虛豁。失於欲界之身
     |　〰　〰　〰初禪方便定    # 能生初禪
     |　〰　〰　〰　亦名未來禪
     |　〰　〰　〰　亦名忽然湛心
     |　〰　〰　〰　無淺深之相
7.018|　〰　〰　〰或有邪偽      # 其相非一。略出二邪。是中妨難非可具以文傳
     |　〰　〰　〰　定心過明    # 見一切事。如得神通。此為邪。當急去之
     |　〰　〰　〰　定心過暗    # 暗忽無所覺知。即是無心想法。能生顛倒。當急却之
7.019|　〰　〰　〰未到二定各異
7.020|　〰　〰　證初禪相
7.021|　〰　〰　〰初禪發相      # 證十六觸成就。即是初禪發相
7.022|　〰　〰　〰　正明初禪發相
7.023|　〰　〰　〰　〰初動觸相功德  # 略說十種。名動眷屬勝妙功德莊嚴動法
     |　〰　〰　〰　〰　定
     |　〰　〰　〰　〰　空
     |　〰　〰　〰　〰　三明淨
     |　〰　〰　〰　〰　淨
     |　〰　〰　〰　〰　四喜悅
     |　〰　〰　〰　〰　悅
     |　〰　〰　〰　〰　樂六善心生
     |　〰　〰　〰　〰　知見明了
     |　〰　〰　〰　〰　無累解脫
     |　〰　〰　〰　〰　境界現前
     |　〰　〰　〰　〰　心調柔軟
7.024|　〰　〰　〰　〰初禪餘觸發
     |　〰　〰　〰　〰十六觸成就  # 約四大而發
     |　〰　〰　〰　〰　八觸
     |　〰　〰　〰　〰　　動      #          風
     |　〰　〰　〰　〰　　痒      #       火
     |　〰　〰　〰　〰　　涼      #    水
     |　〰　〰　〰　〰　　暖      #       火
     |　〰　〰　〰　〰　　輕　    #          風
     |　〰　〰　〰　〰　　重      # 地
     |　〰　〰　〰　〰　　澁      # 地
     |　〰　〰　〰　〰　　滑      #    水
     |　〰　〰　〰　〰　又八觸
     |　〰　〰　〰　〰　　掉      #          風
     |　〰　〰　〰　〰　　猗      #       火
     |　〰　〰　〰　〰　　冷      #    水
     |　〰　〰　〰　〰　　熱      #       火
     |　〰　〰　〰　〰　　浮      #          風
     |　〰　〰　〰　〰　　沈      # 地
     |　〰　〰　〰　〰　　堅      # 地
     |　〰　〰　〰　〰　　軟      #    水
7.025|　〰　〰　〰　簡非禪之法
     |　〰　〰　〰　〰釋疑
7.026|　〰　〰　〰　釋發因緣
     |　〰　〰　〰　〰善心功力成就
7.027|　〰　〰　〰　〰色界定法住欲界身中。與欲界報身相觸故
     |　〰　〰　〰　〰十六觸約四大而發
     |　〰　〰　〰　〰　地中重沈堅澁
     |　〰　〰　〰　〰　水中涼冷軟滑
     |　〰　〰　〰　〰　火中暖熱猗痒
     |　〰　〰　〰　〰　風中動掉輕浮
7.028|　〰　〰　〰　〰十六觸各有十種功德善法。合則一百六十法
     |　〰　〰　〰　〰　初坐發法之人。未必發盡
7.029|　〰　〰　〰　分別邪正
7.030|　〰　〰　〰支
     |　〰　〰　〰　釋支名
     |　〰　〰　〰　　覺支        # 初心覺悟名為覺
     |　〰　〰　〰　　觀支        # 細心分別名為觀
     |　〰　〰　〰　　喜支        # 慶悅之心名為喜
     |　〰　〰　〰　　樂支        # 恬澹之心名為樂
     |　〰　〰　〰　　一心支      # 寂然不散名一心
7.031|　〰　〰　〰　釋支義
     |　〰　〰　〰　　支者。支離為義
     |　〰　〰　〰　　林者。因眾得名
7.032|　〰　〰　〰　辨支相        # 數人辨相。正約二十二心數取辨五支相。今略為二
     |　〰　〰　〰　〰別釋五支相
     |　〰　〰　〰　〰　覺支
     |　〰　〰　〰　〰　〰名觸覺
     |　〰　〰　〰　〰　〰　成禪覺 # 有十種善法眷屬安隱莊嚴故
     |　〰　〰　〰　〰　〰　壞禪覺 # 有二十惡法故
7.033|　〰　〰　〰　〰　〰屬身根
     |　〰　〰　〰　〰　〰　釋疑。何得覺但屬身。 # 就別義論。覺對身也
7.034|　〰　〰　〰　〰　〰名驚悟
7.035|　〰　〰　〰　〰　分別覺支與觀支
7.036|　〰　〰　〰　〰　〰釋疑。觀覺何異 # 麁心在緣名為覺。細心分別名為觀
     |　〰　〰　〰　〰　〰釋疑。覺觀一心。云何為二 # 覺時觀不明了。觀時覺不明了
     |　〰　〰　〰　〰　〰麁細分別。   # 身根身識相應名為覺。意根意識相應名為觀
7.037|　〰　〰　〰　〰　喜支
7.038|　〰　〰　〰　〰　樂支
7.039|　〰　〰　〰　〰　〰釋疑。喜樂   # 麁喜細樂。喜樂根相。初緣生喜及受得樂
7.040|　〰　〰　〰　〰通義
     |　〰　〰　〰　〰　一覺發具五支義
7.041|　〰　〰　〰因果體用
     |　〰　〰　〰　因果          # 第六默然心為定體。即以體為果
     |　〰　〰　〰　體用          # 還以默然心為定體。從默然觸更動發五支為用
7.042|　〰　〰　〰　釋疑
7.043|　〰　〰　〰淺深
     |　〰　〰　〰　修禪之品      # 三品。九品。無量品
7.044|　〰　〰　〰　立品明淺深
     |　〰　〰　〰　　同類
     |　〰　〰　〰　　異類
7.045|　〰　〰　〰　約五支明淺深
     |　〰　〰　〰　　同類
     |　〰　〰　〰　　異類
7.046|　〰　〰　〰　具足不具足
     |　〰　〰　〰　　具足        # 具發十六觸。即是具足初禪為勝
     |　〰　〰　〰　　不具足      # 若發一兩觸等亦得名初禪。但不名具足
7.047|　〰　〰　〰進退
     |　〰　〰　〰　四種性
7.048|　〰　〰　〰　　退分
     |　〰　〰　〰　　　更修還得
     |　〰　〰　〰　　　更修不得
7.048|　〰　〰　〰　　住分
     |　〰　〰　〰　　　任運自住
     |　〰　〰　〰　　　守護乃住
7.050|　〰　〰　〰　　進分
     |　〰　〰　〰　　　任運自進
     |　〰　〰　〰　　　勤修乃進
7.051|　〰　〰　〰　　達分
     |　〰　〰　〰　　　任運自達
     |　〰　〰　〰　　　修觀乃達
7.052|　〰　〰　〰　四分中復各有四種根性
7.053|　〰　〰　〰功德
7.054|　〰　〰　〰　離過德       # 離者。謂離五蓋
7.055|　〰　〰　〰　善心德       # 具者。謂具五支

7.100|　〰　二禪
7.101|　〰　〰釋名
     |　〰　〰　二禪
     |　〰　〰　無覺無觀三昧
     |　〰　〰　聖默然定
     |　〰　〰　聖默然
     |　〰　〰　喜俱禪
7.102|　〰　〰修習
7.103|　〰　〰　修習方法
     |　〰　〰　　觀初禪為下苦
     |　〰　〰　　二禪內淨安隱
7.104|　〰　〰　　遠離初禪之過
     |　〰　〰　　　不受不著故得離
     |　〰　〰　　　訶責故得離
     |　〰　〰　　　觀析故得離
7.104|　〰　〰　中間禪發相
7.105|　〰　〰　　離初禪
     |　〰　〰　　觀相應        # 此定以六行觀為體
7.106|　〰　〰明證禪相
7.107|　〰　〰　禪發相
7.108|　〰　〰　支義
     |　〰　〰　　內淨
     |　〰　〰　　喜
     |　〰　〰　　樂
     |　〰　〰　　一心
7.109|　〰　〰　因果體用
7.110|　〰　〰　淺深
7.111|　〰　〰　進退
7.112|　〰　〰　功德
     |　〰　〰　　離過德
     |　〰　〰　　善心德

7.120|　〰　三禪
7.121|　〰　　釋名
     |　〰　　　三禪
     |　〰　　　樂俱禪
7.122|　〰　　修習
7.123|　〰　　明證禪相
7.124|　〰　　　禪發相
7.125|　〰　　　支義
7.126|　〰　　　因果體用
7.127|　〰　　　淺深
7.128|　〰　　　進退
7.129|　〰　　　功德

7.140|　〰　四禪
7.141|　〰　　釋名
     |　〰　　　四禪
     |　〰　　　捨俱禪
7.142|　〰　　修習
7.143|　〰　　明證禪相
7.144|　〰　　　禪發相
7.145|　〰　　　支義
7.146|　〰　　　因果體用
7.147|　〰　　　淺深
7.148|　〰　　　進退
7.149|　〰　　　功德

7.160|　〰四無量心              // 第六卷

7.180|　〰四無色定

7.200|　修證亦世間亦出世間禪相
     |　〰　三種根性說三門
     |　〰　　慧性多定性少。為說六妙門
     |　〰　　定根多慧性少。為說十六特勝
     |　〰　　慧根性等。為說通明

7.201|　〰六妙門                // 第七卷
     |　〰　釋名
     |　〰　　定法三。數隨止
     |　〰　　慧法三。觀還淨
     |　〰　妙名涅槃
     |　〰　定愛慧策。亦有漏亦無漏
7.202|　〰　辨位次　
     |　〰　　六妙門位即無定
7.203|　〰　明修證　

     |　〰十六特勝

     |　〰通明                  // 第八卷

7.300|　修證出世間禪相
     |　〰對治無漏
     |　〰　觀壞法              // 第九卷
     |　〰　　九想
     |　〰　　八念
     |　〰　　十想
     |　〰　觀不壞法            // 第十卷
     |　〰　　八背捨
     |　〰　　八勝處
     |　〰　　十一切處
     |　〰　鍊
     |　〰　　九次第定
     |　〰　薰
     |　〰　　師子奮迅三昧
     |　〰　修
     |　〰　　超越三昧

     |　　緣理無漏              // 不說
     |　修證非世間非出世間禪相
     |顯示禪波羅蜜果報
     |從禪波羅蜜起教
     |結會禪波羅蜜歸趣
`;
