TSGYP.volNum = 0;
TSGYP.text = (() => {
  var titles =
`001 | 離分別執著，萬法圓融           |
002 | 冠上「太上」是自性的流露       |
003 | 凡聖就在迷悟之間               |禍福無門。惟人自召。善惡之報。如影隨形。
004 | 人心不善，環境就變惡劣         |
005 | 墮落惡道是自造惡業招感         |
006 | 用教學消除世間天災人禍         |〇〇〇〇〇〇〇〇〇〇<dim>善惡之報。如影隨形。</dim>
007 | 財色名食睡，地獄五條根         |<dim>禍福無門。惟人自召。</dim>
008 | 報應像影, 隨形不離             |<dim>禍福無門。惟人自召。</dim>
009 | 積功累德, 才是對後代好         |〇〇〇〇〇〇〇〇〇〇<dim>善惡之報。如影隨形。</dim>
010 | 損人絕不利己, 只有害己         |是以天地有司過之神。依人所犯輕重。以奪人算。
011 | 起心動念命運都在加減乘除       |算減則貧耗。多逢憂患。
012 | 心術不善, 善神福神就離開       |〇〇〇〇〇〇〇〇〇〇〇人皆惡之。刑禍隨之。
013 | 修學最低的水平是五戒十善       |<dim>算減則貧耗。多逢憂患。人皆惡之。刑禍隨之。</dim>
014 | 做弘傳工作的人是僧寶           |<dim>是以天地有司過之神。依人所犯輕重。以奪人算。<br>算減則貧耗。多逢憂患。人皆惡之。刑禍隨之。</dim>
015 | 佛寶現前，法寶僧寶隨之現前     |〇〇〇〇〇〇〇〇〇〇〇<dim>人皆惡之。刑禍隨之。</dim>吉慶避之。
016 | 命運是累劫今生造作所得果報     |惡星災之。算盡則死。
017 | 災難是人心反常導致的           |〇〇〇〇〇<dim>算盡則死。</dim>
018 | 身心世界一切放下，定有好處     |
019 | 吉凶禍福是自定，鬼神來執行     |又有三台北斗神君。在人頭上。錄人罪惡。奪其紀算。
020 | 起心動念點滴都有鬼神在看       |又有三尸神。在人身中。每到庚申日。輒上詣天曹。言人罪過。
021 | 佛菩薩教我們要信解行證         |
022 | 佛教給我們的都是盡善盡美       |月晦之日。灶神亦然。
023 | 修行第一要存好心               |凡人有過。大則奪紀。小則奪算。<br>其過大小。有數百事。欲求長生者。先須避之。
024 | 積德從心地上做功夫             |<dim>其過大小。有數百事。欲求長生者。先須避之。</dim>
025 | 佛法所立的標準就是性德         |是道則進。非道則退。
026 | 佛家各宗派都講求從根本修       |不履邪徑。不欺暗室。
027 | 介紹佛法給眾生，讓他們都得度   |<dim>不履邪徑。不欺暗室。</dim>
028 | 學為人師，行為世範             |積德累功。
029 | 以勇猛心對治菩提道上的障礙     |<dim>積德累功。</dim>
030 | 念念利益眾生不求報答，是真善   |<dim>積德累功。</dim>
031 | 古時教育教做人處世，過生活     |
032 | 修行人就是立志要做一個好人     |<dim>積德累功。</dim>
033 | 諸佛對人以愛心, 絕無傷害之心   |
034 | 第一殊勝無過於念佛             |
035 | 起心動念總得以善心待人處世     |
036 | 夠救濟眾生的危急是大利         |<dim>積德累功。</dim>
037 | 圓人說法，無法不圓             |
038 | 敬重尊長，就是禮敬諸佛的落實   |
039 | 要健康長壽，最重要就是慈悲心   |慈心於物。
040 | 什麼叫教育？忠孝而已矣         |忠孝。
041 | 為什麼不能精進？不知恥         |<dim>忠孝。</dim>
042 | 自私自利是菩提道上最大的障礙   |
043 | 佛法是建立在孝道的基礎         |
044 | 佛法以孝開始，以孝為終極       |
045 | 凡夫成佛在一念之間             |
046 | 唯有真實智慧，才能做到真誠     |
047 | 今父母覺悟才是真正圓滿的大孝   |
048 | 隨順佛性才是真孝               |
049 | 對兒童教養是人生第一等大事     |
050 | 以忠孝落實佛菩薩慈悲教誨       |
051 | 行中有解，常生智慧             |
052 | 孝順要隨順智慧，不隨順煩惱     |
053 | 起心動念要遵循根本             |
054 | 古代國家最重要的大事就是教學   |忠孝友悌。
055 | 修行從不妄語修起               |正己化人。
056 | 菩提道是幸福美滿的生活之道     |<dim>正己化人。</dim>
057 | 佛法是多元文化的社會教育       |<dim>正己化人。</dim>
058 | 分別執著使我們沉淪在三途       |矜孤恤寡。敬老懷幼。
059 | 佛家的教學是教人明瞭因緣果報   |<dim>矜孤恤寡。敬老懷幼。</dim>
060 | 不怕念起，只怕覺遲             |
061 | 發菩提心的人智慧才現前         |<dim>矜孤恤寡。敬老懷幼。</dim>
062 | 少壯是修行功夫最得力時         |
063 | 無畏布施的果報是健康長壽       |<dim>矜孤恤寡。敬老懷幼。</dim>
064 | 究竟了脫的方法是往生           |<dim>矜孤恤寡。敬老懷幼。</dim>
065 | 禪定能夠突破時空的維次         |<dim>矜孤恤寡。敬老懷幼。昆蟲草木。猶不可傷。</dim><br>宜憫人之凶。樂人之善。<br>濟人之急。救人之危。
066 | 學佛頭一個是恢復自信心         |<dim>宜憫人之凶。樂人之善。濟人之急。救人之危。</dim>
067 | 向佛學習，這一生才會成就       |見人之得。如己之得。見人之失。如己之失。
068 | 希求淨土，絲毫惡意都不可有     |不彰人短。不衒己長。
069 | 隨順煩惱生活，哪有不造業的     |<dim>不彰人短。不衒己長。</dim>
070 | 西方世界是諸上善人俱會一處     |<dim>不彰人短。不衒己長。</dim>
071 | 用佛號把前念換過來「遏惡」     |遏惡揚善。
072 | 心清淨，清心寡欲，就健康長壽   |推多取少。
073 | 常向佛菩薩看，就沒有傲慢心     |〇〇〇〇〇受辱不怨。
074 | 世出世間法成就關鍵在忍耐       |〇〇〇〇〇<dim>受辱不怨。</dim>
075 | 福報現前，人就開智慧           |<dim>推多取少。受辱不怨。</dim>受寵若驚。
076 | 陰德就是做好事不必讓人知道     |〇〇〇〇〇〇〇〇〇〇受寵若驚。
077 | 節儉布施才能身心安穩           |〇〇〇〇〇〇〇〇〇〇<dim>受寵若驚。</dim>
078 | 佛教不重外表重視內修           |<dim>推多取少。受辱不怨。受寵若驚。</dim>
079 | 守住聖人的教誨就能得到天下人   |施恩不求報。與人不追悔。
080 | 菩薩示現惡道為教化業重眾生     |<dim>施恩不求報。與人不追悔。</dim>
081 | 菩提心落實，孝養父母才圓滿     |所謂善人。
082 | 轉魔障為助力，這是智慧         |<dim>所謂善人。</dim><br>人皆敬之。天道佑之。福祿隨之。眾邪遠之。神靈衛之。
083 | 天天自己反省改過，這是實學     |欲求天仙者。當立一千三百善。欲求地仙者。當立三百善。
084 | 天天自己反省改過，這是實學     |所作必成。神仙可冀。<br><dim>欲求天仙者。當立一千三百善。欲求地仙者。當立三百善。</dim>
085 | 憑善心善行願心，就得佛力加持   |
086 | 往生是活著往生，當生成就佛法   |苟或非義而動。背理而行。
087 | 符合義理標準叫治世             |<dim>苟或非義而動。背理而行。</dim>以惡為能。忍作殘害。
088 | 切身的吉凶禍福，叫實學         |〇〇<dim>非義而動。背理而行。</dim>
089 | 我這個執著是萬惡之源           |〇〇<dim>非義而動。背理而行。以惡為能。</dim>
090 | 忠孝就是佛法，就是菩提大道     |〇〇<dim>非義而動。背理而行。以惡為能。</dim>
091 | 齋的本意是身心清淨             |
092 | 薰修力量最顯著的是為人演說     |
093 | 選擇修學環境是一生成敗的關鍵   |忍作殘害。陰賊良善。暗侮君親。
094 | 殺生祭祀，善神、善鬼都遠離     |<dim>忍作殘害。</dim>
095 | 凡是殺害眾生的事業，不能發財   |
096 | 不與眾生結怨才能得福報         |
097 | 一飲一啄，莫非前定             |〇〇〇〇〇<dim>陰賊良善。暗侮君親。</dim>
098 | 人懂得道德仁義,是老師教的      |慢其先生。叛其所事。
099 | 禮節是人與人交往一個規則       |<dim>慢其先生。叛其所事。</dim>
100 | 讀經是聽佛講經，使我們明理     |誑諸無識。謗諸同學。
101 | 通情達理到究竟是聖人           |<dim>誑諸無識。謗諸同學。</dim>
102 | 人命無常，國土危脆             |虛誣詐偽。攻訐宗親。
103 | 老師有責任幫助我們破迷開悟     |
104 | 一切法從心想生                 |
105 | 善知識成人之美                 |剛強不仁。狠戾自用。
106 | 學菩薩，要修忍辱波羅蜜         |<dim>剛強不仁。狠戾自用。</dim>
107 | 佛菩薩是社會大眾最好的榜樣     |是非不當。向背乖宜。
108 | 成就別人，才是真正成就自己     |虐下取功。諂上希旨。
109 | 佛對眾生的期望，是成聖成賢     |受恩不感。念怨不休。
110 | 一絲妄想執著，就逃不出六道輪迴 |
111 | 得罪眾生, 菩提道上魔障多       |輕蔑天民。擾亂國政。
112 | 不聽經決定會胡思亂想           |<dim>輕蔑天民。擾亂國政。</dim>
113 | 作佛就得要破四相               |賞及非義。刑及無辜。
114 | 菩提心是真正覺悟的心           |誅降戮服。貶正排賢。
115 | 世間最苦的人莫過於孤寡         |凌孤逼寡。棄法受賂。
116 | 佛的教誨從真心本性流露出來     |〇〇〇〇〇<dim>棄法受賂。</dim>
117 | 明瞭宇宙人生真相，就叫佛法     |以直為曲。以曲為直。
118 | 東方教育重道義，西方重功利     |入輕為重。見殺加怒。
119 | 跟對老師, 聽其言而觀其行       |知過不改。知善不為。
120 | 不覺悟，修行就難了             |<dim>知過不改。知善不為。</dim>
121 | 發菩提心就是發徹底覺悟之心     |<dim>知過不改。知善不為。</dim>
122 | 沒放下, 修行功夫就不得力       |<dim>知過不改。知善不為。</dim>
123 | 利益眾生是真實利益自己         |<dim>知過不改。知善不為。</dim><br>自罪引他。壅塞方術。
124 | 捨棄貪心就能轉災難             |<dim>自罪引他。壅塞方術。</dim>
125 | 造福眾生的, 要讓它暢通無阻     |<dim>自罪引他。壅塞方術。</dim>
126 | 以為自己沒有過失是最大的過失   |訕謗聖賢。侵凌道德。
127 | 欲度眾生，先度自己             |<dim>訕謗聖賢。侵凌道德。</dim>
128 | 學為人師，行為世範是道德之士   |〇〇〇〇〇<dim>侵凌道德。</dim>
129 | 不可惱害眾生                   |射飛逐走。發蟄驚棲。填穴覆巢。傷胎破卵。
130 | 所有宗教都把不殺生擺在第一     |<dim>射飛逐走。發蟄驚棲。填穴覆巢。傷胎破卵。</dim>
131 | 幸災樂禍是很不好的習氣         |願人有失。毀人成功。<br>危人自安。減人自益。
132 | 為眾生活著，六道跟他就不相干   |以惡易好。以私廢公。<br>竊人之能。蔽人之善。
133 | 佛無有法可說                   |形人之醜。訐人之私。
134 | 偷盜常住物，諸佛都無法救       |耗人貨財。<br>離人骨肉。侵人所愛。助人為非。
135 | 佛法修學最重要先轉念, 再落實   |<dim>離人骨肉。侵人所愛。助人為非。</dim>
136 | 真正教學是在童子               |逞志作威。辱人求勝。<br>敗人苗稼，破人婚姻。
137 | 邪法正法都不離自性，邪正不二   |<dim>逞志作威。辱人求勝。</dim><br>乘威迫脅。縱暴殺傷。敗人苗稼，破人婚姻。
138 | 對人事物恭敬,節儉是福報的根    |苟富而驕。苟免無恥。認恩推過。嫁禍賣惡。認恩推過。
139 | 嫉妒障礙造成挫人所長,護己所短  |沽買虛譽。包貯險心。挫人所長。護己所短。
140 | 學佛就是學覺悟，學做好人       |乘威迫脅。縱暴殺傷。
141 | 日用所需省一分就幫助眾生一分   |散棄五穀。勞擾眾生。
142 | 用齋時觀想, 生起感恩的意念     |無故剪裁。非禮烹宰。散棄五穀。勞擾眾生。
143 | 佛門遵守戒律規章，是尊重佛法   |破人之家。取其財寶。決水放火。以害民居。
144 | 三寶要重實質，不重形式         |紊亂規模。以敗人功。損人器物。以窮人用。
145 | 顏回之樂是安貧樂道             |見他榮貴。願他流貶。見他富有。願他破散。
146 | 利用此寶貴的身，修積真實功德   |<dim>見他榮貴。願他流貶。見他富有。願他破散。</dim>
147 | 健康長壽第一個因素是心地清淨   |見他色美。起心私之。
148 | 五常是基本做人的道理           |負他貨財。願他身死。干求不遂。便生咒恨。
149 | 尊重護法，要結法緣             |見他失便。便說他過。<br>見他體相不具而笑之。<br>見他才能可稱而抑之。
150 | 愛的世界好榜樣                 |埋蠱厭人。用藥殺樹。
151 | 孝親尊師                       |恚怒師傅。抵觸父兄。
152 | 因緣果報                       |強取強求。好侵好奪。
153 | 我執與我                       |<dim>強取強求。好侵好奪。</dim>
154 | 盜戒之犯                       |擄掠致富。巧詐求遷。
155 | 盡忠職守                       |<dim>擄掠致富。巧詐求遷。</dim>
156 | 公道不存人心弗服；生於憂患死於安樂 |賞罰不平。逸樂過節。
157 | 嚴以律己，寬以待人             |苛虐其下。恐嚇於他。
158 | 積功累德果報自受；忍讓為上不造惡業 |怨天尤人。呵風罵雨。<br>鬥合爭訟。妄逐朋黨。
159 | 結黨營私，貪圖勢利             |〇〇〇〇〇<dim>妄逐朋黨。</dim>
160 | 親疏要等同的看待               |得新忘故。口是心非。
161 | 畏懼地獄苦，趕緊回頭           |貪冒於財。欺罔其上。造作惡語。讒毀平人。
162 | 骨肉之間聽信謠言，骨肉會滅絕   |<dim>貪冒於財。欺罔其上。造作惡語。讒毀平人。</dim>
163 | 人不可以不存善心               |毀人稱直。罵神稱正。
164 | 學佛要學得跟佛一樣             |棄順效逆。背親向疏。
165 | 佛法是多元文化的社會教育       |<dim>棄順效逆。背親向疏。</dim>
166 | 出家人是佛菩薩的招牌           |指天地以證鄙懷。引神明而鑑猥事。<br>施與後悔。假借不還。
167 | 有智慧的人把福報留到晚年享     |<dim>施與後悔。假借不還。</dim>
168 | 孝敬做圓滿就成佛               |分外營求。力上施設。
169 | 還有愛欲就出不了六道輪迴       |淫欲過度。<br>心毒貌慈。穢食餧人。左道惑眾。
170 | 真有善根福德的，就是依老師     |<dim>心毒貌慈。穢食餧人。左道惑眾。</dim>左道惑眾。
171 | 業力轉成願力,就是乘願再來      |短尺狹度。輕秤小升。以偽雜真。採取姦利。
172 | 一般大眾對造作惡業習以為常     |壓良為賤。謾驀愚人。
173 | 業力不可思議                   |貪婪無厭。咒詛求直。
174 | 佛家戒酒就是防範去犯殺盜淫妄   |骨肉忿爭。男不忠良。女不柔順。
175 | 男女結成夫婦是菩薩事業         |<dim>骨肉忿爭。男不忠良。女不柔順。</dim>
176 | 夫婦是人倫的根本               |不和其室。不敬其夫。
177 | 隨喜功德就是對治嫉妒障礙       |每好矜誇。常行妒忌。
178 | 家庭有問題, 社會就動盪不安     |無行於妻子。失禮於舅姑。
179 | 孝道從祭祀上建立               |輕慢先靈。違逆上命。
180 | 現代人沒人教, 才輕慢先靈       |<dim>輕慢先靈。違逆上命。</dim>
181 | 帶得去的多做，帶不去的不要做   |作為無益。懷挾外心。
182 | 古時帝王念念都是為人民         |<dim>作為無益。懷挾外心。</dim>
183 | 不平的根從妄想分別執著來的     |自咒咒他，偏憎偏愛。
184 | 做好事別叫人知道是積陰德       |越井越灶。跳食跳人。損子墮胎。行多隱僻。
185 | 諸佛菩薩幫助人是無條件         |晦臘歌舞。朔旦號怒。對北涕唾及溺。對灶吟詠及哭。
186 | 明處暗處都不能起不善念頭       |又以灶火燒香。穢柴作食。夜起裸露。八節行刑。
187 | 對一切人事物常存恭敬心         |唾流星。指虹霓。輒指三光。久視日月。<br>春月燎獵。對北惡罵。無故殺龜打蛇。
188 | 有畏懼心，自然就不造業         |如是等罪。司命隨其輕重。奪其紀算。<br>算盡則死。死有餘責。乃殃及子孫。
189 | 佛家講布施要淨財，淨施         |又諸橫取人財者。乃計其妻子家口以當之。漸至死喪。<br>若不死喪。則有水火盜賊。遺亡器物。疾病口舌諸事。以當妄取之值。
190 | 除三毒才能脫輪迴，離三惡道     |又枉殺人者。是易刀兵而相殺也。
191 | 因果通三世，逃不了的           |取非義之財者。譬如漏脯救飢。鴆酒止渴。非不暫飽。死亦及之。
192 | 讀經是親近佛菩薩，聽佛教誨     |夫心起於善。善雖未為。而吉神已隨之。<br>或心起於惡。惡雖未為。而凶神已隨之。
193 | 念念都是惡，怎能不墮惡道？     |其有曾行惡事。後自改悔。諸惡莫作。眾善奉行。<br>久久。必獲吉慶。所謂轉禍為福也。
194 | 境緣無好醜, 好醜起於心         |故吉人。語善。視善。行善。一日有三善。三年。天必降之福。<br>〇凶人。語惡。視惡。行惡。一日有三惡。三年。天必降之禍。<br>胡不勉而行之。
195 | 吉凶禍福皆自造，絕非鬼神主宰   |〇<dim>凶人。語惡。視惡。行惡。一日有三惡。三年。天必降之禍。<br>胡不勉而行之。</dim>`.split('\n');

  var buf = new Buffer();
  function write1(i) { // 0-based
    if (i > 195) { buf.w('<td colspan=2></td>'); return; }
    var a = titles[i].split('\|'), ttl = a[1].trim(), v = a[2].trim().replaceAll('〇','　');
    if (i>=149 && i<159) ttl = `<dim title="原文無此標題；信裹居士所加">${ttl}</dim>`;
    buf.w('<td valign=top align=right><a href="?vol=', i+1, '">&nbsp;&nbsp;', i+1, '</a>.</td>',
          '<td valign=top nowrap>', ttl, '</td><td width="20px"></td><td class="KaiTi" style="text-indent:0">', v, '</td>');
  }

  buf.w('\n<center><table border=0 cellspacing=0>');
  for (var i=0; i<titles.length; i+=1) {
    buf.w('<tr>'); write1(i); buf.w('</tr>');
  }
  buf.w('</table></center>');
  return buf.render();
})();
