SC.volNum = 14;
SC.text = `
<div style="margin-top:-10px; background-color:#fdd">
/BQKaiTi/<ail>（《四十華嚴》缺失〈第十八參·大光王〉及〈第十九參·不動優婆夷〉前半部。本處以《八十華嚴》對應部分聊作填充。）</ail>

/HYSK=18/

漸次遊行，或至人間城邑、聚落，或經曠野、巖谷、險難，無有疲懈，未曾休息。然後乃至妙光大城，而問人言：「妙光大城在於何所？」人咸報言：「妙光城者，今此城是，是大光王之所住處。」

時，善財童子歡喜踴躍，作如是念：「我善知識在此城中，我今必當親得奉見，聞諸菩薩所行之行，聞諸菩薩出要之門，聞諸菩薩所證之法，聞諸菩薩不思議功德，聞諸菩薩不思議自在，聞諸菩薩不思議平等，聞諸菩薩不思議勇猛，聞諸菩薩不思議境界廣大清淨。」作是念已，入妙光城。

見此大城，以金、銀、琉璃、玻璃、真珠、硨磲、碼瑙七寶所成，七寶深塹，七重圍遶；八功德水盈滿其中，底布金沙，優缽羅華、波頭摩華、拘物頭華、芬陀利華遍佈其上；寶多羅樹七重行列，七種金剛以為其垣各各圍遶，所謂：師子光明金剛垣、無能超勝金剛垣、不可沮壞金剛垣、不可毀缺金剛垣、堅固無礙金剛垣、勝妙網藏金剛垣、離塵清淨金剛垣，悉以無數摩尼妙寶間錯莊嚴，種種眾寶而為埤堄。其城縱廣一十由旬，周迴八方，面開八門，皆以七寶周遍嚴飾，毘琉璃寶以為其地，種種莊嚴甚可愛樂。

其城之內，十億衢道，一一道間，皆有無量萬億眾生於中止住。有無數閻浮檀金樓閣，毘琉璃摩尼網羅覆其上；無數銀樓閣，赤真珠摩尼網羅覆其上；無數毘琉璃樓閣，妙藏摩尼網羅覆其上；無數玻璃樓閣，無垢藏摩尼王網羅覆其上；無數光照世間摩尼寶樓閣，日藏摩尼王網羅覆其上；無數帝青摩尼寶樓閣，妙光摩尼王網羅覆其上；無數眾生海摩尼王樓閣，焰光明摩尼王網羅覆其上；無數金剛寶樓閣，無能勝幢摩尼王網羅覆其上；無數黑栴檀樓閣，天曼陀羅華網羅覆其上；無數無等香王樓閣，種種華網羅覆其上。

其城復有無數摩尼網、無數寶鈴網、無數天香網、無數天華網、無數寶形像網，無數寶衣帳、無數寶蓋帳、無數寶樓閣帳、無數寶華鬘帳之所彌覆，處處建立寶蓋、幢、幡。

當此城中，有一樓閣，名：正法藏，阿僧祇寶以為莊嚴，光明赫奕最勝無比，眾生見者心無厭足，彼大光王常處其中。

爾時，善財童子於此一切珍寶妙物，乃至男女、六塵境界，皆無愛著，但正思惟究竟之法，一心願樂見善知識。

漸次遊行，見大光王去於所住樓閣不遠四衢道中，坐如意摩尼寶蓮華藏廣大莊嚴師子之座，紺琉璃寶以為其足，金繒為帳，眾寶為網，上妙天衣以為茵蓐。其王於上結跏趺坐，二十八種大人之相、八十隨好而以嚴身；如真金山，光色熾盛；如淨空日，威光赫奕；如盛滿月，見者清涼；如梵天王，處於梵眾；亦如大海，功德法寶無有邊際；亦如雪山，相好樹林以為嚴飾；亦如大雲，能震法雷，啟悟群品；亦如虛空，顯現種種法門星象；如須彌山，四色普現眾生心海；亦如寶洲，種種智寶充滿其中。

於王座前，有金、銀、琉璃、摩尼、真珠、珊瑚、琥珀、珂貝、璧玉諸珍寶聚，衣服、瓔珞及諸飲食無量無邊種種充滿。復見無量百千萬億上妙寶車、百千萬億諸天妓樂、百千萬億天諸妙香、百千萬億病緣湯藥資生之具，如是一切悉皆珍好。無量乳牛，蹄角金色；無量千億端正女人，上妙栴檀以塗其體，天衣、瓔珞種種莊嚴，六十四能靡不該練，世情禮則悉皆善解，隨眾生心而以給施。

城邑、聚落、四衢道側，悉置一切資生之具。一一道傍皆有二十億菩薩，以此諸物給施眾生，為欲普攝眾生故，為令眾生歡喜故，為令眾生踴躍故，為令眾生心淨故，為令眾生清涼故，為滅眾生煩惱故，為令眾生知一切義理故，為令眾生入一切智道故，為令眾生捨怨敵心故，為令眾生離身、語惡故，為令眾生拔諸邪見故，為令眾生淨諸業道故。

時，善財童子五體投地，頂禮其足，恭敬右遶，經無量匝，合掌而住，白言：「聖者！我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？云何修菩薩道？我聞聖者善能誘誨，願為我說！」

時，王告言：「善男子！我淨修菩薩大慈幢行，我滿足菩薩大慈幢行。善男子！我於無量百千萬億乃至不可說不可說佛所，問難此法，思惟觀察，修習莊嚴。

「善男子！我以此法為王，以此法教敕，以此法攝受，以此法隨逐世間，以此法引導眾生，以此法令眾生修行，以此法令眾生趣入，以此法與眾生方便，以此法令眾生熏習，以此法令眾生起行，以此法令眾生安住思惟諸法自性，以此法令眾生安住慈心，以慈為主，具足慈力；如是，令住利益心、安樂心、哀愍心、攝受心、守護眾生不捨離心、拔眾生苦無休息心。我以此法令一切眾生畢竟快樂，恆自悅豫，身無諸苦，心得清涼，斷生死愛，樂正法樂，滌煩惱垢，破惡業障，絕生死流，入真法海，斷諸有趣，求一切智，淨諸心海，生不壞信。善男子！我已住此大慈幢行，能以正法教化世間。

「善男子！我國土中一切眾生，皆於我所無有恐怖。善男子！若有眾生貧窮困乏，來至我所而有求索。我開庫藏恣其所取，而語之言：『莫造諸惡，莫害眾生，莫起諸見，莫生執著。汝等貧乏，若有所須，當來我所及四衢道，一切諸物種種具足，隨意而取勿生疑難。』

「善男子！此妙光城所住眾生，皆是菩薩發大乘意，隨心所欲，所見不同，或見此城其量狹小，或見此城其量廣大；或見土沙以為其地，或見眾寶而以莊嚴；或見聚土以為垣牆，或見寶牆周匝圍遶；或見其地多諸瓦石高下不平，或見無量大摩尼寶間錯莊嚴平坦如掌；或見屋宅土木所成，或見殿堂及諸樓閣、階墀、窗闥、軒檻、戶牖——如是一切無非妙寶。

「善男子！若有眾生其心清淨，曾種善根供養諸佛，發心趣向一切智道，以一切智為究竟處，及我昔時修菩薩行曾所攝受，則見此城眾寶嚴淨；餘皆見穢。

「善男子！此國土中一切眾生，五濁世時樂作諸惡。我心哀愍而欲救護，入於菩薩大慈為首隨順世間三昧之門。入此三昧時，彼諸眾生所有怖畏心、惱害心、怨敵心、諍論心，如是諸心，悉自消滅。何以故？入於菩薩大慈為首順世三昧，法如是故。善男子！且待須臾，自當現見。」

時，大光王即入此定。其城內外六種震動，諸寶地、寶牆、寶堂、寶殿、臺觀、樓閣、階砌、戶牖，如是一切咸出妙音，悉向於王曲恭敬禮。妙光城內所有居人，靡不同時歡喜踴躍，俱向王所舉身投地。村營、城邑一切人眾，咸來見王，歡喜敬禮。

近王所住，鳥獸之屬，互相瞻視，起慈悲心，咸向王前恭敬禮拜。一切山原及諸草樹，莫不迴轉向王敬禮。陂池、泉井及以河海，悉皆騰溢，流注王前。十千龍王起大香雲，激電震雷，注微細雨。有十千天王，所謂：忉利天王、夜摩天王、兜率陀天王、善變化天王、他化自在天王……如是等而為上首，於虛空中作眾妓樂。無數天女歌詠讚歎，雨無數華雲、無數香雲、無數寶鬘雲、無數寶衣雲、無數寶蓋雲、無數寶幢雲、無數寶幡雲，於虛空中而為莊嚴，供養其王。伊羅婆拏大象王，以自在力，於虛空中敷布無數大寶蓮華，垂無數寶瓔珞、無數寶繒帶、無數寶鬘、無數寶嚴具、無數寶華、無數寶香，種種奇妙以為嚴飾，無數采女種種歌讚。

閻浮提內復有無量百千萬億諸羅剎王、諸夜叉王、鳩槃荼王、毘捨闍王，或住大海，或居陸地，飲血噉肉，殘害眾生；皆起慈心，願行利益，明識後世，不造諸惡；恭敬合掌，頂禮於王。如閻浮提，餘三天下，乃至三千大千世界，乃至十方百千萬億那由他世界中，所有一切毒惡眾生悉亦如是。

時，大光王從三昧起，告善財言：「善男子！我唯知此菩薩大慈為首隨順世間三昧門。如諸菩薩摩訶薩為高蓋，慈心普蔭諸眾生故；為修行，下、中、上行悉等行故；為大地，能以慈心任持一切諸眾生故；為滿月，福德光明於世間中平等現故；為淨日，以智光明照耀一切所知境故；為明燈，能破一切眾生心中諸黑闇故；為水清珠，能清一切眾生心中諂誑濁故；為如意寶，悉能滿足一切眾生心所願故；為大風，速令眾生修習三昧入一切智大城中故。而我云何能知其行，能說其德，能稱量彼福德大山，能瞻仰彼功德眾星，能觀察彼大願風輪，能趣入彼甚深法門，能顯示彼莊嚴大海，能闡明彼普賢行門，能開示彼諸三昧窟，能讚歎彼大慈悲雲？

「善男子！於此南方，有一王都，名曰：安住；有優婆夷，名曰：不動。汝詣彼問：菩薩云何學菩薩行、修菩薩道？」

時，善財童子頂禮王足，遶無數匝，慇懃瞻仰，辭退而去。

/HYSK=19/

爾時，善財童子出妙光城，遊行道路，正念思惟大光王教，憶念菩薩大慈幢行門，思惟菩薩隨順世間三昧光明門，增長彼不思議願福德自在力，堅固彼不思議成熟眾生智，觀察彼不思議不共受用大威德，憶念彼不思議差別相，思惟彼不思議清淨眷屬，思惟彼不思議所作業；生歡喜心，生淨信心，生猛利心，生欣悅心，生踴躍心，生慶幸心，生無濁心，生清淨心，生堅固心，生廣大心，生無盡心。如是思惟，悲泣流淚，念善知識實為希有，出生一切諸功德處，出生一切諸菩薩行，出生一切菩薩淨念，出生一切陀羅尼輪，出生一切三昧光明，出生一切諸佛知見，普雨一切諸佛法雨，顯示一切菩薩願門，出生難思智慧光明，增長一切菩薩根芽。又作是念：「善知識者，能普救護一切惡道，能普演說諸平等法，能普顯示諸夷險道，能普開闡大乘奧義，能普勸發普賢諸行，能普引到一切智城，能普令入法界大海，能普令見三世法海，能普授與眾聖道場，能普增長一切白法。」

善財童子如是悲哀思念之時，彼常隨逐覺悟菩薩、如來使天，於虛空中而告之言：「善男子！其有修行善知識教，諸佛世尊悉皆歡喜；其有隨順善知識語，則得近於一切智地；其有能於善知識語無疑惑者，則常值遇一切善友；其有發心願常不離善知識者，則得具足一切義利。善男子！汝可往詣安住王都，即當得見不動優婆夷大善知識」

時，善財童子從彼三昧智光明起，漸次遊行，至安住城，周遍推求不動優婆夷今在何所？無量人眾咸告之言：「善男子！不動優婆夷身是童女，在其家內，父母守護，與自親屬無量人眾演說妙法。」善財童子聞是語已，其心歡喜，如見父母，即詣不動優婆夷捨。

入其宅內，見彼堂宇，金色光明普皆照耀，遇斯光者身意清涼。善財童子光明觸身，即時獲得五百三昧門，所謂：了一切希有相三昧門、入寂靜三昧門、遠離一切世間三昧門、普眼捨得三昧門、如來藏三昧門……得如是等五百三昧門；以此三昧門故，身心柔軟，如七日胎。又聞妙香，非諸天、龍、乾闥婆等人與非人之所能有。

善財童子前詣其所，恭敬合掌，一心觀察，見其形色端正殊妙，十方世界一切女人無有能及，況其過者！唯除如來及以一切灌頂菩薩。口出妙香，宮殿莊嚴，並其眷屬悉無與等，況復過者！十方世界一切眾生，無有於此優婆夷所起染著心；若得暫見，所有煩惱悉自消滅。譬如百萬大梵天王，決定不生欲界煩惱；其有見此優婆夷者，所有煩惱應知亦然。十方眾生觀此女人皆無厭足，唯除具足大智慧者。

爾時，善財童子曲躬合掌，正念觀察，見此女人，其身自在不可思議，色相顏容世無與等，光明洞徹物無能障，普為眾生而作利益，其身毛孔恆出妙香，眷屬無邊，宮殿第一，功德深廣莫知涯際；心生歡喜，以頌讚曰：

/gatha/
「守護清淨戒，　修行廣大忍，　精進不退轉，　光明照世間。」
//

爾時，善財童子說此頌已，白言：「聖者！我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行？云何修菩薩道？我聞聖者善能誘誨，願為我說！」

時，不動優婆夷以菩薩柔軟語、悅意語，慰諭善財，而告之言：「善哉善哉！善男子！汝已能發阿耨多羅三藐三菩提心。善男子！我得菩薩難摧伏智慧藏解脫門，我得菩薩堅固受持行門，我得菩薩一切法平等地總持門，我得菩薩照明一切法辯才門，我得菩薩求一切法無疲厭三昧門。」

善財童子言：「聖者！菩薩難摧伏智慧藏解脫門，乃至求一切法無疲厭三昧門，境界云何？」

童女言：「善男子！此處難知。」

善財白言：「唯願聖者，承佛神力，為我宣說！我當因善知識，能信能受，能知能了，趣入觀察，修習隨順，離諸分別，究竟平等。」
</div>
爾時，不動優婆夷告善財童子言：「善男子！我憶過去無垢光劫，彼劫有佛名為脩臂，十號圓滿；時，有國王名曰電授，唯有一女，即我身是。我於其夜分廢音樂時，父母、兄弟悉已眠寢，五百童女亦皆昏寐，我於樓上仰觀星宿，於虛空中見彼如來，如寶山王，無量無邊，天龍八部及不思議諸菩薩眾所共圍遶，佛身普放大光明網，遍滿十方無所障礙；佛身毛孔皆出妙香；我聞是香，身體柔軟，心生歡喜；便從樓下，合十指掌，頂禮於佛；諦觀彼佛，不見頂相；觀身左右，莫知邊際；思惟彼佛諸相隨好，無有厭足。善男子！我於爾時，竊自念言：『此佛世尊作何等業，獲於如是勝妙之身？相好圓滿，光明具足，眷屬成就，宮殿莊嚴，福德智慧，總持三昧，神通辯才，咸不思議？』善男子！時，彼如來知我心念，即告我言：『汝應發難摧伏心，斷諸煩惱；汝應發無能勝心，破諸邪執；汝應發無退怯心，入深法門；汝應發不動轉心，拔生死苦；汝應發無迷惑心，普於一切諸趣受生；汝應發無厭足心，求見諸佛，無有休息；汝應發無知足心，悉受一切如來法雨；汝應發正思惟心，普照一切佛法光明；汝應發大住持心，普轉一切如來法輪；汝應發廣流通心，隨眾生欲，施其法寶。』善男子！我於彼佛正等覺所，聞如是法；隨順趣求一切種智，心無退轉；求佛十力、求佛辯才、求佛光明、求佛色身、求佛相好、求佛眾會、求佛淨剎、求佛威儀、求佛壽命。發是心已，深心愛樂，如渴思水；其心堅固，猶如金剛；一切煩惱及以二乘所不能壞。

「善男子！我憶初發是心已來，經閻浮提極微塵數劫，尚不曾起一念欲心，況行其事？爾所劫中於自親屬有過失者，尚不生起一念瞋心，況他眾生無過失者？爾所劫中於其自身不生我見，況於眾具而計我所？爾所劫中死時、生時及於胎藏入住出時，乃至夢中未曾迷惑起眾生想及無記心，況於餘時？爾所劫中乃至夢寐隨見一佛未曾忘失，何況菩薩十眼所見？爾所劫中受持一切如來正法，未曾忘失一文、一句，乃至世俗所有言辭，尚不忘失，何況如來語言藏中所宣妙法？爾所劫中受持一切如來法海一文、一句，無不思惟如理觀察，乃至一切世俗之法，尚恒思惟觀察覺了，何況如來真勝義法？爾所劫中受持一切如來法海，未曾於一法中不得三昧，乃至世間一切工巧技藝之法，一一法中亦復如是；爾所劫中住持一切如來法輪，隨所住持未曾廢捨一文、一句，亦無錯謬，乃至不曾生於世智，唯除為欲調伏眾生；爾所劫中見諸佛海，未曾於一佛所不得成就清淨大願，乃至於諸變化佛所，悉亦如是；爾所劫中見諸菩薩修行妙行，無有一行我不成就而得清淨；爾所劫中所見眾生，無一眾生我不勸發阿耨多羅三藐三菩提心，未曾勸一眾生，乃至一念發於聲聞、辟支佛意；爾所劫中於一切佛所聞之法，乃至一文、一句，不生疑心、不生二想、不生分別想、不生種種想、不生執著想、不生高下想、不生勝劣想、不生愛憎想，乃至無一念中生如是想。

「善男子！我從是來所見諸佛常得親近，未曾捨離；常見菩薩，未曾捨離；常見真實大善知識，未曾捨離；常聞諸佛清淨大願，未曾捨離；常聞菩薩所修妙行，未曾捨離；常聞菩薩波羅蜜門，未曾捨離；常聞菩薩地智光明門，未曾捨離；常聞菩薩總持三昧無盡藏門，未曾捨離；常聞菩薩普入無邊世界網門，未曾捨離；常聞菩薩普入無邊眾生界門，未曾捨離；常聞菩薩以智光明除滅一切眾生煩惱，未曾捨離；常聞菩薩生長一切眾生善根，未曾捨離；常聞菩薩能隨眾生遍周法界普現其身，未曾捨離；常聞菩薩以妙言音開悟法界一切眾生，未曾捨離。善男子！我得菩薩難摧伏智慧藏解脫門；我得菩薩求一切法心無疲厭莊嚴三昧門；我得菩薩堅固受持願行門；我得菩薩一切法平等地總持門；我得菩薩一切法智光照辯才門；現不思議自在神變，汝欲見不？」

善財言：「唯！我心願見。」

爾時，不動優婆夷不起龍藏師子之座，入菩薩難摧伏智慧藏解脫門、求一切法心無疲厭莊嚴三昧門、不空圓滿莊嚴三昧門、十力智輪現前三昧門，入如是等十億三昧門；入此三昧門時，十方各有不可說不可說佛剎極微塵數世界六種震動；一一世界皆悉清淨瑠璃所成；一一世界中有百億四天下；一一四天下皆有如來或昇兜率、或時降生、入胎初生、出家苦行、或居道樹、或現降魔、示證菩提、受梵王請、趣波羅奈、轉四諦輪、或從忉利還閻浮提，三道寶階從天而下；或時現處遍六大城，現大神通摧諸外道；或時現住毘耶離城獼猴池側，初制律儀；或時現處王舍大城靈鷲山等，說諸般若波羅蜜門；乃至或現拘尸那城娑羅林間，示般涅槃；如是所作一切佛事，普遍十方清淨世界；一一如來放光明網周遍法界，道場眾會清淨圍遶，轉妙法輪，開悟群品。

時，不動優婆夷從三昧起告善財言：「善男子！汝見此不？汝聞此不？汝解此不？」

善財言：「唯！我皆已見、已聞、已解。」

優婆夷言：「善男子！我唯得此菩薩所修堅固受持大願行門、求一切法心無疲厭莊嚴三昧智光明門、菩薩難摧伏智慧藏解脫門、一切法平等地總持門、一切法智光照辯才門；為一切眾生善巧方便，以妙言音，普遍一切說微妙法，皆令歡喜，如諸菩薩摩訶薩；如烏灑婆鳥，遊行虛空無所障礙，能入一切眾生大海，自在甚深，普遍觀察，見有善根已成熟者，即便執取置菩提岸；又如商客入一切智大寶洲中，採求如來十力智寶；又如漁師有具足力，持正法網，入生死海，漉諸眾生；如阿脩羅王能遍撓動三有大城諸煩惱海，普令眾生究竟寂靜；又如日輪出現虛空，照愛水泥，令其乾竭；猶如滿月出現虛空，令可化者心華開敷；猶如大地普皆平等，無量眾生於中止住，恒受履踐，心無分別，增長一切善法根芽；猶如大風所向無礙，能拔一切諸見大樹，壞散一切生死園苑；如轉輪王遊行世間，以四攝事攝諸眾生；而我云何能知、能說彼功德行？善男子！於此南方有一大城，名都薩羅；其中有一出家外道，名曰遍行；汝詣彼問菩薩云何學菩薩行，修菩薩道。」

時，善財童子頂禮不動優婆夷足，遶無數匝，慇懃瞻仰，辭退而去。

/HYSK=20/

爾時，善財童子於不動優婆夷所，得聞法已，專心憶持所有教誨、所有示導、所有演說、所有讚歎，所遇光照皆悉隨順，生希有心，思惟觀察，普遍修習，一心正念；漸漸前行，經歷國邑、村營、聚落，然後乃至都薩羅城，於日沒時入彼城中，鄽店閭里，四達交衢，處處尋求遍行外道，於高顯處，遠望觀察。其城東北有一大山，名妙吉祥；善財童子於中夜時，見此山頂有大光明，峯巒峻峙，巖岫攢拱，草樹華林靡不輝映，照耀城居，如日初出，見此事已，生大歡喜，作是念言：「我必於此見善知識。」便從城出，正念觀察，而登彼山；住立思惟遙望瞻仰，見此外道於其山上平坦之處徐步經行，色相圓滿，威光照耀，吉祥福焰過於熾火，十千梵眾之所圍遶，大梵天王所不能及；善財即時往詣其所，頂禮其足，遶無數匝，合掌前立，白言：「聖者！我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道，我聞聖者善能誘誨，願為我說。」

遍行答言：「善哉！善哉！善男子！汝乃能發阿耨多羅三藐三菩提心，復能請問諸菩薩行。善男子！我已安住至一切處，隨順遍行菩薩行，已成就普觀一切世間等無障礙三昧門，已成就無依無作神通力，已成就普門法界際般若波羅蜜，如是一切智慧光明隨行圓滿。善男子！我能普於一切世間種種方所、種種形色、種種相貌、種種歿生、種種行解、種種信樂，一切趣類諸眾生中；所謂：天趣、龍趣、夜叉趣、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、地獄、畜生、閻羅王界、人、非人等一切趣類。或住諸見，或信二乘，或有愛樂大乘之道，如是一切諸眾生中，我以種種方便、種種智慧、種種教化、種種調伏平等利益悉令圓滿；所謂：或為演說一切世間種種技藝利益眾生；或為演說堅如金剛能破無明陀羅尼智；或為演說四攝方便攝諸眾生，令得親近一切智道；或為演說諸波羅蜜開示讚歎，令其迴向一切智位；或為稱歎發菩提心，令其不失無上道意；或為稱讚諸菩薩行，令其滿足，能淨佛剎度眾生願；或為演說造諸惡業受地獄等種種苦報，令於不善深生厭離；或為演說供養諸佛種諸善根，決定獲得一切智果，令其發起歡喜之心；或為讚說一切如來、應、正等覺所有功德，令樂佛身求一切智；或為讚說諸佛威德，令其願樂佛不壞身；或為讚說佛自在身，令求如來無能映蔽大威德體。善男子！我又於此都薩羅城一切方所，一切族類，若男若女，諸人眾中，以善方便示同其形，隨其所應，變化言音，種種差別而為說法；諸眾生等悉不能知我是何人，從何而至；唯令聞者如理修行悟真實義。善男子！如於此城利益眾生，於閻浮提城邑聚落所有眾生止住之處，悉亦如是而為利益。善男子！閻浮提內九十六眾各起異見而生執著，我悉於其中方便調伏，令其捨離所有諸見。如閻浮提一切住處，餘三天下亦復如是；如四天下、小千、中千、大千世界其中眾生一切住處亦復如是；如此三千大千世界，如是十方無量世界一切住處，一切品類諸眾生海，我悉於中隨諸眾生心之所樂，以種種方便、種種法門、種種理趣、種種正行、種種事業現、種種色身、種種形相、種種言音而為說法；令彼眾生皆得利益。善男子！我唯知此至一切處隨順遍行菩薩行，如諸菩薩摩訶薩得與眾生無差別身，得與一切眾生數等三昧，以變化身普入諸趣，於一切處皆現受生，清淨光明遍照法界，其有見者無不蒙益，以無礙願住一切劫，得如帝網諸無等行，常勤利益一切眾生，雖於無量煩惱垢中恒與共居而無染著，普於三世眾生平等，以無我智周遍照耀，以大悲藏增長善根，而我云何能知、能說彼功德行清淨智慧？善男子！於此南方有一國土，名為廣博，彼有聚落從國為名，其中有一鬻香長者，名曰具足優鉢羅華，汝詣彼問菩薩云何學菩薩行，修菩薩道。」

時，善財童子禮遍行足，遶無數匝，慇懃瞻仰，辭退而去。

/HYSK=21/

爾時，善財童子因善知識教，不顧身命，不著財寶，不耽五欲，不戀眷屬，不重王位，自在安樂，唯願化導一切眾生，令其成熟；唯願莊嚴諸佛剎土，普遍清淨；唯願供養一切如來，心無疲厭；唯願證知諸法實性，分明顯現；唯願隨順甚深法界，普遍無礙；唯願修集一切菩薩大功德海，終無退轉；唯願恒於一切劫中修菩薩行；唯願普入一切如來眾會道場；唯願入於一三昧門，普現諸三昧門自在神力；唯願於佛一法輪中，普持一切如來法輪；唯願於佛一毛孔中，見一切佛心無厭足；唯願證得智慧光明，能持一切諸佛法藏；專求此等諸佛菩薩所有功德。漸次遊行，至廣博國及其聚落，普遍尋求鬻香長者。

見已前詣，頂禮其足，遶無數匝，合掌而立，白言：「聖者！我已先發阿耨多羅三藐三菩提心，欲求一切佛平等智慧、欲滿一切佛無量大願、欲淨一切佛最上色身、欲見一切佛清淨法身、欲知一切佛廣大智身、欲淨治一切菩薩諸行、欲照明一切菩薩三昧、欲安住一切菩薩總持、欲堅牢一切菩薩功德、欲除滅一切所有障礙、欲遊行一切十方世界，而未知菩薩云何學菩薩行？云何修菩薩道而能出生一切種智？」

長者告言：「善哉！善哉！善男子！汝乃能發阿耨多羅三藐三菩提心。善男子！我善別知一切諸香；所謂：一切香、一切燒香、一切塗香、一切末香，亦知調合如是香法；又知如是一切香王所出之處；又善了知天香、龍香、夜叉香、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等所有諸香；又善了知治諸病香、斷諸惡香、除憂惱香、生染愛香、增煩惱香、滅煩惱香、令於有為生樂著香、令於有為生厭離香、捨諸驕逸香、聞法歡喜香、發心念佛香、證解法門香、聖所受用香、一切菩薩差別香、一切菩薩地位香。如是等香及調和法，形相生起，出現成就，清淨安隱，方便境界，威力業用，所從根本，隨處、隨人種類差別，如是一切我皆了知。善男子！人間有香名曰龍藏，因龍鬪生；若燒一丸大如油麻，即能興起大香焰雲，猶如帝網彌覆王都，於七日中雨細香雨；若著身者身即金色，若著衣服皆悉變成拘蘇摩華色，若因風吹入宮殿中，一切臺殿、樓閣、堂宇皆悉變為拘蘇摩華色；眾生嗅者，七日七夜歡喜充滿，身心快樂，惑熱清涼，無有諸病及諸煩惱，不相侵害，離諸憂苦，不驚不怖，不迷不亂，慈心相向，志意清淨；我知是已，如應說法，令其決定發阿耨多羅三藐三菩提心。善男子！摩羅耶山出栴檀香，名曰牛頭，若以塗身，設入火阬，火不能燒；善男子！海中有香，名無能勝，若以塗鼓及諸螺貝，其聲發時一切敵軍悉皆退散；善男子！阿那婆達多池邊，出沈水香，名蓮華藏，若燒一丸如麻子大，香氣普熏閻浮提界，眾生聞者，離一切罪戒品清淨；善男子！雪山有香，名具足明相，若有眾生嗅此香者，其心決定離諸染著，我為說法，莫不皆得離垢圓滿清淨三昧；善男子！羅剎界中有香，名海藏，其香但為轉輪王用，若燒一丸，香氣所熏王及四軍皆騰虛空遊止自在；善男子！善法堂中有香，名香性莊嚴，若燒一丸熏彼天眾，普令發起念佛之心；善男子！須夜摩天有香，名淨藏性，若燒一丸熏彼天眾，莫不雲集彼天王所，恭敬聽聞王所說法；善男子！兜率天中有香，名信度嚩囉，於一生所繫菩薩座前，若燒一丸，興大香雲，遍覆法界，普雨一切諸供養具，供養一切如來道場菩薩眾會；善男子！妙變化天有香，名奪意性，若燒一丸，於七日中普雨一切不可思議諸莊嚴具。善男子！我唯知此調和香法，如諸菩薩摩訶薩遠離一切諸惡習氣為無垢香，永斷煩惱眾魔羂索，超諸有趣，得如幻智，於諸世間皆無染著，具足圓滿無所著戒，淨無著智，行無著境，於一切處悉無有著，其心平等無著、無依；而我何能知其妙行、說其功德、顯其所有清淨戒品、示其所作無過失業、闡其所有無過失智、辨其離染三業行門？善男子！於此南方有一大城，名曰樓閣；彼有船師，名婆施羅；汝詣彼問菩薩云何學菩薩行，修菩薩道。」

時，善財童子禮長者足，遶無數匝，慇懃瞻仰，一心戀慕，辭退而去。

/HYSK=22/

爾時，善財童子一心正念，向樓閣城，隨順思惟，觀察道路；所謂：觀道高卑、觀道夷險、觀道淨穢、觀道安危、觀道曲直。漸次而行，作如是念：「我當親近彼善知識；善知識者是成就修行諸波羅蜜增勝道因，善知識者是成就修行普入法界無礙道因，善知識者是成就修行攝取一切眾生智道因，善知識者是成就修行令一切眾生不墮險惡道因，善知識者是成就修行令一切眾生離邪業道因，善知識者是成就修行令一切眾生滅煩惱道因，善知識者是成就修行令一切眾生除惡慧道因，善知識者是成就修行令一切眾生離憍慢道因，善知識者是成就修行令一切眾生拔惡刺道因，善知識者是成就修行令一切眾生捨惡見道因，善知識者是成就修行令一切眾生至一切智城道因。何以故？於善知識處得一切善法故，依善知識力得一切智道故；善知識者難見難遇。」於善知識如是思惟，勤求作意，漸次前行。到彼城已，見彼船師在城門外海岸上住，百千商人大眾圍遶，說大海法，方便開示佛功德海；即前往詣，頂禮其足，遶無數匝，一心合掌；白言：「聖者！我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道，我聞聖者善能誘誨，願為我說。」

船師告言：「善哉！善哉！善男子！汝已能發阿耨多羅三藐三菩提心，今復能問生大智因、斷除一切生死苦因、往一切智大寶洲因、成就不壞趣大乘因、遠離二乘怖生死因、住諸三昧生智慧因、遍行菩薩微細行因、乘大願車遊菩薩行清淨道因、以菩薩行莊嚴無壞智清淨道因、普觀一切十方諸佛皆無障礙清淨道因、速能趣入一切諸佛甚深智海清淨道因。善男子！我在海岸樓閣大城，淨修菩薩大悲幢行。

「善男子！我普觀察閻浮提內貧窮眾生，為饒益故修種種行，隨其所願悉令滿足；先以世間珍寶、飲食充足其意，復施法財令其歡喜，令修福行，令生智道，令增善根力，令發菩提心，令淨菩提願，令堅大悲力，令修能滅生死道，令起不捨生死行，令攝眾生海，令修功德海，令照諸法海，令見諸佛海，令入種智海。善男子！我住於此如是思惟、如是作意、如是勤求、如是利益、如是安樂一切眾生。善男子！我知海中一切寶洲、一切寶處、一切寶性、一切寶根、一切寶種、一切寶類；我又能知淨一切寶、鑽一切寶、出一切寶、作一切寶、一切寶器、一切寶用、一切寶境界、一切寶光明。我又能知一切龍宮、一切夜叉宮、一切羅剎宮、一切部多宮，如是一切差別住處，皆善迴避，免其諸難。亦知大海漩澓淺深，波濤遠近，水色好惡，種種不同；亦善別知日月星辰列宿迴轉，運行度數，變異災祥，晝夜晷漏，時分延促；亦知其船鐵木堅脆，機關澁滑，水之大小，風之逆順，左右旋轉安危之相，可行則行，可止則止。我以如是種種方便，常能利益一切眾生。善男子！我以好船運諸商眾，行安隱道，示其寂靜無恐怖相；復為說法令其歡喜，隨所樂欲引至寶洲與諸珍寶咸使充足，然後將領還閻浮提。善男子！我將大船如是往來，從昔至今未曾損壞，若有眾生得見我身聞我法者，令其永不怖生死海，必得入於一切智海，必能竭盡諸愛欲海，能以智光照三世海，能盡一切眾生苦海，能淨一切眾生心海，速能嚴淨一切剎海，普能往詣十方佛海，普知一切眾生根海，普了一切眾生行海，普順一切眾生性海。善男子！我唯得此大悲幢行，若有眾生見聞憶念與我同住，皆悉不空，如諸菩薩摩訶薩，善能遊涉生死大海，能不染著諸煩惱海，能捨一切諸妄見海，能觀一切諸法性海，能以四攝攝眾生海，能善安住一切智海，能滅一切眾生著海，能平等住一切時海，能以神通度眾生海，能以其時調眾生海，而我云何能知、能說彼功德行？善男子！於此南方有一城邑，名樂瓔珞；中有長者名為最勝，汝詣彼問菩薩云何學菩薩行，修菩薩道。」

時，善財童子禮船師足，遶無數匝，慇懃瞻仰，悲泣流淚；求善知識心無厭足，於善知識增戀慕心、增愛樂心，一心觀察，辭退而去。
`;
