QXL.volNum = 3;
QXL.text = `
請大家打開《講義》第五頁。

這一科是解釋標題，分成兩科。第一科是別釋，把標題分成三段來各別解釋。前面一段是講到大乘。大乘這兩個字，是本論主要修學的法門。馬鳴菩薩在造論的因緣中講到：他之所以要造作本論，主要是要使令一切眾生離一切苦，得究竟樂。

在我們的生命中，什麼叫做痛苦呢？比如說我們今天沒有飯吃，這個也是痛苦；或者是沒有衣服可以穿，感到寒冷，這個也是痛苦：但這種都是暫時的痛苦。佛法所說的痛苦，是指生死流轉的痛苦，因為我們每一期的生命，都積集了無量無邊的痛苦，所以這一切痛苦的根源，是依止生命的流轉而引生出來。所以消滅生死的痛苦，在佛法的修學中，就變成一個非常重要的主題。

從佛法的角度來說，這個生死流轉的痛苦，是由因緣而生起的，既然我們想要消滅它，你要知道它生起的因緣，才能夠知道如何來消滅。

馬鳴菩薩在本論中講到一心、二門、三大。什麼叫做一心呢？就是說我們的生命就像是無止盡的水流，從過去流到現在，從現在又流到未來，這整個生命的相續，主要是我們內心的相續。從一心中，我們應該如何來觀察生命呢？馬鳴菩薩提出兩個法門來觀察：第一個是生滅門，第二個是真如門。

所謂的生滅門就是我們無量劫所造的業力，這個業力它有熏習我們這一念心的作用，這個業力熏習我們這一念心，就會創造出很多很多的果報。假設是善業的熏習，就創造安樂的果報；假設是罪業的熏習，就出現痛苦的果報：這就是我們所謂的個體生命。在三界中，我們會由業力而創造一個色心諸法。

比如說你是一個女人，你就有女人的外相、女人的思想；你來生是一個天人，你就有天人的外相、天人的思想；或者你是一隻螞蟻，你有螞蟻的外相、有螞蟻的思想。既然它是由業力所熏習，而我們的業力是不斷的變化，所以生命的果報體也就不斷的變化，這叫做生滅門，它隨著你業力的釋放而不斷地改變。

我們凡夫最大的障礙，就是我們在這個生滅門（個體生命）中，產生自我的執取思想，認為我們這一念的思想是由業力所生，認為這個思想是有真實不變的自體，叫做我。捏造出一個自我以後，從今以後我們跟整個法界產生了對立，就是在這個平等不二的法界中，產生了一個我相、人相的對立。人跟人之間開始對立以後，就會產生業力，所以無明緣行。為什麼世間上會產生業力？就是因為有個體的對立。為什麼佛跟佛之間不造業呢？因為佛跟佛之間內心是平等的，他不造業力，也不造罪、也不造善。我們有個體生命以後，就產生了無明緣行，產生業力，使令我們這個個體生命，沒有止盡的相續下去。

所以生死流轉的根源，簡單地說就是我相的執取──所謂的我執。

這應該怎麼辦呢？本論中是說：我們這一念心，從今以後不再心隨妄轉，不再跟著你的感覺去活動。不能跟著感覺走，內心中跟著誰走呢？就依止大乘，依止體、相、用三大的大乘。我們經常觀察我們這一念心：

何期自性本自清淨——所謂的體大；

何期自性本自具足——所謂的相大；

何期自性能生妙法——所謂的用大。

這樣我們就能夠從一種狹隘的自我意識中，慢慢地解脫出來而趣向於真如門，達到離苦得樂的目的！

本論的大乘，就是我們的修學宗要，等於是在標題中，就先標出我們的修學宗要就是大乘法門，xxx包括體相用三大的修學。大乘法的修學次第，最主要的就是先生起信心，對大乘法生起堅定不移的信心；所以在講完法體以後，就正式說明如何的來修學。

/SECTION/第二段、釋起信

${diagramSvg('起信')}

在大乘的修學中，先說明這個信，我們看《講義》：

/VERSE9/信者，於諸善心所最為上首。謂於實德能，深忍樂欲，心淨為性，對治不信，樂善為業。

這個信在所有善良的心所中是最為上首，是一切善法的根源。在唯識學上，我們一個人造善法有兩種的差別：一種是決定性的善法，就是一種增長業，它有強大招感果報的力量；第二種的善法是不決定的，它沒有招感果報的功能，沒有強大功能：xxx的差別就是看信解。

就是說你今天造一個善業，假設你是一時的惻隱之心，你到了菜市場看到這些刀下的眾生，一時生起惻隱之心而行放生，但是你對於放生所成就的功德完全不生信解，這樣的善法是不決定的，這個善法對我們的生命並不能產生一個強大離苦得樂的作用。

假設我們今天做一個善法，你去拜佛，你在拜佛時，你深信佛陀有救拔你的力量，他是你的歸依處，每一拜佛都依止你歸依的心，透過你對佛法的熏習產生堅定的信解，你每一拜佛都是一個強大的業力。就是依止信解所造的善法，這個善法叫做增長業，它有強大招感安樂果報的力量。

所以在所有的善法中，你一定要跟信相應，這個善法才能夠變成有力量，所以它是一切強大善法的根源。

那什麼是信的內涵呢？謂於實德能，深忍樂欲，心淨為性，對治不信，樂善為業。這個信的安立有三種差別：

第一個實：是針對這個法的實，這個實是一個存在性，你對於這個法的存在性能夠產生一個忍，忍可隨順，你相信這個法是存在的，它不是天方夜譚，它是真實存在的一個東西。

第二個德：這個法有一種功能德用，這功能德用指的是滅惡生善、離苦得樂的功能德用，你對所產生的功德，生起一個樂，好樂修學。

第三個能：你相信這件情你有能力成就，所以產生欲，有一種想要成就的希望。

當你對一個法的存在性、功德性、成就性，產生隨順、好樂、希望時，內心中是非常清淨的，這就是我們所謂的信心。這個信心在內心中產生以後，就能夠產生滅惡生善的功能，所滅的惡是懷疑不信，所生的善是精進。你有信心，你就產生希望，有希望就會推動你的行動。

淨土宗常說信、願、行，其實所有的法都是信願行，不管雜染法、不管清淨法。就是說一個堅定有力量的業力，不管是善業或者罪業，在唯識學上說都要依止希望、欲樂。這個希望是哪裡來呢？就是你相信，你相信這個法對你來說會離苦得樂。所以你一定是先由信心而產生希望，由希望才產生這個行動。所以說這個信它是所有功德的根源。所以我們要經常產生功德相，就應該要把它的根源先確定下來。

廣泛的來說，信心是涵蓋所有的染淨諸法；但是本論中的信，它的所觀境是針對大乘的功德。大乘功德要生起一個信心，本論中提出有四個法要產生信心，才能夠建立大乘的功德，我們先簡單的說明一下。

一、信根本─樂念真如法故。

這個根本就是我們整個修學大乘佛法功德的根本。什麼叫做根本呢？就是你內心中好樂去憶念這個清淨的真如。

我們平常的心情，假設你不研究大乘佛法，你也會修學善法。一貫道、基督教徒他們也修習善法，但是這樣的一個修學善法，從佛法角度來說，因為沒有依止根本，也就是他修學善法時，內心所依止的是自我意識──我修學善法，你不能修學善法這種我相的執取，就使令他所修的善法不能產生一個乘，不能達到彼岸的解脫功德。這個善法在他的生命中，能夠產生一時安樂的果報，就是在他的阿賴耶識中多了一點善業，在生命中給他一些快樂的美夢，如此而已。至於他內心中的顛倒完全不能消滅，因為他內心中沒有依止根本，所以這個根本是非常重要。

就是你所有的布施、持戒、忍辱、精進、禪定，你依止的是虛妄的妄想，所有的善法都變成妄想。你內心中依止一個我空、法空的真如，這個善法就變成一個清淨的波羅蜜，所以這個根本非常重要。你內心中經常能夠迴光返照何期自性本自清淨，把心中我相的執取消滅以後，就安住在清淨的空性，依止這樣的心性來自利、利他，這個就是所謂的信根本，這個信就是好樂隨順，這是大乘功德的一個內因力。當然有內因力，就應該有外緣力，佛、法、僧三寶就是外緣力。

二、信佛─信佛具無邊功德，常樂禮敬供養；聞法修行，迴向一切智故。

我們除了相信這一念心是清淨的，是具足無量的德能值得我們去開發；我們外在的因緣中，也要相信佛。這裡的佛指的是三十二相、八十種好的佛，主要是講應化身。佛陀有無量無邊的神通三昧，他有救拔我們的能力，所以我們應該要禮拜、恭敬、供養、歸依，乃至聽聞佛陀的開導，如法的修學，成就一切種智。

這裡的佛，在《華嚴經》上說：佛陀有說法之恩。佛陀救拔眾生有兩個方法：第一個是顯神通，顯神通能夠使令我們生起信心；但真正的救拔是說法，說法使令我們明白道理，明白宇宙人生什麼是功德相、什麼是過失相，怎麼樣做會產生痛苦、怎麼樣做會產生安樂。你應該對整個生命的相貌，產生正確而不顛倒的理解。這些法是誰告訴我們的呢？是佛陀告訴我們的。所以我們對佛陀要有歸依的心情，因為他演說真理。

三、信法─信法有大利益，常樂修行諸波羅蜜故。

再看信法，在修大乘佛法中的第三個歸依是歸依法。這個法廣泛地說有六波羅蜜的法門──布施、持戒、忍辱、精進、禪定、智慧，不過這裡的法主要是講般若。《華嚴經》上說：佛有說法之恩，法有開慧之恩。有消滅愚癡、開啟智慧之恩。

在蕅益大師的《靈峰宗論》中講到一個公案：

在明末時有一個老居士，年輕時就學佛了。學佛以後，除了自己用功以外，他非常的護持三寶，經常在三寶的境界裡面修習福業，護持三寶五十年，後來在一次生病中往生了。往生以後，因為他是一個積善之人，所以閻羅王對他非常的尊重，就問這個老居士說：仁者啊，你來生想要投胎做什麼？想到哪一個地方去呢？這老居士說：我來生想要做一個出家人。閻羅王聽了以後非常驚訝的說：仁者，你修何聖業啊，望此高位？你是修什麼福德，怎麼內心中望此高位，能夠做這種奢望啊？就把他的功過簿子拿出來看，說：你修福五十年，這是一個很大的福報，但是你頂多能夠做千戶之長；你要做出家人，這個福報是不夠的。他說：那這樣好了，我不要說是做一個能夠去禪堂參禪聽經的出家人，我做一個燒火僧，做一個卑下的出家眾，整天為大眾師燒柴火，可以吧！閻羅王再算一算，說：沒辦法，抱歉！這個老居士堅持來生一定要做出家人，閻羅王被他的誠心感動，就說：那這樣好了，再給你陽壽幾年，你再繼續修學，看看是不是能夠完成你成就出家人的福德。後來他就從死亡中醒過來。所以說是寧國有一老者，修福五十餘年，求來世作燒火僧而不可得。

還另外一個公案，蕅益大師說：白鴿聞經，轉身為戒環禪師。他說：有一個法師在講經時，有一隻白鴿經常來聽法，講經因緣結束時，這白鴿死掉以後，就轉身做戒環禪師。所以蕅益大師說：聞法功德超勝如此！也就是說修福五十年，竟然比不上一個聞法的功德。

這個我們作一個說明。我們剛開始講經時也說過，佛法的修學有兩個重點：一個是善業力，一個是正念力。你不聽聞佛法，你只是布施、持戒、忍辱修學善業；這樣的善業，在你的生命中所代表的意義，就只是在你阿賴耶識中多一些善業，如此而已。你內心中無量無邊的煩惱障、業障，那些顛倒雜染的功能，完全沒有任何改變，就只是在雜染的因緣中多一個善法而已。

但是我們聽經聞法不同，你聽聞佛法以後，內心中產生一個光明的智慧，你心中的顛倒產生一種扭轉的力量，這時你生命是一個大方向的、決定性的扭轉。你以前認為你很喜歡做的事，你現在不想做了；你以前覺得不值得做的事，現在覺得值得你去追求。你這個思想的改變，你這生命的水流，是產生一個方向性的改變──聞法有這種力量。不聽聞佛法，你生命的水流，以前是什麼樣的思想，你照樣是這種思想，頂多是積集一個善業。

所以這裡說：法有大利益，它有扭轉錯誤思想的力量，也就是它有扭轉你生命水流的力量，所以我們對法應該產生好樂、隨順、歸依。

四、信僧─謂常樂供養諸菩薩眾，正修自利利他故。

第四個信僧，佛有說法之恩，法有開慧之恩，僧有住持之恩。佛、法二寶，賴僧弘傳。佛寶的功德、法寶的功德，在佛滅度以後，靠如法和合的僧團來住持。所以我們能夠依眾靠眾，親近善知識，一定要依止僧寶才能夠產生佛寶、法寶的功德。因為法寶的住世是靠僧眾的住世，這是歸依僧。

就是說這個大乘的功德：有內在的歸依，歸依我們的清淨心；有外在的歸依，歸依我們的住持三寶，佛法僧三寶。這裡順便一提，後面的論文也會提到，有人問馬鳴菩薩說：既然我們這念心本自清淨，那我們不斷的憶念我們的清淨心就好了，為什麼還要去歸依三寶呢？馬鳴菩薩說：譬如明珠，然有污垢，須假方便，方得清淨。就是我們這一念心是本自清淨，但從因緣法上說，我們過去有很多雜染的造作，使令這個明珠產生染污，所以要假藉佛法僧的方便，一方面禮拜諸佛、聽聞佛法，一方面依眾靠眾，種種的方便，才能夠消滅這些污垢。

所以一定要有內因力跟外緣力的和合，才能夠真實的生起大乘的功德。這個就是所謂的信。能信的心，是一種隨順好樂；所信的是根本、佛、法、僧，有四個法是所信。

/SECTION/第三段、釋論

釋論─問辯征析，剖斷開示，令得決定謂之論。

所謂的論：是以問答的方式來作詳細的分析，讓我們對義理產生信解；第二點就是剖斷開示，由不同的角度來開示，使令我們破除疑惑，它有斷疑生信的功能，產生堅定的信解，叫做論。佛陀是說經；菩薩把佛陀的經文加以發揮，安立宗旨，使令這個宗旨能夠產生斷疑生信的功能，這叫做論：就是佛陀說經，菩薩造論。

蕅益大師在解釋經題時，講到這個信心，他在《大乘起信論裂網疏》上說：大乘的功德若詳細論之，有信、解、行、證四種功德。大乘的信解行證，每一個法都非常重要，馬鳴菩薩在大乘法的修學為什麼強調信心呢？大乘起信為什麼不說大乘解行呢？蕅益大師說：因為所有的功德都必需有根源──但得本，不愁末。就是說你能夠對大乘佛法生起信心，你自然能夠產生正確的理解，也就能夠正確的修行而成就大乘的功德。

所有大乘的功德是從信心生起，就像你種樹，你為什麼有蘋果吃呢？因為有蘋果樹。為什麼有蘋果樹呢？因為它有根，因為這棵蘋果樹有根，這個樹根能夠照顧它、堅固它，一定會產生枝葉花果。所以探本求源，你只要有信心，你後面的問題就不難解決。所以在本論中，以這個信先作一些紮根的工作，把大乘的功德先做紮根的工作。

/KEPAN/甲二、合釋

合釋是把這個經題，作一個綜合性的解釋。綜合解釋有兩段：第一個是理論上先明心，明白我們內心的差別相；第二個是淨心，產生一個正式的修行，從雜染的心轉變成清淨的心。

/SECTION1/一、明心

${diagramSvg('明心')}

蕅益大師在明心中，把有情眾生分成五種種性，這個種性是約生滅門安立的。就是說以真如門來說，每一個人剛開始的生命原點，起跑點是平等的，都是何期自性本自清淨；但是在這個三界流轉中，因為有情眾生所造的業不同，就產生了不同的種性差別。

/SECTION/（一）三塗種性

/VERSE9/若信邪倒知見，起惑造業，則成三塗苦果。

這種人叫做三塗種性。這種人他對什麼有信心呢？他信邪倒知見，顛倒的知見。什麼叫顛倒的知見？就是他認為生命有快樂的果報，富貴、長壽這些都是讓我們快樂的；生命也有一些痛苦的果報，貧窮、多病，他認為這些果報完全沒有任何因緣。你為什麼會這麼健康、莊嚴？因為你運氣比較好；你為什麼那麼丑陋、痛苦？因為你運氣比較差。所以生命只是一個偶然，就像樹的葉子，這個風一吹飄下來，有的樹葉往東邊飄，有的樹葉往西邊飄，這是沒有任何理由的，生命只是一個偶然。換句話說，你造善業也不能招感安樂的果報，造罪業也不能招感痛苦的果報。一個人死亡以後，人死如燈滅，生命沒有所謂的來生；沒有來生，你斷惡修善是完全沒有任何的意義。這樣的思考就會使令一個人及時行樂，既然生命只有一次，你就去追求你的快樂吧！不必考慮所謂的斷惡修善。這種錯誤的知見，很容易帶動錯誤的行為，這種人叫做三塗種性。

他的心識呢，蕅益大師說是產生增上的恶心，他偶爾也會生起善心，但是他的恶心強烈，私慾比較重，什麼事情都先保護自己，他內心中不觀照真理，先把自己的慾望放在第一順位。這裡就是說，他對這個邪見產生信心，這種人起惑造業對他來說是非常的容易，這種所謂的三塗種性，他在流轉中，他的生滅門大部分都是在三惡道，他不是做畜生、就是做餓鬼、就是在地獄；偶爾得到人天，沒有多久又到三惡道去了，絕大多數的時間都是在三惡道。

為什麼是這樣？這不是上帝的意思啊！因為你的思想有問題，因為你內心中對邪見生起了信心，這是一個非常值得我們憐憫的一個眾生啊，所謂三塗種性。

/SECTION/（二）人天種性

/VERSE9/若於世間因果起信，則成人天、色、無色界樂果。

這是所謂的人天種性，他對世間的因果生起信心，他相信世間的快樂跟痛苦是有因緣生起。什麼因緣呢？就是你造善業、你布施、持戒，一定可以招感安樂的果報；你造殺盜淫妄，一定會招感痛苦的果報。這樣他就對善法生起信心，對惡法產生排斥，這種人他的果報體在三界中，大部分的時間是在人天，乃至於色、無色界，產生安樂的果報。因為他對世間的因果有信心，他為了追求來生的安樂，他會產生一個克制力──克己復禮。我內心中有慾望要去造罪，但是不可以，因為這個罪業會產生來生極大的痛苦，譬如刀上的蜂蜜，不足一餐之美，而有割舌之患。你吃這個刀上的蜂蜜，雖有短暫的快樂，但是這個舌頭會被刀割傷了。

所以我們為了追求來生的安樂，就必須要克制一下自己的慾望。他為什麼願意產生剋制？因為他對世間的因果生起信心。這種人叫做人天種性。

/SECTION/（三）二乘種性

/VERSE9/若於四諦、十二因緣起信，則成二乘出世法門。

這個叫做二乘種性。二乘種性，他在無量生滅門的個體生命中，所聞思的法基本上都是四諦跟十二因緣。四諦、十二因緣，簡單的說就是發明諸行無常、諸法無我的我空道理。在四諦、十二因緣中，說明我們有情眾生的生命，所謂五蘊的個體，有外表的色、有內在受想行識的內心活動，這些都是無常，它不斷的生滅變化，在這個生滅變化中，我們作不了主的。我不希望變老、我不希望變丑，但是不能作主，你還是會老、會丑。那是誰作主呢？是業力作主。萬般皆是業，半點不由人。所以我們今天產生這個個體生命，我們是作不了主的，所謂的無我，沒有主宰性。二乘人對我空生起堅定的信解，這種信解就會帶動出一個出離心，就會產生一個二乘的果報。

在《法華經》上講到迦葉尊者，迦葉尊者是一個大阿羅漢，他有一次在法華會上其中的《信解品》上，他就很坦白的跟釋迦牟尼佛說：我是一個阿羅漢，我的心情，有時候到外面去托缽，看到形形眾生的雜染境界；有時候來到佛陀說法的地方，看到佛陀、菩薩的功德，能夠演說妙法。我內心中對眾生的雜染法跟佛菩薩的功德，我怎麼觀察？我觀察這些法都是無生無滅，無大無小，不生喜樂，我好樂安住在寂靜的空性中去自受用。

什麼叫做二乘種性呢？就是說他內心中歡喜空性，你說看看諸佛菩薩的功德莊嚴、極樂世界成就如是功德莊嚴，他不生好樂──他對雜染法不生好樂，對清淨的法也不生好樂，他只歡喜觀察一切法是空、無相、無作，這種人就是所謂的二乘種性，對空性特別的好樂。這種人如果在他入涅槃之前沒有改變的話，他一定要先證得小乘果，然後再回小向大，這就是所謂的二乘種性。

/SECTION/（四）菩薩種性

/VERSE9/若於六度、四攝起信─則成菩薩自利利他法門。

六度跟四攝，都是菩薩的功德。前面二乘種性的眾生，他的心情是對空性生信心；這裡是對菩薩的功德生起信心，他對菩薩的功德生起信心，他就能夠一方面自利，一方面利他，這就是所謂的菩薩種性。

/SECTION/（五）圓頓種性

在本論中所要強調、所要建立的種性是最後一個──圓頓種性：

/VERSE9/若於介爾心性，不可思議，絕待大乘起信─則成無上圓頓法門。

我們在因地是一個生死凡夫，有時候靜坐迴光返照，就會觀察到我們內心中有很多的慾望，雖然我們靠持戒的力量把它暫時壓住，但是我們還是發覺到內心有很多的慾望、煩惱跟業力。有時候我們會很沮喪，雖然修行那麼久，煩惱業力依然存在。但是我們聽聞大乘佛法以後，會給自己一個信心：雖然有煩惱跟業力，但是我們的本性是清淨的──何期自性本自清淨。這個煩惱、業力只是一個因緣所生法，是一個如夢如幻的因緣所生法，它並沒有真實染污我們的自性清淨心。你能夠在因地修行時產生這樣的信解，這時你就是圓頓種性。

在本論後面會不斷的教育，就是希望大家能夠從前面的種性轉成所謂的圓頓種性。這裡蕅益大師所要強調的觀念：生命的差別不在業力，你造善業只是產生暫時的安樂，不一定能夠產生決定的安樂。要產生一個決定性的安樂，要能夠建立一個清淨良好的種性，而這個種性就是你的知見。你對生命有不同的看法，就會產生不同的追求、好樂，而產生不同的行動。

我們可以這樣講，在整個流轉的生命中，生命就像是一個無止盡的水流，從過去流到現在，從現在流到未來。這個水流的方向，有時候流到三惡道，有時候流到人天，有時候流到二乘的涅槃，有時候流到諸佛的萬德莊嚴，而這個關鍵點就是你自己的抉擇。你願意相信什麼法門，它就會帶動你整個生命的方向。

我們由於過去的抉擇，創造了你現在的相貌，你現在所謂的色、受、想、行、識，是你過去的抉擇。你認為這樣做比較好，你就去做，所以招感你的果報。你過去的抉擇，就創造你現在生命的相貌；你現在的抉擇，又會影響到你來生的相貌，就是這麼一回事。

就是你願意相信什麼事情，這件事情就會對你產生力量。

比如我們從現實人生也可以知道菩薩種性，菩薩種性有兩種：有些人喜歡修福德，有些人喜歡修智慧。你看有些人福報很大，但是你跟他講佛法的真理，他完全不懂。他為什麼福報這麼大卻沒有智慧呢？這也是他的抉擇。他以前認為福報是他最重要的法，對福報生信心。有些人今生智慧很高，但是福報很薄，這也是他過去的抉擇，他以前就把大部分的時間用來聽聞佛法。

所以你對什麼法生起信心，你就會產生不同的相貌。

當然過去已經過去，我們現在的重點就是──我們未來的生命應該怎麼走？這是我們應該注意的。既然有來生，我們就必須對來生作好生命的規劃。當然你應該在因地中，確定你對哪一個法生起信心，而它就會引導你不同的方向。這裡就是說，先明白你內心是什麼種性，哪些是應該調整的，我們應該先了解自己。`;
