QXL.volNum = 4;
QXL.text = `
請大家打開《講義》第七頁。

解釋標題有別釋跟合釋，在合釋中又分兩科。第一個明心，先明白我們內在的種性，這個種性就會產生不同的業力、不同的果報。在明白這個道理以後，我們應該怎麼去扭轉這個種性呢？就講到修學的方法，這是淨化內心的一個次第。

/SECTION1/二、淨心

${diagramSvg('淨心')}

蕅益大師把凡夫的種性到成佛的次第分成六位，所謂的六即佛。以這個信心來安立六個次第，我們先看第一個：

/SECTION/（一）理即起信<plain>─雖復不信自心大乘妙理，起惑造業，而信心之性，未曾稍減，如水成冰，濕性不改。</plain>

這個理即起信是講我們一般凡夫的相貌。我們凡夫的內心，他不相信自心具足大乘的功德，不相信我們的內心中有所謂的體相用三大，他的內心活在自我意識中。他是一個女人，就以女人的思想為自我；他轉成男人，就以男人為自我；他變成一隻螞蟻，就以螞蟻為自我：內心中就是心隨妄轉，在整個個體的生命中，內心就是跟著感覺走。

跟著感覺走，不跟著真理而走，他會有什麼問題？起惑造業，內心中就很容易生起煩惱，這個煩惱增長廣大，控制不了就造作罪業。凡夫在整個個體生命中，歷史不斷的重演──起惑、造業、得果報，得果報以後又起惑、造業。在這樣的一個生滅門中，唯一值得我們安慰的地方就是信心之性，未曾稍減，我們雖然不肯定我們內心是本自清淨，但是這個清淨的本性，並不因為我們不肯定而減少。

講一個譬喻：如水成冰，濕性不改。水因為寒冷的因緣而結成冰，所以水一些柔軟的功能、洗滌的功能都消失了。但是值得我們安慰的是，這個冰它的濕性沒有改變，只要遇到了太陽溫度的因緣，它隨時可以變成水──凡夫隨時有改變的因緣，所以一切眾生都可以成佛，當然是因為他的佛性沒有改變。不管你起再大的煩惱，不管你曾經造作多大的罪業，我們清淨的本性永遠沒有被染污。就像你用黑色墨汁潑灑虛空，虛空還是清淨本然，這就是理即起信。凡夫的顛倒並沒有改變我們的本性，只是改變我們的因緣。第一段是沒有所謂的修行，真正的修行是從第二個開始。

/SECTION/（二）名字起信<plain>─若聞此論，能知現前介爾心性即是大乘，直下承當，不復疑惑，如知冰即水。</plain>

修行的第一個就是靠語言文字的佛法產生觀照，所以叫做名字，依止聖言量的這些名字。名字在娑婆世界主要是靠聽聞，聽聞大乘的正論以後，我們能夠依教觀心，開始迴光返照。我這一念心，有時候起善念，當我去佛堂看到佛像，對佛像生起信心、生起慚愧心、生起無貪無瞋的心；但是當遇到染污的境緣，內心也會起一些貪慾、瞋恚的慾望。所以如果經常觀照我們的心，會發覺我們的心是不斷的變化，有時候起善、有時候起惡。

我們學過本論以後就會知道：所謂的善、所謂的惡都不是我們的本來面目，它只是一個因緣所生法，就是過去業力所熏習的一種虛妄的功能。當我們觀照因緣所生法，我說即是空，把這些善惡如夢如幻的功能撥開來，就看到內心深處那個不生不滅、不垢不淨、不增不減的本來面目，一個清淨的本性現前，你對這個本性能夠直下承當，不復疑惑，你當下就能夠直下承當，你相信這個就是你本來面目，所謂的煩惱是後來才有的，是你造業才有的，你沒有造業之前，我們的本性是清淨的。你就知道這個冰不是你本來的面目，你本來面目應該是個水，因為寒冷才變成冰。既然它是因緣生，那就表示它可以改變，也能夠假藉因緣而滅。

這意思是說，假設我們的本性是邪惡，那就不須要修行了，因為你修行沒有用，它本性是邪惡，你頂多祗能把它壓抑住，減少它的邪惡功能，因為你的本性是邪惡，你怎麼能夠改變呢？本性是清淨，這個邪惡的功能是因緣所生法，它緣生也就能夠假藉因緣而消失，這是一個根本佛法的理論。

趙州禪師在所有的禪師大德中是非常精進的──趙州八十猶行腳，只為心頭未悄然。趙州禪師出家以後，到處參訪善知識，一直到八十歲都還不能夠安定下來，趙州八十猶行腳。當然他不是攀緣，他是對內心什麼是清淨本性？我的本性是善、是惡，還是清淨呢？這件事情還不能決定，所以只為心頭未悄然。後來有一天，大概是在夏末秋初時，他在寮房打坐，他寮房前面是一片竹林，有人丟石頭，剛好打到竹子產生啪的聲響，他聽到這個聲響，突然間截斷妄流，所有因緣所生法的妄想突然間消滅掉。他就講一個偈頌：踏破鐵鞋無覓處，得來全不費工夫。我花了幾十年，踏破鐵鞋去參訪善知識，都不能很確定的明白我內心的相貌是什麼，現在突然間覺悟以後，原來得來全不費工夫，就在你這個當下，莫向外求。這裡，所謂的名字起信，是整個修學的一個基礎，所謂的直下承當，不復疑惑。

如果我們今天以比較高的標準來要求所謂的修行，禪宗說：不破本參不住山。意思是說，你這個人還活在妄想中，你內心還是跟著感覺走，你沒有資格閉關。你能夠拜佛、持戒，也能夠誦經、持咒，每天做多少定課，這樣在生命中不能講修行；你在懺悔業障、積集資糧，只是在積集你的善業，不能說修行。修行要能夠返妄歸真，對你心中的顛倒要有消滅的功能。

就是說什麼人有資格閉關呢？蕅益大師講一句話說：要能夠達妄本空，知真本有。就是說你在修行的過程中，你起很多的妄想，你念佛時打妄想，拜佛時也打妄想；但是你知道這個妄想是不真實的，它不能夠影響你，只要你不隨順它，它會自動消滅掉，它不是你的本性，因為你的本性是清淨的。你依止你的清淨心來念佛，依止你清淨的本性來持戒、持咒，就是達妄本空，知真本有，這個真實本性是你本來具足的，不必向外追求，你這個人就有資格修行了，遇到任何的煩惱罪業，你都有辦法處理。

在名字起信中，這是一個非常重要的關鍵。在禪宗說明心見性，在教下說大開圓解，這時整個返妄歸真的修行，從現在開始正式的起動，你以前只是在積集資糧，就是你能夠真正的、很明確的知道達妄本空，知真本有，對這個真理沒有任何的疑惑，這時你整個大乘功德從現在開始正式起動。

/SECTION/（三）觀行起信<plain>─若能念念觀此心性，知其念即無念，不起無明諸顛倒惑。</plain>

前面只是一個理論的信解，以下就正式的調伏改變。你在修行中，你能夠念念之間有一個觀照力，這個觀照不是向外，是向內觀照你這一念心性，能夠如實的了知：它雖然起念，但是它的本性是空的，它的本性是無念。我們解釋一下。

我們修空觀的人不起斷滅見，我們知道從因緣上我們有如夢如幻的念頭，就是有這個業力所熏習的等流性。有些人的煩惱是貪慾比較重，他這個人沒什麼脾氣，你刺激他，他也不起瞋心的，但是慾望重。有些人，特別是個性清高的人，他慾望淡薄，但是瞋心重，你稍微刺激，他就發脾氣。所以每一眾生的心念無量劫來業力的熏習不同，所以念頭也各式各樣。

雖然各式各樣，但是沒關係，你內心在觀察這個念頭時，你就告訴自己：這個念頭不是你的本來面目，它只是一個因緣所生法，既然是因緣所生法，我不必隨你而轉，你不是我的本來面目。他雖然起念（我們也同意在因緣上有它的假名、假相、假用），但是在本性上是空寂的，空寂的意思就是：它可以改變，因為它可以改變，所以才叫做空。

你的觀照有這樣的正知以後，就會產生一個實際的行動力，假藉布施、持戒、忍辱、精進、禪定種種的方便法門，來調伏你的惡念、增長你的善念，這就是觀行起信，這佛法說是乘性起修。

西方的文化，有一個地方是值得突破的。西方的文化主要是基督教文化，基督教文強調博愛，神愛世人，所以世人也應該去愛其他人。但是基督教整個西方的文化有一個地方不能突破，就使令它滅惡生善的功能大打折扣。在西方的文化中，它相信人的本性是邪惡的，就是這個自我意識是正常的。一個人在遇到傷害時，他有權力保護自己去傷害別人，因為人的本性是自私的，這個私慾是不能改變的；不能改變，所以只能加以克制，因為自私是人的本性。所以在西方的法律中，為了自衛保護自己去殺人是不犯罪的，因為你的本性如此，本性是不能挑戰的。這樣的思考，就使令西方人很難突破這些障礙，你相信你的本性是邪惡的，你怎麼改變自己呢？你頂多把邪惡的功能加以克制，透過禱告、行善克制，但是邪惡的本性還是存在的。這個思考是非常嚴重的錯誤，你應該相信我們的本性是清淨善良。清淨善良怎麼會有邪惡呢？那是因緣所生法，那是後來的業力熏習才有的。這個房間的主人是清淨的，邪惡是客人，客人是隨時要走的。

這裡很重要，就是觀察我們所有煩惱的惡念，它的本性都是空寂的，這裡很重要。有這樣的觀照，你有信心才能夠產生一些布施、持戒、禪定的方便來調伏它，這時就是觀行起信，你正式開始去修正你的惡念。

/SECTION/（四）相似起信<plain>─若任運消除粗染，淨於六根。</plain>

透過我們的觀照力、調伏力，一次一次不斷的去調伏它。我們說既然因緣所生法，因緣所生法它就是會變化。你隨順它，它就增長；你調伏它，它就減少，乃至於消滅。等到有一天你的禪定現前，一念的相應就把粗顯的三界煩惱消滅了，六根清淨就到了相似位。

/SECTION/（五）分證起信<plain>─若入正位，從淨心地乃至菩薩究竟地。</plain>

這個分證就是分破無明、分證法身，從初地到等覺菩薩，叫做分證。

/SECTION/（六）究竟起信<plain>─若超過菩薩地，微細分別，究竟永盡，心性根本，常住現前。</plain>

我們經過三大阿僧祇劫的內心觀照，及外在種種斷惡修善的方便，把這個俱生的、微細的我法二執消滅，內心中的根本功德，所謂的體大、相大、用大的功德顯現出來，所謂的萬里晴空，一輪明月，這時就成佛了。所以這裡一佛乘，就是他剛開始所相信的跟他最後所成就的，是完全一樣，只是淺深的不同，所以叫一佛乘，這裡是講依止我們清淨本性來修行的重要性。

天台宗講到止觀有兩種差別：第一個叫做次第止觀，第二個叫做圓頓止觀。

/SECTION/第一個、次第止觀

次第止觀是對治，就是在我們個體生命中，我們修四念處──不淨、苦、無常、無我，用這個不淨、苦、無常、無我來對治常、樂、我、淨四種顛倒，這叫做對治止觀。它是一個非常強烈的對治，以善對治惡，所以善惡不兩立。

天台智者大師說：如果你的修行只停留在對治止觀，壓力會很大，修行久了，你的內心會沉悶，有時候會退心。因為你會覺得煩惱實在太多，對治一個又出現一個；所以這個對治止觀雖然用藥很猛烈，但是如果沒有善巧的調和，你內心會產生偏激的思想，因為太對立了。

/SECTION/第二個、圓頓止觀

所以智者大師說：對治止觀最後要提升到圓頓止觀，就是正念真如。就是在對治慾望時，你要思惟：雖念，但本性是無念，你的本性是清淨的，煩惱只是虛妄，用虛妄的法門來消滅虛妄的煩惱，就是站在一個清淨本性的基礎之下來修行。

在座的諸位，很多人都受過菩薩戒。菩薩戒能夠得到戒體，主要是在菩提心。菩提心就是你對生命許下三種誓願，過去的種種譬如昨日死，過去的顛倒我們今天不要再說了，從現在開始我的生命要做三件事情：第一個誓斷一切惡，第二個誓修一切善，第三個誓度一切眾生，我們把這個心態作一個說明。

誓斷一切惡，我們內心的惡，那煩惱是非常強烈的。我們憑什麼能夠誓斷一切惡，憑什麼煩惱無盡誓願斷？不能憑你的行力。你行力有多大呢？就像蕅益大師說：我們在熏習煩惱時，是無量無邊劫的熏習，而修行卻是短暫的。我們過去顛倒的時間很長，覺悟的時間很短，就像小孩子跟大人打架，你怎麼打得過煩惱呢？我們的慾望是生生世世的造業，生生世世累積到今生，無量無邊劫；修行只有幾十年，那你憑什麼說煩惱無盡誓願斷？憑的就是何期自性本自清淨，憑著依止這樣的理解，憑的就是煩惱是虛妄的，所以我們能夠很堅定的在三寶面前宣布：我可以誓斷一切惡，而產生菩薩的戒體。

如果你內心中只是嘴巴講：誓斷一切惡、誓修一切善、誓度一切眾生，你的菩薩戒體是非常的羸弱，因為你面對那麼大的煩惱勢力壓迫，你根本講不出所謂的誓斷一切惡。你能夠產生對大乘佛法的真實信解，達妄本空，知真本有，你能夠沒有任何的疑惑，在三寶面前保證你可以眾生無邊誓願度，煩惱無盡誓願斷，法門無量誓願學，佛道無上誓願成。我可以成佛，因為煩惱是虛妄相，所有的惡法都可以消滅，所有的善法都可以安立，就是你必須從這個關鍵點去學習。這個就是我們說的淨心，就是淨化內心一定要注意你的依止處、你的根源。

以上我們把論主略史跟解釋標題，把馬鳴菩薩的略史跟本經的一些修學宗要作一個大綱的說明。接下來第三科隨文釋義，看《講義》第八頁。以下就正式的解釋馬鳴菩薩的論文。

/KEPAN/叁、隨文釋義（入文分三：一、歸敬述意。二、正說五分。三、結施迴向。今初。)

以下的解釋我作一個說明：

在科判方面我們是根據上會下性老法師的科判。會性法師的科判多分來說還是根據蕅益大師的《大乘起信論裂網疏》，不過老法師的智慧，把有些比較複雜的科判簡化了，我覺得特別的契機，所以我們這次的學習，就根據會性法師的科判。在義理的解釋上，這次本論的解釋，有兩個依據。第一個在消文方面，我們根據唐朝賢首法藏大師的《大乘起信論疏》。在義理上的發揮，有些地方參考蕅益大師的義理，蕅益大師比較不重視消文，但是有些經文他的心得有他的見地，所以在義理的發揮上，有些東西會參考蕅益大師的。

所以本論的學習，我們主要是依止法藏大師、蕅益大師兩位大德，這是我們在解釋論文的一個依據。

/KEPAN/入文分三：一、歸敬述意；二、正說五分；三、結施迴向。我們也可以說分成所謂的序分、正宗分、流通分。剛開始先歸敬述意，再正式說明本論的五科，最後再結施迴向：

/KEPAN/甲一、歸敬述意（分二：乙一、歸依三寶。乙二、述造論意。）

/KEPAN/乙一、歸敬三寶

在解釋論文之前，第一科先歸敬述意，分二：第一歸敬三寶；第二述造論意，敘述造論的因緣。先看歸敬三寶，看論文，大家請合掌：

/gatha/
歸命盡十方　最勝業遍知
色無礙自在　救世大悲者
及彼身體相　法性真如海
無量功德藏　如實修行等
//

我們在學習本論之前，馬鳴菩薩先說歸依三寶文。能歸依的是我們的身、口、意三業，叫歸命，表示我們對三寶沒有任何的保留，盡我們生命中的身業、口業、意業全體的歸依；所歸依的就是三寶的功德。三寶的功德中，它是所謂的盡十方，這個盡十方是簡別，不是小乘的三寶。小乘學者所認為的三寶，是有一定的時空；大乘的三寶是常住十方三寶，是遍滿十法界的常住三寶。

在歸命十方三寶中，我們先說明所歸依的是佛寶：最勝業遍知，色無礙自在，救世大悲者，這是說明佛的身口意三業。

/SECTION/一、皈依佛寶

<c339>第一個</c339>我們所歸依的是<c339>最勝業遍知</c339>，這裡是歸依佛的意業。佛的意業是正遍知，他能夠如實了知真諦跟俗諦的道理：知道一切法的本性是清淨本然，是我空、法空的真理；也知道眾生無始劫業力的熏習，產生很多生滅的個體因緣。所以他能夠觀機逗教，這個叫做記心輪（記是記載的記，心是心地法門的心），是佛陀在三輪中的意業。這個是佛的正遍知，是我們的歸依境。

<c339>第二個色無礙自在</c339>，這是佛的身業，身業是講神通輪。法藏大師講到佛身業的功德，他根據《華嚴經》提出了四種：

第一是大小無礙，佛的功德沒有大小的差別。譬如在淨土法門中，蕅益大師在《彌陀要解》一再強調說：淨土法門的重點，在一心歸命極樂世界阿彌陀佛，因為它是一個他力法門。他力法門就是你一定要跟彌陀的功德感應道交，所以這個歸依是一個重點。這裡有一個問題就是我一心歸命極樂世界阿彌陀佛，那誰代表阿彌陀佛呢？到底阿彌陀佛的歸依處、歸依境在哪裡？蕅益大師說：若廣泛而論，極樂世界正報、依報的莊嚴，都是我們的歸依境。正報莊嚴有佛的莊嚴、菩薩的莊嚴，諸上善人聚會一處，佛菩薩這些清淨莊嚴的僧團都是歸依處。依報的莊嚴有七寶池、八功德水、寶樹、樓閣，這也是我們的歸依處。但是這樣的歸依處太廣泛，心思容易散亂。在整個依正莊嚴中，簡而略之：阿彌陀佛的佛號，南無阿彌陀佛這個聲音，它就總持一切的功德，所以名以召德。

也就是說阿彌陀佛可以表現在廣大的依正莊嚴，也可以把功德濃縮在一句佛號上。就是你這一念心去憶念彌陀聖號，南無阿彌陀佛，這一句佛號在你心中，一句彌陀念、誦、聽，念從心起、聲從口出、音從耳入，聽回去，這時你跟彌陀相應。一心歸命極樂世界阿彌陀佛，誰代表阿彌陀佛？阿彌陀佛的這個聲音，這個就是阿彌陀佛的所有功德。所以佛陀的功德能夠在大中，也可以變成小，大小能夠互相的含攝，所以叫做大小無礙。

第二個是互用無礙，互用等於是自他，就是阿彌陀佛可以現出藥師佛，也可以現出本師釋迦牟尼佛，佛佛之間能夠互相的通用沒有障礙。

第三個是理事無礙，這個理是理體，就是法身的理體跟應化身的作用是沒有障礙的。應化身中有法身，法身中也有應化身，是互相沒有障礙的。

第四個是應機無礙。應機無礙就是普門示現，說是千江有水千江月，同樣一個月亮在不同的水面上，你拿一個臉盆，他也拿一個臉盆，臉盆的大小不同、水質不同，月亮印在臉盆上的影像也就有所差別。說我們現在一百個人同樣看到佛陀，但是每一個人看到的佛陀都不同，都剛好是你喜歡的造型。有些人喜歡看到胖的佛陀，有些人喜歡看到瘦的佛陀；佛陀能夠應你的機，剛好是你最喜歡看的造型，這是應機無礙。

這四種無礙，所謂大小無礙、互用無礙、理事無礙、應機無礙，這個就是我們所歸依的身業，所謂的神通輪。神通主要是給眾生產生歡喜跟信心。

<c339>第三個</c339>歸依境是<c339>救世大悲者</c339>，就是佛的語業，佛的說法輪。在法藏大師的意思：這三業中，真正我們所歸依、最受益的應該是語業，就是說法。

這個說法為什麼講大悲呢？就是一般的凡夫也有慈悲心，譬如說有些人去蓋醫院，做一些慈善事業；但是這樣對眾生只是暫時的救拔。只有佛陀的演說真理，使令眾生解脫，才能夠產生一個究竟的真實救拔，所以叫做大悲。

這個法義：你今天吃完一碗飯，這個飯消化以後，飯的功能在你生命中消失了；但是你聽聞到一句佛法，這個佛法在你的內心中，那個光明的種子，生生世世跟著你，等待因緣去啟發它。這個金剛種子永遠跟著你流轉、陪著你流轉，直到你成佛為止。所以佛陀的說法，是給眾生一個比較長遠的利益，所以叫大悲。當然佛陀說法也必須要靠身體的支持，也必須要有內心的觀照根機，所以我們應該身口意都要歸依，這個就是我們歸依佛陀。

/SECTION/二、皈依法寶

第二個歸依法寶，及彼身體相，法性真如海，無量功德藏。這個是對我們的法，這個法主要是大乘的法寶。大乘的法寶，法藏大師分成：教法、理法、行法來作次第的歸依。

<c339>第一個教法——及彼身體相</c339>，這個教法當然有一個身體相，就是語言文字的佛法，是佛陀在世時到處的演說，由弟子們記載下來的語言文字的佛法，譬如說《金剛經》《楞嚴經》《法華經》《涅槃經》等等，都是法寶的身體相──教法。

<c339>第二個理法——法性真如海</c339>，語言文字它是詮釋一個真理，譬如因緣所生法，我說即是空，這十個字裡面有一個道理，這個道理必須要含攝在文字中，所以文以載道。這意思就是說，佛陀內心中明白一個道理，這個道理是離言說相；但是佛陀內心的道理要傳遞給我們有困難，佛陀就假藉文字，就講出一句因緣所生法，我說即是空，佛陀把道理放在這裡面。那有文字，就可以轉成我們可以消化的訊息，我們把這句話在心中不斷的聞思，聞思的般若就轉成我們內心的觀照，最後我們明白了這個道理，所以這叫做理法。由教法的聞思產生一個真理，這就是法性真如海。

<c339>第三個行法——無量功德藏</c339>。我們內心明白道理以後，就消滅心中的顛倒，從今以後不再跟著感覺走，我們內心從今以後用道理來引導我們的生命，產生一種滅惡生善的功能，這時生起種種的功德、種種的波羅蜜，這就是所謂的行法，無量功德藏，能夠成就五乘的功德。就是我們由最初教法的學習產生真理，依止真理起修，最後產生滅惡生善的功德。這個都是法寶，都是我們應該歸依的境界。

/SECTION/三、皈依僧寶

第三個歸依僧寶，如實修行等。僧寶當然就是如法修學。法藏大師說：這個僧寶有兩種。假設是一個凡位的菩薩，所謂的資糧、加行，所謂的十住、十行、十迴向的菩薩，這些菩薩叫做如法熏習。就是他內心中的自我意識並沒有消滅，但是他相信這個自我意識是因緣所生法，不是本來面目。所以他用清淨的大乘法，不斷的消化，如法的熏習，他已經在對治中，叫做如法熏習。那一定要到初地以上，他叫如實修行，他的本性已經開發出來。所以這個如實修行者，看這個意思，在這個大乘三寶中所歸依的僧寶是聖僧──大地菩薩，這些文殊菩薩、普賢菩薩觀音菩薩、地藏王菩薩才有資格叫做如實修行等，我們現在叫做如法熏習。

這裡是說明，我們在學習本論之前，要先作一個三寶的歸依。為什麼歸依？蕅益大師在這段論文中，提出四點的解釋，所謂歸敬三寶略有四義：

<c339>第一、隨順古代聖賢儀軌故。</c339>古代的整個教法中都要先歸依。從歸依中我們可以知道法的傳承，特別是在僧寶中。譬如說：你歸依的是文殊菩薩，那我們知道這個是屬於大乘的信眾。如果你在歸依文中強調彌勒菩薩，這就是唯識相宗的傳承。所以從歸依文中，我們可以看出傳承的差別。

<c339>第二、為令眾生增長福德善根故。</c339>三寶是功德法具，我們在讀論文之前先歸依，能夠增長福德、滅除罪障，為學習論文作一個前方便，淨罪集資。

<c339>第三、不同外道議論無宗本故。</c339>外道的言論是沒有任何的傳承，沒有根本，外道就是自己在山中打坐，眼睛一閉他打很多妄想，依著妄想安立宗旨，完全沒有宗本。

<c339>第四、顯示感應道交難思議故。</c339>就是祈求三寶的加被，有這個意思。

/KEPAN/乙二、述造論意

我們再看乙二、述造論意。前面是歸敬三寶，這裡是說明造論的意義。為欲令眾生，除疑捨邪執，起大乘正信，佛種不斷故。造作本論有兩個意思：第一個從因地上是除疑捨邪執，起大乘正信，剛好是本論的三大宗旨。

<c339>一、除疑</c339>：就是顯示正義，能夠生起善根，生起信戒定慧善根，顯示正義。

<c339>二、捨邪執</c339>：就是對治邪執，偏重滅惡。我們雖然學習了正見，但是有些人會在正見中產生一些錯誤的認知，所以也應該要對治邪執、滅惡。除疑捨邪執，是屬於義理的說明。

<c339>三、起大乘正信</c339>：是講到修學五門──布施、持戒、忍辱、精進跟止觀。從明白道理到如法的修學，產生一個佛種，成就大乘種性，使令我們在生命中，建立一個堅固而不退轉的大乘種性，這個不斷就是不退轉。

這個佛種不斷故，是講果地的功德；除疑捨邪執，起大乘正信是因地的修學，所以本論的目的就是成就大乘的因果。

我們今天先講到這裡，剩下的下一堂課再說明。

【學員提問】體、相、用三大的文字義理可以理解，但理上無法深刻的深入體會，能否請法師舉例說明。

【師父答疑】這個體、相、用三大，它所說的不是外在的法，這個杯子有體相用，這個桌子也有體相用。這裡的體相用，是指我們這一念心，就是我們凡夫的心，因為我們的執取，就產生自我意識。這個自我意識開展出來，有各式各樣的自我意識，有受想行識，感覺、思想、造作、了別等等。你執取以後就不大，就失去我們的本來面目。所以我們體、相、用三大，就是體大、相大、用大，它都有基本的定義，主要是把錯誤的思想加以調整。不過剛開始先了解體大，了解體大以後，後面的相大、用大就容易了解。就是你經常修我空觀、法空觀，把這個自我意識稍微消滅一點，不要老是活在自己的感覺中。這裡，就是你平常要多多的去觀照。

【學員提問】何謂絕待無外？

【師父答疑】這個絕待是說它不是對立，無外是說它的普遍性，沒有內外的差別，當然絕待無外主要是指我們本來面目，我們的真如門。我們凡夫的心要是沒有經過大乘佛法的訓練，他一定會有對立，乃至於小乘的學者也有對立。小乘的學者有染淨的對立，雖然好樂修學清淨法，但是產生法執，就是清淨法跟雜染法是對立存在，生死跟涅槃也是對立的──你要嘛選擇生死，要嘛選擇涅槃，這兩個只能夠選擇一個，沒有所謂的中道，沒有所謂的不住生死、不住涅槃的思考，沒有這種思考。

大乘佛法是沒有對立的，沒有淨染的對立、也沒有自他的對立等等。這個絕待無外，我們可以這樣想：絕待圓融不可思議，我過去讀蕅益大師的《彌陀要解》，他提到一個觀念：念佛法門是本尊相應法。本尊相應法所強調的是歸依，在歸依的過程中有兩個差別：

一個是對立性的歸依，我歸依阿彌陀佛，我是能歸依，阿彌陀佛是所歸依。我們在生命中產生一個自我，這個自我是有真實體性，說我是業障深重，這個業障深重是真實的；阿彌陀佛是萬德莊嚴，這也是真實的：但沒關係，我業障深重，但是我對你歸依──通身靠倒，你來救拔我。以這樣的思考來歸依，蕅益大師說：也可以往生，但是品位不高，而且中間會有很多障礙，你會覺得一個是自我，一個是佛陀。你這樣念佛念久了，你會：唉呀！佛陀跟我有一段很大的距離，在十萬億佛土之外，他那麼的清淨，我那麼的雜染！這個就是靠信心，就是一種對立性的思考。蕅益大師把這樣的思考叫做事持。

蕅益大師所讚歎的是理持，就是你不要有人我的對立，所謂的此之法門，全在了他即自，你能夠了解自他不二。我是業障凡夫，但是我的業障是如夢如幻，我把這個如夢如幻的業障撥開來，我的心是如；阿彌陀佛是萬德莊嚴，萬德莊嚴也是因緣所生法，是佛陀的波羅蜜所成就的。我們現在先把我的生命回歸到原點，阿彌陀佛的生命也把它歸零，發覺我們的心是如，阿彌陀佛的心也是如，一如無二如。你就在這個自他不二中，產生歸依，這時的歸依是絕待圓融不可思議，你再也不感覺到這個十萬億佛土是如此的遙遠，你也不會因為你是業障凡夫，阿彌陀佛這麼的清淨莊嚴，而感到自己的慚愧卑賤；你會發覺你跟佛陀是能夠達成一片的。這時候你在念佛，你會發覺阿彌陀佛跟你，距離不再是那麼遙遠，所以這個也可以說是絕待無外，你用另外一個思考來念佛。

【學員提問】如何在日常生活中修學我空、法空？

【師父答疑】你要修學，要知道方法，後面會講到怎麼修學我空、法空。方法掌控了，佛法講：此生故彼生，此有故彼有。你掌握了清淨因緣的方法，你去操作它就出現功德；你掌握雜染的因緣造作惡法，它就出現過失。就是你把功德的因緣具足了，這個功德就出現。這方法後面會講到，本論會詳細的從理論的斷疑生信，到最後的實際操作，都有詳細的說明。`;
