QXL.volNum = 5;
QXL.text = `
請大家打開《講義》第九頁，甲二、正說五分。

在本文中，我們根據會性老法師的科判，會性法師的科判等於是蕅益大師的科判，分成三大科。第一科是歸敬述意，第二科是正說五分，第三科是結施迴向。現在我們講到第二科正說五分。前面一科我們講到馬鳴菩薩造論的因緣，他說：

/gatha/
為欲令眾生，除疑捨邪執，
起大乘正信，佛種不斷故。
//

這段的文章是說明本論主要是成就我們：第一個是成就大乘的因相，第二個是成就大乘的果相，等於是引導我們成就大乘的因果。大乘的因相，本論所要成就的是除疑捨邪執，起大乘正信。除疑捨邪執在蕅祖的註解中說：除疑捨邪執就是要我們了解達妄本空，知真本有。

除疑就是要了解知真本有，就是我們這念妄想的心中有清淨的真如本性。這一點是我們在凡夫時就必須要肯定的，知真本有是本來具足的、法爾具足的。直下承擔真如本性以後，第二個要捨邪執，所謂的達妄本空。我們從無始劫來，顛倒業力的熏習所成就的虛妄我執、法執的這些邪執，也要加以對治。

所謂的達妄本空，知真本有，成就大乘的正信，就是成就大乘的因相；依止這樣的一個大乘因相，修習六波羅蜜的法門，使令整個大乘的功德能夠成就不退轉，所謂的佛種不斷故。

這就是我們學習本論的兩個重點：第一個成就大乘的因相，第二個成就大乘的果相。菩薩在正式解釋本論之前，先把本論修學的兩個宗要標出來。

/KEPAN/甲二、正說五分（分五：乙一、標科。乙二、正說。）
/KEPAN/乙一、標科（分二：丙一、標宗。丙二、列科。）
/KEPAN/丙一、標宗

現在我們正式看甲二、正說五分。為了能夠達到成就大乘的因果兩種功德，馬鳴菩薩分成五分來加以說明的，五分中分成兩科：第一科是標科，先把科標出來，標科中又分兩科：丙一、標宗，丙二、列科。我們先說明本經的宗要，我們看論文：

/VERSE/論曰：有法能起摩訶衍信根，是故應說。

菩薩說：以下的法是根據什麼因緣而安立的？當然佛菩薩的說法，一定是對眾生能夠產生滅惡生善的功能而安立這個法。這個法的安立，是要生起眾生的大乘信根，摩訶衍就是大乘，所以安立這個法。這個信根簡單的說就是一種善根。佛法的修學有兩個重點：第一個是業力的修學，說你是布施、或者持戒、修忍辱，在內心中會產生一個善業力，這個善業力會使令我們成就人天尊貴安樂的果報；但是這個善業力不能講善根，善根是一種對大乘法的信、解、行、證，它有一種解脫的功德，才能夠叫做善根。為什麼叫做根呢？就是它有執持不失跟增長廣大兩層意思。

就是說，假設你過去在大乘佛法的善根薄弱，你從這個法中能夠成就執持不失，能夠建立大乘的善根；假設你已經是多生多劫聽聞大乘佛法，本論的學習可以使令你大乘善根增長廣大：就是沒有生起的使令生起，已經生起的使令我們大乘善根能夠增長廣大。因為這兩種因緣，所以必須要演說《大乘起信論》的法門。

在講述本論之前，馬鳴菩薩先說明這個法它在我們的修行中所扮演的一個重要角色，就是為了成就乃至增長我們的大乘善根，才宣說這個法。

/KEPAN/丙二、列科

/VERSE/說有五分。云何為五：一者因緣分、二者立義分、三者解釋分、四者修行信心分、五者勸修利益分。

成就大乘善根的方便法門有五個，這五個在法藏大師的註解中是用四悉檀，就是歡喜、生善、破惡、入理四悉檀的因緣安立。

<c339>一者因緣分</c339>，法藏大師說：這是總說四悉檀，具足了歡喜、生善、破惡、入理，這裡等於是安立了八種因緣，把整個大乘的因相跟果相作一個總相的說明。就是在本論中我們所建立的是什麼？所破斥的是什麼？在因緣分，馬鳴菩薩先把本論中所破斥的跟所建立的作一個總說。

<c339>二者立義分</c339>，立義分就是歡喜義，就是世界悉檀。歡喜義主要是開顯一心、二門、三大的道理，把大乘功德是眾生本具的觀念，先把它標出來，使令我們產生歡喜，讓我們產生希望。

<c339>三者解釋分</c339>。前面的利益分是標出一心、二門、三大的宗旨；解釋分是把這個觀念再詳細的加以發揮，等於是利益分的廣說。利益分跟解釋分，都是屬於理論的說明，把凡夫的雜染緣起跟諸佛菩薩清淨的緣起，如何從雜染的緣起轉成清淨的緣起，這兩科會有詳細的說明。就是說既然一切法因緣生，我們今天能夠消滅雜染的因緣，自然雜染的果報就會消失掉；我們積聚了清淨的因緣，諸佛的功德自然就會成就。

所以在修行中，你最重要就是要掌握什麼是雜染的因緣，什麼是還滅的因緣，這是重點，那個開關你要抓到。在本論中，就詳細的把染淨的因緣作一個說明，這個都是理論的說明。

<c339>四者修行信心分</c339>，這是正式說明本論的修行方法，說是對治悉檀，這當中講到五門，透過布施、持戒、忍辱、精進跟止觀，六波羅蜜的五門來產生滅惡生善，破除雜染因緣，建立清淨的因緣，這一科是修行的方法。

<c339>五者勸修利益分</c339>，這裡是說明我們依據本論而行，有什麼樣的功德、殊勝的莊嚴，這樣的修行有什麼功德。

所以說，在本論中，立義分、解釋分、修行信心分是成就大乘的因相，第五科的勸修利益分是成就大乘的果相。馬鳴菩薩就用這五科來表達這個法的內涵。

/KEPAN/乙二、正說（分五：丙一、因緣分。丙二、立義分。丙三、解釋分。丙四、修行信心分。丙五、勸修利益分。）
/KEPAN/丙一、因緣分
/KEPAN/丁一、標章

再看乙二的正說，把五分次第的說明。先看丙一、因緣分，因緣分中分兩科：先標章，再征釋。先標出這一分章節的名稱。

/VERSE/初說因緣分。

首先解釋馬鳴菩薩造論的因緣。

/KEPAN/丁二、征釋
/KEPAN/戊一、正明八因
/KEPAN/己一、總征
/KEPAN/丁二、征釋，這當中分兩科，第一科是正明八因，這當中又分兩科：先總征，再別釋。

/VERSE/問曰：有何因緣，而造此論？

佛法的安立，一定要有利益眾生的因緣，弘法利生；如果沒有利益眾生的因緣，這個法是不能安立的。這是說明本法主要的是要利益什麼樣的因緣。

/KEPAN/己二、別釋

/VERSE/答曰：是因緣有八。云何為八？

答說：造此論的八個因緣：

/VERSE/一者，因緣總相。所謂為令眾生，離一切苦，得究竟樂。非求世間名利恭敬故。

第一個是總相，是一個總說。本論的安立，是為了令眾生離開一切的痛苦，得到究竟的安樂。這個痛苦最大的根源就是生死的流轉，就是說所有的痛苦都要依止生死的流轉才能夠生起，所以我們在三界中一次一次的流轉，每一次的生命都積集了很多的痛苦，假設沒有生死的流轉，這個痛苦就沒有依止處。所以這當中的關鍵點就是斷這個流轉的力量。離苦以後要得到究竟的安樂，這裡指的是大般涅槃的安樂，就是馬鳴菩薩是依止大悲心，不是追求世間的名利、或者個人的恭敬而安立這個法的。

這裡有一個觀念值得我們去學習：

在《金剛經》佛陀一再的強調一切法是空，法空就是一切法是無自性，不能夠說世間上有一個絕對不變的真實的法，不可以這樣講。所以《金剛經》佛陀很明確的告訴弟子們說：如果你說佛陀有真實的說法，就是謗佛。這樣講，法它不能自性生，要觀待因緣才能夠出現。觀待因緣，智者大師說：佛陀的說法，要觀待眾生有四悉檀的因緣，這個法說出來以後，讓眾生有歡喜、生善、破惡、入理這四個因緣，佛陀才會宣說。假設這個法對眾生沒有這四悉檀的因緣，佛陀不能宣說。這裡就值得我們記住一個觀念，我們以後或多或少會從事弘法的因緣。

佛法跟世間法的最大差別：世間的學者，他可以隨便發表一個論文，他不必為眾生的善根負責。他就是我有心得我就發表，這個東西安立以後，對眾生會產生什麼樣的影響，他不管。他認為我只是表達我的看法，表達事情的真相如此而已。但是佛法安立的角度不是這樣的，就是說身為一個法師，你要能夠觀察眾生的根機，就是這句話講出去，眾生接受了以後，在他內心中要產生四個效果：第一個，他聽了會歡喜；第二個，他會生起善根，對佛法有信心；第三個，這個法對他有對治煩惱的力量，滅惡；第四個，他能夠明白生命的道理。你今天散布一個法出去，你一定要讓眾生有四悉檀，這個法才有建立的因緣，否則這個法不能宣說。

所以這裡馬鳴菩薩說：其實這個因緣總相是通於一切經典，任何一個佛教的經論要能夠安立，一定是為了使令眾生離苦得樂，否則就是戲論──但有言說，都無實義，這樣就不是佛法。這裡，我們從馬鳴菩薩的因緣總相得到一些啟示：就是佛法的安立，它本性是空是怎麼安立的呢？是四悉檀的因緣而安立的，離開了四悉檀這個法不能建立，這個是因緣總相。

以下講到本論的別相，其實前面的總相是通一切經典，二、三、四、五、六、七、八等於是講到本論的各別因緣。二到七是說明成就大乘的因相，因地的相貌；第八是成就大乘的果相。因相中分成兩部分：二、三、四是理論的說明，成就大乘的信解；五、六、七是一個行門，一個修行的方法，成就行的功德，信、解、行三種功德。在二、三、四的理論中，我們先看第一個：

/VERSE/二者，為欲解釋如來根本之義，令諸眾生正解不謬故。

在解釋本論的一些理論，主要的是說明佛法的根本教義，使令我們能夠產生正確而不顛倒的認識。佛法是說生命有兩個相貌：一個是痛苦的相貌，一個是安樂的相貌。這兩個相貌都不是自然而生，也不是上帝創造，也不是他生，是因緣所生。

一、在小乘的教法中解釋這個因緣，它是用業力，就是身口意的造作，由善業招感安樂的果報，由罪業招感痛苦的果報，所謂的業感緣起。

二、大乘佛法認為小乘的學者把因緣觀只解釋一半，叫半字法門，沒有解釋完全清楚。就是這個業本身是誰來造作？造作以後誰來保存？所以大乘認為萬法唯心，業的後面還有一個主宰者、一個推動者，就是一念的心。心把業創造出來，業還沒得果報之前，業的功能也是由心所攝持，所以整個因緣的內涵就是你一念心。就是你的心一動，在你生命中就產生一個因緣，就是一個力量，可能是一個讓你善良增上的力量，也可能是一個讓你墮落的力量。所以你起心動念，在你生命中就產生一個因緣。

這樣的因緣，我們應該如何來了解？這個心它主宰著、驅動著我們生命的流動，生命就是一個無止盡的水流，這個水流是由心來主導，所以了解這念心變成很重要。本論中，馬鳴菩薩的善巧方便，就是怎麼樣了解我們這念心呢？他安立了一心、二門、三大的宗旨。就是我們這一念心，你可以從兩個角度來觀察：第一個是生滅門。生滅門就是我們的個體生命，由業力所創造的一個五蘊個體，你今生是個人，來生是個天，天的福報享盡變成螞蟻。就是由業力所變現的個體生命，它是不斷的變化，叫做生滅門。

而生命在生滅門中有不生不滅的本性，這就是真如門。我們要從生滅門中尋求解脫，你就必須從生滅門而趨向於真如門，說是把心帶回家。就是你這個生滅門，在三界一次一次的流轉，一次一次得到個體的生命，生死相續、痛苦相續，我們都沒有找到一個安穩的家來安住自己的生命。所以說你應該把心帶回家，你要先把你的家找到，這個家就是真如──不生不滅、不垢不淨的大安樂的真如。

生滅門怎麼趨向於真如門呢？

你要坐一輛車子，坐這個大乘，大乘就是三大，就是利用我們生滅的個體生命、色心諸法，來觀察體、相、用的三大，就能夠使令我們這念生滅門的心，到達真如門，就有所謂的乘、有波羅蜜的功能，所以一心、二門、三大。

就是生滅門是苦惱的根源，真如門是我們清淨的本性，依止三大的道理，從生滅門趨向於真如門，而達到離苦得樂。這是一個扼要的說明，本論後面會非常詳細說明它的內涵，馬鳴菩薩認為這就是整個佛法的根本教義。

/VERSE/三者，為令善根成熟眾生，於摩訶衍法，堪任不退信故。

/VERSE/四者，為令善根微少眾生，修習信心故。

前面根本教義的宣說，對我們有兩種不同的效果：

第一種，假設你是一個大乘善根成熟的眾生，也就說你已經多生多劫親近十方諸佛、聽聞大乘佛法，成就了十信滿心的菩薩；在本論的大乘根本教義中，你就能夠從十信而趨向於十住，成就不退信心，所謂的不退轉的功德。當然十住是一個聖位，能夠轉凡成聖。

第二種，假設我們是善根微少的眾生，我們大乘的善根還不決定，有時候墮入凡夫的思想、有時候墮入二乘的思想、有時候起大乘的思想，這就是種性不決定。經過本論的修學，能夠漸漸的建立大乘的信心，所謂的成就十信，從初信到十信的大乘正信。這個就是在解門中開顯成就兩種差別的功德。

這裡講到大乘的善根，我們解釋一下。佛法的修學，有善業的修學跟善根的修學。我今天去布施、拜佛，或者持戒，叫做善業，這個善業對我們的生命會產生安樂的果報；但是這個善業不能對治我們心中的顛倒，沒辦法對治心中的顛倒；對治心中的顛倒，就必須要有智慧的觀照，所謂的善根。善根，從本論的思想分成三類：

眾生的善根：所謂凡夫的善根。凡夫的善根，他內心中所依止的根就是自我意識。就是我們凡夫根據我們心中的名言（就是自己的妄想），捏造一個自我，以自我意識來造善業、或者造罪業，由這個我來造業，最後也是由這個我來得可樂的果報、或者痛苦的果報。所以這是我們凡夫的根、凡夫的依止處，就是以自我來當做我們的根。

二乘的善根：二乘的聖者所依止的根是空性，二乘的聖者認為我是不可得的，所以二乘的聖者他生起無常、無我的智慧，觀察我們這一念心是生滅變異、虛偽無主的，我不可得，就把自我意識消滅了；但是這個心的功能也消滅了。所以從大乘的角度，認為小乘的空義是錯損菩提，空得太嚴重了。

也就是說，凡夫的根是太過於執著，對心太肯定，內心中心隨妄轉，以自我意識為根本，跟著感覺走，當然是不對；小乘的學者對心是完全的否定，小乘佛法在觀心時，觀察我們這念心是不淨、苦、無常、無我，你很容易就覺得心是沒有價值的，是一切罪業痛苦的根源，就把心的功能消滅了。

大乘的善根：大乘佛法在觀心時，是採取比較中道的觀念，是有所破壞、有所建設。大乘佛法認為，在觀空時，所對治的只是我們心中的名言的執取。就是說你所破的是我愛執，這個我是心中的名言所安立的，這應該破掉；但是心的本性它有無量無邊的潛能，可以成就發菩提心、修六波羅蜜、成就諸佛的功德莊嚴，這個心的本性它善良的一面是值得肯定、值得開發的。所以大乘佛法認為所謂的不二法門，雜染的作用只要經過適當的調伏，就能夠轉成清淨的作用，所以大乘佛法的空，是強調不二法門，所謂的轉識成智。

蕅益大師講一個譬喻說：有一隻馬，不知道怎麼回事突然間起顛倒，變成一隻狂馬到處亂撞，我們凡夫就認為狂馬是我的本來面目，這顛倒的馬隨著情緒在空間裡面到處跑、到處傷人。就是凡夫以自我意識為根，認賊作父，以狂馬為本來面目。二乘人看到馬不聽招呼，這是痛苦的根源，就把馬給殺掉，馬根本沒有價值，你看這隻馬它什麼事也不能做，只會傷人、只會造惡業，所以二乘人對馬是比較悲觀的。大乘人認為：馬本來是很正常的，只是一時的顛倒，不要把它殺掉，它沒有錯，錯在它虛妄的狂性，我們如果能夠用適當的方法調治它，馬能夠變成一匹良馬，為我們工作、為一切眾生工作。所以就用種種的方便來調伏馬的狂性，結果變成一隻善良的馬，能夠生起種種的妙用。

所以從馬的譬喻來說：凡夫對心太過放縱；二乘人對心太過排斥；大乘法門是比較中道，染淨不二。就是說起惑造業是它，但是生起種種波羅蜜也是它，重點是如何調治它，而不是把它破壞、消滅。

你能夠對我們的心產生一個不二的觀察，那你這個人是具足大乘善根。你知道心不好是來自心中的名言，它本性是善良，是可以改變的。你內心中不斷的生起這樣的思考，我們說你這個人是具足大乘善根，你跟諸佛所差別的只是一種善業、時間的問題。如果你能夠保持這樣的思考，不斷的斷惡修善，你自然成就佛道，因為你成就了大乘因種。所以馬鳴菩薩在利益分跟解釋分很慈悲的把染淨不二的道理，作一個詳細的說明，來加強我們的大乘善根。這是講到本論的理論。再看第五，第五以後是講修行方法。

/VERSE/五者，為示方便，消惡業障；善護其心，遠離癡慢；出邪網故。

講到修行，本論中修行的行動有兩個：一個是難行道，靠自力斷惑證真的難行道法門，這是第一個選擇；第二個是易行道，靠佛力的加被，所謂的他力法門（在造論因緣的第七法門）。這些在本論中都會提到，讓我們來選擇。

我們先看難行道的修法。難行道中的前方便：

為示方便，消惡業障；善護其心，遠離癡慢；出邪網故。在難行道的修學中，我們剛開始要先淨罪集資，懺悔業障、積集資糧，所以本論會講到一些懺悔的方便、如何拜懺，透過禮拜、讚歎、供養來滅除罪障。所以我們看中國的佛教祖師，慈悲的安立早晚課，有禮拜的地方，有讚歎的地方（讚歎佛菩薩的功德），有種種的供養，這些都是在消除我們的罪障。

第二，前面是滅惡，這裡是講生善，善護其心，遠離癡慢；出邪網故。這以下是說明要透過布施、持戒、忍辱這些善業的修學，來對治我們的愚癡跟憍慢，遠離邪見的顛倒。也就是說雖然大乘佛法主要的修學是心地法門、一種內心的觀照，但是這內心的觀照要有一些前方便作基礎，就是淨罪集資。

龍樹菩薩在《智度論》上說：如果你今天修小乘法，小乘法是一個非常極端的法門，反正我把一切法都空掉，惡法也空掉、清淨的菩提本性也空掉，小乘沒有所謂的不二法門，它是只有對立的法門，染淨是對立的。你修小乘法門不一定要淨罪集資，你的善根很容易成就，因為這個是思議境，是你可以心思口議的境界。這個生命是沒有價值的，是不淨、苦、無常、無我，任何一個人聽到都能夠接受的。

但大乘法門是不思議境，個體的生命這個五蘊，一方面它是不淨、苦、無常、無我，但是它又是一切功德的根本，是眾禍之門，也是眾妙之門，這兩個門是不二，這件事情是不可思議。大乘的不可思議法門，持戒、修福就變成很重要。龍樹菩薩說：福報不夠的人，聽到大乘法門會起顛倒，會錯認消息。所以我們在正式修止觀之前，一定要先淨罪集資，一方面拜懺、一方面持戒修福來作前方便，本論中就先提到這樣的一個修法。

/VERSE/六者，為示修習止觀，對治凡夫、二乘心過故。

這是本論正式的修學內涵，正式的修習大乘止觀來對治凡夫的著有跟二乘的偏空。在本論中，大乘的止觀思想，先說出生命的雜染因緣，說：凡夫雜染的根源是一念不覺生三細，境界為緣長六粗。我們每一個個體生命，有些人善業強，他的個體生命特別的莊嚴，五蘊身心特別的莊嚴美妙；有些人罪業比較強，他的五蘊就比較苦惱卑賤：這都不是我們的本來面目。

當我們把心回歸到原點時，我們這念心是清淨本然，不生不滅。不生不滅，這個心突然間一念的不覺，也不曉得為什麼突然間起顛倒，它就是怎麼樣呢？

真如不守自性，這個真如的清淨心不想安住在清淨的本位上，老是想要向外去攀緣，它總覺得要去動；向外一動以後，不得了了，一念不覺生三細，清淨的本性就變成對立性的阿賴耶識，一個有漏的阿賴耶識。這個三細，後面會說明，簡單說三細就是阿賴耶識。阿賴耶識當然就有一個能所，有一個我，能受用的我；有一個所受用的法；一個微細俱生的我執跟法執出現。俱生的我法二執是不帶名言的，是很微細的，但是這時已經有一個有漏的生命出現，就是一念不覺而產生，叫做一念不覺生三細。

結果境界為緣長六粗。既然有一個我，有一個所攀緣的法的境界，這兩個就相互的作用，我去攀緣你，你也來引誘我，我相、法相的相互造作，以這個境界為因緣就產生了六粗，這時內心開始產生分別，就是所謂的名言，這時的自我意識更加強烈。每一個人都打不同的妄想，所以每個人心中所認定的我是不同的，福報大的人認為我是比較大，像螞蟻就認為這個我比較狹隘卑賤。這時候我們由名言的分別創造一個粗的我，這時就開始造業了、開始流轉生死了，境界為緣長六粗。

所以本論中它所對治的名言、所安立的我，剛開始先超越名言、空掉自我。在大乘止觀明顯的是先說我們這念心是達妄本空，知真本有。在實際的操作上，先達妄本空，破除名言所安立的我；破掉以後，先大死一番，再肯定我們這念心有佛性。一定是先滅，然後再肯定。這裡馬鳴菩薩有詳細的說明，強調你不能直下肯定，你一肯定時就落入凡夫的執取，所以剛開始是先對我們的心全盤否定，然後再直下的承當。

過去有一個禪師，他在山中修行，同參道友去見他，問他說：你住茅蓬那麼久了，是依何道理而住山修行？你住山修行，心中要有個道理。這個禪師說：我見泥牛沉入大海，至於今日尚未出現。這只污穢的牛沉入大海，就是說我們這念心在無始劫的虛妄熏習，安立了很多錯誤的名言，我現在的修行就是對治這些名言，用我空觀、法空觀來消滅這個名言所安立的我執、法執。同參道友就問禪師說：那你什麼時候出山？他說：待其清淨浮現海中，我就出山了。污穢的、有泥巴的牛沉到大海，它在大海里面洗滌以後，它浮現大海清淨時，就是我出去時。就是說當他把名言所安立的我法二執消滅以後，他清淨的大悲心發動時，就是他從空出假時。

所以本論中是先滅除妄想，然後再肯定真如。這裡是講到正修。

/VERSE/七者，為示專念方便，生於佛前，必定不退信心故。

這裡是說我們修難行道的大乘菩薩，要生生世世的在三界流轉有一個問題，就是會退轉。這個退轉，除了外界的引誘以外，就是生命的死亡。死亡對我們來說，是非常嚴重的障礙，就是報障。你今生能夠好好的布施、持戒，有這樣的信心成就一個善業力，你來生不一定願意繼續的布施、持戒，就是說你今生修行的功力，來生不能夠繼續的累積。

我們無量劫在三界流轉，積集了很多的善法，但是為什麼流轉？死亡的中斷，使令我們每一期生命都要從頭開始，這是非常嚴重的問題。你看有些人福報很大，他前生一定是積集善業，但是他福報大卻慳貪。照理講，他前生積集那麼多善業，應該是有布施的等流性，但是他為什麼慳貪？就是他退轉，富貴現前時，他的心情開始改變。

所以在大乘佛法的三大阿僧祗劫中，有死亡的退轉。所以馬鳴菩薩勸我們可以考慮求生到阿彌陀佛的國土去，有無量無邊阿僧祗劫的壽命，能夠保證不退，這是一個方法。

/VERSE/八者，為示利益，勸修行故。有如是等因緣，所以造論。

前面是說明整個因地的修學，能夠產生滅惡生善、離苦得樂的功德；這裡講到大乘的功德。有如是等滅惡生善的因緣，所以造作此論。到這裡是簡單的把本論的內涵作一個總述。`;
