QXL.volNum = 7;
QXL.text = `
請大家打開《講義》第十五頁，丙三、解釋分。

基本上，我們學習世間的學問跟研究佛法的教義，是有很大的差別。世間的學問，它是一種學術上的研究，透過這樣的研究，在我們內心會產生知識，但是這樣的知識對我們內心的煩惱跟罪業，不能產生解脫的力量。也就是說雖然我們累積很多很多世間的知識，但是我們的煩惱依舊、罪業依舊，因為它的方向是向外追求。而佛法的教義呢，它能夠引生我們向內的觀照，所以他內心中有一種解脫煩惱跟罪業的力量。

所以佛法在所有的學問中，它不共世間法的地方，是有一種乘的功德，所謂一切諸佛本所乘故，一切菩薩皆乘此法到如來地故。也就是這個佛法的義理到你心中，它能夠運載你這一念煩惱跟罪業的心，趨向於清淨、安樂的彼岸，它有這種力量。這種力量、這個乘的功德，在經論中的方法是有所差別的。

本論講到大乘的功德要起動，就要依止三大的義理──體大、相大、用大。這個體、相、用三大的修學，我們分成兩部分：第一部分是一種觀照力，就是觀照我們這一念心它的本性是具足體大跟相大。體大就是所謂的真如平等，無增減故；相大就是如來藏具足無量性功德故。觀察我們這一念虛妄的分別心，它的本性是清淨，本性是具足功德。

從這樣的觀照在本論中，透過真理的觀照，就發起三心，所謂的直心、深心、大悲心這三種心。就是我們從過去虛妄顛倒的心識，透過體相的觀照，你內心中開始對無上菩提產生真正的發心，也就是說你內心中從現在開始，真實的安住大乘種性，就是透過觀照產生真正發心。由觀照的發心，產生所謂的行動，修學五門：布施、持戒、忍辱、精進跟止觀，發動我們身口意這些斷惡、修善、度眾生的行動，把大乘的用大全部的發揮出來。

所以本論的修學是從內心的觀照產生發心，由發心帶動整個六波羅蜜的修學，這樣我們的生命就是正確而不顛倒的安住在大乘的功德，也就慢慢地趨向於離苦得樂的成佛之道，這就是《大乘起信論》的整個修學法要。

當然我們今天要對內心產生觀照，就必須要先對它了解，你一定要有了解，依教起觀，一定要有一些教義的基礎，才能夠觀照。所以我們在前面的利益分，簡要的把一心所具足的三大表達出來；解釋分以後，再詳細的把內心的相貌作一個解釋。

/KEPAN/丙三、解釋分
/KEPAN/丁一、結前起後

這當中分兩科，先看結前起後，就是一方面結束前文，一方面生起後文。

/VERSE/已說立義分，次說解釋分。

前面我們是把大乘的功德作一個綱要的說明，就是大乘修學的重點在心；這個心不是修妄想心，而是修真實心。什麼是真實心？就是體、相、用三大，觀察我們這一念心具足體、相、用三大，我們的心就產生真實心，我們的心就是安住大乘，這是立義分的大意。

以下就把這樣的心作詳細的說明。前面的立義分是偏重在清淨的功德緣起，所謂的還滅門；解釋分中，就廣泛詳細的說明流轉跟還滅二種因緣。當然我們對於整個流轉的因緣跟還滅因緣，你了解更透徹，你觀照的力量就會加強。

/KEPAN/丁二、標列正解
/KEPAN/戊一、標列

這裡先標列解釋分的章目，再正式解釋。先標示出它的章目，就是解釋分有哪些的重點：

/VERSE/解釋分有三種。云何為三？一者顯示正義，二者對治邪執，三者分別發趣道相。

這三科，前面二科是因地的修學，所謂的觀照力；第三科是一個功德相貌，觀照以後有什麼樣的功德出現。

第一段是顯示正義：正義是發明整個大乘佛法的要義，也就是發明生命的真相，包括凡夫的流轉門，也包括聖人的還滅門，在這一段中都會詳細的說明。

第二段是對治邪執：是說凡夫在流轉中的問題，為什麼凡夫會一次一次流轉？就是我們凡夫有這種邪，這個邪就是顛倒的執取。這裡，所對治的有兩種：第一個是凡夫的我執，第二個是二乘的法執。這一段會把凡夫的我執跟二乘的法執的相貌，乃至對治的方法一一的說明，說明凡夫流轉跟二乘功德為什麼不圓滿的因素。顯示正義跟對治邪執這兩個，就是要引生我們一種觀照。觀照以後：

第三個產生功德，分別發趣道相。什麼叫做分別發趣道相？這個發趣就是發心趣向無上菩提的聖道。發心趣向無上菩提，簡單講就是真正發心，發起直心、深心、大悲心。這三心有淺深的不同，我們必須把它作一個分別。

本論中把我們從凡夫到成佛的發心，分成三種發心：所謂的信成就發心，剛開始從仰信真如而真正發心；第二個是解行發心；第三個是證發心：信、解行、證三種的發心。這個發心是透過前面的顯示正義跟對治邪執所產生的一種功德。這是先標出解釋分的章目，是我們所要達成的因地修學跟果地的功德相貌。

/KEPAN/戊二、正解
/KEPAN/己一、顯示正義
/KEPAN/庚一、總標二門

以下正式的分別這三章的內涵，一、顯示正義，先把大乘佛法的因緣觀表達出來，這當中有三科，先看一、總標二門，我們看第十六頁：

/VERSE/顯示正義者，依一心法。有二種門。云何為二？一者心真如門，二者心生滅門。是二種門，皆各總攝一切法。此義云何？以是二門，不相離故。

首先我們先解釋大乘佛法的要義。當然佛法不是學術，它是一個宗教，宗教要使令眾生離苦得樂，就必須要掌握我們的心，心是整個痛苦、快樂的一個主要根源。要觀察我們這一念心，本論分成二種門來觀察，一者心真如門，二者心生滅門。

這個真如門蕅益大師說：這個真如門是顯現隨緣不變的體性，是我們內心中的一個體性，它本身隨順染淨的因緣，它是不能改變的，所以叫做真實而不變。

心生滅門是顯現一個不變隨緣的作用，心受業力的熏習：你造殺、盜、淫、妄的業去熏習這一念心，這個心它就顯現罪業跟痛苦；我們用布施、持戒的業力來熏習這一念心，我們的心就產生種種安樂的果報：這些都是屬於生滅門，就是它會生滅變化，隨我們所造作的業力而生滅變化，它是一個心的作用。

這個門我們解釋一下。古德說這個門有二義。

一者區別義：就是把真如跟生滅加以區別。真如它是一個絕待平等的相貌，它顯現整個十法界的共同生命，就是我們整個生命的一個總相，簡單的說是整體生命的相貌。生滅門是一個相對的、差別的相貌，就是每一個人在共同生命的原點基礎之下，因為在流轉中每一個人積集了不同的業力，這個業力去熏習清淨的本性，就顯現一些差別的果報。就是每一個人的外表身相不同，內在的思想感受也不同，就顯現整個生命所謂個體生命的出現。這個門就是把整體生命跟個體生命區別出來，這個真如是一個整體生命，生滅門是個體生命，把它區別出來。

其次，這個門有通達義：說這兩個門是可以互相的通達。就是說我們也可以從所謂的迷真取妄，凡夫的心情，是從真如門而通向生滅門，這時迷真取妄，真如門就關閉了，進不去了，我們就在生滅門中產生顛倒，永遠就回不了家了，這個是迷惑的流轉因緣；我們也可以通過大乘佛法的修學，從生滅門而通達真如門，把真如門的門打開，把心帶回家，就是在這個流轉中，能夠回到我們的本來面目，把心帶回家。所以這個門，理論上是可以相通的，凡夫因為迷惑顛倒就變成障礙。所以這個門也有通達義。這個門可以到另外一個門，另外一個門也可以到這個門，所以這個門也有通達義。就是把真如門跟生滅門的個體內涵跟相互關係作一個簡要的說明。

是二種門，皆各總攝一切法。這兩種門都攝受一切法，這一切法包括雜染流轉的法，也包括了清淨的還滅的法。這裡我們說明一下：

這個真如門是染淨諸法的總相，就是雜染法它的體性是清淨，清淨法它的體性也是清淨，只是迷悟的不同；所以真如門是攝染淨諸法，生滅門是顯現諸法的別相。當他迷惑時，顯現雜染的因果；當他覺悟時，顯現清淨的因果：所以這兩種門都總攝一切的染淨諸法。

此義云何？以是二門，不相離故。這兩種門是不能分開的。不能分開，蕅益大師說：譬如大海，深廣無涯。真如是大海的濕性，一個不變的濕性；生滅門是這個濕性的水，透過不同的風浪，這個風指的是業力之風的吹動，就變現不同的波浪，這個波浪就是生滅門。當然波浪也沒有離開水的濕性，水的濕性也沒有離開波浪，所以這個不相離，應該說是非一非異，一體兩面。這裡是說我們內心可以從這兩個方面來觀察。

這段的論文，蕅益大師有一個比較詳細的發揮，他說：我們這一念心，是整個生命的根源，痛苦、快樂的根源。我們這一念心有兩個方向可以活動：第一個是隨順我們的慾望，就是我們內心有各式各樣的慾望，這是一個活動方式，隨順慾望的後果，那也是惑業苦的痛苦相貌。第二個是隨順於道理，說是克己復禮，克制慾望隨順於道理。我們在內心生滅的活動中，一個是隨順於慾望，一個是隨順於道理，因為我們內心所隨順的不同，就有一些所謂種性的差別。蕅益大師也舉出幾個例子說：

一、凡夫他內心中所依止的體性：以自我為體性，所有的慾望以自我意識為根本，以自我為自體，當然就起惑造業，他的整個生命就變現一個三塗的果報，因為你以自我為體、以慾望為自體。

二、凡夫的另外一個相貌，就是以因果為自體：我相信我內心中有自我，但是這個我要用因果來加以收攝。我應該要造善業招感安樂的果報，避免造罪業招感痛苦的果報。所以這個時後候，他內心中多了一層道理，這個人生命中有一定的章法，有一點章法，他知道惡法不能做，要積集善業。所以以因果的道理為自體，這種人已經變成人天的果報。

三、第三種人是以空性為自體。前面的人天果報，雖然是安樂美妙，但是畢竟是無常敗壞，他的安樂只是暫時；從這當中，二乘的聖人更清楚的知道在流轉中沒有真實不變的我，所以修無常觀、無我觀，把自我的執取消滅，把所依止的道理，從因果的道理提升到空性的道理，以空性為自體，這時趨向於涅槃，這是二乘果報，以空性為自體。

四、大乘的佛法是以現前一念心性，所謂的以菩提心為自體，他依止上求佛道、下化眾生的菩提心，他所依止的是一個大白牛車，而趨向於諸佛的萬德莊嚴。

所以說我們這一念心，因為所依止的體有所不同，他生命中的造業、感果就有所差別。凡夫在生滅門跟真如門，當然主要的造作是生滅門，所依止的是真如門，這個真如也有一些所謂的方便。你說因果，也是真如的一部分，為實施權；空性也是一部分；最圓滿的，當然是即空、即假、即中的真如。我們對真如歸依的淺深不同，所產生的功德就有所差別，有人天的果報、二乘的果報跟大乘的究竟果報。所以蕅祖的意思就是說，生滅門是我們目前所顯現的相貌，真如門是我們的歸依處。

/KEPAN/庚二、各釋二門
/KEPAN/辛一、釋心真如門
/KEPAN/壬一、釋心真如相
/KEPAN/癸一、正詮顯法體
/KEPAN/子一、借言詮法

前面是一個總說，這以下各別把真如跟生滅二門的相貌作一個解釋，這當中先講心真如門，真如門先講它的相貌，相貌中分兩科，第一科正詮顯法體，先把真如的法體表達出來。表達法體有兩部分：第一個是借言詮法，這個借言詮法就是依言真如，依止名字言說所安立的真如。第二個是顯法離言，講離言真如，就是聖人所證入的真如；前面是靠語言文字所表達的真如。我們先看依言真如：

/VERSE/心真如者，即是一法界大總相法門體。所謂心性不生不滅。一切諸法，唯依妄念，而有差別。若離妄念，則無一切境界之相。是故一切法，從本已來，離言說相，離名字相，離心緣相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如。

這裡是把所有的大乘經論，有關真如的表達方式作一個總說。真如是我們的歸依處，也等於是所有大乘學者所歸依的一個家。這個家是一個什麼相貌呢？先作一個總說：

「即是一法界大總相法門體，所謂心性不生不滅。」

真如是一真法界，一真法界包括整個十法界染淨的因果，在整個十法界染淨因果中，它是一個總相的法門體。說這個十法界的出現，是因為眾生各式各樣不同的業力，有些人現出三惡道的果報，有些人現出人天的果報，有些人現出二乘的涅槃，有些人現出萬德莊嚴；而這些差別的果報，都是依止一個基本的總相，那就是真如。就像大海中有很多的波浪，但是波浪的本性都是濕性；所以這個真如是整個十法界所依止的一個共同的總相，一個無差別的體性。這是從空間上來說明。從時間上來說，所謂心性不生不滅，從時間上來說它是不生。蕅益大師說：什麼叫不生？過去無始，謂之不生，沒有開始；什麼叫不滅？未來無終，它也沒有一個結束，所以叫不滅。這是從時間上來說明。

這裡，是簡別我們凡夫的心念是有生滅的，譬如說：我們現在明瞭的心，到了佛堂生起一個我要拜佛的念頭；生起以後，可能我們拜佛拜了五分鐘，生住相續；慢慢慢慢，拜佛的因緣結束了，就產生變化，生住異滅；然後拜佛念頭消失了，你又去做其他的事，到了書桌上看書。這個拜佛的念頭生起以後，它消滅了；消滅以後，又生起一個看書的念頭，開始觀照。

從經典中的啟發，觀照生命有一些差別的因緣，有流轉的因緣。凡夫為什麼流轉，聖人為什麼還滅，這個問題在哪裡？徹底的去觀察生命的真相。就是我們凡夫的心念它是生起消滅，生起另外一個念頭又消滅，又生起一個念頭又消滅；就像那個大海一樣，一個波浪接一個波浪，一個波浪接一個波浪，但是這個波浪有時候起善念，有時候起惡念，有時候起惡念又起善念，就是有各式各樣無量無邊的心念的累積，構成我們一個生滅門。

但是這個真如門它不是，真如門它是不生也不滅。你起善念它的本性是如，你起惡念它的本性也是如，一如無二如，所以它在時間上是不生也不滅，空間上是整個十法界共同的依止處，在時間上它是沒有生滅相。這個時空，我們從這兩個角度就知道：這真如是這樣的一個情況，也知道一個消息。這是一個總說，以下是別釋。

「一切諸法，唯依妄念，而有差別。若離忘念，則無一切境界之相。」

這句話非常重要，這句話將整個《大乘起信論》解釋分後面的重點──雜染的生起因緣，還有清淨法的生起因緣，等於是作一個總標。那這一段的論文，我們分兩段：

先說迷真起妄，一切諸法，唯依妄念，而有差別，這叫迷真起妄，流轉門；

第二個是講返妄歸真，若離妄念，則無一切境界之相，這叫返妄歸真，還滅門。

/SECTION1/一、迷真起妄——流轉門

這一段我們解釋一下。我們的本來面目，就是把心帶回家。我們現在每一個人都可以修所謂的空觀，觀察我們這一念心，當你一觀察這一念心，你一照以後，你發覺你這一念心錯綜複雜，有時候起善念，有時候起惡念；但是這些善惡的念頭都是因緣所生法，你把這個因緣所生法的相貌撥開來以後，你看到你內心清淨光明的本性，是不生也不滅，它沒有流動的變化相。沒有流動的變化相，那我們這些生命的變化是從哪裡來的？這些個別的因緣是怎麼來的？

說一切的諸法有很多的差別，你的相貌跟我的相貌不同，我的思想根你的思想也不同：這些差別不是上帝創造的，也不是自然產生的；它是由因緣而生的。什麼因緣呢？就是妄念。這個妄，本論的意思就是迷真取妄，就是不稱合真如本性的所有念頭都是妄念。只要這個心念不是從我空、法空的真理髮動的，以自我意識發動的，都叫做妄念。不管你今天起了多大的善念，只要以自我意識為根本的都是妄念，這個妄念當然是生滅相。

妄念為什麼會產生差別的果報、差別的境界？這當中有兩個差別的因緣：第一個是妄念產生的業力，第二個是妄念產生的分別。我們作一個解釋。

第一個、妄念產生不同的業力：就是我們這個妄念：有時候是起善念，布施、持戒、忍辱的善念，這個妄念就會推動身口去積集善業，就出現安樂尊貴的人天果報；有時候是起惡念，惡念就會去創造殺盜淫妄的罪業，招感卑賤痛苦的三塗果報。就是妄念會產生善惡的業力，所以果報就有差別了，這是第一層的差別，由業力的差別所顯現的這些痛苦、快樂的相貌。

第二個、妄念產生不同的分別：就是我們的分別心。我們這一念心去接觸這些果報時，我們心中有各式各樣的情緒跟思想，對這個境界就安立了很多的名言，這時這個境界就產生變化。譬如說：我們是一個僧團，我們今天每一個人穿同樣的衣服、吃同樣的飯菜、睡同樣的寮房，表示我們過去有共業。就是我們過去在某一個時空中，我們同時都起了某一個妄念；雖然這個妄念不是依止我空、法空，但可也是善業，所以才能夠出家。這個妄念，我打的妄想跟你的妄想都很接近，都是歸依三寶，在三寶中積集善業；所以這個妄念成熟了，表現出來，我們今天受用僧團的種種依正莊嚴。

這些境界就是這樣出現的，就是由這個妄念創造一個業力，由這個業力招感這個果報。這個果報大家很接近，表示我們過去最初那個妄念很相似。雖然我們吃同樣的飯菜、穿同樣的衣服，但是每一個人的痛苦、快樂感受還是有所不同，就是因為每一個人的名言不同。有些人少欲知足，他遇到環境安立比較好的名言，這個人容易得到快樂，他只要有一點小小的環境，他就能夠產生樂受，他心中的名言，都是安立好的名言，比較厚道。有些人慾望比較重，他跟境界相接觸時，都是安立比較尖酸刻薄的名言，所以這個人很難得到快樂，他快樂的範圍非常窄。要很特殊很特殊的因緣出現，他偶爾才有個樂受，而大部分的時間都是痛苦，因為他心中的分別有問題，就是安立的名言太過刻薄。

這就是為什麼大家受用同樣的環境，會有不同的感受，就跟你當下的情緒、思想、分別的名言有關係。所以說世間上的果報、為什麼會有不同呢？簡單的說就是妄念。由妄念產生不同的業力，也由妄念去受用這個果報，而產生不同的分別，所以這個世間就是這樣的出現。

/SECTION1/二、返妄歸真——還滅門

什麼時候這個境界會消失呢？若離妄念，則無一切境界之相。當你這個妄念的力量、勢力消失掉了，當然消失，有可能是自然的消失，這個業力釋放完畢了自然消失，或者是對治而消失。這個妄念消失了以後，這些差別的果報就消失掉了。

佛陀在世時，有很多的釋提桓因，其中有一個釋提桓因，他天界的果報即將要結束，身為一個天當然他有神通，他知道他來生的果報要做一隻豬，生長在一個農夫家裡，他非常恐怖。這個果報即將出現，他為了尋求一個解脫之道，就升到大梵天，向三界的大梵天作一個祈求說：大梵天！你有大威德，我天的果報即將結束，你有沒有什麼方法能夠讓我解脫這樣的痛苦，從豬的果報解脫出來？

大梵天說：我沒有辦法，我沒有這樣的法門來扭轉你的業力。大梵天說：人世間有釋迦牟尼佛出世，他演說真理，引導眾生離苦得樂，你應該向佛陀去祈求。這時釋提桓因聽到這句話很歡喜，就變現一個年輕人的果報，來到佛陀的精舍。來到佛陀精舍時，他那個時候業力即將結束了，他看到佛陀以後，很真誠的歸依佛陀，就至誠的拜下去。拜下去時，還沒起來就就死掉了。

唯識學上說：這個果報有內因力跟外緣力。他死掉以後，因為歸依的心很強，他能歸依的心強，一個人遇到痛苦現前時，他對三寶歸依的心非常的堅定、強烈，所以業強；第二個他的外緣力也殊勝，他所歸依的是真實的佛陀。像我們只能夠拜佛像，他真實的拜到佛的真身，所以他拜下去以後，產生很大的善業。這時他投胎到豬的胎中，這隻母豬本來是懷六個小胎兒，在釋提桓因拜下去時，突然間這隻豬就像發瘋一樣，在豬舍裡面到處亂竄、發狂，就把女主人一個很漂亮的瓦器打破了。這個女主人一生氣，拿起棒子就打這隻母豬，就把釋提桓因那個胎兒打流產了。釋提桓因投胎沒有多久，他又死掉以後，又變成一個當下的釋提桓因，又回到釋提桓因的本位去了。

這個生命的因緣，佛法怎麼解釋？我們作一個說明。

佛法說是「一切諸法，唯依妄念，而有差別。若離妄念，則無一切境界之相。」

釋提桓因，因為他過去有一個妄念、有一個善念。他把這個善念付諸行動以後，造了善業，變成釋提桓因，釋提桓因的果報是由這個妄念的善業力量資持，他就一直受用這個安樂的果報。但是這個妄念，它是生滅的，生滅門有生有滅。有一天，他這個妄念的善業力量釋放完畢時，他要墮落到豬；這時他因為歸依佛陀，又創造一個善的妄念，就又做一個釋提桓因。肯定來說，他第二次的釋提桓因跟第一次釋提桓因的正報、依報應該有一些不同；沒有兩個妄念，是完全相同。當然大方向相同，但是差別會不同。

也就是說，生命是一個無止盡的水流，它是由很多很多無窮盡的波浪而累積起來；所以我們的生命不是一條直線，是由無量無邊的點所構成。就是你一個妄念得一個果報；這個果報結束以後，又另外一個強大的妄念，又得一個果報；這個妄念又結束時，又產生一個果報：這就為什麼我們在整個生滅中，這個個體生命不斷的變化。因為我們打各式各樣的妄想，所以我們生命的相貌也就各式各樣。

一切諸法，唯依妄念，而有差別。當我們這個妄念消失以後，這個境界就消失了，期待下一個妄念的出現。這個就是講到凡夫的生滅門，剛開始所謂的迷真起妄，最後從妄裡面又消失掉。這裡在後面的修大乘止觀，是一個很重要的觀察。

馬鳴菩薩在發揮流轉門跟還滅門，他的根本思想一言以蔽之就是這句話：一切諸法，唯依妄念，而有差別。那怎麼辦呢？若離妄念，則無一切境界之相。也就是說，我們今天對某一個環境感到不滿、對某一個人感到不滿，重點不是你去改變外在的環境或人事；因為這個環境跟人事是由妄念而變現，它的根源是你內心的妄念而出現。所以你的重點在若離妄念，你要透過你的懺悔、修觀的對治，這個妄念消失了以後，這個境界就自然消失掉，它就是這麼一回事。

所以古德說：罪從心起將心懺，心若滅時罪亦亡。這個罪是由你最初一念妄念的活動才產生的，這個身體是不能造罪的，嘴巴也不能造罪，它只是個工具，真正造罪的老闆是心。所以這個牛車的車子不能主動跑，是透過牛在跑。罪從心起將心懺，心若滅時罪亦亡。

滅罪之道，就是消滅這個惡念的相續。

蕅益大師說：我們經過一段的修學以後，要怎麼樣判斷我們修行是不是有進步？你花了很多的時間去拜懺、修止觀、持戒，就是說我們的心念改變，我們過去慾望的心念淡薄了。所謂的淡薄不是說我不敢去做，因為有這個罪業靠持戒的強壓，不是這個意思；而是你很真實的觀察到妄念的過失而放下。

當你的心念對於五欲的執取減少了，對三寶的歸依加強了，表示你這個人修行進步了，也表示你的生命有一個決定性的變化。所以這裡的生滅門是這個意思。`;
