QXL.volNum = 8;
QXL.text = `
請大家打開《講義》第十六頁。

這一段是講到真如的體性，這當中馬鳴菩薩有一段論文開示：

「心真如者，即是一法界大總相法門體。所謂心性不生不滅。一切諸法，唯依妄念，而有差別。若離妄念，則無一切境界之相。」

我們上一堂課講到這裡。

真如的體性，它是超越時空的一個整體生命，它在空間上是總相，在時間上是不生不滅，它是超越有時間障礙的個體生命。既然它超越時空，那我們這個個體生命當然是有一定的時間、空間，就是時間會變化，空間也會有變化，這些時空變化的個體生命是怎麼來的？

因為有妄念。我們本來是不生不滅，但是我們的心有向外攀緣的心，我們不喜歡安住在不生不滅的本性，說是真如不守自性，一念的妄動，這一動以後，就沒完沒了，就開始產生很多很多所謂的個體生命，所以這些個體生命是很多很多的妄念所變現出來。當我們把妄念都消滅時，這些生命的流轉果報就消失了。

古人說：夢裡明明有六趣，醒後空空無大千。你在做夢時，一個夢接一個夢，一念的夢心變現很多的山河大地，你也真實感受到有快樂的感受、有痛苦的感受。這些感受是怎麼來的呢？一念的夢心所變現。這個夢做完了，你又做另外一個夢；另外一念的夢心又變現一個果報。等到你哪一天晚上做五六個夢醒過來以後，就是等你有一天成佛以後，你已經把心帶回家以後，你再觀察：你過去的流轉因緣，是覓之了不可得，醒後空空無大千，原來都是一念的顛倒，如此而已。

所以這裡若離妄念，這些境界就消失掉了，因為它本來就是妄念所變現的。這裡等於是把這些流轉跟還滅因緣說出來，這以下是正式說明怎麼樣能夠消滅妄念？什麼是我們的家？

/SECTION1/一、破遍計執

「是故一切法，從本已來，離言說相，離名字相，離心緣相。」

我們一切法的本來面目，從本以來就是本來面目，就是說我們現在有一個色身，是一個男人的色身、或女人的色身，你這個色身有各式各樣的想法、思想，有受想行識不同的感受分別，這些都是因緣所生法，是你過去的某一個妄念變現出來的，它不是你的本來的面目。這怎麼辦呢？離言說相，離名字相，離心緣相。這裡簡單的說就是破我們的遍計執。

就是說我們凡夫在分別中，有一個所分別的境相，這個分別的境相是一個言說相、或者是名字相，這個名字就是文字。比如說我們要表達一個觀念說這朵花很漂亮，當然我們有名言以後，由這個分別心依止這朵花很漂亮這幾個字，就開始產生分別。事實上佛法說，這些依止名言所產生的分別都是戲論，但有言說，都無實義。你說這朵花很漂亮，這朵花不管漂不漂亮，它那樣就是那樣，它不漂亮是你自己安立的，所以這個花是一個妄念的因緣變現出來。這樣的相貌，我們說你很漂亮、這個人很丑陋，這些都是遍計所執。

所以我們剛開始要先破這個粗的遍計執。就是說由言說相、由文字相所安立的各式各樣的概念，這些都要消滅掉，否則你沒辦法恢複本來面目，這是<c339>第一個破遍計執</c339>。

/SECTION2/二、遠離依他

<c339>第二個是遠離依他起</c339>——畢竟平等，無有變異，不可破壞。依他起性我們不能說破壞，因為它是由業力所變現的，你說我現在的身體一天到晚老病死太痛苦，我要把這個身體消滅掉。不可以！你只能夠說遠離，不隨它而轉。

觀察這些依他起的本性是畢竟平等。畢竟平等，法藏大師解釋是<c339>不垢不淨</c339>，它沒有垢、也沒有淨。當然我們凡夫的身心世界會感到垢淨，我今天拜一部《八十八佛》，我內心善良的功能增加了；我今天持了一個《楞嚴咒》，這個善法增加了；我又打了一些惡念，惡的法也增加了：我們的身心世界是在染淨中不斷的變化，但是這時你遠離這個染淨的概念。

其次，無有變異這個變異就是增減相，你的功德增加了，過失減少了，當然這也是好念，但是這個好念不如無念，再把這些<c339>增減的概念消失</c339>掉。

其三，不可破壞遠離這個依他起，這怎麼辦？觀察這些依他起的本性是畢竟平等。畢竟平等法藏大師說是<c339>不生不滅</c339>，它沒有生起，也沒有消滅的相貌。當我們面對心中的名言，用念佛、或者持咒斷除名言的相續，一方面對於依他起性產生不生不滅、不垢不淨、不增不減的觀察，這個就是第二個方法，遠離依他起性。因為依他起它一定有生滅、有增減、有垢淨的對立差別。

/SECTION3/三、唯是一心

當我們破除遍計執，遠離依他起，<c339>第三個</c339>工作也是很重要，

<c339>唯是一心</c339>，故名真如。前面的兩個修學──破遍計執、遠離依他起是一個否定式的；這個唯是一心是肯定。這裡等於是簡別二乘的偏空，說小乘學者跟大乘學者修空觀的差別：小乘的空觀是一個理性，大乘的空觀是心性，它有明瞭性。所以小乘的空是滅色取空，它不能夠有心識的活動。簡單的說，小乘的空觀不允許有明瞭性、不允許有生命現象，有生命現象就不是空，會障礙你的空。所以小乘的涅槃是不能有生命的現象，大乘的空是容許有明瞭性。這個明瞭性本身沒有錯，錯在妄念，你把妄念消失了，這個清淨的心性就是空，就是清淨心。

大乘佛法講空喜歡講清淨心，強調這個空是有明瞭性，所以唯是一心，它是現前一念心性。這裡強調：你修空觀不能斷除生命的現象，這叫真如。

當你修空觀時，你把一切的妄念消失了，心性的明瞭功能也消失了，那就不是真如，那是偏空涅槃。所以這裡唯是一心就是當你大死一番以後，重新再肯定──唯是一心。你要保存心性的本來面目，那個明瞭的功能要保存下來，你依止這個明瞭心性，才能夠從空出假，顯現八相成道，廣度一切眾生，這才是真如。否則你這個心性一斷滅以後，那就是一灘死水，什麼作用也生不起來。所以第三段也是很重要。這裡等於是把我們所謂的本來面目，把我們的家找到。

本論說是生起信心──大乘的信心，有信根本、信佛、信法、信僧，當然主要還是以根本，因為你根本沒有找到，你在三寶中所有的造作都是虛妄的。依止妄念所修的善業，都是虛妄的果報，還是在生滅門打轉。

禪宗有一個禪師叫做趙州禪師，說是趙州八十猶行腳，只為心頭未悄然。一般禪殼子的參學都是年輕的，只有趙州禪師八十歲還在那個地方到處參訪善知識，因為他心中的家還沒找到。這時遇到一位老禪師看他這麼年紀大了，就點他一下說：老老大大，云何尚無住處？說你年紀也不小了，怎麼還沒有找到一個安住的處所？當然這裡不是說身體沒有住處，是說你內心中這個家還沒找到。趙州禪師受到這句話刺激以後，他去打坐，開悟以後他說：「踏破鐵鞋無覓處，得來全不費工夫。」我原來向外到處去參訪善知識找這個家，結果原來家就在自己的心中，一念的迴光返照，就能夠找得到。

說「是故一切法，從本已來，離言說相，離名字相，離心緣相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如」，這就是我們返妄歸真的一個依止處。

/KEPAN/子二、顯法離言

前面這一段借言詮法，是假藉言說相來詮釋真如；這以下顯法離言，是說明我們親證真如的這個相貌，就是聖人的真如是什麼相貌：

/VERSE/以一切言說，假名無實，但隨妄念。不可得故。言真如者，亦無有相。謂言說之極，因言遣言。此真如體，無有可遣；以一切法，悉皆真故。亦無可立；以一切法，皆同如故。當知一切法，不可說，不可念故，名為真如。

前面的真如是假藉佛法的文字來表詮真如，這以下是說明真正的聖人跟真如接觸時是什麼相貌。這當中有四段，

第一段、「以一切言說，假名無實，但隨妄念，不可得故。」

言說相就是名言，所安立的法都是虛妄的，就是虛妄的名言帶動虛妄的分別，這就是所謂的情有理無。在凡夫感性的身心世界感覺到有，但是用真理去觀察是覓之了不可得──情有理無。

就是說凡夫遍計執的生起，在唯識學上說有三個次第：相、名、分別。就是由這個業力變現的相貌，善業強的人變現安樂的相貌，罪業的因緣變現痛苦的相貌。但是這個相是依他起，我們跟相貌接觸時，安立名言；有名言以後，就產生不同的情緒、感受；這時產生虛妄分別，正式落入遍計執。所以我們剛開始時，能夠證得真如時，心中沒有任何的名言，沒有話可以說的。

第二段、「言真如者，亦無有相，謂言說之極，因言遣言。」

這是遠離依他起的相貌。所以我們打坐時：我看到真如了。這個真如你有一個相狀可以看到，那表示你沒有看到真如，你還在隨順真如、還在趨向真如的過程中，真正的真如是沒有相狀。為什麼？它是言說之極，它是言說之外的，超越我們這些名言的。就說超越名言，那佛陀為什麼要依止名言來建立真如？因為用佛法的名言來消滅凡夫錯誤的名言，這個觀念很重要，禪宗說是就路還家。

我們凡夫顛倒太久太久了，佛法內心中有依止真如的體性，它是離言說相，離一切的差別相。但是佛陀要把自己親證的道理傳遞給我們有困難，這中間沒有一個橋樑，佛陀知道我們平常已經習慣用名言來吸收一些訊息，所以佛陀就安立名言說：什麼是真如？它是因緣所生法，我說即是空，這是悟入真如之道。我們剛開始就假藉這個名言來消滅我們錯誤的名言，最後再把這些佛法的清淨名言也消失掉，所以真如的真實相是沒有相，這個相是一個過程。

「此真如體，無有可遣；以一切法，悉皆真故。亦無可立；以一切法，皆同如故。」

安住在真如是什麼相貌呢？它不能有斷滅見，亦無有可遣，你把現前一念明瞭的心性消滅的時後，你找不到真如了；說這隻馬是一隻狂馬，你把這隻馬殺死了，你也找不到這隻良馬。所以修真如法者，不起斷滅見，但是也不起常見，亦無可立，以一切法，皆同如故。這個凡夫的執取也不可以。遠離凡夫的執取，遠離二乘的偏空，不能完全消滅，也不能一路的隨順。

所以修學真如之道，古德講出一個意境說：「覓即知君不可見，不離當處常湛然。」你要去追求真如，你一輩子找不到，因為你有要向外追求的心；追求真如不是追求，是消滅你的執取，所以覓即知君不可見。你說：那這樣這個真如是不是斷滅呢？不是！不離當處常湛然。當你能夠消滅心中執取時，它是處處顯現的。剛好這句話的意思，遠離兩邊順入中道，才能夠顯現真如。

第三段、「當知一切法，不可說，不可念，名為真如。」

真如親證的境界裡面，是不可以言說、不可以用心念去分別的：開口便錯，動念即乖，故名真如。是這個意思。不過這裡我們在修學次第上，大家要知道：你一開始一定是假藉因緣真如，然後再成就離言真如。就是說你現在要渡過這個大海要先假藉船，這個船不是彼岸，但是剛開始沒有船你不能到彼岸。你到彼岸以後，你過去假藉語言文字這些佛法都可以放掉了，因為你得到那個文以載道，那個道有了，這些文字都不需要了；但是這個道沒有生起之前，文字相是有需要的：這兩個，一個修學的過程，一個是究竟的圓滿。

/KEPAN/癸二、明隨順悟入

這裡是講隨順悟入真如的方法。

/VERSE/問曰：若如是義者，諸眾生等，云何隨順，而能得入？

前面把真如分成兩部分：一個是凡夫所認識的真如。我們說什麼是真如？我們就假藉佛陀的形容去觀照，得到一個真如。說我現在也有真如，但是這個真如叫依言真如。文殊菩薩心中也有真如，他的真如是離言真如。這兩個真如都不錯，應該怎麼悟入隨順呢？這以下說出方法：

/VERSE/答曰：若知一切法，雖說，無有能說可說；雖念，亦無能念可念；是名隨順。若離於念，是名得入。

一切法，雖說，而無有能說可說，這個是破所取相。你要能夠悟入真如，你對你心中的名言、所安立的法，你不能當真；所以剛開始你對於你的想法，是採取一種否定的階段。你剛出家時，你起很多念頭，你都不能相信；等到出家久了以後，你會發覺剛出家所起的念頭都是虛妄的；出家再久一點，你過去的念頭也是虛妄。就是我們剛開始對心念是採取否定的階段，慎勿信汝意，剛開始是這樣；因為你遍計執太強烈。雖念，亦無能念可念，這是破能取相。

前面是所分別的境界，這個是能分別的妄想，都要消滅，這個意思等於是修空觀，觀察所分別的人事境界，都是你的名言所安立的。說這個人非常的好，其實他好不好是一回事，這個好是你自己安立的、你自己說的；這個人非常不好，這件事情也是你自己名言所安立的、你自己說的：這個名言要消滅，我們虛妄的分別心那個心念也要消滅，這樣就是隨順真如了。等到連那個觀照的心念也不可得，所謂的離言真如，這時正式證入了。剛開始我們成就依言真如叫隨順，最後證入離言真如。

這裡的意思是說，我們剛開始在趨向真如時，是先成就它的空，然後再成就它的如實不空。

唐朝的福建有一座雪峰山，雪峰山住了一個雪峰禪師，在那個地方教化眾生。在北邊有一個禪師，從北方來參訪雪峰禪師，拔山涉水非常辛勞，到了雪峰山以後，他就頂禮雪峰禪師。雪峰禪師說：你從什麼地方來？我從老遠的北部而來。這時候雪峰禪師說：你老人家一路辛苦了。參訪的禪師說：我是仰慕道德，不畏辛勞。這時雪峰禪師說：你來這裡有什麼目的？我請善知識開演甘露法門，開演我解脫之道。雪峰禪師講一句話：出去！就走了。

這句話是說解脫之道，就是你心中有很多很多的妄想，妄想要活動需要有個橋樑，就是名言，你應該從你自己能分別的心跟所分別的名言中解脫出來，就是所謂的雖說，而無能說可說；雖念，而無能念可念，這個就是隨順於真如之道，這所謂的出去，就是出離自己的虛妄分別心。

/KEPAN/壬二、即示大乘體
/KEPAN/癸一、略標釋

大乘的體性，當然是真如。前面把真如的相貌跟隨順的方法說出來；這以下把真如的相貌，假藉言說再詳細的分別。

/VERSE/復次，真如者，依言說分別，有二種義。云何為二？一者如實空，以能究竟顯實故。二者如實不空，以有自體，具足無漏性功德故。

真如的本性，我們講到這些佛菩薩親證是離言說相；但是凡夫要假藉言說，假藉言說就產生兩種的差別：

一者如實空，以能究竟顯實故：如實空，他所空的是遍計執跟遠離依他起，空掉的是我們心中的名言分別。所以剛開始是先如實空，產生否定。

二者如實不空，以有自體，具足無量性功德故。如實不空是說：我們所對治的是遍計執，但是不能生起斷滅見，因為真如它是有體性的。凡夫的分別心這種遍計執是虛妄的、沒有體性；比如說你晚上看到一條繩子，你看到繩子心中出現蛇的影像，這就是你的遍計執，這個你不能說它有體性，這你自己捏造出來。這個人怎麼樣、那個人怎麼樣，都是你自己捏造出來的，本來都沒有的；但是真如不能說沒有體性。你這樣觀察，其實你只是隨順真如，因為它本來就有體性的。這個體性是什麼體性？具足無量性功德故。這裡我們也不能錯認消息，你說真如具足無量性功德故，那就不勞我修，落入自然外道。

什麼叫做具足無漏性功德故呢？簡單的說：諸法不自生，亦不從他生，不共不無因，是故說無生。以無生理，所以具足無量性功德故。

天台智者大師在《摩訶止觀》，他解釋這個性具說：什麼叫做自性具足無量功德？這個具足什麼意思？說一切法是不能自己生起。說你自己生起富貴，不可能。你自己不能生起富貴，那麼是他生？還是上帝、大梵天送給你的？也不是。他自己不能生、他也不能生，共也不能生。那不能生是怎麼生呢？是假藉布施的因緣，把你具足富貴的種性表現出來。假設你的自性沒有具足富貴的本性，缺乏內因力，你再怎麼修布施都不能產生富貴。沒有種子，你怎麼灌溉也不能生出水果，所以一定要有內因外緣。它這個無漏性功德就是說：你只要有造作，這個果報就會出現，一切法因緣生，所以叫做具足無漏性功德故。所以這裡是從否定了以後，再重新的肯定。

古德在開悟時，他講出一個相貌說：「心空如太空，豁然無所觸，一真法界中，寂照常安住。」這句話我們說明一下。這個人他所悟的理是什麼理？從他的話可以知道消息。心空如太空，豁然無所觸，他心中所安住的理是遠離一切的虛妄名言，心空如太空。但是他是不是斷滅呢？沒有斷滅。一真法界中，寂照常安住，他那個寂而常照、照而常寂的現前一念心性沒有消失掉。所以他的空是跟真如相應，不是跟小乘的偏空相應。

所以你要判斷這個人他修空觀時，最後的結果是不是保存在一真法界中，寂照常安住，這是非常重要的，簡別大小乘的空。大乘的空，它有跟如實空相應，它也跟如實不空相應，順入中道。

/KEPAN/癸二、廣釋成
/KEPAN/子一、釋空義

廣成中，把這個空跟不空作一個說明。

/VERSE/所言空者，從本已來，一切染法不相應故。謂離一切法差別之相，以無虛妄心念故。

說是空，前面講如實空是顯現真實性。什麼叫真實性呢？簡單的講一切染法不相應故，這句話太重要了。我們剛開始在斷惡時，我們在佛前發願從今以後誓斷一切惡，無量無邊顛倒熏習的煩惱跟罪惡都要消滅。誓斷一切惡，你要能夠經常觀察一切染法不相應故，何期自性本自清淨，這時對你斷惡有很大的加持力。就是這個煩惱跟罪業是虛妄相，是虛妄有的，不是本來有的，所以斷惡是可以做到的。什麼叫做清淨呢？就是染法它有沒有存在？有，但是它不相應。

謂離一切法差別之相，以無虛妄心念故，這個虛妄念沒有真實的染污到我們的本性。

/VERSE/當知真如自性，非有相，非無相，非非有相，非非無相，非有無俱相。非一相，非異相，非非一相，非非異相，非一異俱相。乃至總說，依一切眾生，以有妄心，念念分別，皆不相應，故說為空。若離妄心，實無可空故。

用四句偈把一切法不相應這句話開出來：它不是有相，不是絕對的有；也不是絕對的無；也不是非有非無，雙否定；也不是亦有亦無。不是非一、非異，也不是亦一、亦異，也不是非非一、非非異。就是離開四句的分別。

簡單的說，一切眾生，以有妄心，念念分別，皆不相應。這些妄心無量劫來雖然打了無量無邊的妄想，但是值得慶幸的是──我們的清淨本性沒有被染污。換句話說，恢復清淨本性是可以做到的，因為這些妄念沒有真正的相應。若離妄心，實無可空故，他所要空的就是妄念，這是空義。看第二個如實不空：

/KEPAN/子二、釋不空義

/VERSE/所言不空者，已顯法體空無妄故，即是真心。常恆不變，淨法滿足，則名不空。亦無有相可取。以離念境界，唯證相應故。

前面在對治我們的心念，是採取否定的方式，覓之了不可得；這以下再重新肯定。不空就是說，在我空、法空的相應之下，這樣的我空、法空的基礎的無生理體中，它具足常恆不變的清淨功德。換句話說，諸佛的無量功德莊嚴，我們是有可能成就的，有這種成就的可能性。只要我們願意布施，我們就能夠出現福報；只要我們願意持戒，就能夠成就尊貴身；只要我們願意忍辱，我們一定可以成就所謂的莊嚴：每一個因緣都能成就某一種功德，這個就是不空。

亦無有相可取，雖然這個不空是沒有可相可取，因為離念境界，唯證相應故。前面的染污法是偏重在斷惡，所謂的染法不相應是斷惡；這裡是生善。當我們觀察我們這一念心具足無量性功德，這時我們開始發起誓修一切善，生起善法是可以做到的，因為我們的本性本來就具足善的功能。這個就是我們在成就真如的兩個方向、兩個目標。

這裡講如實空跟如實不空，我們剛開始是先修如實空，先偏重在如實空；但是因為你在修如實空時，你也知道有如實不空。所以在修如實空時，他不把這個心性的本性斷滅，他只是破壞遍計執。所以這裡大乘修空觀，跟小乘有所不同。我們今天先講到這裡。

還有一點時間，我們把何期自性本自清淨這個觀念再解釋一下。這句話，對我們消滅妄想很有幫助，也就是說：清淨就是染法不相應。不相應這句話《楞嚴經》說：非和合、非不和合。我們也可以根據《楞嚴經》的這個方法作一個實驗。我們請維那師慈悲，大力的敲這個鐘。（當——）我們每一個人這個現前一念明瞭的分別心性，剛剛都聽到了一個因緣所生法，就是鐘聲。這個鐘聲所謂生、住、異、滅的這個生滅門，它本來沒有，後來生起了；生起以後，相續一段時間，變小，然後消失掉。我們的心跟這個鐘聲的關係是怎麼樣？說一切法不相應故。

我們這一念心是非和合、非不和合。你說這個心跟鐘聲完全和合，如果真的和合，那這個鐘聲應該永遠不消失；但是現在你聽不到鐘聲。所以你不能夠說它完全和合。你說它完全不和合，那你怎麼聽得到鐘呢？你說我跟鐘聲完全不和合，那你就聽不到鐘聲了。

所以是：非和合、非不和合。鐘聲如此，一切法亦復如是，它沒有真正的染污你的本性，但是它又如夢如幻的宛然存在，宛然存在它又沒有真實染污你的心體。這個妄念就是這麼回事。這個妄念跟我們的清淨本體就是這麼回事。你說它沒有，它有它的假名、假相、假用；你說它有，它又沒有真實的染污你的本性，它可以消滅。

這件事情就是這麼回事，大家體驗看看，這就是所謂的一切染法不相應故，這個觀念你要懂了以後，你發菩提心：眾生無邊誓願度，煩惱無盡誓願斷，法門無量誓願學，佛道無上誓願成。你以前發願，說是煩惱無盡誓願斷，你這個發願的聲音很小聲。你說：煩惱這麼多，我有很多慾望，怎麼斷？但是你說一切染法不相應故——何期自性本自清淨時，你可以很大聲的在三寶面前宣布：煩惱無盡誓願斷。沒錯！產生聖解。

所以菩提心的生起，是來自正見的資持，不是靠一點宗教情操仰信三寶，這個是不能持久的。這裡，我們透過教理的學習產生觀照。所以本論的發心，它是放在正見的後面，信成就發心、解行發心、證發心。就是說，你要能夠如實的觀照生命的染境因緣，才能夠真實的發菩提心，依止菩提心修六波羅蜜的法門，才能成就大乘的功德。我們今天就上到這裡。

有兩個問題我們作一個簡單的回答。

【學員提問】法師曾在課堂中提到：修我空觀、法空觀能夠悟入真如門，是悟入真如的一個前方便。中觀跟如來藏的思想差異，是否是在如實不空的認知？

【師父答疑】是的。中觀，它觀察因緣所生法，我說即是空。當然這個觀可以觀察色身，也可以觀察內心。當你用這個法來觀心時，你觀察你的心有善念、惡念，都是因緣所生法；但是你不一定會感覺得到這個清淨的本性具足諸佛的這種功能，你不一定有。所以智者大師把中觀的學派判作通教，通前通後。利根的人通前別圓，鈍根的人修中觀就通到藏教去了。假設你過去有大乘善根，你觀察因緣所生法，我說即是空，你能夠依止不空的體性而發菩提心；假設你小乘善根強，修空觀就把這個心性的功能消滅掉了，就入了偏空涅槃。這個大乘的空跟小乘的空差別在這個不空，沒錯。

【學員提問】請問真如跟如來藏之間的差別為何？是否代表都是清淨的自性，只是後者就生滅門來說？

【師父答疑】這個真如，在本論中的定義就是如來藏，後面會說到。法藏大師解釋說：這個如來藏就是真如，不同的名稱，但意義相同。

本論的緣起，諸位後面的學習會發覺：馬鳴菩薩解釋本論是講得非常詳細，他都是先略說，再廣說，就愈講愈深。當然你對教理的了解愈深，你觀察的愈肯定，你對你未來這個生命水流的方向何去何從，就更加的肯定、更加的正確。`;
