QXL.volNum = 10;
QXL.text = `
請大家打開《講義》第二十頁。

我們上一堂課講到覺，這個覺悟在本論中有三個覺：第一個是本覺，第二個是不覺，第三個是始覺。這三個覺我們可以從兩部分來說：

這個本覺是一個生命的總相，就是一個生命的本性，不管我們今天是放逸、是修行，它是不可能有生滅、不可能改變的，這個叫做本覺。

從本覺的一念無明以後就全體變成不覺，不覺在流轉中它是一個生滅門，本論中是依止阿賴耶識而有的，那麼阿賴耶識是生滅的。有時候我們的情緒會比較強烈、有時候會比較淡薄，所以這個不覺它是有生滅變化的。我們不覺中遇到痛苦，就開始歸依三寶發心修行，內心就產生一個對治不覺的功能，這個叫做始覺。當然始覺也是一個生滅門，他有時候道心強、有時候道心羸弱。

所以本覺是從本性上說的，始覺跟不覺是從緣起上說的，它有生滅的作用。

關於這一點蕅益大師講一個譬喻能夠幫助我們了解，說是我們剛開始是一灘平靜的水，這個水是非常的平靜，沒有任何的波浪；後來這個水為無明風所吹，整個水全水成波就變成了波浪，波浪後來又慢慢的恢復成平靜的水。也就是說剛開始是一個本覺，變成波浪；慢慢使令這個波浪，再澄靜又恢復到水。

換句話說從本覺的角度，這個濕性是永遠沒有改變的；但是在對治生滅的波浪中有強弱的差別，就安立了所謂的覺，始覺跟不覺這樣一個互相的對立，是這個意思。

/KEPAN/卯二、別辨本始二覺
/KEPAN/辰一、辨始覺義
/KEPAN/巳一、總標淺深

前面是把本覺跟始覺作一個總標，這以下就各別的詳細的解釋本覺跟始覺的相貌。分兩科，先看第一科辰一、辨始覺義，先說明始覺。始覺中分成三小科，先看巳一、總標淺深，我們始覺的觀照智慧有淺深的差別。那麼淺深是怎麼安立的？

/VERSE/又以覺心源故，名究竟覺。不覺心源故，非究竟覺。

這個覺當然就是有對治妄念；那麼對治妄念，什麼樣的情況是一個徹底的對治，什麼情況是一個部分的對治？這裡馬鳴菩薩作一定義：

當我們覺照的功夫能夠直接觀照到我們內心的根源，不是只看到枝末而已，是看到根源。就說我們剛開始觀心時，是觀照到我們內心中有兩種功能：一個是道心，人心惟危，道心惟微，我們剛開始先看到我們的道心，隨順於戒定慧的道心，所謂的始覺。我們也會看到我們內心深處有一種私慾，個人的慾望與不覺這兩種功能。當你只看到這兩種功能，你沒有看到內心的根源。當我們把這兩種功能撥開以後，看到了清淨本性，那這樣你就是究竟覺了，對治一切的妄念。如果我們今天觀心，只是觀察到善念、惡念的過程，就是不覺心源故，非究竟覺，它也是覺，但是它只是對治一部分的妄念。

所以以覺心源跟不覺心源來安立究竟跟非究竟。這個就是從觀心的角度來安立這個覺照，這個意思就是這個覺。馬鳴菩薩這裡露出一個消息：這個覺不是向外。你去看看這個人怎麼樣、這個事情怎麼樣，這個不是覺；它這個覺是迴光返照，從你內心觀察的淺深來安立你覺照的淺深，有這一層意思。這一段是總標。

/KEPAN/巳二、詳示淺深

我們講觀照力是本論的第一個功德，一定先有一個對生命的正確觀照，才能夠產生正確的希望，產生正確的修行行動。這個觀照力的淺深，本論提出四種觀照力，法藏大師把這四種觀照力分成：生、住、異、滅。我們前面說過什麼叫覺呢？就是對治妄念，對治無明妄念。這個妄念的對治，從粗到細有生、住、異、滅。就是說滅是最粗，異是其次，住再次之，最微細的是生相。從無明的相貌中，我們對無明的消滅，由淺入深，分成生、住、異、滅四種觀照。先看我們剛開始在對治妄念，先對治這個滅相。

/SECTION/一、滅相（業果的覺悟）

/VERSE/此義云何？如凡夫人，覺知前念起惡故，能止後念令其不起。雖復名覺即是不覺故。

我們剛開始生起人天種性的覺照。什麼叫人天種性呢？如一般的凡夫，我們剛開始學佛時，內中是跟著感覺走的一個生死凡夫；我們相信了三寶以後，我們開始第一個深信業果，知道生命有快樂的果報、有痛苦的果報，這個果報不是上帝創造的、也不是自然產生的，是由業力所變現。你有這種善業決定招感安樂的果報、罪業招感痛苦的果報的理解，用這個觀念來覺知我們的念頭，前念起惡故。

我們一個人沒有經過佛法的教育，你這個心跟境界接觸時，難免會生起惡念，或者貪慾、或者瞋恚、或者嫉妒、或者高慢，你沒有經過佛法的訓練，你的生命是沒有方向。克己復禮，你不可能克制，你這個妄念就不斷的隨順放縱，你今天這樣做，你明天還是這樣做，你後天還是這樣做，你走上一個不歸路。你說佛弟子學佛以後，還不是起惡念嗎！是的，但是佛弟子起惡念，這裡跟一般人有所不同，他能夠覺知前念起惡故！

當他起了惡念以後，晚上他到佛堂去拜佛時，內心中歸依三寶，念佛、念法、念僧，把佛法僧三寶清淨光明的所緣境現前，這時內心中會產生一個非常珍貴的自我反省的力量，開始知道今天起了惡念。惡念最怕的就是你去觀照到它，因為你一觀照到它時，就在對治它了。你這樣能夠不斷的產生反省，就能夠克制後念的展轉相續，使令它慢慢的不再生起。這樣雖然叫覺，但是相對於後面的覺悟來說，它還不是非常徹底，所以它是一個不徹底的覺悟。

什麼叫不徹底？我們剛開始修學佛法，都是在表相上學佛法，我們剛開始，噢，原來什麼事情不要向外看，開始去觀照自己的心，觀察自己的心有善念、有惡念，這時我們開始生起慚愧心，深信業果，崇重賢善，輕拒暴惡，在內心中：開始呵責我們的惡念，這個惡念是不對的，這個惡念會帶給我痛苦；這個善念會招感安樂的果報，我應該多多去做。對於惡念的呵責，對於善念的讚歎，剛開始就是這樣來修行。但是這個惡念是有真實性的，它是常？是無常？不明白。這個念頭的本性到底是空的？是有自體的？它的一個真實本性，我們還不能明白，但是知道惡念有它的作用，善念也有它的作用，所以剛開始這個覺是一種表相的覺悟。

但是剛開始這個是非常重要的，修行就是從這裡啟動。古德說：眾生畏果，菩薩畏因。我們從一個流轉的個體生命來說，在整個生命的水流中，我們每一個水流的一個點，都在受用果報，都在創造業力，就是說這個水流有它的前因跟後果。也就是說，我們過去由某一部分的業力而成就這個果報，我們依止這個果報去受用時，又創造一個業力。事實上我們這個個體生命就是處理兩件事：第一個是受用果報，第二個是造作業力。

學佛的人跟一般人，對於造業跟受果的偏重有所不同。一般人他是偏重在果報的受用，眾生畏果，他在乎我現在的果報體不能有痛苦出現。當今生的果報有痛苦時，他要想盡一切辦法加以排除，甚至於不惜造作罪業，他對於因地造作罪業他不在乎的，造作這個罪業以後會招感來生的果報，他完全不會去在乎，他可能也不知道。他的心點點滴滴在這個果報上計較，這是一個非常可憐憫的眾生。

一個學佛的菩薩他覺悟以後，他知道今生的快樂痛苦、莊嚴美丑這件事情，已經是沒辦法的事情，這是過去的業所招感的，逆來順受把它度過去就罷了，這誰也不能改變的，自己造業自己承當，自己敢造業，自己就是只好去承當這件事。但是現在的重點是說：我今天遇到這個果報，可能是順境也可能是逆境，這不是重點；重點是我用什麼心態，在這個順境、逆境中，去創造一個什麼業？

菩薩在生命中，他對果報是一笑置之；當他被人誨謗、被讚歎，他覺得這個東西是過去的業所招感的；但是他面對這個果報時，他開始注意他的因地，他用什麼樣的心態、什麼樣的行為，來面對這個生命，開始注重因地。一般的凡夫重視他的結果；修行人重於他的過程，結果不重要，這個結果是前生的業所招感，重點是我如何的來面對這個生命過程。

當你內心中開始覺照你因地時，我們可以說你的第一道的觀照力正式起動，這叫人天乘的覺悟，開始去對治你的惡念、讚歎你的善念，剛開始學佛是這樣生起的。我們看第二段：

/SECTION/二、異相（無常的觀察）

/VERSE/如二乘觀智初發意菩薩等，覺於念異，念無異相。以捨粗分別執著相故，名相似覺。

前面是一個凡夫的觀照，是從善念、惡念的觀照；這裡更深，是二乘種性的觀照，或者是初發意菩薩，覺於念異。前面是念頭消失以後，滅了以後才觀照。這裡是在念頭的異，就是變化時，從念頭的變化觀察到念相，這個等於是無常觀，就是我觀察我的心念是無常。我剛出家時的心情，是一個心情；出家十年以後，心情有變化了，發覺這個念頭是會變化的。再微細一點，你發覺同一件事情，你昨天的想法跟今天有所不同，你就知道這個念頭有變化相。

從無常中，就觀察到我空的智慧，念無異相，就觀察到我們心念中沒有人我的對待相；心念只是一種由業力所變現的作用，當然可能是善的作用、可能是惡的作用，這當中沒有一個常一主宰的我。就你能夠觀照到我們心念中沒有異相，就是沒有人我的差別對待，就是我空。就是你的個體生命，你是一個心念，我也是一個心念。譬如說我跟你，不要這樣講，就是你是由你的心念來主導你的生命，我也是由我的心念來主導生命，這樣以捨粗分別執著相故，名相似覺。這時能夠棄捨一些分別的我執，這樣安立做相似覺，或者講隨順，隨順於覺悟。這裡從前面的一個善惡念，由慚愧心引生的善惡念，再提升到無常、無我的智慧。

無常、無我智慧的觀察，我們解釋一下：

/SECTION/（一）觀心無常

我們剛開始就是觀心無常。我們平常在日常生活中，我們的心是向外攀緣，心隨境轉，在外在的人事因緣中活動；在人事境界的活動中，我們就產生很多的得失、愛憎、取捨，就會忽略我們的心是怎麼變化。所以我們觀心無常，剛開始一定是在靜坐時，你才會發覺得到，你靜坐時，就會發現到心是無常。就是說你的心本來在念佛，念一念佛號丟掉了，就到處攀緣。你剛剛在念佛是一個念佛的心，現在變成一個打妄想的心，其實這是有變化的。平常時打妄想，有時候起善念，有時候也會為三寶做事；有時候生起私慾，要滿足自己的慾望。所以你一靜坐時，你就知道你的心是不斷的變化變化，從這個變化你就知道：我的心它不是一個常態，不是一條線，它是由很多的點所構成的。

/SECTION/（二）無常故苦

那麼無常故苦，你從無常中作一個結論，原來整個生滅的本質是苦的。就是說：無常是一種不安穩性，你不知道明天會發生什麼事，你不能規劃人生，你也不知道你下一剎那會發生什麼事，未來的生命充滿了不確定性、不安穩性，佛法說苦是講這個苦。你說我們一般苦是觀三惡道苦，但是三惡道的苦不能普遍三界，所以佛法講的苦諦是講無常。因為身為一個有情眾生，每一個人都是想要追求安穩。為什麼一隻狗、一隻螞蟻再怎麼辛苦也要找一個家？一個在家人他一工作，第一件事是買一棟房子？理論上來說，你用買房子的錢的利息去租房子就夠了；但是不行，一定要買房子：因為眾生是追求安穩。

但是不幸的是，我們這個個體生命是違背安穩，因為它是生滅變化。所以我們感覺到在整個流轉的生滅中，我們很難找到一個安穩，我們知道因為無常，所以生命是苦。

/SECTION/（三）苦即無我

苦即無我，從生命苦的本質中，我們知道我們對生命沒有主宰性。假設我們對生命能夠決定自己的性質，我應該可以讓自己的生命不斷的快樂，如果我能夠決定、能夠主宰的話。

/SECTION/（四）無我故空

所以我們對生命基本上是一點法子也沒有，我們只能夠任由生命的水流不斷的帶著我們流動，這樣講無我就是空，就看到了一個我空的真理，悟入我空的真理。

當你對內心的觀照能夠生起無常、無常故苦、苦即無我、無我故空，這時你的心是起動了二乘的觀智。我們前面說過，它每一個覺悟都能夠含攝一切法，能夠引生一切法：當你起動的是人天的觀智，它帶動你的生命是人天的安樂果報；當你起動的是二乘的觀智無常故苦，這時你的生命就正式啟動一種偏空的涅槃。所以你起動不同的覺照，你生命中就引生不同的果報。再看第三：

/SECTION/三、住相（空性的觀察）

/VERSE/如法身菩薩等，覺於念住，念無住相。以離分別粗念相故，名隨分覺。

這裡是更高深的觀照，是法身菩薩。法身菩薩的觀照當然更深入，他能夠觀察到心念的住相，不必等待心念有所變化，他在這個心念安住時，觀察到這個心念是沒有住相，這個住相不可得。遠離這種分別的粗念相故。這個粗念相，法藏大師說是分別法執。前面是分別我執，這裡連法的執取也消滅了，叫做隨分覺，叫分證本覺。

這個住相怎麼說呢？住就是安住。我們剛開始的心是散亂的，而我們從散亂中就很容易發現這個變化相，我們剛開始知道散亂心是不對的，是隨順於苦惱的。我們開始去憶念佛陀、憶念佛號，剛開始不能念要他念，不能專要他專，用強大的如理作意，來強迫這一念躁動的心，一次又一次的安住在佛號上。我們也說過心是無自性的，無自性就是你能夠變化；你怎麼去做，這個心就有所改變，在佛號中，這種躁動就能夠明瞭寂靜的安住，這時心中就只有一個相，法界一相，就是佛號，這個就是類似於住相。這個住相，你說我前一念是佛號，下一念也是佛號，你很難觀察無常，它沒什麼變化，它是在住，這時法身菩薩知道這個住是無自性的。

這個無自性的空是怎麼安立呢？它不是從無常，它是從緣起性空──因緣所生法，我說即是空，它假藉因緣所生，所以它本性是空。假藉因緣所生這句話，我們應該會歸到當初智者大師在《摩訶止觀》講到無生的觀念，智者大師發明無生是根據：「諸法不自生，亦不從他生，不共不無因，是故知無生。」怎麼知道一切法是無生呢？無生，簡單說就是無自性，講自性空。

剛開始先假設我們在念佛，譬如說我在念佛，我生起一個念佛的心念，這個念佛的心念先假設它有自性，那念佛的心念是自己生——自生。假設念佛的心念是自己能夠生起，它就有無窮盡的過失，它應該不斷的念佛，因為你帶動了一個念佛的心念，它自己又生起第二念，第二念又生起第三念，因為它能夠自生，念佛的念應該是無窮盡的。但事實不然，我離開佛堂，我就不念佛了，所以它自生是不能成立的。說是他生，阿彌陀佛把佛號送給你，或者是大梵天、或上帝把這個念佛的心念送給你了。說是他生，而自他體別，他跟你的體性不同，他怎麼能夠送給你呢？這個不合道理。說是共生，自也不能生，他也不能生，合起來更不可能生。所以我們知道我念佛的這個心念，也不是自己生起，也不是別人給我的，不是自生也不是他生。

那是怎麼生？是因緣生。什麼叫因緣生呢？簡單的講有三種因緣：第一個，你內心中有這個種子，你曾經聽聞過淨土的法門，有這樣的一種善根種子；第二個，有環境的刺激，你可能看到佛像、或者吃到苦頭，還有所緣境的增上緣；第三個，更重要的是作意，你一定要有個如理作意，先有這個種子，再跟環境接觸時，如理作意再把它起動，把這個本來在睡眠狀態的種子，起動成一個現行，這叫作意。所以你念佛的心念，是由種子、所緣境跟作意的心所三個和合而生的。

三個和合而生，它是因緣生，它的本性是空。說你現在有一千塊，這一千塊不是你的，這不是你的是誰的呢？你向某甲借三佰塊，向某乙借三佰塊，向某丙借四佰塊，三個因緣加起來；但是這個三個因緣都討回去，消失時，你這個念佛的心就消失了，所以說是自性空。你能夠在住相時，就觀察它是因緣生無自性空，這時叫隨分覺，不必等到它變化，這時空性的觀察更加的徹底，這個是法身菩薩的觀照，在住相的觀照。看第四生相的觀照：

/SECTION/四、生相（無生的觀察）

/VERSE/如菩薩地盡，滿足方便，一念相應。覺心初起，心無初相。以遠離微細念故，得見心性，心即常住。名究竟覺。

菩薩的因地窮盡，這個窮盡應該說是等覺後心。為什麼會窮盡呢？因為在三大阿僧祇劫中，滿足一切六波羅蜜的方便，你廣修六波羅蜜的方便法門，到等覺後心時，就進入到這個金剛心，在這堅固的禪定中，生起一念的無生智慧，這時覺心初起，心無初相。

這時你無生的智慧觀照到你最初的生相，前面是看到住相，這時是看到你一念不覺最初那個一念妄動的生相。你觀察心無初相，觀察妄相最初的那個一念妄動，原來是覓心了不可得，這時遠離一切微細的妄念，悟入到我們清淨的本性。這時心即常住，一切顛倒的生滅心完全脫落，這時就是所謂的究竟覺。是從最初的生相無明去觀察生相不可得。

生相不可得這句話，我們解釋一下。

禪宗的傳法公案說：五祖弘忍大師年紀大時，要把祖位傳給他的弟子。禪宗的傳法不是看戒臘，是各憑本事，看誰的觀照力最為深入、最為圓滿，以觀照力來判定由誰能夠接祖位，領導大家繼續修行。在諸位弟子中，有兩個弟子就提出他打坐修止觀的心得報告。

神秀大師說：身是菩提樹，心如明鏡台，時時勤拂拭，莫使惹塵埃。我們在觀照我們的生命，當然是不能離開因緣所生法。就著個體生命的身心世界，神秀大師說：我這幾十年的用功心得，我們的色身是菩提樹，我這個色身可以布施、持戒、拜佛，像菩提樹能夠生起菩提的水果，我這個色身能夠造很多的善業。那我這一念心就像一個清澈光明的鏡子，我每天告訴自己什麼是該做、什麼是不該做，用善惡的觀照來引導自己。總而言之，我對身心世界一言以蔽之：時時勤拂拭，莫使惹塵埃。我偶爾也會起起惡念灰塵，但是我用佛法的戒定慧不斷的時時勤拂拭，莫使惹塵埃。

我們可以看的出來神秀大師不可思議，是非常用功的一個修行者。當然用功是一回事，他的加行力很強；但是觀照力不足，他只是一種善惡念對治的表相的觀察。所以這個心念，它的本來面目是怎麼回事，就沒有明顯的說出來，這是比較遺憾的地方。

六祖大師也講出一個修止觀的報告，他說：菩提本無樹，明鏡亦非台，本來無一物，何處惹塵埃。本來無一物，何處惹塵埃這件事情，就說出了整個禪宗最重要的清淨傳承。就是說真正的觀照，是觀照到我們這一念心的最深處是本來無一物的，覓心了不可得，我與汝安心竟。

這個覓心了不可得，我們簡單解釋一下。

說是無生，觀察它生相不可得。《金剛般若疏》對無生這個觀念，提出一個非常重要的開示：若法先有後無，諸佛菩薩即犯殺罪。說我們這個心念本來是有一個自我的個體，先有；後無，佛菩薩硬生生用我空觀，把這個我消滅了：假設是這樣的話，諸佛菩薩犯了殺罪。這個東西本來是有一個我，我們用空觀七觀八觀把這個我消滅了，你說佛菩薩是不是犯了殺罪呢？把一個有情眾生殺死了。

其實不然，本來無一物，何處惹塵埃。就是本來就沒有一個我，我們眾生一念顛倒自己捏造一個我出來；佛菩薩慈悲，告訴我們修無生觀，把這個虛妄相消失掉，還他本來面目。《維摩詰經》說：「法本不生，今則無滅，是無常義。」我們怎麼知道無生？就是一切法本來不生，現在也就沒有所謂的滅。也就是說它是虛妄的生、虛妄的滅，這就是所謂的生相不可得，這句話是這個意思。

所以我們修我空觀，就是說本來就沒有一個我，何期自性本自清淨，我們現在有這個我，是自己的感覺創造出來的，我現在在這個講堂，我說現在這個講堂中有一條龍，但事實上沒有龍。我經過正確的指導以後，這條龍消失掉了。所以這條龍是怎麼有呢？就是但有言說，都無實義，這個遍計執的名言安立的。

我們平常所謂的妄念生、住、異、滅也都是這個意思，情有理無，在眾生的妄情裡面它顯現，但是他醒過來以後它消失了，不要說他醒過來，你還沒有醒時它也是沒有，所以這個叫做無生。說是一念的相應慧生起時，覺心初起，心無初相，這是初相不可得，覓心了不可得，這時得見心性，心即常住，一切的顛倒的生滅相全部脫落，這個時後叫究竟覺。

以上，馬鳴菩薩把眾生的覺悟，由淺入深分為四種，我們起動哪一個覺悟，就會產生不同的果報，是這個意思。最後總結：

/VERSE/是故修多羅說：若有眾生，能觀無念者，則為向佛智故。

這段是引用《楞伽經》。這個修多羅，馬鳴菩薩在本論中，他很歡喜引用《楞伽經》，《楞伽經》上說：我們一個眾生，能夠觀察我們心念是無念，這樣就趨向於、隨順於諸佛的智慧。

這個無念我們前面也說過，就是雖念，亦無能念可念，雖然有念，但我們觀察它這個念是假藉因緣所生，它的本性是畢竟空寂的，它沒有生相、沒有住相、沒有異相、沒有滅相，雖念，而無真實的能念可念，這時隨順於智慧。

這裡，我們要作一個補充說明。本論中講到覺悟有四種，我們也就知道最後的覺悟，所謂的覓心了不可得是最圓滿的覺悟。不過這裡蕅益大師的開導，也有這一層意思，他以權實不二來作一個總結。從根本思想上，我們認同何期自性本自清淨。從對治的角度，我們也不妨採用前面業果的觀察、無常的觀察、空性的觀察來對治。

也就是說信根本，以無生的清淨本性依止點當根本；但是從對治的角度，也要有業果、無常、空性的對治。所以說有權法、有實法，你這樣操作才能夠圓滿，這裡要注意。

/KEPAN/巳三、明淺深無性

前面是從因緣的角度，由淺入深安立了四種的差別；這四個差別再把它會歸到一心，它本身是沒有真實的體性，完全是依止一心安立的。這當中有三段：前面二段先安立覺悟跟不覺的因緣，第三段再作一個總結。先看覺悟的心念，

/SECTION/第一段、覺悟的因緣

/VERSE/又心起者，無有初相可知。而言知初相者，即謂無念。

我們這個心的生起，是始覺的觀照智；觀照智真實生起時，我們觀察沒有真實的初相，這個初就是生相不可得，覓心了不可得。覓心了不可得，就是說，「而言知初相者，即謂無念。」就是說我們觀察到我們最初心念的初相，不是你看到的初相，而是看到初相是不可得。看到初相不可得，我們就認為你了解初相。什麼叫觀察初相不可得？譬如說你做夢，夢裡面你一念顛倒的夢心，變現很多人事的因緣，因緣都在夢境裡面，到處的攀緣受用，你心中也出現很多的愛憎取捨，各式各樣的感覺。當然我們有兩個方法：

第一個就是讓夢慢慢醒過來，這個是對治法，前面所謂凡夫的覺照、二乘的覺照、菩薩的覺照，這是對治法，讓這個夢慢慢的醒過來；

第二個是根本法門，就是觀察覓心了不可得。就是說你在做夢時，不必等到夢全部醒，在夢境中你就知道這個夢是不真實的，它只是假藉一念無明的夢心而變現的。

就是說你現在還沒有成佛，就知道你現在的妄想本性是空的。在《楞伽經》上說：「諸佛所知，轉相傳授，妄想無性。」三世諸佛把所覺悟的究竟真理，展轉的傳給弟子。傳授什麼真理呢？妄想無性。就是說你不要對你一時的心念的感覺太認真，它不是真實的；我們真實的體性，是我們的清淨本性，是這個意思。

/SECTION/第二段、不覺的因緣

/VERSE/是故一切眾生，不名為覺。以從本來，念念相續，未曾離念，故說無始無明。

前面是講覺悟，這裡是講不覺。一切眾生的顛倒，無始以來，是念念相續，未曾離念。也就是說我們從最初的清淨本然一念不覺以後，這個不覺的念頭一啟動以後，糟糕了！就停不下來。念念的相續，未曾離念，這個就是所謂的無始無明。這就是為什麼生死會不斷的相續，就是我們的妄念沒有停止；我們的妄念不停止，你積集再大的善業也沒用，這個善業會讓在你未來的生命中，暫時成就一個安樂的果報，但是它對於妄念沒有對治的力量。所以講念念相續，未曾離念，這個就是所謂的無始無明，沒有開始，也就沒有結束，這個是講流轉門。最後作總結：

/SECTION/第三段、總結

/VERSE/若得無念者，則知心相，生住異滅，以無念等故。而實無有始覺之異，以四相俱時而有，皆無自立，本來平等，同一覺故。

我們能夠成就無念的智慧，觀察覓心了不可得的智慧，你就知道真實的生住異滅其實跟清淨的本性是相等的，它不離開我們清淨的本性，這是就著對治無明由淺到深：第一個是對治無明的滅相，第二是對治無明的住相，第三個是對治無明的異相，最後是對治無明的生相。約著對治義，安立四種智慧。從本性觀察，其實這四個相本來平等，同一覺故，都是一念的清淨本性所顯現出來的。所以前面是安立四種覺悟的差別體相，這裡把它會歸到一心。

這裡蕅益大師的意思是說，馬鳴菩薩為什麼會歸到一心，就是方便有多門，歸元無二路，他怕我們在觀照裡面產生好壞的分別──你這個智慧只是業果的智慧而已，我是無常的智慧。不要這樣講，契機就是妙法，對治就是良藥。你有這個病，就老老實實吃這個藥；你沒有這個病，就不要吃這個藥。

就像蕅益大師在這裡說：我們在做夢時，在夢中我們掉入到大海中，這時要醒夢怎麼辦呢？你可以用喊叫的方式，有時候用雙手的震動、用雙腳的踢拍。有些人適合用喊叫的方式讓自己醒過來，有些人用雙手的震動醒過來，有些人是用雙腳的踢拍醒過來，醒過來的效果是完全一樣。

所以我們不要說：你修唯識學的，你修天台宗的，你修中觀的！每一個法門都好，能夠對治你的妄想的都是良藥。所以這裡消滅我們對於法門的執取，有這一層意思。就是你有什麼病，你就需要這個藥，是這個意思。

當然以第四個無生觀，信根本何期自性本自清淨，你深信一切的生滅門都是後來才有的，這是根本思想。以這個為根本，以前面三個為對治，就是找一個你適合的法來加以對治，這就是我們講到這個覺，始覺智是有四種智慧，這四種智慧的差別相，跟它的共同體性先把它說出來。

好，我們今天先到這裡。以下我回答幾個問題。

【學員提問】我們如何讓自己養成圓頓種性，遇境隨緣，如何作觀？

【師父答疑】圓頓種性，從本論上來說，就是你能夠正念真如，不要隨順無明。

一個種性的產生，講到種性當然就是生滅門，生滅門就要有所造作。只有一個方法：你就是不斷的聞思，就是你的觀照力。這個觀照力不是說你兩個眼睛一閉、雙腿一盤就有觀照力，你這種觀照力是跟著感覺走，靠直覺觀照，佛法是不同意的。佛法認為所有的觀照都必需有清淨的傳承，就是這些佛菩薩的法語你都是要學習，依教起觀。

就如何養成圓頓種性？只有一個方法──多聞熏習，如理思惟。這樣的熏習，遇境逢緣你就知道觀照，觀照真如，簡單講就是正念真如。真如有二個觀：一個觀察如實空，一個觀察如實不空。觀察如實空跟觀察如實不空，這個調配一般是比較困難。比較困難，我自己的經驗提供給大家參考一下。

我有一次看到弘一大師一段法語，給我很大的啟示。弘一大師開示說：我們調心要知道中道。什麼叫中道呢？就是你處在順境時，要用收斂法來調心，心志得意滿，容易出差錯。所以遇到順境時要收斂，要不斷觀察自己的不足。處在逆境時用開闊法，告訴自己沒關係！還有希望，一時的成敗不能夠論英雄。就是說你就是調。弘一大師這一段法語，我突然間有一種感覺，其實我們在觀照真如也是這樣。

我們在行菩薩道時，有時候有所得的心太重，這時觀察如實空：何期自性本自清淨。你把這句話念三遍，這時你這種有相的執取，就會慢慢的鬆脫。所以你如果有所得的這個得失心太重，雖然你也是修善為公為眾，但是得失心重，就使令你不安產生情緒，這時你在正念真如時，就偏重在觀如實空這部分。

有時候你的心太沉悶了，你看到眾生的苦你沒感覺，看到諸佛菩薩的功德莊嚴也沒感覺了。糟糕了！這時就要觀如實不空：如來藏具足無量性功德故。你不應該沒感覺，你要積極的行善，啟發你自性本具的功德。

所以我們剛開始不要說正念真如，觀察這一念心即空、即假、即中。即空、即假、即中那是不思議境，能夠觀是最好；或者我們也可以用對治觀。你太過於躁動，觀如實空，以如實空對治止。太過於沉默時，觀如實不空來起動你的悲心，起動你要修善的心。遇境逢緣就是這樣觀，看你的心是什麼情況方便對治，使令這一念心，譬如調弦，鬆緊中道，合乎中道。

【學員提問】假設有人過去式的習氣是布施，今生是富有，可是今生慳貪（過去的習氣跟今世不同），為何會退轉，什麼原因造成退轉？

【師父答疑】退轉的原因就是環境造成的。我們一個人有錢了以後，理論上你很有錢以後應該布施，其實剛好相反。我們一個人愈有錢愈慳貪，所以佛菩薩他不同意我們累積財富。你有一萬塊時，你的心情會想到十萬塊；你有十萬塊時，你的心是看著一百萬；一百萬看著一千萬。我們心中沒有錢的人，很容易布施，反正我這是小錢，布施出去算了。所以說我們在貧窮的階段，我們知道貧窮是因為慳貪所造成，會起慚愧心。但是你做一個轉輪聖王時，你的心情有變化，開始放縱享受，把福報享盡了，因為慳貪的業力，來生做一隻螞蟻、一隻狗。好不容易從狗變成一個乞丐，這時你又起慚愧心，又開始修善，修善以後又變成轉輪聖王，又開始慳貪。這個生滅門就是這麼回事。

等到有一天你聽聞了佛法，真實的明白生命的真相，起動你認識的覺悟，用覺悟來引導你──從今以後不再跟著感覺走，你的生命才有決定性的改變。否則我們就是隨著外在的環境，心隨妄轉，流轉三界中沒有一個依靠。為什麼會退轉，就是環境的變化，心情就會產生變化，是這樣。

【學員提問】如何達到離念的境界？

【師父答疑】你說這個離念，應該是講無念。

我們剛開始的念是很多的念，所以剛開始不要直接進入無念。就是你剛開始的心先把多念轉成一念，就是念佛用一個佛號這個有相行，所以我們後面會講到他修真如三昧，一開始先修一相三昧。就是剛開始先用一個念來攝受你的妄想，慢慢慢慢你心中就是一個念一個佛號。心於佛號專一安住，心於佛號相續安住。這時你再用因緣所生法，我說即是空，把佛號捨掉，你就容易進入無念。剛開始先進入一相三昧，再進入所謂的無念三昧，有一個次第。

【學員提問】我們平時行、住、坐、臥、穿衣、吃飯、上殿、作佛事中，如何依止真如，不依止自我意識？

【師父答疑】要依止真如，你要有觀照力。我們可以這樣講：從生滅心的角度，我們生滅心有兩種功能：一個是覺，一個是不覺。

我們老實一點的說：平心而論，我們不覺的功能是強大，覺的功能是薄弱。所以你要是觀照力不現前，你一定隨順自我意識。你可以回想我們過去的待人處事：這件事情跟我們的利益沒有關係，你會很公正的該怎麼做就怎麼做；但是這件事情跟你的利益有衝突時，你的心情就會有一些變化。就是在該怎麼做的範圍之內，你心中有一個自我意識會來干擾你，干擾你時，你就會做出一些不應該做的事情。就是有一個自我意識，就是我愛執愛著這個我，保護這個我，那你做的事情，就會有一些不合常理的事情出現。

所以消滅自我，你就是保持一個平常心，我不可得，該怎麼做就怎麼做。當然這個是觀照力要現前，才有辦法做到。

我平常個人有一句話自我勉勵，就是凡事不必在我，隨喜一切功德。就是說在我們整個的個體生命中，不要把這個我看得太重，就是沒有你，太陽還是會從東邊昇出來。就是這個生命是多元化的生命，不必什麼事都要你去做，別人做我們也隨喜功德，以一種隨喜無量善法的心情，你那個自我意識就會慢慢的萎縮、慢慢的萎縮下去。這是要很多的方便，當然這都是要觀照才有辦法生起。

我們今天就講到這裡了。我們講到觀照，我希望諸位掌握兩個重點：

第一個是從本性的觀照，就是它的本來面目是什麼？父母未生之前什麼是我們本來的面目？我們要先了解當我們還沒有動一個念頭之前，我們的本性是什麼？就是真如門。

第二個觀照就是生滅門，當我們動念以後，已經變成一個流轉的個體生命，我們如何從個體生命中，所謂的覺跟不覺中生起觀照？因為我們必須要面對現實，我們現在已經不是在本來面目，我們內心中阿賴耶識累積很多覺跟不覺的功能，我們應該如何返妄歸真？這談到緣起。

所以整個《大乘起信論》有兩個重點：第一個是對本性的觀照，第二個是對緣起的觀照，能夠掌握這兩個觀照，就能夠正確掌握大乘的正見。`;
