QXL.volNum = 11;
QXL.text = `
請大家打開《講義》第二十二頁，辰二、辨本覺義。

法藏大師在註解本論時，把本論的修學宗旨歸納成──要我們對大乘法生起信、解、行、證四種功德。什麼是大乘法呢？簡單的說就是我們眾生的現前一念心性。因為廣大的十法界因緣果報的緣起法，都是我們這一念心所變現，所以眾生的心就是大乘法。

大乘法應該如何建立信心呢？從本論的開導，就是我們在凡夫時，對我們這一念打妄想的心，只要你能夠相信你這一念心具足體、相、用三大。我們平常這一念明瞭分別的心識本來是清淨的，而且這個清淨的本性具足無量無邊的功德。這樣的功德一旦被啟發出來，就能夠生起種種自利、利他的妙用。所以我們剛開始時就應該相信我們這一念心具足了體大、相大、用大，這個是我們剛開始的大乘信心。

在《教觀綱宗》上說：什麼叫大乘信心？簡單的說就是仰信真如佛性在凡不減、在聖不增，心、佛、眾生三無差別。所以廣大的菩薩道，斷惡、修善、度眾生的整個功德，就是依止心、佛、眾生三無差別的信心開始發動出來。這就是我們在整個大乘修學中，所要建立的第一個功德──建立大乘的真實信心。

有了信心以後，我們進一步要對大乘生起解的功德。這個解就是能夠對生命生起正確的觀照。應該怎樣觀照我們生命的現象呢？本論講到一心有二門。就是說我們剛開始可以從假入空，觀察我們這一念明瞭的心性，有時候起善念、有時候起惡念，但是善惡的念頭都是因緣所生法，從本性觀察它的體性是畢竟空寂的。這時我們的心就能夠安住在清淨平等的法界，所謂的一真法界。在這個法界中是不生不滅、不垢不淨、不增不減，離開種種的對待，它是一種整體的生命。

當我們從一個清淨平等的法界再從空出假，這時我們觀察這個清淨的心性，它會受種種業力的熏習，就出現了所謂的生滅門。由於我們內心中有覺跟不覺兩種差別，當我們隨順於覺悟的功能，就起動了四聖法界的安樂果報；當我們隨順於不覺，這時就起動六凡的痛苦果報。這個生滅門就是一種染淨、苦樂，一種對待性的個體生命，這種生命現象都是生滅門所收攝。

當我們能夠同時看到生命絕待圓融的本性，也能夠看到生命的個體相貌，透過一心二門的觀察，就能夠正確而不顛倒的了解生命的全體相貌，這就是成就大乘解的功德。

我們這一科是講到生滅門，生滅門在本論中主要是依止阿賴耶為整個生命的根源。阿賴耶識中有覺跟不覺，在覺中有始覺跟本覺。前面我們已經把始覺有四種的相貌都說過了，接下來我們講本覺的相貌：

/KEPAN/辰二、辨本覺義
/KEPAN/巳一、標二相

這當中分兩科，巳一先標出兩種本覺的相貌，我們看論文：

/VERSE/復次，本覺隨染分別，生二種相，與彼本覺，不相捨離。云何為二？一者智淨相，二者不思議業相。

本覺的相貌在法藏大師的註解中，把它分成兩種相貌：第一個叫做隨染本覺，就是隨順染污以後產生對治，而恢復清淨的本覺，叫隨染本覺；第二個叫做性淨本覺，這個性淨就是它本性具足清淨的本覺。有隨染本覺跟性淨本覺這兩種。

在第一科裡面，它是先講到隨染本覺。復次，本覺隨染分別，生兩種相。這個本覺它隨順染污的因緣，產生一種對治的功能以後，它會生起兩種功德相，這兩種功德相跟本覺的體性是不相捨離的。這一段我們說明一下。

天台宗講到覺它是分成三種：就是始覺、本覺跟究竟覺。當始覺跟本覺和合以後，天台宗是安立做究竟覺。本論是比較原始的論典，它名相安立比較簡要，所以本論只安立始覺跟本覺。這裡的隨染本覺，事實上就是本覺經過始覺的熏習以後所產生的究竟覺。這裡的意義跟天台宗的究竟覺是相同的。

這個本覺經過環境以後，會產生兩種相貌：一者智淨相，二者不思議業相。這個智淨相是一種自受用的功德，就是根據根本無分別智生出我空、法空的智慧，所成就的一種自受用的功德，叫智淳淨相。二者不思議業相，這個不思議業相是成就他受用的功德，是這個後得有分別智。就是菩薩從空出假以後，依止他的善巧方便，廣泛的使令眾生生起種種善根，成就一種他受用的功德，這個叫不思議業相。所以當本覺被啟動以後，就產生自受用跟他受用兩種功德相貌。這一段是先標出隨染本覺兩種清淨的功德相，以下巳二再詳細的解釋它的內涵。

/KEPAN/巳二、釋二相
/KEPAN/午一、智淨相
/KEPAN/未一、示相

巳二、釋二相中分兩科：先看第一科智淨相，再看第二科不思議業相。智淨相中又分兩科，未一、示相，先指出智淨相的一個相貌，我們看論文：

/VERSE/智淨相者，謂依法力熏習，如實修行。滿足方便故，破和合識相，滅相續心相，顯現法身，智淳淨故。

這個智淨相是一種自受用的功德，它是怎麼成就的呢？剛開始是依法力的熏習，這個法力熏習就是一種始覺智慧的觀照力，具足來說是依止三寶力的熏習，三寶中主要依止法，就是諸佛菩薩所開導的這些教法。我們依止教法而生起觀照，依教起觀如實的在心中一次一次的去修行這個觀照力。滿足方便，就是成就一種對治妄想的方便力。成就對治妄想的方便，以下講出兩個內涵：第一個是破和合識，第二個是滅相續心。這一段的開示，是整個《大乘起信論》下手的一個主要修行內涵。我們作一個簡單的解釋。

在蕅益大師註解中，破和合識就是破阿賴耶識，破除阿賴耶識生滅的顛倒相，這個是比較微細的；滅相續心是破除前七轉識染污的現行：一個是破阿賴耶識，一個是破前七轉識。

從修學的次第上來說，我們剛開始是要滅相續心，主要的是持戒跟修定。就是我們剛開始修學佛法，你要能夠持戒清淨，因為這個罪業它的體性是躁動的：你要是造了殺盜淫妄的罪業，你的心就會不安穩；不安穩時，你要修禪定、修智慧就會構成一種障礙。反過來說，當我們修學善業時，這個善業的體性是寂靜的，你一個善業心強的人，他的身心世界特別的寂靜安樂，能夠對你未來的止觀打下一個非常好的基礎。所以我們在滅相續心時，剛開始是要以持戒作基礎；在持戒的基礎之下，修習這個止來止住我們的妄想。

當然，修止你應該先有一個所緣境，就是你心中要安立一個法寶來安住你的內心。站在淨土宗的角度，主要是以佛號為所緣境，所以你剛開始要對佛號修歸依，你應該要對你心中的法寶──萬德洪名的佛號，你要觀想：你相信你是業力凡夫，你決定不能仗自力斷惑證真、了生脫死，你自己沒有力量出離三界；第二個你相信阿彌陀佛有大悲願力，他決定有能力救拔你。這時，你對心中的佛號生起一心歸命，通身靠倒的一種不共歸依；有這樣的一個信心以後，你就可以正式修止了。你強迫自己的心──心於佛號，專一安住；心於佛號，相續安住。

當然剛開始是要勉強，不能念要他念，不能專要他專，妄想不能斷要他斷。你的佛號在你一次一次專注的訓練之下，你的力量就慢慢的增長廣大。平常在寂靜處時先建立佛號的力量，等到煩惱活動時──若妄念一起，當下就要叫它消滅，這時你用佛號的力量來調伏你的妄想，或者說用佛號來取代你的妄想，轉念念佛。所以剛開始時，我們是滅相續心，剛開始是滅惡念的相續，就是我們剛開始的修學，透過持戒、修定來調伏我們現行的煩惱，進一步我們就可以破和合識。

破和合識就是說，在持戒、修定的基礎的心中，你的心從前面粗糙的相貌，達到了一種明瞭寂靜的狀態，這時你的觀照力現前。觀照你這一念明瞭的心性是因緣所生法，我說即是空，覓心了不可得，這時我們就用一種有所得的生滅心，達到一種不生不滅的心性的意境裡面去了，這時心中就沒有所謂能所的分別──能所雙亡，諸相叵得。我們這樣修時，我們阿賴耶識的生滅相就一次一次的被我們對治，我們的心就從生滅相，慢慢的慢慢的趨向於真如門。這就是剛開始是滅相續心，進一步破和合識，這個就是所謂的滿足方便。這個滿足就是成就一種對治無明的方便。

經過我們的破和合識跟滅相續心以後，有什麼樣的功德出現呢？顯現法身。這是大乘法不共小乘的地方。小乘法修習空觀以後，他的功德相是一種灰身泯智；大乘法在對治妄想以後是轉識成智，他這時有一種清淨明瞭的法身現前，這樣的一個清淨法身我們安立做智淳淨，這叫做智淨相。因為他的智慧是離開了雜染，特別的清淨，叫智淳淨相或者叫智淨相。智淨相是我們剛開始修學佛法所要用功的一個自受用功德。

我們講到生滅門，生滅門就有所謂的因緣果報，在因緣果報中，我們就不能夠忽略業力的因緣。我們內心中有善業、也有罪業，所以我們剛開始先懺悔業障、積集資糧。這個懺悔業障這是一個很重要的觀念。什麼叫懺悔業障？很多人一直不明白。從大乘的角度來說，這個罪業是由心所生，所以也是由心來改造這個罪業，說是罪從心起將心懺，心若滅時罪亦亡。

我們想要消滅我們的罪障，你剛開始要知道這個罪障是怎麼生起的？就是為什麼會有罪障呢？把這個罪障的源頭抓出來，說是罪從心起將心懺，也就是說我們的身口二業是個工具，它是不能造業的，主要的根源是心中的顛倒、煩惱，才驅動身口去造業，所以心是罪業的一個主導者。所以你在懺悔時，要注意你要滅的是你這個心念的相續、惡念的相續。當你透過破和合識，滅相續心，心若滅時罪亦亡，當你的惡念消滅時，你的罪障才正式的消滅。就是你的心跟染污的境界接觸時，你內心中已經產生一種對治力，你以前有一種隨順顛倒的心念被你消滅了，這時你的罪障才正式消滅。

《龍舒淨土文》講到一個公案：

在宋朝有一個居士叫吳瓊居士，從小生長在一個很貧窮的家庭，因爲貧窮，只好出家修行去了。在叢林中，他是負責典座，在廚房裡面工作。叢林有很多人住，所以典座的工作也非常辛苦，後來他實在忍受不了辛苦就還俗去了。還俗以後就到菜市場去賣雞賣鴨，自然就會殺生，把這個雞買過來，殺死以後切成小塊再賣出去。因為造殺業的關係，沒多久他的眼睛就長一個腫瘤，像一個雞蛋這麼大的腫瘤。

當然有善根的人跟沒有善根的人是有差別的，有善根的人他遇到惡因緣的刺激，他善根的觀照就現前，他知道這件事情是罪業的一個花報，他果報在三惡道，果報要出現之前先開花。這時他起大恐怖，生起了慚愧心，就趕快把這個工作停掉，在家裡懺悔念佛。他一方面修懺，一方面念佛，在文中來看，大概是念了一年還是念了三年，時間不是很長。念了一段時間以後，有一天他就跟隔壁的鄰居說：我要往生極樂世界了，希望你們來幫我助念一段時間。鄰居就為他助念。念了一段時間以後，他就說佛來也，他看到阿彌陀佛現前，清淨光明的佛陀現前，就在大眾的念佛聲中安然的坐化。

我們可以從這個公案理解罪業的生起，跟罪業改變的相貌。

剛開始他一念的不覺，啟動一念的不覺，罪從心起造了殺業，他心中若不是起顛倒，他不可能去做這種事情，沒有人強迫他，是他自己要做的，以不覺的因緣起動了罪業。後來這個罪業要起現行之前，他馬上生起觀照，觀照力現前至誠的懺悔，這時一方面懺悔、一方面培養他心中覺悟的觀照。當然覺悟是一種真實功德，不覺是虛妄的相貌，所以他能夠以光明來破除黑暗。他從前面顛倒的心識，經過他的懺悔、修福、念佛以後，已經變成一種覺照的功能而跟彌陀感應道交。所以與其說改造業力，倒不如說是改造我們的心念。因為你要是不從心念改造，心外求法，無量無邊的業力你怎麼改造呢？

像基督教，基督教有它的殊勝處，但是它對業力的改造這個觀念不正確。譬如說你造了罪業，你只要把這個罪業向上帝發露，上帝就能夠代你受罪，你的罪業就得到救贖。大乘佛法不同意這個觀念。你只是把罪業發露，這個罪業沒有產生一種對治力，你的罪業沒有消滅，你還是會繼續造罪業。

所以我們在研究本論時要注意，破和合識、滅相續心，特別是剛開始先修這個滅相續心──罪從心起將心懺，心若滅時罪亦亡。就是你心中的這個法寶，最基本要能夠調伏你煩惱的現行，進一步再去對治你內心深處微細的無明顛倒，就是破和合識。這個就是我們在佛堂中一個自受用的自利功德。

/KEPAN/未二、釋成

前面是說出它的一個相貌；這以下說明這個因緣是怎麼成就的，解釋這個成就的因緣。看論文：

/VERSE/此義云何？以一切心識之相，皆是無明。無明之相，不離覺性。非可壞、非不可壞。

先作一個簡單的略說。為什麼我們破和合識、滅相續心以後，就能夠顯現法身？

一切凡夫的生滅心，這種雜染的生滅心，都是由無明而引生的。無明的相狀，它雖然是顛倒相，但是它的本性不離覺性，它的體性沒有離開我們清淨的覺性；所以我們面對無明的態度，是非可壞、非不可壞。也就是說它的體性是覺性，所以你不能完全的斷滅；但是它的作用是顛倒的，所以非不可壞，就是你應該加以破壞。我們破壞的，或者說我們所轉變的，是無明的一個作用；但是我們保存了無明的體性。這個觀念是大乘的不二法門，斷滅不得，但是也隨順不得，這個觀念甚深甚深。以下講出一個譬喻：

/VERSE/如大海水，因風波動，水相、風相，不相捨離。而水非動性，若風止滅，動相則滅，濕性不壞故。

用我們用日常生活容易理解的情況，來比況這種深奧的道理：

這個大海水就譬喻我們的一心真如。這個寂靜的一心真如，因為有這個風的因緣就產生了波浪，一念的無明風的妄動，就產生波浪的一個個體生命。這時水相、風相，不相捨離，水的濕性跟風所引生的波浪，它體性是不相捨離的。

而水非動性，若風止滅，動相則滅，濕性不壞故。這個水指的就是濕性，本身非動，是寂靜的；只要這種擾動的風停下來，這個波浪就消滅；波浪消滅時，這個濕性就現前，這個法身就現前。

這個意思就是說，清淨的法身在無量劫的流轉過程中，我們一直被無明牽著走，就是在十二因緣中不斷的流轉，由一念顛倒的心，無明緣行就造業；造業以後就創造一個阿賴耶識，這阿賴耶識就得果報。這個十二因緣雖然一次一次的起動，但是值得慶幸的是濕性不壞故，就是我們的清淨本性決定沒有消失。

在大乘佛法中，你一定要生起一個堅定的信心，就是你有恢複本性的可能性，就是本性沒有消失，本性從來沒有被污染過。就是說雖然波浪已經擾動很久，但是濕性不壞。這是一個譬喻，以下合法：

/VERSE/如是，眾生自性清淨心，因無明風動，心與無明，俱無形相，不相捨離。而心非動性，若無明滅，相續則滅，智性不壞故。

我們一念的清淨心，因為這個無明（就是愚癡），不知道老老實實的安住在清淨的本體，向外攀緣就產生一個動相，這個動相使令我們清淨心跟無明和合在一起；但是這二個都沒有形相，所以不相捨離，無明跟真如的本性是不相捨離。

這個不相捨離蕅益大師註解得好，他說：離開了清淨心就沒有無明，離開了無明也沒有清淨心。就是離開了水你就沒有所謂的波浪，離開了波浪你也找不到水。而心非動性，在體性上來說，我們的心本身是寂靜的，它不是擾動的，所以只要這個擾動的無明，它相續的功能被破壞以後，這個清淨的智慧（所謂的法身）就顯現出來。

這個智淨相，前面一段偏重在否定門，破和合識、滅相續心，剛開始是一種調伏，或著說是一種破壞的法來加以對治；在第二段釋成，又加以肯定：就是作用是可以破壞，但體性不能斷滅。

也就是說我們在修學大乘佛法時要注意，要經常以中道的思想來檢討自己。就是說我們剛開始出家煩惱比較粗重，可能會用比較極端的方式來面對我們的心性，你打那麼多妄想，我就讓你不動，用佛號、或者持咒，你煩惱一起動，我佛號也起動，就把你給調伏住了。就是說剛開始我們是用比較粗猛的藥，來對治這個粗重煩惱，這個可以理解，所以剛開始是破和合識、滅相續心。

但是你的煩惱慢慢淡薄以後，你應該用另外一個角度來觀察你的心──其實我們的心性不是一文不值，就是你要想一想，自知我是未成之佛，諸佛是已成之佛，其體無別。所以我們剛開始是用否定的法來調伏自己，後來用肯定，就是我們這一念心跟諸佛的心性是沒有差別的，我們這一念心具足體相用三大，如來藏具足無漏性功德故，能生一切世出世間，善因果故。剛開始我們用調伏，然後重新的肯定，先大死一番，然後再大活。所以馬鳴菩薩的智慧，你看他老人家，一開始先告訴你否定的法，在釋成時再重新的肯定。

這裡就是在呵斥外道的無想定。外道的行者在禪定中，他也能夠知道我們這一念心有很多很多的煩惱，而這些煩惱都是痛苦的根本。為了要調伏煩惱，就使令自己無想，無想的結果，的確是讓煩惱停止下來，但是也深深的傷害到我們的菩提本性，錯損菩提。我們在修智淨相時，這裡馬鳴菩薩有兩段開示：第一個是否定法，破和合識、滅相續心；第二個是告訴我們無明的本性就是自性清淨心，因為自性清淨心並沒有破壞。這就是我們從論文中了知如何修行的一個消息。

/KEPAN/午二、不思議業相

前面的智淨相是講到自受用的功德，這以下講到他受用：

/VERSE/不思議業相者，以依智淨相，能作一切勝妙境界。所謂無量功德之相，常無斷絕。隨眾生根，自然相應，種種而現，得利益故。

不思議業相是怎麼產生呢？以依智淨相故。就是說你要修不思議業相，你要以成就智淨相作基礎，這裡很重要。你要修大悲，你一定是先修清淨心，依止這個清淨心修大悲心，從空出假，廣攝方便，變現種種的勝妙境界。這個勝妙境界包括色法──種種美妙的顏色、音聲，乃至種種的香、味、觸五塵的勝妙境界。什麼叫勝妙境界呢？簡單的說所謂無量功德之相，常無斷絕。就是顯現種種依報、正報的功德莊嚴，這種功德莊嚴在時間上、在空間上是沒有斷絕的──在時間上是盡未來際，在空間上是在整個無量的世界顯現種種的依正莊嚴。

這個依正莊嚴當然不是自受用，是他受用。幹什麼用呢？隨眾生根，自然相應，種種而現，得利益故。這種依正莊嚴，會隨順眾生差別的善根，你會知道眾生心中的希望、煩惱的厚薄是怎麼回事。他過去所栽培的善根，他是持戒的善根強、或者禪定的善根強、或者智慧的善根強，應該如何的來啟動他的善根，你就很自然能夠相應，顯現他歡喜的相狀，使令眾生成就歡喜、生善、破惡、入理四種悉壇的利益，這個就是所謂的不思議業相。

這個不思議業相，簡單的說就是恆順眾生，廣設方便。就是說我們在成就這個隨染本覺，有兩個次第：第一個次第是一種內觀，就是你的心剛開始是善知識莫向外求，你觀照你這一念心來破和合識、滅相續心，一種自我的調伏。剛開始你的心是完全向內觀照，別人是怎樣跟你是完全沒有關係的。慢慢的你的心清淨調伏以後，你的心就是從內觀開始外觀，觀察眾生差別的因緣，這時可以廣設方便來度化眾生，所以他的心是先內觀再外觀。你外觀以後，你有自在力，就變現五塵的境界來攝受眾生。

比如說我們娑婆世界主要的是音聲，在五塵中是音聲最能夠感動我們的心。娑婆世界的眾生，一開始他煩惱粗重，你要他受戒、聽經他有困難；你要他唱唱爐香讚，他爐香讚一唱下去，他內心起歡喜心，由歡喜心生恭敬心，由恭敬心生起信心，就觸動他過去的善根，然後開始受五戒、聽聞佛法。說是很多人都是唱爐香讚以後才相信佛法。

我們這一念心，《楞嚴經》說有六根門頭，有六個門，六個門都能夠進入到我們的一念心性；但是這六個門，耳根這個門特別重要，就是我們對於音聲的感覺特別強烈，在五塵中耳根這個門特別厲害，所以佛陀就恆順眾生。比如說香積佛國，香積佛國的眾生這個舌根特別厲害，在六根裡面舌根特別厲害。他修行有障礙，向佛陀請求開示，佛陀二話不說給他一碗飯，這一碗飯他吃下去，滅惡生善。你像天衣佛國，天衣佛國他修行有困難，佛陀給他一件衣服穿，他的皮膚跟衣服接觸時，自然皆生念佛、念法、念僧之心。

所以說度化眾生，應該要站在對方的角度：你在自利時，可以完全觀照自己的相貌；但是你度化眾生這個法是別人需要的，就應該恆順眾生，應以何身得度，就施設什麼樣的方便，這裡這樣的一個相貌叫不思議業相。從前面一個清淨的自受用，依止大悲心變現出種種的方便力，成就一種他受用的功德，這個叫做不思議業相，這兩個都是本覺的作用，本覺的作用就叫隨染本覺。

/KEPAN/卯三、總顯四種大義

前面的本覺是一種作用，這裡是講到本覺內在的體性。本覺內在體性叫做性淨本覺，性淨本覺有四種大義，這個大不是大小的大，是當殊勝講，就是說這個性淨本覺有四種殊勝的功能，叫做四種大義。我們看論文：

/VERSE/復次，覺體相者，有四種大義，與虛空等，猶如淨鏡。

這裡是先總標。前面講到隨染本覺，是本覺跟始覺智慧和合以後，產生一種自利、利他的功德；這裡講到我們本性具足的性淨本覺，它有四種殊勝的功能，我們簡單的以兩種譬喻說明：第一個是虛空，第二個是淨鏡。`;
