QXL.volNum = 12;
QXL.text = `
請大家打開《講義》第二十四頁，卯三、總顯四種大義。

這一大科講心生滅門。生滅的因緣是依止阿賴耶識，阿賴耶識中有兩種功能：一個是覺，一個是不覺。覺悟的功能又分成兩種：一個是始覺，一個是本覺。我們今天講到本覺，本覺中又分成兩種，前面的一科是隨染本覺，是約著本覺的作用來說明本覺；那這裡是講到性淨本覺，是約著本覺的體性。我們如何了解本覺的體性？從四種殊勝的功能來了解這個本覺的體性。看論文：

/VERSE/復次，覺體相者，有四種大義，與虛空等，猶如淨鏡。

本覺的體性開展出來，有四種殊勝的功能，簡單的說有兩種：一個是虛空，一個是淨鏡，也就是說本覺有空如來藏跟不空如來藏。從空的角度，講出一個譬喻就是虛空，這個虛空前面也說過了。法藏大師解釋虛空是用二義：第一個週遍義，就是本覺能夠週遍十法界，在十法界的眾生中都具足了本覺，叫做虛空；第二個虛空是無差別義，就是法界一相。這個本覺它是在凡不減，在聖不增，出生死而不染，證涅槃而非淨，它沒有增減的差別，就是空如來藏；其次，它不空，就像一個鏡子有能生義，能夠顯現種種自利、利他的功德：就是一個是空如來藏，一個是不空如來藏，從這兩個角度來了解本覺的體性。

/VERSE/云何為四？一者、如實空鏡；二者、因熏習鏡；三者、法出離鏡；四者、緣熏習鏡。

我們先看第一個。

/VERSE/一者、如實空鏡。遠離一切心境界相，無法可現，非覺照義故。

本覺的體性，第一個是如實空。什麼叫空呢？就是遠離一切心境界相，無法可現。雖然這個本覺有時候是被不覺所蒙蔽，它會顯現種種的天、人、餓鬼、畜生的雜染境界；但是從本覺的體性中，它是遠離一切的境界之相。說虛空，你用墨汁去潑虛空，也不能染污虛空；用白色的油漆去潑虛空，虛空也是一個如的境界：它是遠離一切黑白的境界相。所以簡單的說它是非覺照義故。

非覺照義蕅益大師解釋說：它不是凡夫的妄念能夠分別出來的。凡夫在整個社會的發展，一天到晚打妄想，能夠發明很多很多的東西，能夠想出各式各樣的資具出來；但是凡夫的歷史經過百千萬劫以後，沒有人能夠想到本覺的內涵，不可能，因為它是非覺照義故，它不是你向外追求而能夠覺照得到的。

天台《小止觀》裡面講到對治魔事，就是你在修行時有魔障應該怎麼辦呢？智者大師教授兩個方法：第一個有相行，就是歸依三寶，念佛、念法、念僧，你或者念佛、或者誦經、或者依止大眾的僧團憶念三寶的力量，這叫有相行；第二個，無相行，就是你安住在空性，魔王不能干擾你。

這個無相行在寶靜大師的註解中，講一個公案說：佛在世時，佛陀去托缽，魔王要障礙佛陀，就現出一個牧牛人的相狀，手上拿著一個手杖，披頭散髮站在一個大石頭上，非常的憍慢。佛陀拿著缽安詳走過來以後，魔王就很憍慢的問佛陀說：瞿曇，你要到哪裡去？佛陀一看就知道這個牧牛人是魔王，就反問魔王說：那你要到哪裡去呢？魔王就很高傲的說：我就帶著這些牛在人間、天上到處的享樂。我們知道魔王就是修習善業，他歡喜布施、持戒，但是他沒有出離心，貪著五欲就變成魔王。所以他說：我是一個牧牛者，我帶了很多的眾生去積集善業。積集善業幹什麼呢？不是追求無上菩提智，是受用這些五欲的果報，所以我的活動範圍就在人天裡面活動。

魔王很高興的講完以後，就問佛陀說：瞿曇你到哪裡去呢？佛陀說：我要去的地方是你不能去的。什麼叫做不能去的地方？寶靜大師說：就是安住在空性。就是說當魔王干擾你時，你能夠觀察因緣所生法，我說即是空時，魔王找不到你，因為非覺照義故。就這裡不是一般的意識分別心所能夠到達的境界，是這個意思。所以這裡講這個空，不是我們向外攀緣所能夠覺照的，是依止我空、法空的智慧才能夠相應的。

/VERSE/二者、因熏習鏡。謂如實不空，一切世間境界，悉於中現。不出不入，不失不壞，常住一心。以一切法，即真實性故。又一切染法所不能染，智體不動，具足無漏熏眾生故。

這個本覺的體性有四種相貌，簡單的說就是體大跟相大。前面的如實空是講它的體大，以下的二、三、四是講它的相大。相大當然就講不空，相大中的第二段是一個總說。

因熏習鏡，這個因我們解釋一下。因就是生起清淨法的因種，它有能生義，生起種種的清淨法。

我們看它的解釋，「謂如實不空」。這以下有兩段，兩段中第一段是約著所顯現的境界：一切世間境界之下，都是在本覺的體性顯現。這個境界跟本覺是「不出不入，不失不壞，常住一心」。法藏大師說：不出就是不離，不入就是不即，不離不即。這個是講到第一個情況。第二個是「不失不壞」，它不失去也不減少。法藏大師說：這個一切的因緣相在本覺的體性顯現，不出不入是解釋它的法性本來空寂，不失不壞是解釋因果絲毫不爽。不管空、不管因果，都是依止一心而顯現，所以講常住一心。

以一切法，即真實性故。一切法的本性就是本覺的體性。這一段是講到它所顯現的萬法。不過從本論的意思來看，它的因熏習鏡是講下一段，是約著能顯現的覺體；前面是約著所顯現的萬法。本論的重點是下一段，約著能顯現的覺體。

「又一切染法所不能染，智體不動，具足無漏熏眾生故。」這個本覺的空，它不是頑空，它有對治染法的功能，這染法不能染，它不動的體性具足無漏的功德來熏習眾生。具足無漏熏功德故，在法藏大師的註解說叫做本覺內熏。就是說我們這一念明瞭分別的心性，無量劫中在三界一次一次的打滾，流轉三界中，這是一個很長的時間。但是我們內心中有一種功能在不斷的提醒我們，或者說是熏習我們，告訴我們要怎麼樣呢？厭惡生死，欣求涅槃，就是有一種功能，叫做本覺內熏。

本覺內熏這句話，蕅益大師講得很詳細，他說：這個本覺內熏，就是一種出世的善根。什麼叫出世的善根呢？蕅益大師進一步解釋說：佛性雄猛，不可破壞。我們的本覺裡面這個不空如來藏有一種非常堅定的體性，會引導我們厭惡生死，欣求涅槃。不管你過去曾經造了多少五逆十惡的罪業，都不能破壞這種佛性內熏的功能，它不為一切法所破壞，而能夠破壞一切法。

過去，美國有一個碩士，這個碩士後來出家了，出家以後他修行的章法就是朝山，到美國各地去拜山。拜山以後他寫下心得，叫做《修行者的日記》。他在朝山中，有些人羞辱他，有些人讚嘆他、供養他，有人就問他說：你是一個碩士，依你的資糧力，你在人世間可以享受榮華富貴，你為什麼要出家，在這裡辛辛苦苦的拜山呢？這個比丘就回答他說：我們每一個人都有一個出世的善根，當這個善根被啟動以後，不是任何的境界所能夠障礙的。就是蕅益大師說的佛性雄猛，不可破壞。

我們可以這樣講：一個人說要出家修行，他覺得很多很多的障礙、很多的罣礙──這個人沒有真正的發心。就是說一個人善根真正被啟動時，所有的障礙都不是障礙。你覺得出家有很多的障礙，那表示你還活在你的妄想中，你真實的因熏習鏡那個不空如來藏的善根沒有真正的觸動。

所以這裡講：我們本覺的體性雖然是空，但是這個空裡面有一種潛伏的功能。它幹什麼呢？具足無漏熏眾生故，它白天、晚上不斷的告訴我們要厭惡生死、欣求涅槃。當然我們沒有去注意它，這個功能對我們就不能產生一定的效果；雖然它沒有顯現，但是功能是存在的，這個叫做本覺內熏。這個是不空（或者講相大）的一個總說。這個本覺內熏，到底它的內心是產生什麼樣的功能？以下分兩段：

/VERSE/三者、法出離鏡。謂不空法，出煩惱礙、智礙，離和合相，淳淨明故。

這裡是約著自受用的功德來說。這個法，什麼叫法呢？這個法就是戒定慧。這個本覺的內熏，它會引生一種戒定慧的功德，它能夠對治我們的煩惱，叫做出離。我們看論文：謂不空法，當這個本覺內熏的功能假藉我們聞思修的因緣啟動以後，就有出煩惱礙跟智礙的功能。這個煩惱礙就是煩惱障，這個智礙就是所知障，遠離這些和合相（本論裡面看到和合相，你就知道是阿賴耶識，它是一個真妄的和合。），破除這個阿賴耶相，恢復我們的本性清淨。

法出離鏡這裡很重要，就是說你要相信你心中的戒法、或者是禪定法、或者智慧之法，是能夠對治煩惱的，你要相信這件事情。我們無量劫來在心中熏習很多的煩惱，各式各樣的煩惱都有，貪慾、瞋恚、忌妒、高慢，你要能夠相信這些煩惱都是虛妄相，因為顛倒生、因緣有是虛妄。什麼是真實相呢？就是我們內心中的本性是能夠出離的，那種真實的功德是能夠對治虛妄相，就是光明能夠破除黑暗，這裡叫法出離鏡，這個法有出離煩惱的力量。

/VERSE/四者、緣熏習鏡。謂依法出離故，遍照眾生之心，令修善根，隨念示現故。

這個緣，這裡指的是利他的功德，成就眾生得度的因緣。謂依法出離故，遍照眾生之心，令修善根，隨念示現故。當本覺不空的因熏習鏡被觸動以後，它能夠成就法出離鏡；以這個清淨心作基礎，能夠遍照眾生的差別根機，使令眾生修習種種的信、進，念、定、慧的善根，隨順眾生心念的好壞，來顯現種種的差別因緣，應以何身得度，就現何身而為說法令他解脫，這個叫做緣熏習鏡。

這裡是講到性淨本覺，就是我們打妄想的心中，具足如實空跟如實不空這種潛伏功能，等待我們去開發。本論的覺講得很詳細，這個始覺的智慧講到四種始覺智，本覺講到兩種本覺。

/SECTION1/阿賴耶識覺的功能──總結

大、小乘的修學有一個共同點就是觀心，所以小乘的學者很喜歡說內觀法。這個內跟外的差別就是心——心內跟心外，所以這個內觀法講得非常好，剛開始應該內觀，內觀以後再外觀，依止大悲。大悲是外觀，智慧是內觀，內觀是對心的觀照，就有所不同了。我們整個佛教的修學宗旨基本上可以分成三個主題，說是觀照我們這一念心有三種差別：

/SECTION/一、小乘觀心

第一個是小乘的教法，小乘的教法觀心，認為這個心純粹是雜染性，說是心是惡源，形為罪藪，所以我們看不出在小乘的經典中有所謂的自知我是未成之佛，諸佛是已成之佛，其體無別。對讚歎我們心的本性跟諸佛是沒有差別這樣的話，我們在《阿含經》幾乎是看不到的；我們只看到佛陀告訴我們：我們這一念心是不淨的、是苦惱的、是無常、是無我的，是這樣的一個雜染的心識。因為心是雜染的，只好把它完全消滅了。所以在觀心中，小乘的學者對心的態度，認為心是純粹的雜染，這是第一個重點。這樣在破惡方面有很大的力量；但這個生善、度眾生時，你用這個觀法會產生很大的障礙。

/SECTION/二、天台觀心

第二種的觀法就是天台宗的思想：天台的圓教思想認為心是完全純淨的。當然它能夠安立圓教，有它的經論根據，根據《法華》《涅槃》，認為我們的心完全是清淨的，說是達妄本空，知真本有，妄想是完全不存在的。這時天台宗的圓教，它在教理上的認知心是純然清淨，所以他修證時，就是正直捨方便，但修無上道，這些枝枝葉葉的對治都不須要，直接的正念真如，這一念心直接觀照到不生不滅的清淨本性。這些所謂的無常觀、業果觀都不須要。利根人，像禪宗的人，直接從一念不生，即名為佛，就悟入了本性。這個是比較樂觀一點，認為心是純然清淨的，這種觀法有它的傳承，《法華》《涅槃》就是這種思想。

/SECTION/三、本論觀心

第三種本論是根據《楞伽經》為基礎，開展出來的：馬鳴菩薩比較中道，他認為：心的本性是清淨，但是帶妄，所以他認為心是真妄和合。說我們這一念心本性是清淨，但是一念的妄動就變成阿賴耶識，就帶妄了，生滅跟不生滅和合。但是值得慶幸的是──真實能夠破除虛妄。所以我們看本論裡面講到始覺智四種智慧，它前面的業果觀、無常觀跟空觀，都是對治這個虛妄相；到了第四個時，他修無念法門，直接觀照這一念心，覓心了不可得，直接的契證真如。

所以本論比較中道，就是我們這一念心是帶妄，真如帶妄，或者說在纏真如。所以本論後面正式的修行方便，它有對治觀，也有根本觀。根本觀直接的觀照真如，直接的覓心了不可得，就在那個地方安住；雖覓心了不可得，但無始的熏習有一些虛妄的煩惱，那就要假藉這個業果觀、無常觀、空觀善巧對治了。所以本論對心的態度，認為是真妄和合，這個觀心法門基本上有三個重點。到這裡把<done>阿賴耶識覺的功能都講完了。</done>

/KEPAN/寅二、釋不覺義
/KEPAN/卯一、總明不覺依覺故無實

前面是講到覺悟的功德，這以下講出不覺的相貌。這當中分兩科，先看卯一、總明不覺依覺故無實，我們看論文：

/VERSE/所言不覺義者，謂不如實知真如法一故，不覺心起，而有其念。念無自相，不離本覺。

這個不覺的相貌，法藏大師說：本論中的不覺有兩種相貌：第一個是根本不覺，或者說是根本無明；第二個是枝末不覺，或者講枝末無明。這一段是先講根本不覺。

什麼叫根本不覺呢？

謂不如實知真如法一故，不覺心起，而有其念。念無自相，不離本覺。說是我們這一念心：剛開始是清淨本然、離諸對待，是沒有個體生命的差別。那怎麼會有不覺呢？剛開始就是我們不能夠如實了知真如的法是平等不二的。就是我們剛開始的生命現象，是沒有我相、人相的對立，那是一切法如的相貌，如的相貌本來是非常好。

但是不覺心起，而有其念。我們的心剛開始是怎麼回事呢？說真如不守自性，一念的妄動，我們總是覺得應該要向外攀緣比較好，生起一個向外攀緣的心就動，就不覺心起；不覺心起以後，而有其念，就產生很多個體的生命現象出現。

就是剛開始的生命是離諸對待的，沒有時間相、沒有空間相、沒有差別相，開始動了第一個念頭以後，糟糕了！開始有時間、空間、各式各樣的因緣果報，就是從最初的一念妄動。這個妄動是念無自相，不離本覺，雖然妄動，但是它不離開我們的本覺。

所以馬鳴菩薩很慈悲，他在說話的時侯，經常會給我們一些鼓勵：雖然打了妄想，但是你要永遠相信──我是未成之佛，諸佛是已成之佛，其體無別。就是消滅這些妄想是可以做到的。為什麼呢？因為本性沒有失掉。

這一段話很重要，根本不覺。我們期末考會考這一段，什麼叫根本不覺？就是因為以不如實知真如法一故，不覺心起，而有其念。就是剛開始我們不能安住在真如的平等法，而向外的妄動，一動了以後，就產生個體生命了，所以這個個體生命不是上帝給我們的，是我們一念妄動，就是十二因緣的第一個無明，無明就產生業力、行，就產生阿賴耶識，就產生很多的果報，這叫根本不覺。這以下講出一個譬喻：

/gatha/
猶如迷人，依方故迷。
若離於方，則無有迷。
眾生亦爾。依覺故迷。
若離覺性，則無不覺。
//

一個在路途上迷惑的人，他為什麼會迷惑呢？因為他有方向的概念，他有東西南北，把東邊當做西邊，把西邊當做東邊，所以他才有所謂的迷惑。如果我們把這個方向的概念都消失掉，那就沒有所謂的迷惑可言。這是一個譬喻，這以下合法：眾生亦爾。依覺故迷。若離覺性，則無不覺。眾生就是因為有本覺，有覺才有所謂的迷，就是說不如實知真如法一故。那如果沒有真如，那當然就沒有所謂的不如實知真如法一故，就是有覺才產生迷，所以離開了覺性就沒有所謂的迷惑可言，說是離開了水就沒有波浪可言。

以有不覺妄想心故，能知名義，為說真覺。若離不覺之心，則無真覺自相可說。

這裡法藏大師作一個總結。法藏大師說：前面一段，是真有待妄之義，這個真實的功德有對待妄想的義理，真有待妄之義；下面一段是妄有起淨之功，在妄想中它有生起淨化的功德，妄有起淨之功。

我們解釋一下以有不覺妄想心故，能知名義，為說真覺。

因為有不覺的妄想存在，我們為了要說明這個迷義，才說明這個覺悟，所以真有待妄之義，就是覺悟跟不覺，這兩個因為對立才能夠安立，真有待妄之義，就是有妄想才安立覺。

第二段更重要了，第二段是重點。若離不覺之心，則無真覺自相可說。

你說我們現在在不覺，把不覺消失掉了，完全棄捨這個不覺之心，你也找不到真覺的自相可得，就是妄有起淨之功。就是說我們流轉在三界中，何處是依怙？我們現在每一個人都是在生滅門活動，我們沒有一個人在真如門安住，沒有一個人。雖然這是生滅門，但是你離開了生滅門，你就不能契入真如門，說是就路還家。我們從最初的覺而變成不覺，但這個不覺跟覺是合在一起的，所以你用無想定把這個不覺的心消滅掉，你也會失掉這個覺的功德，那就錯損菩提了，是這個意思。

這裡等於是告訴我們：雖然一念的妄動全體變成不覺，但是這個本覺的體性沒有失掉，它有這個意思。當然這一段話的重點還是在發明根本不覺，就是根本不覺是由不如實知真如法一故，不覺心起，而有其念。這個是說明我們生命的一個源頭，就為什麼會有生命呢？就是這樣產生的。我們再看第二段：

/KEPAN/卯二、別示不覺虛妄相

/VERSE/復次依不覺故，生三種相。與彼不覺，相應不離。云何為三？

前面一段是講根本不覺，這以下講枝末不覺。這個根本不覺法藏大師說：根本不覺是迷真取妄。對真如平等法生起迷惑，一念妄動就產生這個不覺，迷真取妄，這叫根本不覺。枝末不覺是執妄為真，在妄想中又把它執為是真實的，就產生一個妄想的相續。例如：我們剛開始眼睛有毛病，從虛空中變出一個花。虛空本來沒有花，就產生一個個體生命的花出來，這個叫做根本不覺。進一步我們認為這個花是真實的，開始對這個花種種的攀緣造作，又引生很多的事情，這個叫做枝末不覺；開展出來有三細六粗，共九種相貌。先講三細。

/VERSE/一者、無明業相。以依不覺故心動，說名為業；覺即不動。動即有苦，果不離因故。

當我們最初的一念妄動以後，在我們的清淨本性中生起的第一個相貌叫無明業相。法藏大師解釋這個業相有兩種意思：第一個是造作義，就是我們下面論文解釋的第一段叫造作義；第二個是招感義，招感果報的功德這叫業相。

一、造作義：「以依不覺故心動，說名為業；覺即不動。」當我們最初一念妄動以後，就產生一個業力了。當然業的意思就是動。什麼叫業呢？簡單的說就是一種動相，它不斷的活動。當然這個業好一點的可能造善業，不好一點造罪業。不管是善業跟惡業都是一種動相，就是造作義。

二、招感義：「動即有苦，果不離因故。」這個動就是業，業就招感果報，善業招感安樂的果報，罪業招感痛苦的果報。這些果報從真如來說都是苦惱的，相對涅槃來說它都有老病死的繫縛，所以都是苦惱的。

一言以蔽之，無明業相就是一個個體生命真正的開始，就是為什麼會有這個我、你這些差別。眾生會有人、畜生、餓鬼這種個體生命，就是一念妄動以後所變現的無明業相。這個業相如果是善業，他的果報會莊嚴一點；如果是罪業，就是卑賤苦惱：這些都是以無明為根本所發動的業相。

/VERSE/二者、能見相。以依動故能見，不動則無見。

既然有個體生命，就有一個能照見的，就有能所，就著人來說它有一個能照見相，或者說是能受用。當我們有個體生命以後，我們在個體生命中，就有一個能受用的東西，能受用的叫能見相。

/VERSE/三者、境界相。以依能見故，境界妄現，離見則無境界。

這個是所受用。當然善業強的人，他受用的都是安樂的五塵；罪業所受用的是一個苦惱的五塵。

這一段在法藏大師的判定，都是屬於阿賴耶識，都是依他起性。這三個諸位要注意，一念不覺生三細，這個三細是同時出現的。就是當有無明業相的時侯，也就同時有能見相跟境界相，這都是非常微細的和合識阿賴耶識，都是依他起性。

「一念不覺生三細，境界為緣長六粗。」這個六粗就是前七轉識的作用所產生的遍計所執性，就是這個在無明業相的個體生命中，由境界的刺激、不斷的造作所產生的六種相貌。

/VERSE/以有境界緣故，復生六種相。云何為六？

這六種相是：智相、相續相、執取相、計名字相、起業相、業系苦相。

/VERSE/一者、智相。依於境界，心起分別，愛與不愛故。

這個智是一種分別心，特別是第六意識的分別功能叫智相，就是我們依於境界，心起分別，愛與不愛故。我們這一念個體生命的心，跟這個好壞的境界接觸的時侯，就產生很多的虛妄分別，這個分別的緣故，就產生了愛跟不愛。這個愛就是希望，就是說我們在個體生命受用境界時，有兩種希望：有些東西我們希望跟它和合，有些東西我們希望跟它遠離。總之，由於境界的受用，先產生一個希望，這個內心中對種種的東西有所期待、有所希望，這叫智相。這是一個很微細的分別。

/VERSE/二者、相續相。依於智故，生其苦樂，覺心起念，相應不斷故。

依止前面的這種智分別的希望，就產生苦受跟樂受。我們跟所希望的境界接觸而產生樂受，跟不希望的境界接觸而產生產苦受，由前面的希望跟境界接觸以後，進一步產生痛苦跟快樂的感受，這個叫相續相。這樣的感受又會加強我們對前面的希望。

法藏大師說：前面的智相是一個點狀的，這個相續相是一個累積性的。就是說我們本來只是對某一個東西希望，但是當你真正接觸的時侯，你產生樂受就加強這個希望；對某一個東西我們是不喜歡的，但是由於業力的因素我們還是要跟它接觸，結果產生痛苦，這個痛苦又加強我們不喜歡的希望。這個相續相，就是把前面的希望變成一種累積性、一種更強烈的希望，叫做相續相。

/VERSE/三者、執取相。依於相續，緣念境界，住持苦樂；心起著故。

依於前面的這種相續，一次一次的去緣念受用這些美好的境界，產生一種住持，這個住持就是產生堅固的執取，對於快樂感受、或者痛苦感受的執取，就產生一種執取相。這個執取相按照我們現在的白話來說，就是一種生命的經驗。

以我個人的一些小經驗：我小時侯有一次生病感冒，感冒當然身體功能比較差；後來我吃一種豆子，吃完以後就吐。從今以後，我看到這種豆子就害怕。這就是一種生命的經驗，就是你曾經在某一種境界裡面受用，一次一次的受用，產生苦樂的感受以後，你就產生一種取著；取著你就產生一種所謂的執取相，對好的東西的執取，對壞的東西也產生執取，就產生一種所謂的生命的經驗。

/VERSE/四者、計名字相。依於妄執，分別假名言相故。

透過前面對境界好壞的執取，這個時侯進一步安立各種名言──這個人是好人、這個人是壞人，這個人是我的朋友、這個人是我的冤家，把這個名言安立以後，就使令我們對生命的執取這種概念就更加的堅定，而且把這種執取擴大，無限制的擴大。所以這個名言安立以後，我們的妄想就變得更加複雜，這個分別我執就是這個計名字相產生的，最粗顯的就是計名字相，說是自我意識，就是你心中的概念名言。到這裡，等於是惑（惑業苦的惑），就是由細到粗，從一個智相、相續相、執取相到計名字相。

/VERSE/五者、起業相。依於名字，尋名取著，造種種業故。

我們對生命有很多的思想以後，就依止我們的思想去造業了，我們認為這件事情是功德相、是對的，我們就會去做；這件事情對我們有傷害的，我們就避免去做：就依止個人心中的思想概念，去做他認為對的事情，這當中就造業。如果你的概念是正確的就造善業，如果你的思想是錯誤的就造罪業。

/VERSE/六者、業系苦相，以依業受報，不自在故。

你造了業，這個業就有招感義，在三界裡面得果報：如果是善業，就招感安樂的果報；是罪業，就招感痛苦的果報。不管安樂還是痛苦，都離不開老病死的繫縛，所以使令我們身心不得自在。這個是果報。最後作個總結：

/VERSE/當知，無明能生一切染法。以一切染法，皆是不覺相故。

這些三細六粗，一言以蔽之，都是一念心的顛倒引生的，一切的雜染法，都是不覺所引生出來的。

這個六粗相我們簡單的說一下：

剛開始我們從持戒的角度，是先破第五個起業相。剛開始先不要造罪業，先不要問為什麼，就是依止對三寶的信心，相信佛陀的教授，能夠使令我們離苦得樂，就是相信佛陀的制教，相信佛陀是一切智者，能夠引導我們離苦得樂。所以我們剛開始持戒的時侯，所破的是起業相。

以持戒作基礎，再修的止觀，那就破第四個計名字相，就破壞我們一種思想的名言。我們凡夫的名言最嚴重的就是貪戀娑婆，我們一直認為娑婆世界是可樂的。

所以以淨土宗來講，厭離娑婆、欣求極樂，在修觀時，先安立名言，告訴自己：娑婆世界是惡夢者也，極樂世界是好夢者也；極樂世界是醒夢者也，娑婆世界是添夢者也。你要用這個佛法的清淨名言，來修正自己的概念，這個止觀就是先破除計名字相，所謂的滅相續心、破和合識。

好！我們把<done>阿賴耶識的覺跟不覺講到這裡全部講完了。</done>`;
