QXL.volNum = 14;
QXL.text = `
請大家打開《講義》第二十八頁。我們這一科講到丑一、明迷染因緣。

在整個生滅因緣中有兩個因緣：第一個是迷染的因緣，所謂的流轉門；第二個是悟淨的因緣，所謂的還滅門。本論講到有情眾生依止內心的迷惑顛倒所產生的這些生命相貌，這個生命的相貌有五種的意。第一個是業識，第二個是轉識，第三個是現識，這些都是阿賴耶識的因相跟果相，到這裡基本上還是一個非常微細的心識活動。再看第四：

/VERSE/四者名為智識，謂分別染淨法故。

前面的轉識跟現識就是一個生命的產生，生命的產生當然一定有一個能受用的我相跟所受用的法相，當這個轉識跟現識一接觸時，就產生了所謂的智識。這裡的智不是智慧，指的是一種分別。我們開始去分別這個法的好壞，產生一種愛憎之心。當然我們心中有很多希望，有些的境界我們希望跟它接觸，有些不喜歡的境界我們希望跟它遠離，這樣的分別叫做智識。你內心中開始把你所接觸的環境分成兩大類：哪些環境是你喜歡跟它接觸的，哪些人事你把它歸納成你不喜歡接觸的，這都是因為有轉識跟現識的相互作用，而產生各式各樣的希望，那這個希望，佛法說就是一種愛著的煩惱。

/VERSE/五者名為相續識，以念相應不斷故。

前面只是一種希望，這樣的希望有可能是前世帶來的等流習性。這個相續就是說，當我們跟這些環境（或者是我們喜歡的環境、或者我們不喜歡的環境）真實接觸，心境的接觸就會產生一種感受，這個受可能是樂受，也可能是苦受。這種感受就不是一種希望而已了，就變成你一個實際的生命經驗，這時你對於這個東西愛憎的希望就變得更加的強烈、更加的堅固，這就是相續。

所以這個相續識跟智識，法藏大師解釋說：這兩個體性都是愛著，約著強弱的分別，而安立為智識和相續識。一個只是一種內心的期待、希望；但是這個相續識是根據你真實受用以後，產生一種實際的感受經驗，這時就變成非常強烈，那這個相續識在我們生命中所造成的作用非常的大。以下把相續識對我們生命的影響力分成三段來說明。先看第一段：

/VERSE/住持過去無量世等善惡之業，令不失故。

這個相續識表面上是一個愛憎取捨，這個愛憎取捨，基本上對我們的業力有一種引導的作用。我們說過：業力的保存是保存在業識，我們每一個人來到三界都帶了很多業力而來，但是到底哪一個業力對我們來生會產生招感性，這跟你的相續識有關係。

所以這裡法藏大師說：什麼叫做住持業力不失呢？這句話怎麼解釋呢？法藏大師用十二因緣解釋說：我們剛開始無明緣行，行緣識，由無明推動了業力，這個業力保存在識。這個識就是第八識，就是我們這裡所說的業識。但是這無量無邊的業力要得果報，它必須有愛取的滋潤，所以愛取有。前面無明緣行，行緣識這個識，有很多很多的善業、罪業，但是到臨命終時，這個愛取的煩惱會去滋潤某一個業力，使令它變成有。這個有支表面上解釋就是存在義，它從一種潛伏的功能而轉成存在。也就是說這個業力它是一個成熟的業力，有招感果報的業力。就是說你今生的思想、你今生的好樂，對某一群的業力會有滋潤、刺激的作用。

譬如說：你今生有很強大的意樂要往生西方極樂世界，雖然你在阿賴耶識中，你念佛的意很單薄，但是你信願具足。臨終時，照正常情況說是強者先牽，本來應該不是淨土的業起現行，但是你臨終時不斷的憶念阿彌陀佛，這時隨念往生，以念力來主導你的業力。就是它能夠住持過去無量世等善惡之業，令不失故，它會把你淨土的業從一種潛伏的種子，而轉成一個強大能夠招感果報的一個有，這就是它對業種有一個成熟性。第二個：

/VERSE/復能成熟現在、未來苦樂等報，無差違故。

這一段法藏大師說：我們的思想、愛憎取捨的相續，進一步會把有轉成生，把這個有招感業力的業種使令它得果報，使令這個業力變成果報，所以這個相續識的力量很大。它能夠把業力、業種轉成有，再把這個有滋潤而轉成生。

在《淨土聖賢錄》講到：唐朝有一個僧藏大師，出家以後，看書的意思就是：白天為大眾師作務，任勞任怨，為大眾師服勞役；晚上他就專心念佛。等於一方面是持戒修福，一方面是信願持名。到晚年以後，傳記上說生了一場病，在病痛中，他臨命終到來時候，他是看到諸天次第來迎。剛開始四天王天、忉利天、夜摩天、兜率天、化樂天、他化自在天，他在臨命終時，諸天的果報一一現前。

但是因為他的心情、他那個相續識只有一個念頭，所謂的一心念佛，別無二念，他是專心的想要到淨土去。所以雖然他持戒修福的業有很多可能性，就是說我們造了善業，大方向來說是招感安樂的果報；但是這個安樂的果報也可能在淨土得安樂果報、也可能到諸天得安樂果報、或者在人間得轉輪聖王，這樣的差別相就是由你這個相續識來指導。結果他因為一心念佛，諸天的因緣、中陰身就全部消失了，最後阿彌陀佛現前而往生淨土。

所以說我們來生的果報，從親因緣來說，跟我們前生的業跟今生的業都有關係。但是這個業力要得果報，跟你愛取的心有關係。你這個業要得果報，要愛、取、有，有才變成生。所以我們這個相續識，在我們的生命中，也扮演著一個主導的角色。因為它能夠住持過去無量世等善惡之業，令不失故。復能成熟現在、未來苦樂等報，無差違故。它會對我們已經成就的業力，有一種滋潤，而使令它招感果報的功能。再看第三個功能：

/VERSE/能令現在已經之事，忽然而念；未來之事，不覺妄慮。

這個心念有一種等流性。這個相續識就是說，你前生有各式各樣的愛憎取捨，今生也會有這樣的一個愛憎取捨，就是已經發生的事，本來已經忘掉了，但是會忽然間生起；未來沒有發生的事情，你也可能打種種妄想，生起種種的規劃：這都是因為你這種愛憎取捨的相續識在那個地方作用。

/VERSE/是故三界虛偽，唯心所作，離心則無六塵境界。

所以說從大乘的角度，三界的果報都是因緣所生法、自性空，都是我們一念心所造作和變現的。這個相續識，我們從某一部分來說，跟今生有關係。你今生聽聞什麼樣的教法、接觸什麼樣的善知識、生起怎麼樣的分別，你就有某一個程度的相續識；但是跟你前生也有關係，跟這個過去的等流性也是有關係。

比如說在美國有一個心理醫生，寫一本書叫做《前世今生》。他用催眠術來為大家治病。他有一個病人得到對水的恐懼症，這個病人一看到水就害怕，他那個相續識對水是非常的排斥。那這件事情很嚴重，因為這個水是日常用品，不管是飲用、或者是洗滌、或者各式各樣都是需要水，如果遇到水就害怕，那生活就遇到很大障礙。要把這個過失消滅，就要找它的因緣。

所以這個心理醫生就為他催眠，結果就發現他前八十六世的情況都顯現出來。在前面的八十六世中，他有二世跟水有密切的關係。其中有一世，她是一個鄉下婦人，有一天帶女兒回娘家參加一個喜慶，在中間過橋時遇到暴風雨，她跟女兒都被大水沖走了。因為這個事情來得太突然了，她在淹沒了之前，心中生起很大的恐怖。而這個恐怖的心是依止水而引起的，所以她在那一世就成就對水排斥的自識相續識，這是第一個。

其次，她過去有一生也是住在一個鄉村，她得到一種病，這種病類似淋瘋病，在那個時候是沒有藥可以治療。所以鄉村的人就把這些淋瘋病人全部關在山洞裡面，讓他們自生自滅。這個女居士她在死亡之前，經過一段很長的時間，被這個病痛折磨得很嚴重。這個淋瘋病的引生跟水有關係的，因水的污染而傳染，所以她對水也產生了恐懼排斥。

就是說這個人他為什麼歡喜持戒？有人歡喜修定，有些人歡喜研究智慧，這種愛憎取捨對事物的差別相跟前生有關係，跟你今生的造作也都有關係，這個就是所謂的以念相應不斷故，我們每一個人會對各種的事物產生不同的愛憎取捨。再看下一段：

/VERSE/此義云何？

為什麼說是三界虛偽、唯心所作呢？

/VERSE/以一切法皆從心起，妄念而生。一切分別，即分別自心。心不見心，無相可得。

這裡是回答，說一切法是由我們真心起動，真心起動就變成一個個體生命的阿賴耶，阿賴耶再變成很多很多覺跟不覺妄念的造作，就有很多很多的果報。所以我們在分別這些果報時，就是分別自心的影像。什麼叫分別自心的影像？

《維摩詰經》上說：譬如諸天共寶器食，隨其福德，飯色有異。說這個天人共同在一桌吃飯，每一個人因地的福德不同，每一個人看到的飯色有差別。所以我們今天雖然生活在同一個僧團，大方向的話是有共業，但是每一個人受用的色、聲、香、味、觸、法也不同。你有你的業力，變現你的環境，在你自己的環境中受用；某個人有他的業力，也變現他所謂的轉識，他的六塵境界。你在你自己的六塵裡面去活動，所謂的一切分別就是分別自心的影像，這是流轉門。當我們能夠迴光返照，心不見心，無相可得，假設我們的心，不要隨順這個流轉的方向去活動，把心帶回家、迴光返照，這時從生滅門而回歸到真如門，就發覺無有少法可得。

這一段等於是把前面的三界虛偽，唯心所作的觀念，再把它作一個說明。這以下把前面的五意作一個總結：

/VERSE/當知世間一切境界，皆依眾生無明妄心，而得住持。是故一切法，如鏡中像，無體可得，唯心虛妄。以心生，則種種法生；心滅，則種種法滅故。

所以說這個世間的境界相，都是依止我們無明妄心，而得住持的。就是說你今天遇到什麼人，會遇到什麼樣的環境，跟你前生的業力有關，跟你今生的思想也有關係。你的想法一直是這樣，這個果報就一直的一直的存在。你今生遇到這樣的因緣，你的思想不變，你來生還是遇到這樣的因緣，因為你的妄念不斷的活動，這個果報就不斷的出現。除非你的心念改變，否則你的環境、所變現的果報一樣，就是這麼回事。說是一切法因緣生，你的因緣、你的心一直在這樣環境活動，當然你就招感這個因緣，所以一切法，如鏡中像，無體可得。雖然無體可得，但是你的心不斷的活動，它就不斷的出現。

總而言之，心生，則種種法生；心滅，則種種法滅故。從流轉門的角度，你生起各式各樣的愛憎取捨，它就有各式各樣相應的法出現；當你這個愛憎取捨消滅的時侯，這些法就消失了。這個觀念很重要──心生，則種種法生；心滅，則種種法滅。

這裡我們解釋一下。這個五意我們可以從兩方面來了解：

一、一念不覺生三細，由一念不覺的妄動、造業以後，就變成三細，就是所謂的業識、轉識、現識，這部分是屬於業力的部分。我們過去已經造了很多很多的業，說實在也沒辦法改變；不管我們願不願意，我們都要承當過去的業。就是我們阿賴耶識有很多很多的善業，也有很多的罪業，這是誰也沒有辦法改變的事實。

二、但是境界為緣長六粗，這個智識跟相續識是我們的分別所引生。前面是由業力所引生的；這是分別所引生，是可以改變的。

佛在世的時侯，有一個國王叫做娑婆羅那國王。這個國王的果報長得非常莊嚴，他自己也非常滿意，經常在國內舉辦很多的選美大會。但是在國內沒有一個人比他莊嚴，所以他的大臣就勸他說：國王啊！你應該把這個範圍擴大，去聘請國外一些莊嚴的人來跟你比較，這樣才會圓滿。

這時，智臣就建議說：我聽說隔壁國家的迦旃延尊者長得特別莊嚴，你應該請他來比較比較。娑婆羅那國王就派了很多的大臣去禮請迦旃延尊者。迦旃延尊者是一個阿羅漢，他有三明、六通、八解脫，他入定觀察，知道他跟這個國王有因緣，過去生有他得度的因緣，對眾生有利益他就歡喜的接受（雖然不是請他來說法，而是比莊嚴。）。迦旃延尊者一來，跟這個國王一比，果然迦旃延尊者比他莊嚴很多，所以這個國王就對迦旃延尊者生起信心，就歸依了迦旃延尊者。

歸依了以後，他問尊者說：師父啊！你是什麼因緣而得此莊嚴果報？尊者就回答說：過去生我在僧團做沙彌時，我歡喜掃地，他的因緣是對清潔的工作特別好樂。當然人的相續識是各式各樣，每一個人喜歡做的善業也各式各樣。迦旃延尊者過去在做沙彌時，他就整天為大眾師做清潔工作，清潔大殿、清潔廁所、清潔寮房等等。

有一天他做清潔工作時，有一個乞丐跟他乞食，這個沙彌說：我們三寶的飲食是不能夠隨便給別人受用的，除非你能夠跟我一起做出坡工作，你幫我打掃環境，打掃好了以後，我把我的飲食分一半給你。那乞丐說：好。這個乞丐以後就每天跟著這個沙彌清潔僧團環境，然後這個沙彌就把他飲食分一半給乞丐。

迦旃延尊者說：以前那個沙彌就是我，那個乞丐就是你。你因為清潔三寶的因緣，你今生有福德做國王；也因為這樣的因緣，有這樣一個莊嚴的果報。娑婆羅那國王一聽：我過去只是在三寶的善法中修習一個小小的善法就做了國王，就這麼莊嚴；那我要是出家的話，那還得了！這時他就放棄了王位，交給他弟弟，跟迦旃延尊者出家了。

出家以後，迦旃延尊者一想：你是一個國王，你在這個國家大家都認識你、大家都供養你，你沒辦法修行，生起我慢心。所以把娑婆羅那國王剃度以後，就帶到隔壁的國家叫做阿盤地國去修行。有一天，迦旃延尊者出外說法時，娑婆羅那國王在自己的山洞修行。這時阿盤地國的國王帶著宮女出來遊玩。那國王當然是放逸的境界，喝酒、跳舞，累了就睡覺，這個宮女就到處的玩，就看到了娑婆羅那國王在那個地方打坐修行。這個修行者長得很莊嚴，宮女就在那個地方跟他指指點點、跟他談話。這時阿盤地國國王醒過來以後，他看到了宮女跟這個修行者講話的情況，生起嫉妒心。就問這個娑婆羅那國王說：你得到四果沒有？沒有。三果？也沒有。二果、初果？都沒有。你得到四禪否？也沒有。三禪、二禪、一禪？都沒有。你連初禪都沒有，表示你沒有離欲啊！你沒有離欲，你怎麼能夠戲弄我的宮女呢？就叫旁邊的軍隊打娑婆羅那國王。看這個意思是打得很重，打得昏過去了。

昏過去以後，到了晚上迦旃延尊者回來以後，就把他的身體抱起來，抱回自己的寮房去療傷。到了晚上他就醒過來，醒過來以後（他是一個凡夫，凡夫當然是有煩惱，你這一刺激他時，煩惱就活動。），娑婆羅那國王就跟迦旃延尊者說：師父啊！我跟你請假幾天，我要回去了。說：你為什麼要回去呢？他說：這個阿盤地國的國王欺人太甚，我在那個地方修行，他來傷害我這麼嚴重，我回去跟我弟弟借軍隊，要報這個仇。迦旃延尊者說：這不可以啊，這造殺業，會招感痛苦果報的。這個娑婆羅那國王說：師父，我的心現在跟石頭一樣堅固，沒辦法改變。迦旃延尊者說：好吧，那你要回去也不急在這一時，天也黑了，你先睡一覺，明天早上再走吧。

娑婆羅那國王在山洞睡覺時（當然阿羅漢他有神通，在夢境就給他一點消息），他就做夢，夢到他回到自己的國家，跟他的弟弟借軍隊，帶了軍隊來興師問罪，攻打阿盤地國。剛開始氣勢很旺就打勝仗，但是到了最後阿盤地國被逼到實在是沒地方走，就下令反攻，一鼓作氣就把娑婆羅那國王打敗了。打敗了以後，就抓到娑婆羅那國王，送到斷頭台。這時阿盤地國的國王就說：這一場戰爭死了很多人，都是因為你引起的。就下令劊子手要砍他的頭。要砍時，娑婆羅那國王一驚怖就醒過來了，嚇了一身冷汗，原來是一場夢。醒過來以後，迦旃延尊者把握這個機會為他說四聖諦法：此是苦汝應知，此是集汝應斷，此是滅汝應證，此是道汝應修。他聽了四聖諦以後，當下證得了初果。這是出自於窺基大師《唯識二十頌述記》裡面的一段故事。他的意思就是說：我們的生命往往是在一念之間。

假設這個娑婆羅那國王他生起一念的自識相續識，他的心中就是這件事情一定要報仇，這個心念如果沒有破壞的話，我們可以預測娑婆羅那國王來生的果報應該是在三惡道，不是餓鬼、就是畜生、就是地獄，所謂的心生，則種種法生。這個惡念生起沒有破壞，後面的果報就沒完沒了。當然他遇到了善知識，依止法力熏習，破和合識、滅相續心，他把這個希望的惡念破壞了，這時心滅，則種種法滅。

所以說生命是怎麼回事啊？就是這麼回事。你怎麼知道你能夠改造你的生命呢？你過去有很多的慾望，生為一個凡夫一定會有慾望，問題是你面對慾望你是怎麼辦？你是隨順它，或者是調伏它？如果你經過出家生涯，已經產生一種對治力，這些慾望你本來應該隨順的而你把它破壞了，那你的生命就有變化了，就是算命先生算你的命就算不準了，你的生命已經是心滅，則種種法滅。應該說你過去的生命已經消失了，你現在是脫胎換骨了，就是另外一個生命的出現了。這裡是一個重點，就是如何的滅相續心？滅這個自識跟相續識是個重點。

我們看下一段。前面是解釋五意，這以下解釋意識，所謂眾生依心意識而轉。

/KEPAN/卯二、釋意識

/VERSE/復次，言意識者，即此相續識，依諸凡夫取著轉深，計我我所，種種妄執。隨事攀緣，分別六塵。名為意識，亦名分離識，又復說名分別事識，此識依見愛煩惱增長義故。

這個是最粗重的心識。言意識者，即此相續識，這意識是怎麼來的呢？就是前面愛憎取捨的一種愛著的相續識，這個相續識假設我們沒有斷除，繼續的作用，依諸凡夫取著轉深，計我我所，種種妄執。這裡就轉成了前面所謂的執取相，就是執取識，就是這個相續識我們把它加以執著，

下一個隨事攀緣，分別六塵，這裡就產生了計名字相，就正式產生很多的分別，所謂的名言，或者說產生很多的思想，所以這個意識就是一種思想。前面的這個意識跟相續識，它是一種感受跟希望；這裡是一個思想，那這個思想名為意識，亦名分離識。這個分離怎麼說呢？就是它的作用是分離的，因為六根它是分別去攀緣六塵，眼識攀緣色塵、耳識攀緣聲塵，乃至於意識攀緣法塵，它的作用是相互作用的，它是分別作用的。

又復說明分別事識，它又能夠去分別這些差別的事相因緣，這個識是依止見愛煩惱增長義故，都是依止迷理的見煩惱和迷事的愛煩惱而展轉引生，乃至於展轉的增上。這裡講到我們在流轉門中最粗的思想。

凡夫的流轉果報，當然是由心識的流轉引生。心識的流轉，我們阿賴耶識這個微細的地方我們先不談，破和合識這件事情我們先不談；先談第六意識這個粗顯的心識，這個滅相續心是下手的第一道。

這個第六意識引生的心識，從本論來說我們可以分成兩類：第一個是感受的問題。受，我們跟環境的接觸有很多的感受，產生很多的愛憎取捨這個感受；第二個就是思想的問題，我們的概念、名言的問題，大方向來說，我們在沒有經過佛法的訓練之前，我們的思想是隨順感受而走，就是跟著感覺走，就是由感受來引導我們的思想。

也就是說我們隨順流轉門，就是由自識引生相續識，由相續識引生我們的意識，就是你有什麼樣的感受，你就產生什麼樣的思想，凡夫是這樣，就是以感受來引導思想。修行人相反，我們是用佛法的思想，來引導我們的感受，這裡有所不同。

我自己的一個修學經驗，我剛出家時，曾經有一段時間持過午不食有一些困難。就是剛剛做居士時，做居士有很多事情要做，到了晚上肚子就餓了。我們今天依著對三寶的信心、對戒法的信心，不能吃東西，不能持要他持，堅持；餓得太厲害就喝一點開水，趕快期待明天的到來。剛開始持戒都是一分的信心，但是久了以後發覺這也不是個章法，應該在信心之外加一分智慧。在佛學院讀那麼多聖賢書，應該要觀照觀照。

後來有一天我就觀照這個受，我想：我是喜歡飽的感受，不歡喜餓的感受，但事實上都是一種感受。剛開始我們會觀察這個受是無常，這個很重要，觀這個受是無常的，也就是說你前一天很餓，但是早上起來時變成飽飽的，所以這個受是不真實的，觀照這個不真實，你會發覺這個感受是可以改變的。所以剛開始我們對這個受，用無常觀是很好，它不是我們想像的那麼真實，它是隨順因緣而變化的。第二個，就是我們為什麼一定要喜歡飽的感受呢？其實餓的感受也不錯，它也是一種感受。經過我們智慧的觀照以後，我發覺我過午不食這條戒就比較容易持了。就是說餓有餓的感受，飽有飽的感受，你換一個思想，這個餓的感受也不錯，它也是一種感受。而我們過去的這個遍計執，就一定要有一種飽的感受，但是這件事情不決定，不一定要有這個想法，所以我們用思想來改造我們的感受。

再舉一個公案：有一個老婦人，她生兩個女兒，大女兒是賣雨傘，小女兒是賣冰棒。這個老婦人一到了夏天，她痛苦的感受就出現了，因為她想到她大女兒賣雨傘賣不出去，太陽這麼大這怎麼辦呢？就產生苦受。到了冬天她也感到痛苦，就想到她小女兒賣冰棒賣不出去。所以她就被這些憂愁、苦惱所繫縛。後來遇到一個善知識說：你換一個想法，你夏天時想小女兒一到夏天時，冰棒賣得很好；你到冬天時、雨季時，就想大女兒雨傘賣得很好。所以我們的思想能夠善巧應用。

當然我們說：一個人的果報是由業力，業力佔一部分，這個阿賴耶識所謂的業識、轉識、現識，這個果報有些依他起是不能改變，但是我們可以改造我們的感受，可以的，靠這個意識的名言安立。就是說我們面對逆境時，可以使令自己的痛苦降到最低。一個有智慧的人，利用思想來改造我們的感受，所以心理學家說：要測試一個人思想的不同，你給他半杯水。有些人看到半杯水，內心充滿了希望：唉呀！太好了，我還有半杯水可以受用。這個人是樂觀主義者，他是往光明面去想。有些人看到半杯水，非常的苦惱：糟糕了！只剩下半杯而已。那這個人的想法是往黑暗面去想。這裡就是說，這個意識對我們的果報也會有引導的作用。就是引導我們的生命，有業力所產生的受、有思想所引生的造作，這兩個對我們生命都有影響力。

最後一段，我們看第三十頁：此識依見愛煩惱增長義故。這裡我們要稍為分別一下：

一、唯識學講到八識的心王都是無記的，諸位知道它的染淨是由心所帶動的，所以它這個第八識在唯識學的修學是轉識成智。你不能消滅八識，消滅八識的話，在唯識學認為你這個人是斷滅見，因為唯識學認為應該把第八識轉成大圓鏡智，把第七識轉成平等性智，乃至於前六識轉成妙觀察智。所以在唯識學認為識沒有錯，錯在心所有法。

二、《大乘起信論》的看法不同，它是安立真如，真如一念妄動變成阿賴耶，這個阿賴耶所帶動的八識都是煩惱，都應該完全消滅。所以《大乘起信論》認為：這個八識，我們用滅相續識、用對治的觀法來對治一些個體的煩惱；或者是直接破和合識，迴光返照我們一念心覓心了不可得，直接從生滅門趣入真如門。

從《大乘起信論》的角度：它所安立的這些八識是要完全消滅，因為它是見愛煩惱所引生的。但是唯識學它不認為心識是見愛煩惱，這裡我們要分別一下。當然唯識學它沒有安立真如，如果八識就是見愛煩惱引生，這個人的生命就沒有希望了，所以這裡應該有所差別。因為《大乘起信論》是先安立真如，真如起動再變成阿賴耶，這個阿賴耶是後面的東西；阿賴耶消滅以後，回歸到一心真如。所以它這裡，把這個心識，包括整個八識的心王都是見愛煩惱引生的。所以我們在研究唯識跟《大乘起信論》時，這裡要有所區別。`;
