QXL.volNum = 15;
QXL.text = `
請大家打開《講義》第三十頁，丑二、明悟淨因緣。

我們這一科講到解釋分，是解釋生命的真實相。有關我們生命的真相，在小乘的教育裡面，說是由業力所創造，是業感緣起；大乘佛法認為是萬法唯心。也就是說我們因地時，所謂的業是由內心所主導的，心為業主；在果報上呢，也是由這一念的心所變現。簡單的講，大乘佛法的生命是強調妙因妙果不離一心，因地是由一念的心性所創造，果報也是由一念心性所變現，所以生命的真實相，從大乘的角度來說，一言以蔽之，就是所謂的現前一念心性而已了。

這個現前一念心性是怎麼樣的一個情況呢？從本論上來說分為二門：心真如門跟心生滅門。我們剛開始了解我們這一念心，就是必須要把心帶回家。我們這一念生滅擾動的心，有時候起善念，有時候起惡念，我們把它攝用歸體，這時我們的心回歸到我們的原點，我們心的情況是清淨本然、週遍法界的，沒有這些差別的因果相，說是在凡不減，在聖不增，眾生本具，諸佛所證的一個平等理性。這樣一個真如的法界，是十法界所共同依止的一個處所。

當我們這一念心依體起用，這個真如起動以後，就變成一個生滅門。本論中，以阿賴耶識來統攝整個生滅門。那什麼叫阿賴耶識呢？在經論上說是無始時來界，一切法等依，由此有諸趣，及涅槃證得，整個生滅門簡單的說，就是因跟果兩種的相貌。從因相上來說是無始時來界，一切法等依。我們這個生滅心，基本上是含藏無量無邊的種子，說是無始時來界，這個界就是種子，有善的種子、有惡的種子。當這個種子遇到因緣刺激以後，就生起種種善惡的現行，就是所謂的一切法。

在我們的生滅心中，所謂的種現相熏，由種子而帶動的現行，由這個現行又引生的種子，下一時另外一個種子又引生的現行，由種現相互的資助，就構成我們整個生滅門的一個因相。這個因相有兩大類：第一個是以覺悟為主導的清淨的因相，第二個是以不覺來主導所帶動的雜染的因相，這個都是所謂的無始時來界，一切法等依，都含攝在我們的阿賴耶識中。這個因相在我們的心中一次一次的造作、一次一次的累積，會有什麼樣的結果呢？由此有諸趣，及涅槃證得。就使令我們的生命有雜染的六道輪迴果報，也會有這樣的因緣而產生清淨的涅槃，這個就是生命的果相。所以這個生滅門就是由覺悟所引導的一個因果相貌，或者說是由迷惑因緣所引導的一個雜染的因果。一個是清淨的因果，一個是雜染的因果，這都是屬於生滅門所收攝。當然生滅門它是一個對立的法，有染淨的對立。

/KEPAN/丑二、明悟淨因緣
/KEPAN/寅一、明悟有淺深

我們前面一科講到迷染的因緣，這裡我們從生滅門裡面去探討依止覺悟的心所引生的清淨法的因緣。所以悟淨因緣這個悟是約著因地的相貌來說，我們是以依止覺悟的心；這個淨是約著果相來說，帶動一個清淨的果報。也就是說前面的迷染因緣是在強調我們生滅門裡面的流轉門，這裡的悟淨因緣是強調還滅門。這當中分成兩科，先看第一科明悟有淺深。講到覺悟，覺悟就是一種智慧，先把智慧淺深的差別作一個總說，我們看論文：

/VERSE/依無明熏習，所起識者，非凡夫能知，亦非二乘智慧所覺。謂依菩薩，從初正信，發心觀察。若證法身，得少分知，乃至菩薩究竟地，不能盡知，唯佛窮了。

第一段、「依無明熏習，所起識者，非凡夫能知，亦非二乘智慧所覺。」

這裡講到智慧的觀照，先講到凡夫、或者二乘的智慧。依止無明的熏習，這個無明是根本無明，就是最初的一念妄動，這一念妄動去熏習我們清淨的真如本性，真如本性本來是沒有所謂的因果相，雜染相也不可得、清淨相也不可得，當這一念的妄動去干擾真如本性以後，會產生什麼結果呢？所起識者，就生起一個阿賴耶識，這個識是阿賴耶識，阿賴耶識它就有所謂的個體生命，有覺所帶動的涅槃，也可能會有不覺所帶動的三界流轉，這都是屬於阿賴耶識所收攝。這個阿賴耶識的煩惱它的生滅相是非常微細，所謂的三細的煩惱，一念不覺生三細，它的生滅相不是我們凡夫修止觀時、乃至二乘人在高深的禪定中所能夠了解的。

這裡的意思就是說，如果我們不能了解內心的生滅相，就表示我們不能對治，因為你連了解它都不能，那你更不可能去對治它。所以凡夫跟二乘人所能對治的，是第六意識相應的粗顯生滅相；對阿賴耶識微細的生滅相，就不是我們所能夠對治的，因為凡夫、二乘的覺照是比較粗的智慧。

第二段、「謂依菩薩，從初正信，發心觀察。若證法身，得少分知。」

阿賴耶識這種微細的生滅相，這些煩惱障礙，是從初正信，這個正信就是大乘的十信位，你剛開始是先仰信真如佛性在凡不減，在聖不增，從這樣的一個信心開始去修行；到了所謂的發心住（這裡發心是指十住、十行、十迴向的三賢位。），從前面的信心轉成一種發心。在論文中講到發三種心：直心、深心、大悲心。

一、直心：我們剛開始對真如只是一念的信心，經過十信位到了住位以後，就會產生第一個直心，開始去正念真如法故，開始不斷的去隨順、憶念真如的法性，使令自己的身口意隨順平等不二的道理。

二、深心：樂其一切諸善法故，開始去積集善法。前面的正念真如是斷惡，這裡是身心修善。

三、大悲心：欲拔一切眾生苦故。

到了住位的菩薩，就依止三心的大菩提心，去觀察一心二門的道理，知道我們這一念心有生滅門、有真如門，真生不二，這樣就進入清淨的初地的法身，這樣對阿賴耶識的生滅相，就能少分的覺悟，也等於是少分的對治，這個是講到菩薩。

第三段、「乃至菩薩究竟地，不能盡知，唯佛窮了。」

要到菩薩的究竟地，就是等覺菩薩的後心，最後才到佛的階位，才能夠究竟了知阿賴耶識的生滅相，當然也能夠窮盡阿賴耶識的生滅相，就從整個生滅門全部回歸到真如門，這就只有佛才能做到。這裡講到了二乘人、菩薩跟佛三種智慧。

這裡馬鳴菩薩用了知來解釋二乘、菩薩跟佛的差別，那什麼叫了知？了知什麼道理呢？在蕅益大師的註解中強調：《大乘起信論》的修行，它在大乘的解門中，就是要你了知達妄本空，知真本有。

學習大乘的佛法，你要知道兩件事情：第一個，要相信妄想是不真實的，它本性是空的；第二個，要相信你的佛性是本具的：有所否定、有所肯定，就是了知這兩件事情。後面整個悟淨的修學次第，事實上也是在發明達妄本空，知真本有兩個內涵。

/KEPAN/寅二、詳釋淺深差別
/KEPAN/卯一、總明義深

前面是把覺悟智慧的淺深作一個總說，這以下是詳細的說明，這當中有三科，先看卯一的總明義深。講到大乘佛法緣起的道理，這個一心二門緣起的道理是甚深甚深。我們看論文：

何以故？是心從本已來，自性清淨。而有無明，為無明所染，有其染心。雖有染心，而常恆不變。是故此義，唯佛能知。所謂心性常無念故，名為不變。以不達一法界故，心不相應。忽然念起，名為無明。

我們研究一心二門這種真如跟生滅二門的道理，要掌控三個主題：第一個是真如，第二個是無明，第三個是染心，從緣起法來說就是真如、無明、染心這三個重點，這裡是把這三個內涵講出來。何以故？在整個緣起的道理中，是一個什麼樣的相貌呢？凡夫的流轉是什麼相貌呢？先看

第一段、染心相貌

/VERSE/何以故？是心從本已來，自性清淨。而有無明，為無明所染，有其染心。

說我們一念的心性，從本以來它的本來相貌，是自性清淨的。這裡的清淨，不是跟雜染法對立的清淨；這裡的清淨是不垢不淨，它沒有清淨相，也沒有垢染相。所以我們在讀《心經》，是諸法空相，不生不滅、不垢不淨、不增不減，這不生不滅這句話是兩句話，你把這個不生不滅解成一句話，那你這個道理就錯了。不生不滅就是說它遠離生相、遠離滅相，也遠離垢相、遠離淨相，遠離增相、遠離減相，所以這個是六句話，這六句話合起來叫做自性清淨，簡單的說就是離諸對待。

這樣一個真如門的平等法界，後來就是而有無明，就是真如不守自性，向外的攀緣、追求，就產生一種對立的無明，當然這個無明是非常微細的根本無明。這根本無明一發動以後，就再也停不下來，一直在真如的體性裡面，一直的活動、活動、活動。這樣的根本無明、對立的思考在心中（在真如裡面的心性）活動以後，就去染污了真如，就創造了這個染心，這個染心就是枝末無明，所謂的三細六粗，就是所謂的阿賴耶識跟第六識的兩種染心。這個染心是這樣來的，是由無明去熏習真如所產生的一個雜染心識。這一段先說明染心生起的因緣，說明染心的相貌。

第二段、真如的相貌。

/VERSE/雖有染心，而常恆不變。是故此義，唯佛能知。所謂心性常無念故，名為不變。

我們這一念心是由無明的熏習而變成染心，染心就在境界裡面一次一次的活動；但是值得我們慶幸的是這個清淨的本性，雖然受到無明的干擾，也受到染心的熏習，但是它的本性是常恆不變的。這種不變的道理，只有佛能夠徹底的了知，只有佛能夠徹底的去相應。什麼叫不變呢？簡單的說就是心性常無念故，名為不變，馬鳴菩薩把這個不變說出來。

說前面的染心是約著我們這一念心的作用，隨緣義，以隨緣的道理來發明我們心的功能叫染心；這裡，真如是約著不變義。什麼叫不變呢？就是心性常無念故。這裡的常無念故是說：我們的心體是遠離妄念的，它不能被妄念所染污，也不能因為妄念而增加。

就是說我們無始劫來起了很多的惡念，這個惡念不能夠染污我們真如的本性；我們無始劫來在三寶的境界裡面，不斷的拜《八十八佛》、念阿彌陀佛、修種種的善法、起種種的善念，這個善念也不能增加真如本性：就是我們的真如本性，它是遠離一切的善念、惡念，這個叫做不變義，這個不變是這樣安立的，它是處生死而不染，證涅槃而非淨，它沒有所謂的增減相貌，也沒有所謂的染淨相貌，更不可能有所謂的生跟滅的相貌，它就是經常保持一個如的相貌，這個就是我們所了解的真如。

這個如的相貌，法藏大師講一個譬喻說：假設我們有一個清淨的摩尼寶珠，有時候把它丟到臭穢的廁所，這個摩尼寶珠就散發出臭穢的味道；有時候把它拿到清淨的檀香旁邊熏習，這個摩尼寶珠就出現很多的香味：但是摩尼寶珠的本質是不改變的。你到染污的地方，你用肥皂洗一洗它又清淨；你把這個摩尼寶珠拿到香的地方，再把它洗一洗，它香味也消失掉了。也就是說不管香氣也好、臭氣也好，它不能改變摩尼寶珠的本質。這樣我們就能夠了解什麼叫做心性常無念故，就是這個道理。我們不管過去起多大的惡念，我們的心性還是清淨本然；不管過去起什麼樣的善念，我們的心性還是一樣清淨本然：這個叫做真如，真如就是這個意思。這裡是講到真如。

第三段、無明相貌

/VERSE/以不達一法界故，心不相應。忽然念起，名為無明。

這個無明的相貌，從本論來說是依真如而起的，就是說我們本來是安住在一真法界的真如（遠離種種相對差別的知見，叫一真法界），本來是沒有差別，後來我們動了一個妄念以後，就產生了我相、人相的差別，這就是所謂的不達一真法界。

這時心不相應，忽然念起。這裡的忽然，法藏大師說：什麼叫忽然呢？就是無始的意思，就是說這個妄念是沒有一個開始，因為我們講不出無明是什麼時候生起，只好安立做忽然。我們研究大乘佛法，說真如是無始的，沒有開始；無明也是無始的：這兩個都是無始的。這裡叫做忽然，就是所謂的無明、我們這一念心，從一個平等的法界，突然間向外攀緣，向外一追求以後，就產生一個能所的對立，這時真如的作用就全體變成一個生滅的阿賴耶識。

從真如轉成阿賴耶識的過程，是誰去主導的呢？就是由無明來主導的，這個過程叫做無明。這裡無明值得我們去解釋的，它說是心不相應。這裡的相應，法藏大師說：根本無明為什麼叫心不相應呢？這當中有兩層意思：

第一個，這個無明是不與心所法相應。諸位研究過唯識學都知道，心所有善惡的功能，所以無明本身是不牽涉到善惡的，它是無記性，它沒有心所法，沒有心所法當然就非善非惡。

第二個，它不與一切外在的境界相應。就是這個無明的擾動，它只是向內的擾動，它不向外攀緣。不管你到了清淨的環境，它的無明也是擾動；你到了雜染的環境，它的無明還是擾動：它不與外在的環境相應，這叫心不相應。這兩層意思。

我們講到返妄歸真之前，我們應該要先知道三個法：第一個是真如，第二個是無明，第三個是染心。就是說你要修行，你一定要知道什麼東西是要消滅，什麼東西是要保存的。你不是一昧的去消滅，結果你應該保存的沒有保存，最後形成了障礙，成佛之道就構成障礙。

這就是剛開始時，你沒有具足大乘正見，結果是錯認消息。所以馬鳴菩薩說：要生起後面的大乘止觀，你要先知道三個法：第一個真如法，第二個無明，第三個染心。這裡的意思就是說：真如是你要保存下來的，無明跟染心是要對治的，剛開始先透漏這個消息。

/KEPAN/卯二、別示次第
/KEPAN/辰一、正釋悟淨次第
/KEPAN/巳一、明離染心次第

當你有這樣的正見以後，就有資格修大乘止觀。講到修習止觀的次第，這裡兩科，先看辰一的正釋悟淨次第。

我們講到修習大乘止觀的兩個次第：第一個是明離染心次第，講到對治染；第二個在第三十二頁。在大乘止觀中，第一個是離染心，第二個是離不覺（這個不覺就是無明）。就是說我們有志於修大乘止觀，你要掌握兩個宗旨：

第一個是掌握達妄本空，就是面對妄想應該要加以消滅、破壞，這就是第一科的明離染心次第，這個是破執，破壞執著的法門，是屬於一種破壞法門，所謂的達妄本空。第二科是明離不覺次第，這裡是一個肯定的法門，知真本有，對真如佛性的肯定跟隨順。所以大乘止觀事實上在操作時，就是根據這兩個原則。從次第上來說，我們可以先從破執下手。

一、達妄本空——破執法門

先看第一段，

/VERSE/染心者，有六種。云何為六？

我們所要消滅的染心有六種：一者、執相應染；二者、不斷相應染；三者、分別智相應染；四者、現色不相應染；五者、能見心不相應染；六者、根本業不相應染。這六個染心，大方向我們分成兩段：

（一）前面三個是屬於相應染，這個相應染主要是說它會跟環境相應，它會受環境影響。你到了染污的環境，這三個煩惱會增長；你到了清淨的環境，這三個煩惱會降低：它會跟環境相應。第二個它會跟心所有法相應，換句話說它是有很多善惡的差別。這個是染心，是相應，是屬於第六意識所相應的煩惱。

（二）第四五六是不相應染，它是不跟外在的環境相應的，它也沒有所謂的善惡差別，它是跟第八阿賴耶識相應的。

這裡的意思，我們可以把生起染心的次第重新說一下：

染心的生起是從細到粗，我們剛開始是從真如的妄動以後，這個真如就變成了一個阿賴耶。阿賴耶識第一個相貌就是根本業不相應染。這裡值得我們注意是這個業，這個業就是業力。真如本來沒有所謂的業力，後來一動以後，就累積很多很多的生死業力。當然有業力就有招感性，就變現了能見心跟現色不相應染。這個能見心，是一個主觀的自我，是一個我相，這個我相是非常微細的俱生我執。現色不相應染是屬於客觀的環境，是我們所受用的法相。

這裡就是說：從真如受到無明的熏習以後，就從一個平等的法界，變現成一個個體的生命，這個生命有可能是一個安樂的果報，也可能是一個痛苦的果報，關鍵點就在這個業。假設這個無明的動，是隨順於善法的動，就出現安樂的果報；如果是隨順於惡法，就出現痛苦的果報：這都是微細的阿賴耶識的生滅相。從這個果報體相互的作用，就是從我相去接觸法相時，就產生了分別智相應染，這個分別智相應染就產生了一個愛，貪愛的煩惱。我們對某一個環境會產生貪愛，對某一種環境會產生厭惡，這種愛憎的差別就是分別智相應染。

由分別智的進一步活動，產生不斷相應染。這個不斷的意思就是說，我們對某一個環境的愛跟憎恨，它本來只是心中的一個希望，但是我們一次一次的造作以後，會產生很多的感受。感受有樂受有苦受，這個苦樂感受經驗的相續，就產生一個取跟捨，那這個取跟捨是更強烈了。我們知道愛，它只是一個點狀的煩惱，可能是某一個時候才去愛，有時候不去愛；那這個取就是相續，它在內心中一定要得到為止。從愛加上種種感受的累積，就產生的一個取，或者是產生一個捨，由這個愛憎取捨的內心活動，就進一步變成執相應染。

這執相應染就是執取相跟計名字相，就是把前面的愛憎跟取捨的這些生命經驗，累積成一個所謂的自我意識──這就是我。我對某一件事情有愛，對某一件事情有憎恨，對某一件事情我要去追求，對某一件事情我要去排斥，這些都是依止自我意識而安立的種種名言，產生一個自我意識。這就是我們從真如的因緣，受到無明的干擾以後，產生的三細六粗。從對治上來說，我們先看第一個，我們在修大乘止觀，第一個是先對治執相應染。

/VERSE/一者、執相應染。依二乘解脫，及信相應地，遠離故。

這個執相應染，所對治的是一個分別的我執，由第六意識的數數分別所產生的自我，這時是在二乘的解脫位，包括了阿羅漢、辟支佛；或者是大乘的信相應地，這個信相應地就是大乘的十信滿心，到了初住就能夠消滅分別的我執。我們修大乘止觀，第一個當然是先破壞分別我執，因為它是最粗的煩惱。這個我，我們要消滅我執，要先知道什麼叫做我。這個我就是主宰，它有主導我們生命追求什麼、放棄什麼的一個功能，這叫做我。

這個我的相貌，一般來說有兩種的情況會生起：

（一）即蘊計我

就著五蘊的自體來產生一個自我。當然分別的我執都是依止五取蘊而起的。

第一、是以色法為自我，這個是一個非常粗的執取。就是什麼叫我呢？就是以色身為自我。一般人如果沒有經過佛法的訓練，也沒有經過外道思想的靜坐，都會以色身為自我。我是很年輕，過幾年以後這個我老了，最後死掉。當然以色身為自我的人，就很容易會有斷滅見：這個色身死掉了，我們生命的一個主導者也就消失了，所以生命只有一次，那只好及時行樂，這樣的一個自我意識的分別是非常粗糙的。

第二、是以感受為我。我們這一念心跟環境接觸會產生一個受，可能是樂受、也可能是苦受。以感受為我的人，他的心情就是跟著感覺走。他對某一件事情有好的感受，他就去追求；有不好的感受，他就去排斥：以這個受來主導整個生命的造作。這種人當然已經比執色為我稍微高明一點，因為畢竟這個受是一個心理的狀態。

第三、是以想為我。這種人比較清高，前面的受還是一個愛煩惱，這個想是一個見煩惱。有些人是以什麼來主導我們的生命？就是以這個思想，說是我思故我在。他對某一件事情有很多很多的思想，就用這個思想來主導他的生命，以這個想為自我，以這個想來決定什麼是該做、什麼是不該做。

最後，以行蘊為自我就比較高深，以造作為自我，乃至於以識為自我，以了別為自我。這個以行蘊為自我跟以識為自我，都是外道有禪定的人才有這種微細的分別；我們一般人都是以色為自我、以受為自我、以想為自我。可是這個分別我執，基本上是約著五取蘊的當體來執取為自我。

修我空觀的方法，第一個是修無常觀，觀察我們的色身、我們的感受跟思想都是生滅變化的，你不能當真的。從生滅變化中，你就知道它是一個虛妄相，它是在某一個時間、某一個空間才出現這個感受、出現這個思想，當時空改變時，我們的思想也改變了，所以它不能當作我們生命的主導。

所以這個即蘊計我的消滅方法是修無常觀。

（二）離蘊計我

這是是比較高明的，一般是外道的學者，他我相的執取是離蘊計我。就是說五蘊是生老病死，但是另外有一個不生不滅的我叫做神我，住在五蘊中來主導著我的五蘊，那這個修無常觀是沒辦法、沒有用的，因為這個五蘊是生滅，它是不生滅的。這怎麼辦呢？這時佛法的修觀，去觀察這個覓之了不可得。說是離開了五蘊有一個自我，請問這個自我是什麼相貌呢？外道就講不出來了。因為你講出一個相貌，一定是被五蘊所收攝，所以這個我是捏造出來的。

所以我們在修我空觀，主要的兩個方法就是：第一個是無常觀，第二個就是去觀察覓之了不可得。龍樹菩薩說：若我是五蘊，我即為生滅；若我異五蘊，即非五蘊相。我的當體是五蘊，那這個我就是生滅；第二個，如果離開了五蘊有一個我，那這就不是五蘊相了，這不是五蘊相，這是我們捏造出來的。所以我們在修大乘止觀，第一個先破壞分別的自我。

/VERSE/二者、不斷相應染。依信相應地，修學方便，漸漸能捨，得淨心地，究竟離故。

這個不斷相應染，是一個分別的法執，它的修學是從十信的滿心以上（就是十住、十信、十迴向），開始進一步的修學止觀的方便，慢慢的捨掉分別法執，到了初地的淨心地才究竟的消滅。

我執跟法執不同。我執，在唯識學是編入遍計所執性，這個東西是完全不存在的，如龜毛兔角，是我們自己捏造出來的。但是這個法執，它是依他起性，你不能夠說它沒有，它是依他起性有它存在的假名、假相、假用。

什麼叫法執呢？就是說如果你認為有一個法是離開你一念心性而單獨的存在，這個就是法執，就是心外有法。這個法跟你的心沒有關係，你的心不管是什麼樣的作用，它是有獨立體性的，你起善念也不能去改變它，你起惡念也不能改變它，這個法的存在叫做法執。

所以大乘佛法是以萬法唯識的道理來破法執。蕅益大師說：諸法無性，盡隨心轉：心為菩提，一切趨菩提；心為名利，一切法趨名利。一切法是沒有自性的，是由你的心來主導的。佛陀是依止菩提心來修習布施、持戒、忍辱的善法，這個善法變成無上菩提；魔王是依止心中的慾望來修習善法，結果這個善法變成魔王的果報。所以這個法是由心來主導的，當你能夠知道一切法是由心來主導，你就能夠消滅這個法執。

/VERSE/三者、分別智相應染。依具戒地漸離；乃至無相方便地，究竟離故。

這裡是消滅微細的法執，具戒地就是二地離垢地，具足了三聚淨戒。無相方便地：這是七地的菩薩，有甚深的我空、法空的智慧叫無相；方便地就是他還有功用行，他還要假藉種種的方便來加強他空觀的智慧，到七地才遠離這種微細的法執。

微細的法執的意思是說，它對於雜染法跟清淨法還有一些微細的分別。比如說他有時候入定，空觀現起；有時候出定，這個空觀就會慢慢的退轉。所以他在空有這方面，還不能得大自在；要到八地以後，才得到空有無礙的自在，這時微細的法執就消滅了。`;
