QXL.volNum = 16;
QXL.text = `
請大家打開《講義》第三十一頁。我們這一科講到明離染心次第。

在大乘佛法中講到心地法門，是有所破壞、有所建設。就是說我們在修止觀之前，要知道我們內心中有三個相貌：所謂的真如、無明跟染心。我們所對治的是染心跟無明，所要肯定的是我們的真如。這一段講到我們剛開始的修學止觀，是先對治這個染心。染心有六種染心，前面的三種是第六意識相應的染心，所謂的分別我法二執。這以下我們講第八識相應的染心，這個是俱生的煩惱，俱生的我法二執。

/VERSE/四者、現色不相應染。依色自在地，能離故。

這個色自在地是八地菩薩，八地菩薩能夠以色法得大自在，他內心止觀的力量，能夠把外在的瓦片變做黃金等等，他能夠在色法中得大自在。一個人會得自在，就是他心中障礙有破除；他障礙不破除就不能得自在，他一定是被煩惱所障住了。這八地菩薩他就是解脫了現色不相應染。

/VERSE/五者、能見心不相應染。依心自在地，能離故。

心自在地就是九地的善慧地。善慧地能夠成就四無礙智：法無礙、義無礙、辭無礙、樂說無礙。所以這個九地菩薩，他一方面能夠深入法義通達善巧，對於大小乘法門的義理跟他修學的方便法門都能夠通達；第二個對於眾生他能夠恆順眾生、廣設方便：所以他的心得大自在，他能夠攝受眾生得大自在。這個自在是約著智慧，這個四無礙智主要是約智慧，智慧得大自在。

/VERSE/六者、根本業不相應染。依菩薩盡地，得入如來地，能離故。

菩薩盡地是指十地的法雲地（法雲地，就是他這一念心是大法智雲，含眾德水。），他這一念心，攝受無量無邊的波羅蜜，乃至進一步到成佛以後。成佛以後，那一念清淨光明的心現前的時後，所謂的金剛道後異熟空，這無量無邊的生死業力全部消滅掉。佛陀沒有所謂的業力這件事情，佛陀來到三界都是依止清淨的願力，所以這根本業不相應染，要到佛時才窮盡、才真實的業盡情空。

這六種染心，法藏大師說：一念不覺生三細，境界為緣長六粗。就是四五六這三種不相應染，它生起的因緣是由不覺，就是一種人我對立的心情，這都非常的微細的。一二三生起的因緣，是由境界的刺激而引生的。

所以這意思說，我們剛開始在修大乘止觀，要以持戒作基礎。也就是說我們遵循佛陀的制教，在我們的生命中能夠劃分一道的界限，什麼是該做、什麼是不該做，剛開始先遠離雜染的環境，就是在你的這一念心中先建立一道的保護牆。在保護牆中，你不能只是停留在持戒，你在身口的持戒作基礎之下，內心中還有很多的執相應染、不斷相應染、分別智相應染，在那個地方不斷的活動，只是說它沒有環境的刺激而已。

這時我們應該進一步修無住，修我空、法空的法門。就是說我們這一念心假設沒有經過大乘止觀的訓練，要按我們過去的等流習性，我們這一念心是有所住。有些人是住在色法，有些人是住在感受，稍為高明一點的住在思想，就是這樣，或者是跟著你外表的色身來活動，或者跟著感覺走，或者跟著思想走。就是我們內心中，每一個人所住的因緣各式各樣，帶動各式各樣的業力。所以我們剛開始就是用我空觀、法空觀，把心中所執取的這個色受想行識的這些自性執，慢慢慢慢的把它消滅掉。

蕅益大師在《靈峰宗論》說：「今人輒論六度萬行，而以破執法門，曾不究心，求出輪迴，不亦難乎！」就是我們現在末法時代的眾生髮菩提心以後，剛開始就去修善法，輒論六度萬行；對於心中的破執，從來不下工夫，這樣求出輪迴，不亦難乎！就是說我們如果剛開始只是停留在持戒，靠著信心來持戒，內心中對於所謂的執相應染，不斷相應染，分別智相應染，那個我執法執的內心、有所住的心沒有消滅，那這個持戒只是一個善法。這個持戒會讓你來生依止這個善業的力量，變現一個安樂的果報，但是我們內心中的煩惱是存在的，跟安樂果報接觸時就開始造業了。

所以我們在持戒的基礎之下要修無住，這個無住的法門在臨命終非常重要。就是說我們如果平常對於自己的五蘊有很堅固的執取，你臨命終時雖然念佛也會構成障礙。所以憨山大師說：你這個五蘊的執取是熟境界，你對阿彌陀佛聖號的憶念是生疏的境界，結果是強者先牽。

所以我們平常修淨土不是到臨命終才修習，就是你平常靜坐時要經常修我空觀、法空觀，把我們內心中對五蘊感受思想的執取，每天鬆脫一點、鬆脫一點，慢慢慢慢你就能夠不隨妄轉，等到臨命終你念佛時，你對佛號的歸依的力量就很強。所以這裡我們剛開始先破執，破執這是第一點。

/KEPAN/巳二、明離不覺次第

前面是對治染心；這裡是對治根本無明，比較微細的。我們看論文：

/VERSE/不了一法界義者，從信相應地，觀察學斷。入淨心地，隨分得離。乃至如來地，能究竟離故。

這個無明的相貌就是不了一法界義者，就是我們在整個平等的生命中，虛妄的生起人我的對立，這個就是無明。這個無明什麼時候斷呢？從信相應地，觀察學斷。這裡要注意了！雖然無明是微細的，但是你從剛開始發心而成就信時，你就要去觀察我們這一念心具足體相用三大，而慢慢地去對治，斷除人我的對立，它不是在後面，我們待會再說明。到初歡喜地（初地）以後慢慢真實的遠離，然後慢慢的破一分的無明，證一分的法身，到成佛的如來地才究竟的遠離。

二、知真本有——肯定法門

前面的破執法門是偏重在達妄本空，這裡是偏重在知真本有。就是說破執法門，我們所破的是妄想，以我空觀、法空觀來破除由無明所帶動的我執跟法執；這裡遠離根本無明，他是憶念真如、正念真如，不斷的憶念平等不二的真如，來消滅我們對立的根本無明，是這個意思。

這兩個法藏大師說：我們剛開始在達妄本空時是對治染心，遠離不覺時是正念真如。這兩個法藏大師說是說有前後，治斷同時。就是說我們在言說時，喔！前面是對治染心，後面遠離根本不覺；但是在治斷時是同時的。這地方怎麼說呢？就是說大乘止觀跟小乘止觀，剛開始下手都是在破除我執、法執，這裡的方便法門是沒有差別的。沒有差別，那大乘不共於小乘的地方在哪裡呢？

大乘止觀的特色在於不二法門，悟入不二法門。就是說我們在破除我執、法執而悟入到無住時，我們同時會生心，無住而生心。譬如說小乘的學者證得我空法空以後，他鬆脫了對五蘊的執取以後，他就不再造作了，就入了不生不滅的涅槃了；大乘佛法也是假藉小乘的我空觀、法空觀，來鬆脫對五蘊的執取。但是五蘊的執取鬆脫以後，幹什麼呢？說我這個五蘊裡面沒有一個主宰者、沒有一個自我意識，我們後面的生命應該怎麼辦呢？應該怎麼走下去？就是依止願力。

這時我們從一種對感受的執取、對思想的執取鬆脫以後，取而代之的是內心中生起三種誓願：誓斷一切惡，誓修一切善，誓度一切眾生。這時我們生命的造作，就用三種目標來引導我們，以斷惡、修善、度眾生來當做整個菩薩的三大修學目標。所以大乘佛法的重點在於一個中庸之道，它破壞執取以後，要建立依止真如而顯現出來的誓願力，在這裡有所不同。

這裡，應該說遠離不覺的次第是大乘的不共法門，前面的對治染心應該是共小乘的修學。這裡我們講到修習悟淨的因緣，一方面達妄本空，有所破壞；一方面知真本有，有所肯定。

/KEPAN/辰二、轉釋相應不相應義

把我們對治這個煩惱有相應跟不相應作一個說明。

/VERSE/言相應義者，謂心念法異，依染淨差別，而知相緣相同故。不相應義者，即心不覺，常無別異，不同知相緣相故。

先解釋相應。有的煩惱叫相應染，有的叫不相應染，所謂的相應就是心念，這個心念是能緣的心，這個法是所緣的境。說我們能緣的心跟所緣的境，這兩個法是有差別的，叫做異。但是約著染淨的因緣來說，這個知相，這個能緣能心跟所緣的境的緣相，這二個是相隨順的，這叫做相應。也就是說前面的三種染心，它會隨環境而相應：你接觸到雜染的環境，這三種染心就會增長；你接觸清淨的環境，這三種染心就會減少，這叫做相應，知相跟緣相是相隨順的這叫相應。

反過來，不相應義者，即心不覺，常無別異，不同知相緣相故。不相應義就是依止著即心不覺，這個即心不覺就是阿賴耶識，阿賴耶識它雖然是不覺，但是它是不離開真如的不覺，就是阿賴耶識。阿賴耶識所引生的煩惱，它的體性沒有所謂的差別相，它不管遇到什麼環境，它的心都是無記的，環境對它的煩惱不會增長，也不會減少，這叫做不相應。

/KEPAN/卯三、結示二障

我們把前面所對治的不覺跟染心作一個總結：

/VERSE/又染心義者，名為煩惱礙，能障真如根本智故。無明義者，名為智礙，能障世間自然業智故。

這個染心是第六意識所分別的、引生的我執、法執，它是一種煩惱障，產生煩惱障礙真如的二空之理，這根本智就是我空、法空的根本智。這個無明，這個一念的妄動產生人我的對立，這個叫做智礙，障礙我們的後得智，障礙世間的自然業智故。這裡先作一個總說，以下把這道理開展出來。

/VERSE/此義云何？

為什麼這樣講呢？（何以染心為煩惱礙，無明為智礙？）

/VERSE/以依染心，能見能現，妄取境界，違平等性故。以一切法常靜，無有起相。無明不覺，妄與法違，故不能得隨順，世間一切境界，種種知故。

首先說明這個染心對我們的障礙：我們依止這六種染心所謂的能見能現，剛開始有人我的對立而產生我相、人相的對立，這個能見能現是後三種微細的不相應煩惱；妄取境界是前面三種相應的煩惱：這些都是違背我空、法空的平等性，所以障礙我們根本智的生起。

再講到這個無明，以一切法常靜，無有起相。一切法的本性本來是寂靜的，這個寂靜就是平等不二：諸法從本來，常自寂滅相，本來是沒有所謂的佛陀、眾生這些染淨的差別，沒有這種生滅的起動相，但是因為一念的無明妄動以後，妄與法違，就虛妄的跟真如寂靜的法相違背，就不能隨順平等的道理，所以對於這世間的差別相貌，就不能隨順一切境界的差別，而生起了種種的了知，對於差別相就有障礙，障礙後得智。這個後得智的障礙，看本論的意思，主要是一種對立的心情產生。

我們如果研究《易經》，中國文化裡面講到《易經》這個文王八卦，就是你想要知道某一件事情會不會出現，你在卜卦的時後，有些人卜卦會成功，有些人會失敗。關鍵點在哪裡呢？如果你卜卦時，你的心不平等，起心動念，這時你的卦象就不准了，就是你那個心念去干擾這個卦象；如果你在卜卦時，能夠保持平等心，遠離我相、人相的對立，以平常心來卜卦，這個卦象就非常准。也就是說這一切法的存在，它有一個自然的軌則在運作。這個自然軌則，它就會去引導這個卦出現什麼相貌，你從這個相貌中，就知道一些消息。但是如果你內心中不平等，這時這個卦象就受到你的心的干擾，它就有問題，產生障礙了。

當然這個卜卦是世間法，很多佛法的道理都是這樣。你看這個密宗的本尊相應法，本尊相應法有兩種修法：

第一個是事相的歸依，說我是業障凡夫，阿彌陀佛是萬德莊嚴。當然這是種對立的觀念，是一種事持，但是沒關係！我是業障凡夫，阿彌陀佛是萬德莊嚴，我對你通身靠倒，我祈求你的救拔。當然剛開始能這樣就很不錯了，依止信心來念佛。

蕅益大師在《彌陀要解》裡面強調：你應該再提升，你要相信心、佛、眾生三無差別。我們念佛也好、持大悲咒、修觀世音菩薩本尊相應、或者你是修文殊菩薩本尊相應，你在持本尊咒或者念阿彌陀佛時，你內心中要一念不生。就是你的心進入到本尊的心性，本尊的心也進入到你的心性，這時平等不二。你以平等不二的心來念阿彌陀佛的聖號，那這時套一句印光大師的話：即眾生心，投大覺海。這時你得到阿彌陀佛的加持是不可思議的。

從理論上來說，十方諸佛對我們都有很大的悲憫心，很想要加持我們；但是這當中有障礙，就是我們的心不平等，他的力量加持不下來。所以以一切法常靜，無有起相，這是我們的本來面目；但是無明不覺，妄與法違，我們自己在平等法界中，我們一定要去創造一個對立相：你是佛、我是眾生，你怎麼樣、我怎麼樣，所以就不能夠隨順世間一切的境界差別，而生起種種的了知，乃至於得到諸佛的加持，這個就是所謂的智礙，障礙我們後得智的生起。

這裡是把染心跟無明所引生的一個障礙作一個總結。

/KEPAN/子三、辨生滅之相
/KEPAN/丑一、正辨

這裡的生滅心，是偏重在六種染心的相貌作一個辨別，這當中分成兩科，先看丑一的正辨，正式的辨別。

/VERSE/復次，生滅相者，有二種，云何為二？一者粗，與心相應故。二者細，與心不相應故。

這個生滅心廣泛來說，包括了根本無明，包括了六種染心，這裡論文兩個都提到了。看這個粗，與心相應故。與心相應當然就是跟外在的環境相應，這裡是第六意識相應的；二者細，與心不相應故。就是外在的環境跟心所法不相應，這是阿賴耶識，第八識相應的。先作粗跟細的大判，再把它細分成四種：

/VERSE/又麤中之麤，凡夫境界；粗中之細，及細中粗，菩薩境界；細中之細，是佛境界。

把染心的差別分成四種：

一、粗中之粗是指這六種染心的第一個染心，叫執相應染，執相應染是分別我執引生的，對於五取蘊相的執取，這個是凡夫能夠對治、夠覺悟的境界。

二、粗中之細是指的第二跟第三，就是不斷相應染跟分別智相應染，叫粗中之細。

三、細中之粗是指的第四跟第五個染心，現色不相應染跟能見心不相應染。這四種染心都是菩薩所覺悟的境界。

四、細中之細，是佛境界，這個細中之細是指最後的染心，最微細的根本業不相應染，這個是等覺菩薩入金剛喻定時所對治的，是佛的境界。下面作一個總結：

此二種生滅，依於無明熏習而有，所謂依因依緣。依因者，不覺義故；依緣者，妄作境界義故。若因滅則緣滅。因滅故，不相應心滅。緣滅故，相應心滅。

這二種生滅相，包括粗的生滅相跟細的生滅相， 它是怎麼產生呢？是依止無明的熏習而有的 ，所謂的依因依緣，這個因是指內因力，一個是外緣力。依因者，什麼叫依因呢？是不覺義故，是由不覺引生的。依緣者，妄作境界義故，這個作就是執取，由對境界的執取而產生的。所以這個因 產生三細的煩惱，依止緣就產生六粗的煩惱。

生相如此，那還滅呢？若因滅，則緣滅。因滅故，不相應心滅。緣滅故，相應心滅。假設我們今天是直接從一種不覺，從人我的對立心消失， 外在的因緣就消滅。因滅故，不相應心滅。就是說你這個不覺的功能被破壞以後，後三種微細的染心就消失了 ，阿賴耶識的染心就消失了。如果是緣滅故，相應心滅，前面的三種染心也就消失了。

這裡我們說明一下 ：

若因滅，則緣滅這句話，我相信很多人會產生疑惑。這個一念不覺生三細，境界為緣長六粗，當然一念不 覺是一個因，這個境界是一個緣。這染心的生起有兩個：一個是內因力，一個是外緣力。從理論上來說：應該是先 破壞這個緣，因為這個境界為緣長六粗，這個是比較粗的 。所以法藏大師說：因滅則緣滅，這裡是約道理上來說的，從道理上說因滅則緣滅。從實際的修證上來說，應該是要先緣滅則因滅。

譬如說：十二因緣的流轉跟還滅。我們經常說：無明緣行、行緣識、識緣名色，名色緣 六入，乃至於生老病死，流轉門是這樣。還滅門我們會說：無明滅則行滅，行滅則識滅，識滅則生老病死滅。

但正式理論上來說，沒有一個人修行是直接破無明的，沒有這回事情。就是說流轉門的修學次第，一定是先斷愛取，取滅則愛滅，愛滅然後再破名色滅。就是說煩惱的生起是從細到粗，但是對治煩惱是從粗到細。但是我們在理論上經常會說：無明滅則行滅，行滅則識滅；但是你修行不是這樣修的。

法藏大師講出一個譬喻：你有一件衣服弄髒了，這個灰塵是怎麼回事呢？它是一層一層卡上去的。第一層灰塵，第二層灰塵，到第九層灰塵，三細六粗。但是你洗時，一定是先洗外面的灰塵，第九層，再洗第八層 ，再洗第七層，你不可能直接洗第一層，不可能。所以你洗衣服時是從外面洗進去，但是你生起灰塵是從內而到外。

所以這裡因滅則緣滅是約理論上說，但是實際修證是緣滅則因滅。所以你要先斷外境引生的煩惱，再對治你內心根本不覺的煩惱。

從馬鳴菩薩的這個觀念，我們學大乘止觀會有一個心得，說是境界為緣長六粗，看這個意思，如果我們有志於成就解脫（當然我們每一個人來到三寶的境界，成就種種的功德，三寶如大海。但是如果你要得到的寶是比較大的寶，是解脫，而不是成就人天福報，你要能夠出家，這件事情你佔了便宜。），這個境界為緣長六粗，就是你在出家的因緣中，整天跟三寶相應，你要調伏粗重的我法二執比較容易。因為在家居士一天到晚被這個環境刺激，你沒辦法生起對治力了。所以這裡就是緣滅則因滅，這裡的次第不能弄錯。

/KEPAN/丑二、釋疑

有關因緣的消滅，這裡提出一個疑問：

/VERSE/問曰：若心滅者，云何相續？若相續者，云何說究竟滅？

這裡對滅這句話有疑惑，說是心滅，假設我們的心在修我空觀、法空觀時消失了，這個生命就不能相續，大乘佛法所謂無量生命的觀念就不能建立了。如果說我們一定要建立一個生命的相續，說成佛以後還有生命，那你怎麼說是有所謂的滅這個字？這個滅跟相續好像產生衝突了，提出這個疑問。我們看馬鳴菩薩怎麼回答：

/VERSE/答曰：所言滅者，唯心相滅，非心體滅。

先作一個總答。我們修大乘止觀時要注意，你所消滅的是內心的雜染相，就是這個依止五取蘊相的執取。譬如說：有些人對自己色身的貪愛特別厲害，跟貪愛有關、跟他色身有關係的，乃至於去造業都無所謂，就是他用色身來主導他的生命；有些人依止感受；有些人依止思想。那這種對五取蘊的執取要完全消滅。但是能執取那個明瞭的心性，這個心體不能消滅，是這個意思。先作一個總答。好，我們看第二段的詳答。詳答中，馬鳴菩薩先講出一個譬喻：

/VERSE/如風依水而有動相，若水滅者，則風相斷絕，無所依止。以水不滅，風相相續。唯風滅故，動相隨滅，非是水滅。

這個譬喻中有三個法：第一個是風；第二個是水；第三個是動相，這個動相就是波浪。說我們剛開始的心就像水，就是一個濕性，一個真如的濕性，它是非動非靜。這個濕性的水，莫名其妙的吹了一陣的無明風，也不知道是怎麼來的，這風一吹以後就產生波浪了，就變成染心。

這時我們怎麼辦呢？怎麼把水這個波浪恢複本來面目呢？

第一個、二乘：若水滅者，則風相斷絕，無所依止。這裡就是講到修證的過程中，二乘人的態度。二乘人看到這個波浪是非常不好，結果他在消滅波浪時，連這個水的濕性也消滅，這時不管是風，還有風所起的波浪，乃至於這濕性的水都消滅了，這時生命就變成無所依止了。說這個人他的確不能造惡業，但是他可也不能造善業，所以這個人的心從有情轉成無情，灰身泯智，這個是二乘人對治的方法。

第二個、凡夫：以水不滅，風相相續。當然凡夫更糟糕了，凡夫就是完全的放縱，跟著感覺走，跟著思想走，雖然濕性沒有消滅，但是他的風相，他的無明風也沒有消滅，他沒有錯損菩提，但是可也沒辦法對治煩惱，當然是不斷的流轉下去，凡夫的相貌是這樣。

第三個、菩薩：菩薩的相貌，唯風滅故，動相隨滅，非是水滅。菩薩有善巧，他在修止觀之前能夠通達整個內心的正見，所以他知道他所對治的是風，把這個風的無明消滅，那麼波浪也消滅，但是這個濕性是保存下來，他依止菩提心，修六波羅蜜等善法的這個明瞭心性保存下。這裡是譬喻，以下合法。

/VERSE/無明亦爾，依心體而動。若心體滅者，則眾生斷絕，無所依止。以體不滅，心得相續。唯癡滅故，心相隨滅，非心智滅。

無明的生滅道理也是這樣，就是它有清淨的心體，而一念的妄動；如果你今天把心體消滅，你這個眾生的生命就斷絕，無所依止了。

所以我們正確的方法是：心體，這個清淨明瞭心性的心體不能消滅，這樣使令我們的心能夠相續，我們能夠成佛以後盡未來際的廣度眾生；所消滅的是內心的愚癡，我執、法執的障礙。這種擾亂我們清淨心的這些我執、法執的心相消滅，但是內心清淨的智慧是不消滅的，它是有所破壞、有所承當的一個中庸之道。

這裡講到整個大乘的止觀的一個修習次第。

大乘佛法，你剛開始依止信心（當然我們的信心剛開始就是對三寶的信心），相信我們是業障凡夫，十方諸佛是萬德莊嚴，他們一定能夠救拔我們，這樣一個對立的心態是可以理解的。但是沒關係，我是業障凡夫沒關係，阿彌陀佛阿彌陀佛通身靠倒，剛開始的心態都是心外求法，剛開始是這樣的。信佛、信法、信僧，祈求三寶的救拔。

但是我們慢慢慢慢開始會發覺：原來我這個業障凡夫的這一念心，他的本性也不可思議，他的心跟諸佛是平等的，他這一念心如來藏具足無漏性空德故，能生一切世出世間善因果故，他也能夠生起功德的，跟十方諸佛沒有差別。這時我們從對三寶的歸依，開始也對自己根本清淨的本性產生了信心，產生了歸依。

這時我們在修學佛法的心態，套一句幽溪大師的話是：托彼依正，顯我自性。托彼依正，假藉外在三寶莊嚴的因緣，來啟發我們的自性；但是也不能沒有三寶，托彼依正，顯我自性，這時就是進入到信四種法──信根本，信佛、信法、信僧。這個論文大義如此。`;
