QXL.volNum = 17;
QXL.text = `
請大家打開《講義》第三十四頁。癸二、明染淨熏習

本論總共有五分，所謂的因緣分、立義分、解釋分、修行信心分、勸修利益分。這五分中，因緣分等於是個總說。其他四分，法藏大師判作信、解、行、證，成就大乘的四種功德。我們這一科是解釋分，主要就是解釋生命的真實相，本論是以一心二門來解釋生命的真相。所謂的心真如門，這當中有兩個內涵：

第一個、如實空義：就是所謂的真如平等，無增減故，就是我們這一念分別心。剛開始我們觀察我們這念心時，有善念有惡念，這樣叫做不平等。當我們把這些不平等的因緣所生法都撥開以後，我們看到內心的深處那是一個不生不滅、不垢不淨、不增不減的，沒有對立的一個平等相貌，這樣的相貌叫如實空義。

第二個、如實不空：所謂如來藏具足無漏性功德故。我們這一念清淨平等的心性，它有可能成就諸佛的種種神通三昧，有這種可能性，因為它具足無漏的性功德，只要我們肯努力，一切諸佛的萬德莊嚴都是可以成就的，這樣的內涵叫做如實不空。

這真如門就是我們整個十法界所共同依止的一個清淨的本性，這是我們對生命的第一個了解。

其次，我們應該進一步了解生滅門，所謂的依體起用。這生滅門它是很多差別的個體生命，這些個體生命佛法說有十法界的差別因果。十法界的因果，主要是由迷跟悟所引生的。從本論生滅門的開示，大致把生滅門的因緣果報分成四類：

第一種、依止慾望——三塗種性

第一種眾生他內心中是依止慾望，心隨妄轉。內心中以慾望為根本，造的是殺盜淫妄的罪業，招感三惡道的果報，這樣的情況就是依止不覺所帶動的生滅果報，天台宗認為這叫做三塗種性。

第二種、依止業果——人天種性

內心中以業果為住。在業果的思想中說：我們的內心中不可能沒有慾望，但是應該加以克制，所謂的克己復禮，以因果的道理來調伏心中的慾望，使令我們在生命中，遵守著君君、臣臣、父父、子子，每一個人都應該按照自己的本分來行事，來調伏自己的私慾。能夠依止業果而行，他們的生滅門就是趨向於人天的安樂果報。

第三種、依止空性——二乘種性

的生滅現像是依止空性，他對整個生命的觀察是以無常、無我來做他生命的根本，使令生命趨向於畢竟空的涅槃，而成就二乘的功德。

第四種、依止實相——菩薩種性

生滅門是依止中道實相，能夠不住生死，不住涅槃，猶如蓮花不著水，亦如日月不住空，以真空妙有的中道實相，來當做他生命的歸依處，這樣就直接的趨向於諸佛的萬德莊嚴。

所以生滅門就是每一個人內心中，他的依止處有所不同，發動了不同的業力，也就招感了各式各樣差別的果報，這些都是生滅門所收攝的。

當我們在觀察生命時，我們了解：從本體來說，是無差別的體性；從因緣上，就是因為迷悟而有十法界的染淨因果。所以能夠知道依體起用，用不離體，就是這種體是不生滅的，作用是各式各樣的差別，能夠觀察體用同時、體用不二，我們就正確而不顛倒的看到生命的全貌，這是真生不二──真如門跟生滅門是不二的，這就是本論在解釋分中所要強調的宗旨。

這一科講到生滅門，講到染淨的熏習，這裡的科我們把它作一個說明，先翻到《講義》第十九頁。十九頁中講到辛二、釋心生滅門，這當中分兩科：壬一、正釋此心生滅因緣相，先講因緣的差別相，第二科再講心性的體相用三大，再會歸到不生滅體相用三大的理體。生滅因緣相又分兩科：癸一、明染淨生滅，這一科是單單就著染法的生滅跟淨法的生滅。這染法是怎麼生起的，怎麼消失的？淨法是怎麼生起，怎麼消失的？就染淨二法個別的生滅相貌，這是第一個部分。

現在是講它的第二個部分，癸二、明染淨的熏習。前面的染淨法是強調個體的生起因緣，這裡是強調染法跟淨法之間互相的作用。從現實的角度，我們內心中在起心動念時，往往都是染淨互相的熏習。就是說起了善念，但善念中也夾帶著惡念；雖然起惡念，但是也夾帶了善念。只是說哪一個勢力比較強大，如此而已。哪一個勢力強大，它在熏習中就扮演了主導的角色，所以這一科是把染淨二法的相互作用作一個說明，這當中有四科，先看第一科：

/KEPAN/癸二、明染淨熏習
/KEPAN/子一、總標熏義

先作一個總標，把熏習的內涵作一個總說：

/VERSE/復次，有四種法熏習義故，染法淨法，起不斷絕。

在我們的生命中有四種的法，這四種法相互的熏習，使令生命中產生一種染法的相續跟淨法的相續。染法的相續，是依止不覺所帶動的流轉力量，使令我們在生命中更加的墮落；淨法的熏習，就是依止覺悟所產生的還滅力量，使我們的生命不斷的超升。當然染法、淨法生起的相續，都是由這四種法來相互作用的。

/VERSE/云何為四？一者淨法，名為真如；二者一切染因，名為無明；三者妄心，名為業識；四者妄境界，所謂六塵。

這當中講到有四種法對我們的生命的流轉跟還滅產生了一定的影響：

一者淨法，名為真如：第一個是清淨法，清淨法就是它的體性是決定的，決定是清淨的，清淨法就是真如，真如的熏習。這裡大家可能會質疑說：理論上說真如平等，無增減故；但是前面也說過：我們一念不覺以後，整個真如變成阿賴耶識。所以在凡夫位，真如在實際的作用上已經是不存在了，為什麼在熏習中有真如這句話呢？我們解釋一下。

這裡的真如，法藏大師解釋說：真如就是一種本覺的智慧。就是真如被無明的熏習妄動以後，整個真如變成一個阿賴耶三細的煩惱，但是他內心中本覺的功能沒有失掉。所謂的本覺，就是真如裡面那個如實不空，如來藏具足無漏性功德故。本覺的功能它相續的保存在阿賴耶識，這種本覺的功能就是真如。

真如蕅益大師註解說：真如就是在阿賴耶識中所具足的一個無漏的種子。這無漏的種子為什麼叫真如？因為這種功能它隨順真如法故，名為真如。就是它本身不是真如，但是它會引導我們厭惡生死、欣求涅槃，當它被起動時候，有這種功能，所以它隨順真如，所以也可以成為真如，以阿賴耶識的無漏種子，我們一種本具的善根，這是在我們的生命中第一個清淨法的熏習。

二者一切染因，名為無明：這裡無明是指根本無明，就是我們剛開始從真如的法性一念的妄動（會妄動的理由，就是不了一真法界故。），我們對於清淨平等的法界產生迷惑顛倒、產生了能所的對立，能所對立以後，我相人相對立以後，開始向外的去追求，這個念頭的生起叫做無明，無明就是愚癡的意思，是一切染法的根源，這體性也是決定的。

三者妄心，名為業識：妄的意思就是生滅的意思，我們的生滅心名為業識。這裡法藏大師說：應該再補充一個事識，應該是業識跟心識，這二個就包括第八識、前六識都在裡面。這個妄心是通於染淨的，也可能是染、也可能是淨。它如果跟真如相應，妄心就是清淨的；妄心跟無明相應，它就是染污了。

四者妄境界，所謂六塵：這種生滅的境界也是通染、通淨的。就是我們所接觸色、聲、香、味、觸、法的境界：如果是三寶的境界，在我們生命中就扮演一種還滅的功能、解脫的功德；如果是一個五欲的境界，就引導我們向下墮落。所以環境的熏習，對我們也扮演一個重要角色。

所以這裡的染淨熏習有四個法：真如、無明、妄心、妄境。這裡先作一個總標。以下把熏習的內涵作一個說明。

/VERSE/熏習義者：如世間衣服，實無於香，若人以香而熏習故，則有香氣。

這一段先作一個譬喻。什麼叫熏習？這四個法相互的作用，為什麼叫熏習？比如說這世間上的衣服，我們把它洗乾淨以後，這衣服是沒有香氣；我們現在以沉香來熏習衣服，這衣服就有香氣。我們在了解熏習，你要知道所謂的熏習它一定是二個法，一個法不可能熏習的。二個法，某甲釋放一種力量，某乙也釋放一種力量，這當中看哪一個力量強大，強大的那一邊就扮演著主導角色。這當中衣服跟香，香的勢力強大，所以它能夠去改造衣服，而不是衣服能夠改造香。這段是作一個總說，以下合法，先講到染法的熏習。

/VERSE/此亦如是。真如淨法，實無於染﹔但以無明而熏習故，則有染相。

我們的本來面目是清淨本然的，本來是沒有這些煩惱罪業的，那為什麼會有煩惱罪業？但以無明而熏習故，則有染相。當我們從一個真如平等的法界動了一個妄念以後，妄念它開始起動以後，假設我們沒有加以對治，它就一次一次的發生作用。不管白天晚上，不管我們白天待人處事，或者晚上做夢，我們內心總是覺得：我跟你不一樣，你也跟我不一樣。這生命是有很多的個體生命，有我、有你、有他、有阿羅漢、有菩薩、有佛，這些個體生命，完全是獨立的，沒有交集的。我們對生命的看法，在流轉中，每一次的生命，總是覺得生命是一種對立的。這樣的熏習就使令我們的煩惱業力不斷的增長，就是沒有去作一些對治還滅的功夫，這就是所謂的第一個染法的熏習的因緣。

/VERSE/無明染法，實無淨業；但以真如而熏習故，則有淨用。

我們在無明的染法中，不可能生起一些自利利他的功德，沒有這些清淨的妙用；但是我們依止真如，這個真如前面說過，是一種本覺的功能，一種覺悟的功能。覺悟有包括止觀──包括對治的我空、法空觀的破執法門，也包括了根本觀──正念真如，直接的憶念真如。依止這樣對真如不斷的觀照熏修，就能夠產生種種戒定慧的妙用，戒、定、慧、解脫、解脫知見種種解脫的妙用。就是你能夠從無明中發起覺悟，就能夠產生妙用，這就是所謂的淨法熏習。

熏習，在這一段是作一個總說。這個熏習在本論中有四個法：真如、無明、妄心、妄境。這當中，法藏大師強調有三個觀念值得注意，我們作一個說明。

第一個、熏習的依止處：在整個熏習的作用中，你要知道這四個法的依止處，主要就是染心。就是說熏習的作用，是依止什麼來發揮作用？其實就是依止我們這一念第六意識的分別心，它是整個染淨熏習的依止處。

我們講一個譬喻，譬如說我們去參加拔河比賽，拔河比賽有甲方跟乙方，兩方都往他自己的方向用力的拔。當然有可能是甲方贏，或者是乙方勝，都有可能。但是拔河比賽，兩方一定要有一個共同的依止處，就是依止繩子。他們以繩子為依止處，產生正面跟反面兩種的力量。我們講到四個法的熏習亦復如是，有真如、有無明、有妄境，這三個法的作用都是依止我們第六意識的生滅心而發動的。所以這裡你要知道熏習的依止處是什麼。

第二個、熏習的強弱：這個熏習有強、弱的不同。譬如說今天某甲跟某乙兩個人住在一起，剛開始某甲有他的習性，釋放他習性的力量；某乙也釋放一種力量。那到底是誰改變誰呢？熏習簡單的說就是同化，我跟你住在一起，是你改變我，還是我改變你呢？這時是看誰的勢力強大。就是說在熏習的過程中，勢力強大的叫做能熏；勢力薄弱的就是所熏，它變成被動。所以我們內心中也是這樣，有時候，我們有煩惱但是有善根，有善根有煩惱，到底是煩惱熏習善根，或者是善根熏習煩惱呢？那就要看誰的勢力強大。勢大強大的，扮演一個主導角色叫能熏，勢力薄弱的叫做所熏。所以在這熏習中，你要把握一個強弱的差別。

第三個、熏習的內外差別：在熏習的過程中，你要把握內、外的差別。熏習，法藏大師說：有內引生跟外引生。由內在體性所引生的叫做習熏，就是說它是自己的體性引生的，從自己引生的。不管是染法淨法，它本身自己引生起來叫做習熏。第二個叫做資熏，資熏是由外在的因緣引生的，由外在的資助引生的，就是由外因緣引生的功能叫做資熏。

所以在研究熏習時，要掌握三個要點：第一個是熏習的依止處，第二個是熏習的強弱，第三個是熏習的內外差別。後面講到染法的熏習，講到淨法的熏習，都不離開這三個原則。

/KEPAN/子二、釋熏習染法
/KEPAN/丑一、正明熏義

釋熏習染法這是一個倒裝句，等於是染法熏習的意思。前面是作一個總說，這裡是各別解釋染法的熏習。染法熏習中分兩科，丑一、正明熏義，正式說明我們這些雜染法生起的因緣。

為什麼我們會有煩惱跟罪業？這不是上帝給我們的，是由熏習而來的。

/VERSE/云何熏習，起染法不斷？

這裡是問：什麼樣的因緣熏習，會使令內心中這些煩惱罪業的力量生起，而且相續不斷？為什麼我們今天死亡以後，又會去招感一個生死？由一個生死，又去招感另一個生死？這種生死相續，到底是什麼力量在支持？提出一個問。這以下有三段，我們先念一遍：

/VERSE/所謂以依真如法故，有於無明。以有無明染法因故，即熏習真如。以熏習故，則有妄心。以有妄心，即熏習無明。不了真如法故，不覺念起，現妄境界。以有妄境界染法緣故，即熏習妄心，令其念著，造種種業。受於一切身心等苦。

這裡是說明有情眾生流轉力量的生起，這當中有三段，由細到粗有三段。

第一段、「所謂以依真如法故，有於無明。」

我們今天如果把生命回歸到原點，剛開始就是真如，就是生命中的本來面目是清淨本然，週遍法界；週遍法界，清淨本然，這當中突然間一念的妄動，就是一念的愚癡妄動，產生對立以後，就產生無明，這個無明就是根本無明。

這地方，我們讀馬鳴菩薩的教法，他一再強調說：無明是後來才有的。就是說我們雖然有無量無邊的煩惱罪業要去處理，但是在處理之前一定要相信：要處理的這些煩惱跟罪業都是後來才加上去的，它不是你的本來面目。

這個很重要，大乘佛法的修行你要不忘本，你要知道你的根本是什麼。你的根本是清淨本然，週遍法界；這煩惱不是你的根本。為什麼會有煩惱呢？所謂以依真如法故，有於無明。就是從一個真如的平等法界中一念的妄動才有的，這是第一個產生根本無明。

第二段、「以有無明染法因故，即熏習真如。以熏習故，則有妄心。」

第二個產生妄心了。我們無明的生起，是一個對立的心，剛開始無明是不造善也不造惡的，是無記的，只是一個對立的思考，對立的思考是流轉的第一個因，無明染法的因緣。這個第一因佛法講此生故彼生，此有故彼有，我們沒有去對治，所以無明生起以後，它就去熏習真如，它的勢力強大強大，就不斷地的去干擾真如，干擾的結果則有妄心。

就是說真如的體性是清淨本然，週遍法界，我們剛開始在清淨本然的心中，本來是出現一個小黑點、一個無明、一個對立的心；但是不幸的是我們沒有馬上對治，它就在那個地方不斷地擴大、擴大、擴大，到最後整個真如被無明這種對立的思考佔有以後，我們的真如就變成整個妄心，這個妄心就是阿賴耶識三細的煩惱，開始產生一種三細，有一種個體生命，有一個能所的個體生命，有一個我、有一個我所用的環境。妄心這種微細的阿賴耶識生起以後，我們剛始有個體生命的生起了，這是第二段的流轉的力量。

第三段、「以有妄心，即熏習無明。不了真如法故，不覺念起，現妄境界。以有妄境界染法緣故，即熏習妄心，令其念著，造種種業。受於一切身心等苦。」

這第三段的熏習就比較粗顯。當我們開始有妄心以後，開始有個體生命的一個心識以後，它又加強最初的無明。就是我們本來只是一個對立的思考，是不能造業；但是妄心是會造業的，開始造業了。妄心跟環境一接觸時開始造業，又加強最初不覺的力量，對真如的平等法更加的不了知，這時就現出種種的妄境。當然你造了業，就得果報了，可能是到天上得果報，也可能到三惡道得果報。依止這個環境的熏習，又加強我們的妄心，產生六粗，就熏習妄心。

這裡的妄心是指第六意識，前面的妄心是第八識。這裡是六粗的煩惱，使令我們第六意識累積很多的生命經驗，令其念著，我們對很多的環境，會產生很多的執取。我們會喜歡某一種因緣，而排斥某一種因緣，這種愛憎取捨念頭的相續，就帶動我們去造業。我們開始追求想要的，排斥我們所不要的，這種取捨的過程中當然就會造業了，由業力就招感了三界輪迴的痛苦。

這裡就說，我們從真如的法界生起了對立的心，由對立的心產生個體生命，依止個體生命再產生愛取的煩惱，再造業，再流轉，這是一個流轉的力量。在染法的熏習中，前面我們也說過：所有染淨的熏習一定是以妄心為依止。這個妄心從本論來看我們可以作一個總結：我們這一念心會往下墮落，這當中有兩個因素：

第一個就是不覺，不覺為因生三細，就是我們心中的愚癡。就是說我們對眾生假設一直存在一種不平等的觀念，我跟你不一樣，你跟我也永遠不一樣，我們二個之間不可能會有所謂的交集點。這種思考不加以對治時，我們不可能離開阿賴耶識的，不可能離開個體生命，也不可能回歸到真如去，不可能。這不覺為因生三細，這個體生命的產生是由不覺引生，這不覺去刺激妄心。

第二個是境界為緣長六粗，我們粗重欲妄的生起跟環境有關，你這個妄心接觸的色聲香味觸法，都是五欲的境界，我們就產生慾望、愛著；我們今天經常跟佛法僧三寶的因緣接觸，我們內心中就產生一個清淨的善根──信進念定慧的善根，這跟環境也有關係。

所以我們在虛妄的熏習中，第一個不覺為因，第二個境界為緣。我們內心的愚癡這是一個因素，第二個染污的環境這也是一個因素，這兩個對我們整個生死的輪轉，扮演著一個非常強大的力量。

這裡我們也說一下：在染法的熏習中，是無明熏習真如，無明扮演著一個主導角色，無明熏習真如，這個境界又熏習妄心。這裡無明熏習真如我們解釋一下。

中觀的學者，特別是在明末以後的中觀學者，對大乘佛教安立真如或如來藏的確有一點意見。中觀學派的思想是自性空，因緣有。他認為這個真如的安立，違背自性空的思想。好像說我們這一念心中有一個自性，這個自性就是真如，跟外道的神我思想沒有差別。當然這種看法的確是一種錯誤的誤解。

因為在本論中安立真如，但是它說無明熏習真如，這個真如會受無明的熏習，這表示這個真如它有隨緣義。假設大乘法安立真如是有自性，它就不應該受到熏習，就是這個東西有自性，誰也不能去改造它、同化它，不可能！你無明再怎麼妄動，真如還是真如，這樣是有自性。

但是在大乘佛法安立真如是說：真如有不變義，也有隨緣義。它受到無明的干擾，這時真如功能就消失掉了；真如如果受到智慧的觀照，真如的功能就恢復。所以這裡沒有說真如有自性，中觀學者質疑真如有自性，是誤會了大乘這部分的教法。它沒有這個過失，你這樣質疑它，那就是誤解了。

這裡無明熏習真如，就給我們很大的思考。當然如果我們學得不善巧，我們說內心中真如平等無增減故，有一個真如，這個真如是有自性的，不管我是放逸也好、精進也好，它永遠是這個相貌，你心中的真如是自性執了，不是馬鳴菩薩所安立的真如。

馬鳴菩薩安立的真如是受熏。就是說你要精進，你真如的功能就增長廣大；你要放逸，真如的功能就慢慢消失掉。馬鳴菩薩的真如是這樣安立的，就是無明熏習真如，這裡沒有說他有自性。這裡你在研究教法要把重點抓出來。這裡是講到染法的熏習。`;
