QXL.volNum = 18;
QXL.text = `
請大家打開《講義》第三十五頁。這一科是講到子二、染法的熏習，這當中分兩科：第一科是正明熏義，先把染法生起的因緣作一個總說；現在講到丑二、釋義差別。

/KEPAN/丑二、釋義差別

雜染法的生起當然有三個因素，第一個是無明，第二個是妄心，第三個是妄境，這三個相互作用。前面一段是一個總說、是一個略說，這以下把無明、妄心、妄境詳細的差別情況作一個說明。我們看論文，這當中有三段，先看第一段：

/VERSE/此妄境界熏習義，則有二種。云何為二？一者增長念熏習，二者增長取熏習。

我們先講到環境對我們的影響，我們所接觸的這些顏色、聲音，乃至各式各樣的觸覺，這種六塵境界對我們的內心產生兩種的影響：第一個增長我們的念，第二個增長我們的取。

這個念法藏大師說是一種分別心，就是智相跟相續相，這裡等於是一個分別的法執，我們對某一個人、某一件事情，產生一種好壞的一種看法，增長念熏習。

我過去讀佛學院時，我們佛學院的老師都是傳統佛教的老和尚。讀了三年以後，我有一個同學到南傳的僧團去參學，好像去了三年，在佛學院時成績滿優秀的。三年後他回來看我，跟我談一些教法，我發覺他的思想有很大的改變。他內心中讚歎空性，對於諸佛菩薩不可思議的功德莊嚴，再也不生好樂，對於真空妙有不再好樂，就是歡喜寂靜，這就是變成一種小乘種性。他以前在佛學院時，我們都是同學大乘的；可見得你跟某一種人在一起，日常生活行住坐臥，你看到他走路、看到他講話，你跟他在一起久了以後，他就會釋放一種力量，你也釋放一種力量，結果大家平衡。所謂的平衡是說，他們人多你人少，結果你不能改變他，他改變你，這就是增長念熏習。

就是說你所處的環境，不管是什麼顏色，或者你聽到什麼聲音，它都釋放一種力量，這種力量可能對你是增長或者折損。就是我們凡夫的心一定是有所住（聖人的心是無所住，環境對他沒有影響。），你有所住，這環境就對你有影響力。第一個影響力就是產生一個念，你對事情的好壞會產生不同的看法。當然這是很微細的，這個還沒有到造業。第二個增長取，取就是一種愛取、一種慾望，追求的慾望，這個慾望就是可以造業的，推動身口去造業。

在唯識學上說：一個人慾望的生起，在《成唯識論》上說是依止根本識。依止根本識有兩層解釋：第一個，你根本識裡面的種子，就是你前生慾望很重，你今生慾望也是很重，這是內在的因素；其次，依止根本識，依止第八識的現行，就是說你阿賴耶識是一個什麼樣的果報，對你的慾望有影響。比方說你是一個天人，就算你今生本來慾望很淡薄，你變成天人時，你的慾望也會變得比較重。你要是變成一隻螞蟻，你會比較認命，你是一隻苦命的螞蟻，人家隨便丟一個糖果你就很滿足了。但是你要是一個釋提桓因，你的慾望就不可思議了。

所以說我們所處的環境，對我們愛取的慾望，也會產生一定的影響。第一個是分別，第二個是慾望，這個都會受環境的影響，這叫妄境界的熏習。再看妄心的熏習。

/VERSE/妄心熏習義有二種。云何為二？一者業識根本熏習，能受阿羅漢、辟支佛、一切菩薩，生滅苦故。二者增長分別事識熏習，能受凡夫業繫苦故。

前面染污的力量是由環境引起的叫資熏，它對我們內心染污的功能有資助的作用；這裡是習熏，習是自己的體性發動出來的。妄心，這個心是生滅，生滅就是會造作、活動，我們每一個心只要起心動念，念頭一動，這件事情就產生兩個因素：

第一個是業識根本熏習。假設今天，你的心跟環境一接觸時，跟某人、或者跟某一種環境接觸時，你的熏習是一種業識根本熏習，就是一種對立的思考，這樣就產生一種阿羅漢、辟支佛、一切菩薩的變易的生死，這是阿賴耶識，這阿賴耶識界外的變易生死就不能斷絕。就是你每一次生起一個對立的思考，就加強了阿賴耶識的這種相續的功能，也就加強了界外變易生死的力量，當然這是很微細的。

第二個是增長分別事識熏習，能受凡夫業繫苦故。前面的對立非常微細的，還不牽涉善惡。當我們在活動時，又產生六粗的煩惱、愛取的煩惱，我們去追求要的東西，追求到了的話當然是貪愛，就放縱自己的慾望去享受；追求不到就恨。這種愛恨功能發動時，就增長我們凡夫的業力跟痛苦的果報。就是你要是放縱這種愛跟恨的念頭，表示我們三界的業力跟三界的痛苦就很難解脫了，誰也救不了我們，這個就是所謂的增長分別事識熏習，增長愛取的煩惱。前面是增長這種對立的煩惱，這個都是由妄心自己生起的，就是我們的不如理作意引生的。看第三：

/VERSE/無明熏習義有二種，云何為二？一者根本熏習，以能成就業識義故。二者所起見愛熏習，以能成就分別事識義故。

前面的妄境是資熏，外在環境引生；妄心是習熏；無明是通內通外，有習熏跟資熏。

先看由內引生的，一者根本熏習，以能成就業識義故。無明的活動，第一種是根本無明，根本無明是一種對立的思考，增長了阿賴耶識，這個是習熏；第二個是枝末無明，就是我們對環境的愛取，增長我們的分別事識，就是前六識的六粗煩惱，這個叫做資熏。這一段等於是講到我們在生命流轉中，染法生起的力量，這裡把染法的生起作一個總結。

我們三界流轉，從佛法說是因緣生；我們不同意是由上帝來決定；或者是說是無因緣，莫名其妙所生的。生命它有一定的軌則，就是因緣生。這個軌則，主要是由內心引生的，內心引生的叫做不覺，由內心的愚癡引生的；第二個由環境的助長，不覺為因生三細，境界為緣長六粗：就是這念心有兩個力量引導我們流轉。

我們剛開始從一個對治煩惱的角度，你選擇一個好的環境很重要。你看我們中國的孟母三遷。孟子他過去的善根應該是很強大，能夠成為一個亞聖。但是他小時住在一個菜市場旁邊，整天就是學人家怎麼樣賣菜。他母親看這樣下去不行，這小孩子以後是個賣菜的，就搬家搬到墳墓旁邊。他在環境中，這墳墓也釋放一種力量，他就學怎樣去拜拜祭祀。他母親還是覺得不滿意，下定決心，就搬到學校旁邊。學校的色聲香味觸，它也釋放一種力量，就是讀書。孟子以後就好樂讀書。當然讀聖賢書所學何事？就是明白道理。明白道理以後，就能夠改造我們的身口意，果然成為一代的亞聖。就是說，孟母要是不改變環境，孟子可能只是個賣菜的，能把菜賣得很好，如此而己。所以我們不能忽略環境的因素。

在《成唯識論》上說：假設我們不求生淨土，你起碼要發願做人。

《成唯識論》中警告所有菩薩說：成佛之道不是一生一世，你一定會有來生，但是你怎麼規劃你的來生？這你要發願。你看天人釋提桓因，他以前做人時是好樂修學佛法。有一段時間，佛陀說法時他都不來參加。這時目揵連尊者看不過去，以神通力飛到天上去呵責釋提桓因說：你以前做人時，佛陀說法你都來聽；現在做了釋提桓因，怎麼都不來聽法？釋提桓因說：我是很想來聽法，但是沒有時間。目揵連尊者說：你們諸天衣食自然，怎麼會沒有時間？他說：我是不用為衣食而忙碌沒有錯，但是我有很多事情，我有很多的宮殿要打點，很多的宮女要照顧。目揵連尊者是個出家人，他也不知道諸天的情況，當然不相信。

這時釋提桓因就說：這樣好了，我有很多兒子，我的兒子也有很多宮殿、很多宮女，我就找我一個福報最差的兒子過來問好了，他只有一個宮殿、幾個宮女而已。他就下命令去請他的最小的兒子來。請第一次，這個兒子回答說沒有時間來。釋提桓因說：再去請，父親請他來。第二次還不來。這時釋提桓因火大，就跟侍者說：這次再不來，就要殺頭了！這個小兒子就心不甘情不願來了。他說：父親什麼事？你有話趕快講。釋提桓因就跟目揵連尊者說：師父你看，這是我最小的兒子。他的生活是最單純的，都沒有時間來；其他的大兒子更不要講了，我更不要講了！我哪有時間去聽佛陀說法？

就是說你今生積集了布施、持戒、忍辱的善業，你不可以生到天上去，障道！境界為緣長六粗，就是說你的善根，因為諸天的果報現前以後，產生了遮障，沒有辦法修習佛法，太忙碌了！當然你也不能到三惡道去，三惡道的地獄、餓鬼、畜生雖然苦，有出離心，但是這個苦的刺激太厲害了，你也很難靜下心來聽聞佛法，增長善根。所以你要是不求生淨土，一定要發願做人。境界為緣長六粗，這個環境很重要，就是一定要善得人身，這第一點。

第二個，你一定要發願生長在有三寶住世的地方。所以在普賢十大願王中，我們一個菩薩剛開始禮敬諸佛、稱讚如來、廣修供養，這個就是修歸依。就是說三寶為什麼要去禮拜？三寶是一個大功德的境界，你禮不禮拜，他還是安樂的。重點是，我們對三寶的禮拜憶念，我們就能夠跟三寶結緣，生生世世生長在有三寶住世的地方。所以你看十大願王剛開始先修歸依──先禮拜、口業的稱念讚歎、意業的歸依，然後再所謂的聽聞佛法，再開始廣修善法、起大悲心，後面的普賢十大願王才開始增長智慧，生起大悲。這裡就是說，你要為你未來的生命創造一個學佛的好環境，這第一個。

當然環境是一個助緣，第二個重點當然是不覺為因，就是這個不覺迷惑顛倒的對治，這也是重點。

在南北朝，道安大師弘揚般若法門。他在弘揚般若法門時，很多出家眾的弟子都來聽，也有很多在家弟子來聽課。在家居士中有很多都是當時的王公大臣，都是大福報者，掌握著整個國家大權，也來聽道安大師講般若法門。《般若經》講完以後，道安大師有一個弟子就問師父說：師父啊！像我們出家眾聽您講《般若經》，大家都進步很多。但是你看在家居士王公大臣，他《般若經》聽完以後，他們在朝庭中的斗諍還是非常地兇猛，好像沒什麼減少？般若法門好像對他們沒什麼改造，為什麼？同樣的法，跑到這個人的心中產生一個解脫的力量，跑到他的心中好像沒什麼改變，這是怎麼回事？

道安大師說：這些王公大臣來聽經，他沒有真正的覺悟；沒有真正的覺悟，這個法變成什麼？就是觀一切法空，這些王公大臣平常在宮殿時，鬥得太厲害，起心動念太強了；回來以後，在佛堂中用空性把心安定下來，讓自己的心在空性中休息一下。等到休息夠了以後，再從空出假，繼續鬥爭。就是說空的法門只是他暫時的休息處，他沒有用這個法門來啟發對生命的覺悟，改造他生命的看法，非常可惜！

所以說不覺為因，就是說你雖然今生出家，你開始布施、持戒，或者做一個佛弟子；但是如果你內心的覺悟沒有發動，這在你生命中的因緣，只能叫做積集善業。積集善業，就是說你不覺的功能還在，來生福報很大，但是可能會造業。就是你不覺的功能為因，福報的因緣一刺激時，可能會增長你的慾望，就造作罪業，第三生就墮落到三惡道，這叫三世怨。

所以我們在熏習中要掌握兩個因素：第一個是選擇一個清淨的環境；第二個是你要趕快加強你心中的光明，把你心中的覺悟，對生命的真相，什麼是痛苦的因緣？什麼是安樂的因緣？你的生命何去何從？這件事情你要清楚的弄明白，在死亡到來之前要把這件事情弄清楚。這裡講到染法的因緣，第一個是心中的愚癡，第二個是染污環境的刺激。

/KEPAN/子三、釋熏習淨法
/KEPAN/丑一、正明熏義

前面的是說明墮落力量的生起，這裡是講解脫力量的生起。解脫的力量也是要因緣生，它也不是上帝可以送給你的。這當中分成兩科，先看丑一的正明熏義，先把淨法熏習作一個總說。

/VERSE/云何熏習起淨法不斷？

我們今天有志於修學佛道，應該怎麼做才能夠使令自己內心中這種清淨的善根，對三寶的信進念定慧的善根能夠生起，乃至於不斷的增長廣大？提出一個問，

/VERSE/所謂以有真如法故，能熏習無明。以熏習因緣力故，則令妄心，厭生死苦，樂求涅槃。以此妄心，有厭求因緣故，即熏習真如。

這以下有三段：

一、以有真如法故，能熏習無明：我們老實一點的說，我們內心中大部分的時間都是無明，愚癡就是對立的心，對立就會產生一個取捨及追求。我們會去追求一些五欲的快樂，有些人追求財、有些人追求色、有些人追求名，每一個人所追求的不同，但大方向都是追求。當然追求成功了以後，有些人會成就安樂，有些人還是痛苦。這就是我們在還沒有接受佛法之前，我們的心就是在得失中流轉，成功了又失敗，失敗了又成功。慢慢的，這時、夜深人靜時，會感到弟子心不安，我們會感覺到內心中沒有歸依處，流轉三界中，何處是依怙？我們發覺所追求的財富、眷屬，乃至於聲名，都是非常的脆弱，隨時會破壞，我們非常沒有安全感。這時你內心中，就是所謂的本覺內熏，你的真如開始刺激你，你開始對這些成敗得失，這種流動的變化開始厭煩。你開始為什麼會厭煩？表示你在無明心中，有一個本覺的功能沒有失掉，它提醒你這不是真正的歸依處。這時我們的本覺就開始去熏習無明，這是第一個，我們本身本具的善根。

二、以熏習因緣力故，則令妄心，厭生死苦，樂求涅槃：剛開始當然是一個善根，善根以熏習因緣，這個因就是本覺內熏為因，這個緣就很重要了。這個緣法藏大師說：三寶的加持力叫緣。你沒有善根，你希望能夠觀察到生死疲勞，想要厭惡生死；但是沒有三寶的加持，你不可能成功的。所以剛開始我們就是要有一些助緣，可能你是看到佛像的莊嚴生起歡善心、或者聽聞佛法明白道理、或者參加法會唱唱爐香讚。

總之你有這種想要去尋求解脫的一個善根，再接觸到三寶的助緣，這時就使令我們第六意識的生滅心，開始厭惡生死的苦，尋求涅槃，心中開始有變化，你生命的目標開始改變了。你對於這些生死的境界──財、色、名、食、睡開始厭惡；對於這種寂靜安樂的涅槃開始好樂，就是你內心中產生一個正確的觀照力。你過去覺得很重要的，現在覺得這件事一文不值了；你以前把這件事不當一回事，你現在覺得這件事很重要：你生命的希望改變了。為什麼會改變呢？當然是有因緣，就是第一個善根的觸動，第二個跟三寶的接觸。

三、以此妄心，有厭求因緣故，即熏習真如：這個第六意識的妄心，當然前面只是厭惡生死，欣求涅槃的一個觀照力；這裡就講到行動力，你開始付出行動，開始在三寶的環境中去持戒修福，造種種的善，斷種種的惡。這時就加強我們本覺的功能。這種覺悟的功能，這裡講到淨法熏習，也等於是兩個重點。

前面的染法的熏習是不覺為因，境界為緣；淨法的熏習也是兩個因素，本覺為因，三寶為緣，這兩個因素缺一不可。

本覺的生起我們作一個說明：

佛法的修學跟世間的工作不一樣：這世間我一天工作八個小時，我去時打個卡，回來下班就算了，你心中對你的工作生不生好樂不是重點，你把工作做完就好了；但是佛法不能這樣的，它是心地法門。就是說你內心中沒有覺悟觀照，你拜《八十八佛》，那個味道就不對了，那個力量也生不起來。你一定是以本覺為因，就是你的觀照力，所有的法門都是要發自內心的覺悟，你所造的善業才有意義。

唐太宗，在中國的歷史是非常英明的皇帝。唐太宗晚年時，唐太宗這個人是有點好大喜功，他皇帝做久了以後，別人對他有點不恭敬，他就去討伐他。高麗就是這樣，高麗的使臣對他不是很恭敬，他就親駕御征，親自帶著兵去打高麗，結果雖然把對方打敗了，但是被射到一支毒箭，從此以後身體就不行了。後來他晚年時，箭的病痛一直的折磨他。他這時知道：做國王的權位這件事情，靠不住了，他要在有生之年趕快創造一個功德，他就把國師玄奘大師找過來，他說：朕想廣修福德，在佛法中有為福德以何為最？說我現在已經晚年了，我知道我的生命不多了，我希望在我能夠作主的一天，廣修福德，什麼樣的福德是最殊勝的？這時玄奘大師說：一切福德中，以弘護正法，開人智慧最為殊勝。

當然我們今天也要讚歎一些慈善事業，你沒有飯吃，我蓋個餐廳讓你來吃飯；你有病痛，我蓋個醫院讓你來治療病痛：這都是非常值得讚歎的。但是他吃飽飯、身體健康以後，心中的顛倒依舊，他會繼續去造罪業，繼續招感痛苦，所以我們這樣對眾生的利益就不大了。

一個對眾生成就真實的利益，莫過於你告訴他佛法的道理，啟發他心中的光明。告訴他痛苦是怎麼產生的？安樂是怎麼產生？想要離苦得樂，趨吉避凶，什麼東西該斷？什麼時候該去做？你要告訴他這個道理。

所以在整個佛法中，法布施對一個眾生的受益是生生世世的；財布施只是得到今生的受益。所以在淨法熏習中本覺，你要想盡一切辦法，在佛法中透過聞思來啟發你對生命的覺悟。你的覺悟沒有生起，你只是靠自己的信心勉強去布施、持戒，這樣對淨法的生起幫助不大的，只能夠說是生起善業，所以淨法的生起本覺為因是第一個。第二個三寶為緣。我們要不斷地親近三寶。

所以我們可以從淨法熏習中得到一個結論：在世間上有兩個功德是值得讚歎的：第一個是弘護正法，開人智慧；第二個是你能夠成立道場，安身辦道。成立一個道場，讓大家在這個環境中不斷的熏習，讓大家能夠在這個環境中持戒、做早晚功課、拜佛、聽經，這個功德不可思議。因為三寶為緣，你創造一個三寶，讓大家能夠親近，增長善根。

這裡是說明淨法的生起，以本覺為因，以三寶為緣。第二段就把淨法生起的次第詳細的說明：

/VERSE/自信己性。知心妄動，無前境界。修遠離法。以如實知無前境界故，種種方便，起隨順行。不取不念。乃至久遠熏習力故，無明則滅。以無明滅故，心無有起。以無起故，境界隨滅。以因緣俱滅故，心相皆盡，名得涅槃，成自然業。

一、這裡就詳細的說明淨法生起的一個道次第。這個道次，第一個是「自信己性」，這裡法藏大師把它判作十信位。就是我們剛開始依止我們內心的覺悟觀照，然後不斷地依止三寶、不斷地造作，斷惡修善，剛開始的階位叫做自信己性，這是十信位。這時我們修行的動力，就是仰信真如佛性，在凡不減，在聖不增，心佛眾生三無差別。身為一個大乘學者，你不管是拜佛也好、持戒也好，你總是覺得你所有的造作，就是去開顯自性本具的功德，他不向外追求的。當然這個真如佛性對一個凡位的菩薩來說是仰信，誰也沒有看到真如佛性的功德，但是假藉語言文字的認知產生一個信解，這個信解是從文字上得知，所以叫仰信，剛開始都是這樣的。

這個仰信真如，在我們斷惡修善很重要的。比如說：我們平常有時候會有一些煩惱的活動，這煩惱可能是貪慾、也可能是瞋恚，身為一個佛弟子，我們會知道這是一個過失相，會帶來痛苦的果報，我們會想辦法對治。但是在對治之前，如果你能夠先作一個動作會有幫助的，就是說在對治煩惱活動之前，你先正念真如，你先告訴自己一句話：何期自性本自清淨，把這句話念三遍，你就告訴自己煩惱是虛妄相，這時你再起動你的佛號，你會發覺效果更好。這裡有所不同，就是我們剛開始，比如現在去作一個善法，或者布施、或者持戒、或者是拜《八十八佛》的善法，有時候也不想做，這時你也是告訴你自己：何期自性本自清淨；何期自性能生萬法，你會比較容易去做善。所以剛開始在斷惡修善，十信位要花一萬劫的時間，他整個斷惡修善的重點就是仰信真如，就是修這個重點。

二、「知心妄動，無前境界。」這個叫十住，於真如理如實安住。前面的十信位是一個外凡的資糧位，外凡就是心游理外。就是說我們在佛堂拜佛時正念現前，或者在講堂時聽法師的講經，我們知道這一切的境界都是我心中所現的影像，離開我這念心，沒有少法可得。但是正常情況，我們離開佛堂以後，我們的心都是心外求法，都是對立的，大部分都是心游理外，就是外凡位，大部分都是活在對立中。

但是十住的菩薩不同，十住的菩薩叫做加行位（內凡加行位），他有禪定的力量，所以心中的止觀強，他的心跟境界一接觸時，他知道這些境界的確是心中的影像，離開心沒有這些境界可得，都是我的心動，才有這些境界存在，所以說他止觀的力量加強。所以我們講十信的菩薩其實是就一個信心，仰仗對於真如佛性的歸依信心斷惡修善，慢慢慢慢的趨向真如；但是十住菩薩不同，他在信心之外有一個強大的觀照力。

三、「修遠離法。」這遠離法就是包括十行跟十迴向，都是屬於加行位（加行位包括十住、十行、十迴向）。什麼叫遠離法？法藏大師說：就是六度的妙法。六度為什麼叫遠離？就是布施能夠使令我們遠離慳貪，持戒遠離煩惱，忍辱遠離瞋恚，精進遠離懈怠，禪定遠離散亂，智慧遠離愚癡。這時我們假藉六度的法門，來對治心中的煩惱障，叫做十行；把這些斷惡修善度眾生的功德，迴向於真如法界，這是十迴向，修遠離法。就是說前面的知心妄動，還是偏重在一種內心的止觀，還是偏重在觀照力，行動力還是比較薄弱的，比較欠缺的；到了十行時，就正式的把內心的觀照付諸行動，表現在六度的行動。

四、「以如實知無前境界故，種種方便，起隨順行。不取不念。」這是講十地菩薩。這個菩薩透過前面的觀照力跟六度的行動以後，他一念的相應慧就成就了所謂的十地。

這個大地有兩種功德：第一個不動，就是大地的菩薩他內心中有強大般若波羅蜜的智慧，所以遇到順境逆境，他都知道這是一個生滅相而已，暫時的生滅相；我內心真如的功德不可思議，他不向外求，所以不為一切環境所動，就像大地它不動，這個人在大地上面走來走去，大地不動，這個是強調自力的功德。

第二個荷負，大地能夠荷負一切眾生，不管你是好人壞人，大地是平等的來荷負。十地菩薩的心也是一樣，他能夠平等的來救拔一切眾生。所以說大地菩薩他有不動義跟荷負義來譬喻菩薩。他為什麼能夠做到？因為他如實知道離開了這念心，沒有這些外境可得，這些境界都是心中的業力所顯現，再由心中的執取把它擴大。所以他就生起種種的六度的方便，隨順中道真如的妙行，在一切境界中不取不念。

不取不念就是不生我、法二執，他整個修行都是會歸到真如，說是稱性起修，但是全修在性。就是說我們在布施、持戒，一般人除非正念真的是很強烈的現前，大部分我們在修善時，一般我們這個善法是沒有辦法會歸真如，我們總是覺得善法會給我們得到安樂的果報，一般人很難想到說我修善法會開啟我的真如，有這種想法很少。但是十地菩薩他不向外追求，他修總總的善法，他不取不念，他是全修在性，所有的修德是在開顯性德，他完全是向內會歸的。

五、看最後的佛果，「乃至久遠熏習力故，無明則滅。以無明滅故，心無有起。以無起故，境界隨滅。以因緣俱滅故，心相皆盡，名得涅槃，成自然業。」前面的十信、十住、十迴向、十地是叫因地，這裡是講果地。經過我們前面內在的觀照力還有行動力，剛開始從信心，再產生觀照力，產生行動力以後，經過三大阿僧祗劫的修行，這時無明則滅，心中的這些枝末無明、根本無明這種對立情形消失了。無明滅故，心無有起。內心中沒有這種分別心，沒有分別心當然就不再造業了，一切生死的果報就消失了，包括內心不覺的因，包括這些生死染污的因緣，都消失了以後，心相皆盡，這時有漏的生滅心、生滅門全部窮盡，這時內心中成就二種功德：一個是涅槃的寂靜，一個是自然業的他受用。

這個涅槃是法身自受用常樂我淨的功德，是別人不能跟你分享的，佛陀自己安住的。佛陀跟眾生接觸時，他所顯現的叫自然業他受用功德，就是應化身跟報身，這時整個生命從一個雜染的生滅門，又回歸到真如門，真如門中顯現的涅槃跟自然業兩種功德。這裡是說明淨法的熏習，淨法的生起因緣。

在淨法熏習中，我們剛始其實就是修十信，自信己性。蕅益大師的《彌陀要解》上說：在我們的成佛之也教我們一個殊勝的法門，就是求生淨土。就是十信位的菩薩有退轉的力量，這時勸我們：在十信位，你也可以為菩提道求生淨土。以這種外在清淨因緣的熏習，來加強內心的善根，這後面會說明。所以在本論中，道中，最因難突破的就是十信位了。他說：加行位的菩薩到十住以後，他止觀力強，要去斷惡、修善、度眾生就不困難。就是凡夫在修善，比如說我們現在去拜八十八佛，覺得八十八佛很重要，我們也覺得積集種種的善法很重要，但是實際操作有困難。

就是聖人去修善、去度化眾生比較容易，但是凡夫要去修善、去度化眾生有困難。為什麼？我們心中有煩惱，這一定會有問題──煩惱障。所以在自信己性時，當然這裡剛開始就是《成唯識論》上說：乃至未起識，求住唯識性，於二取隨眠，猶未能伏滅。就是你要能夠不放棄，求住唯識性。所以說十信位的菩薩雖然困難，但是成功的關鍵就是看誰不放棄。一個人能夠不放棄努力，他就是能夠度過十信，所以十信位就是靠不放棄。

當然在後面，馬鳴菩薩也教我們一個殊勝的方法：就是求生淨土。因為十信位的菩薩，還有退轉的問題，所以馬鳴菩薩勸導我們：在十信位，你也可以為菩提道求生淨土。以這種外在清淨因緣的熏習，來加強內心的善根，後面會說明。

總之，在本論中，馬鳴菩薩的止觀有兩個：一個是真如三昧，一個是念佛三昧。真如三昧是自力法門，念佛三昧是他力法門，我們等到後面再來說明。好，我們今天把染法熏習跟淨法熏習講到這裡。`;
