QXL.volNum = 19;
QXL.text = `
請大家打開《講義》第三十七頁，丑二、釋義差別。

我們這一大科是講到解釋分。解釋分主要的宗旨，就是要教導我們如何來觀照生命的真實相。從佛法修學的次第上來說，我們每一個人剛開始修學佛法，主要的就是依止一分的信心，而我們在三界流轉中，有很多的障礙──煩惱障、罪障、報障，在這麼多的障礙中，我們相信三寶的功德是無所不在的，也相信三寶有足夠的能力救拔我們，依止這個信心，我們就歸依在三寶的座下，做為一個佛陀的弟子，或者是在家、或者是出家。剛開始是依止信心。有了信心以後，我們進一步培養我們對生命的觀照力了，就是這一科的重點，由信心而提升為對生命的正見。

對生命的觀照，基本上有兩個方向。我們一般凡夫生命觀照的方法是向外觀照，就是去觀照外界的環境，結果看到的是生命的虛妄相。就像是渴鹿追求陽焰，一隻口渴的鹿，在沙漠中去追求一種虛妄相，結果一輩子都沒有得到解脫，這就是心隨妄轉，在虛妄的境界中去觀照，結果永遠沒有找到真相。

從佛法的角度，我們如何觀照生命？應該是要向內觀照，就是觀照這一念明瞭分別的心性。你能夠了解你的心性，你就了解到生命的過去、現在、未來。

應該如何來觀照我們這念心呢？本論中馬鳴菩薩提出了兩個觀照的重點：

第一個就是對於我們內心體性的觀照，這當中馬鳴菩薩安立一個名相叫真如，就是這念心的本質是不生不滅、不垢不淨、不增不減，它遠離所有的生滅相、增減相跟垢淨相，也就是說一切對立的相貌都是遠離的，它是一個清淨而平等的相貌，這就是我們對生命內心體性的觀照。

其次，就是對於內心作用的觀照，所謂的生滅門。生滅門主要是由很多很多的因緣所構成，這因緣中主要有兩個重點：第一個是依止覺悟的因緣所帶動的清淨安樂果報。第二個是依止迷惑的因緣所帶動的雜染痛苦果報。也就是說我們現在這一念明瞭分別的心跟境界一接觸時，它就會剎那剎那的活動。我們這心念的活動，我們有兩個選擇：第一個，我們對我們的心念選擇用放縱的方式，這樣我們的內心就會帶動無量無邊的罪業，招感無量無邊的痛苦，就帶動了雜染的緣起；第二個，我們心念跟境界接觸時，產生很多的造作活動，我們選擇克制，以觀照的智慧來善調其心，這樣我們就帶動了一種覺悟的因緣，而造作很多善業，趨向安樂的果報。

所以我們未來的生命是快樂或痛苦，是由於我們對心念的放縱跟克制來決定的，這就是整個生滅門的大意了。

我們把丑二、釋義差別這一科的科判作一個說明。這一科我們看《講義》的第三十四頁。這一科主要是從癸二、明染淨熏習，就是我們內心中有一種雜染的力量，但是我們曾經也有一些清淨的力量，這兩個力量在內心中交互的作用，這叫做染淨熏習。這當中有四科：第一科是總標熏習的意義，第二科是說明染法的熏習，第三科是說明淨法的熏習，第四科是說明這熏習的法是斷還是不斷。染淨的熏習的第四科是在四十一頁的子四，總結雜染法跟清淨法的熏習，什麼情況是斷跟不斷。

/KEPAN/丑二、釋義差別
/KEPAN/寅一、釋妄熏義別

這一科我們回到《講義》丑二、釋義差別，是解釋淨法熏習差別的內容。前面是把淨法熏習作一個總說，這以下把淨法熏習的差別內容作一個詳細的說明。這當中有兩科：寅一是解釋妄心的熏習，寅二是講真如熏習。

我們內心中，有時候也會產生一種清淨的功德，這個功德有兩種因緣：第一個是依止第六識的因緣所引生的，第六意識的如理作意叫做妄心熏習；第二個是由第八識任運生起，叫真如熏習。我們先看第六意識引生的淨法的熏習：

/VERSE/妄心熏習義有二種。云何為二？

淨法熏習的第一個內涵叫妄心，妄心在法藏大師解釋：就是第六意識所相應的始覺智慧。就是我們第六意識的分別心，經過佛法的聽聞跟思惟所產生的一種觀照智慧，這種智慧有時候生起、有時候消滅，所以叫做妄。這個妄的意思就是它會生滅變化，所以叫做妄。凡夫的觀照力有時候強、有時候弱，所以叫做妄心熏習。依止第六意識的觀照力所成就的淨法功德，中分成兩種，先看第一種：

/VERSE/一者分別事識熏習。依諸凡夫二乘人等，厭生死苦，隨力所能，以漸趣向無上道故。

第一個是分別事識的力量所產生的熏習，這是屬於凡夫跟二乘人的一種覺悟。我們經常說：佛者，覺也。什麼叫覺悟呢？簡單的說就是厭生死苦，隨力所能，以漸趣向於無上道故。所以整個覺悟是對於生死流轉痛苦的覺悟。

這個厭生死苦，我們解釋一下，這當中有兩個內涵：

一、凡夫的厭生死苦，他所厭惡的是整個三惡道的痛苦，所以一般凡夫對人天果報是不厭惡的。一般凡夫的覺悟就是說：生命是一個無止盡的水流，首先我們要相信我們是有過去、現在、未來一個相續流轉的生命，這個生命中的快樂痛苦，是由我們的業力所招感的，萬般皆是業，半點不由人。我們在這個覺悟的觀照之下，我們這念心跟境界接觸時，我們開始迴光返照。就是說以前跟一些不合理的境界接觸，你傷害我，我也傷害你，心隨境轉。

但是覺悟業果的道理以後，我們開始注意自己的起心動念：就是說你傷害我，那是你自己的事情；但是我絕對不能夠起惡念，我自己要求我自己的因地不能有差錯。這樣就是說，我們因為害怕到三惡道去受苦，我們開始調伏自己的惡念，所謂的深信業果，斷惡修善，這個是剛開始第一個要生起的觀照力。依止這樣的一個觀照我們就遠離三惡道的因緣，就在人間或者天上受用安樂的果報。

二、其次是二乘人的觀照。二乘人的觀照，是以空性來作一個觀照。二乘人是怎麼觀察空性？他所依止的是三法印，說是諸行無常、諸法無我、涅槃寂靜。二乘人把生命分成兩部分。第一個是生死流轉的因緣，這種因緣是無常、無我的，就是說即使生到人天上去，饒得千般快樂，無常終是到來。就是說即使是人天安樂的果報，它也是一種不安穩性的，所以給我們的是一種非常嚴重的不安全感，我們不知道明天會發生什麼，所以無常，所以是苦。

二乘人從這種無常的覺悟，他不但知道三惡道是苦，他更微細的觀察到人天的果報也是苦，因為他是不久住故。這時他從無常中體驗到無我，原來我們對生命沒有主宰力。如果我們可以選擇，沒有一個人願意去三界流轉。所以從無常、無我中，他就離開了三界的繫縛，而趨向涅槃安樂的果報。說是諸行無常，是生滅法，那怎麼辦？生滅滅已，寂滅為樂。這就是整個二乘人對生命的觀察，超越人天的觀察。

一個人能夠對生命觀察，他就能夠作出正確的取捨，當然他就能夠產生一種行動力，隨順這一生的能力去修習戒定慧，漸次地、慢慢地趣向無上道故。這就是講淨法熏習的第一個，依止第六意識的分別事識。

/VERSE/二者意熏習。謂諸菩薩，發心勇猛，速趣涅槃故。

第二種的淨法緣起，是這些大乘的菩薩。身為大乘菩薩，他的智慧涵蓋了人天的智慧，也涵蓋了二乘的智慧，他進一步能夠發心勇猛。發心勇猛就是說他能夠觀察到我們這一念的心，具足了體相用三大，他能夠法法銷歸自性，觀察我們這一念明瞭的心，為什麼會有生死？為什麼會有涅槃？其實是由一念心所變現。這一念心的本質是真如平等無增減故，如來藏具足無漏性功德故，能生一切世出世間善因果故。既然我的內心中有無量的功德，我應該要假藉六度的方便來開顯我自性本具的功德，所以依止一心真如的思想，廣修六度的善法，而迅速的趣向於大般涅槃。這樣的熏習，我們叫做意熏習，他是直趣向大乘涅槃。

這裡就說明，我們在成佛之道中，的確是有一些種性的差別──有人天種性、有二乘種性、有大乘種性。我們解釋一下：從因緣果報來說，我們生命有十種選擇。有一種人他是屬於大乘菩薩，他的想法是正直捨方便，但趣無上道，他是直接把車子開到成佛之道的寶所去。有些人他的車乘，你要他直接成佛，他可能有困難。那怎麼辦？沒關係！先做做國王，做做轉輪聖王，修習人天的善業。國王、轉輪聖王他做滿意以後，他開始修無常觀，知道生死流轉實在是疲勞，不是個章法，就修無常觀、無我觀，解脫生死到涅槃。在空性的涅槃裡面，好好的修習一段時間，然後佛陀為他說大乘法，再從空出假，趣向於佛道。就是說這個成佛之道有的是直趨大乘，但是有些人必需要在整個過程中有一些方便。所以這地方就是說：熏習有這麼多差別，這是每一個人選擇的不同。

這裡我們解釋一下大乘跟小乘的空性：

一、小乘的空性——滅色取空

基本上從解脫的角度來說，你一定要修空性，不管你是小乘的學者，或是大乘的學者。不過小乘的學者修空性跟大乘學者修空性，所對治的內涵有所不同。當然能觀的空應該沒差別，但是他所對治、他所破斥的有所不同。小乘學者的空叫做滅色取空。就是說他把我們內心的遍計執的妄想消滅了，他也把依他起的這些因緣果報的法也消滅了，這叫滅色取空，空得太過徹底了，所以他那個空觀成就時，智者大師說叫做灰身泯智。雖然是雜染法不可得，但是明瞭性也消失掉了，這個就是會有一些錯損菩提的過失。就是說你雖然是寂靜安樂，但是你等到要成佛時，你還要花很多很多的時間，把你的心性再栽培起來，就是修空觀修的不善巧。

二、大乘的空性——緣起性空

大乘佛法他在修空觀時，他很清楚他所破的是遍計執，他保留整個清淨的依他起，說是遍計本空，依他如幻。就是說大乘佛法在修空觀，他是滅除內心的妄想執著叫遍計執；但是內心中依止大悲心來修習善法、度化眾生，這樣的一個依他起他是保留的。所以他的空觀叫緣起性空，他只是破除對諸法的自性執，但諸法的作用這一部分是保留的。所以在《瑜珈菩薩戒》說：小乘學者修空，在《瑜珈菩薩戒》說：小乘學者修空，大乘學者也修空，說三乘共坐解脫床，有什麼差別？在《菩薩戒》上說：大乘菩薩修空觀時，他內心有希望，有兩個希望──上求佛道，下化眾生，他不能滅除對於無上菩提的追求跟度化眾生的希望。小乘的學者修空觀是沒有希望，他對生命雜染法也沒有希望，清淨法也沒希望。當然你要是沒有希望，你菩薩的戒體就失掉了，因為菩薩的戒體在凡夫位是安立在對無上菩提的追求跟度化眾生的追求，你這種希望消失了以後，菩薩戒體就失掉了，所以這裡我們應該加以簡別。這裡是講到第六意識如理作意所引生的淨法熏習。

/KEPAN/寅二、釋真熏義
/KEPAN/卯一、總標

這當中有三段，先看第一段的總標。

/VERSE/真如熏習義二種。云何為二？一者自體相熏習，二者用熏習。

前面的妄心是第六意識，第六意識的熏習，它要假藉我們的如理作意去觀想才能夠生起，有時候你會觀想，有時候你失去正念，所以它是生滅的。真如的熏習是第八識的，第八識是無作的、任運生起的，這叫做真如熏習。這當中有兩種：一者自體相熏習，二者用熏習。自體相是真如內在的體性熏習，用熏習是外在的因緣熏習。從論文上來看，自體相的意思就是一種自力的法門，仰仗自力，內在本覺的功能所帶動的；用熏習是仰仗他力，就是諸佛菩薩的加被力：這兩個產生我們內心淨法的力量。

/KEPAN/卯二、別釋
/KEPAN/辰一、釋體別
/KEPAN/巳一、正釋

把體相的熏習跟用熏習各別解釋，先解釋辰一的釋體熏習，自體熏習又分兩科：先作一個解釋，再解釋疑惑。先看正釋：

/VERSE/自體相熏習者，從無始世來，具無漏法，備有不思議業，作境界之性，依此二義，恆常熏習，以有力故，能令眾生，厭生死苦，樂求涅槃。自信己身，有真如法，發心修行。

真如的體相熏習是怎麼一回事？先說明它熏習的因緣。就是我們眾生的一念明瞭的心性，當然無始世來打了很多很多的妄想，也起了很多的煩惱；但是不可思議的是，我們的本性中有一種很特殊的功能，就是具無漏法，有一種無漏的清淨力量。這裡的無漏法是指什麼？法藏大師解釋說：無漏法就是不空本覺，就是我們阿賴耶識中有一種本覺的功能。這個本覺功能能夠產生兩種的力量：

第一個力量是備有不思議業用，它能夠引生我們在生死流轉中，厭惡生死、欣求涅槃的力量。就是說我們在三界打轉，總有一天你會覺悟生死是痛苦的，涅槃是安樂的。這種力量是怎麼生起的？就是我們內心中，本來就具足一種本覺的功能，這種功能非是凡夫、二乘所能夠了知的，所以叫做不思議，它沒辦法用我們的分別心去心思口議的。

第二種力量是作境界之性。前面是一種能觀智，這地方是所觀境。就是說在阿賴耶識中本覺的功能，它會顯現很多的清淨所緣境來引導我們趨向於解脫。

過去有一個禪師，他讀《法華經》，他讀到經文上說：諸法從本來，常自寂滅相。他內心中不能夠明白這句話的道理：這一切法怎麼說是寂滅相？一切法有很多的生滅變化，這個人他成功了、失敗了，到三惡道、到人間去了，有很多很多的變化，怎麼說是寂滅相？他去請教他師父，他師父說：汝去！我不與汝道。你自己去體會，我不告訴你。這個禪師他就自己去聽聞，然後自己去打坐思惟。

這一天，春夏秋冬過去了，到春天到來時，他在寮房打坐，他聽到黃鶯鳥的叫聲，他突然間開悟了！開悟以後，他就講出一個偈頌，他說：「諸法從本來，常自寂滅相，春到百花開，黃鶯鳴柳上。」說一切法的本性的確是常自寂滅相，是自性空；但是自性空，同時也是因緣有。你用春天的因緣來熏習大自然，它就春到百花開，秋來黃葉落。就是你用春天的因緣跟秋天的因緣，它的解釋就會有變化，乃至於黃鶯鳴柳上，黃鶯就在柳枝上叫。

這裡就是說，事實上外在的環境都有一種力量，引導我們趨向於中道思想的智慧。就是說我們內心中自己打妄想，所以把外境扭曲了。所以禪師開悟以後，說是山色無非清淨色，溪聲皆是廣長舌。就是說如果我們把自己的妄想消滅以後，其實整個山河大地都是在為我們演說中道實相、真空妙有的道理。這種境界對我們演說佛法，叫做作境界之性，是阿賴耶識的本覺所變現的如實境界，提醒我們什麼是生命的真實相，所謂的自性空因緣有，因緣有自性空。

這是講到真如的一個熏習的因緣。這樣的熏習有什麼樣功德？依此二義，恆常熏習，產生這種內在的觀照，外在環境的助緣，使令眾生，厭生死的痛苦而樂求涅槃。由這樣的一個觀照，就產生一個行動力，自信己身，有真如法，發心修行。這時我們相信內心有無量的功德值得去開發，而去廣修六度的方便，來開顯自性的功德，叫做體熏習，體熏習就是講本覺的內熏。

本覺的內熏，我不知道諸位聽了以後有什麼樣的心得。我讀佛學院時，是在一個傳統老和尚的佛學院，也經常聽到本覺內熏。不過我對本覺內熏剛開始還不是很了解，說是打妄想的心有一個本覺，這是怎麼回事？後來我讀到藏地法王的開示，我就明白了什麼叫本覺內熏。說：我們每一個有情眾生的內心有一種本性，這個本性是每一個有情都想要離開痛苦，追求安樂，這就是我們的本性，而這個本性不會因為任何的因緣而有所破壞。不管你造了多少的罪業到三惡道去，其實你也是想要離苦得樂，只是我們起顛倒而已，這種好樂安樂、厭惡痛苦就是我們的本覺內熏。

我姑且解釋一下本覺內熏：

我們今天撇開我們內心的顛倒，把這部分的顛倒、錯誤的認知先拿掉。就是說每一個人的心情都想離開痛苦、追求安樂，你怎麼知道呢？你的手被火燙傷以後，你馬上會把手收回來的，很自然的，不用經過作意。就是我們對痛苦是排斥的，對安樂是追求的，這個不須要經過學習。但是這裡有一個問題存在，就是我們追求安樂，在佛法說安樂有兩種：一種是色身的安樂，一個是內心的安樂。我們剛開始的安樂是產生了顛倒，我們剛開始的安樂是追求色身的安樂，但是這色身安樂它有兩種的障礙：

第一個它是躁動，就是你追求這種感官色身的快樂，你內心中是躁動不安的，非常沒有安全感。我們追求的是內心的安樂，他是寂靜安穩的，所以這裡有躁動跟非躁動的差別。

第二個有過患跟非過患的差別。就是我們追求色身的安樂，這整個過程中會產生貪慾跟瞋恚的煩惱。你要追求得到，你就生起貪慾；你要追求不到，你就生起瞋心。所以色身的安樂，它會產生煩惱跟罪業的過患。而我們追求內心的快樂，是沒有這種煩惱跟罪業的過患，它沒有這種的過失。

也就是說我們想要離苦得樂，但是剛開始是生顛倒的，作出錯誤的判斷，但是我們想要離苦得樂的本性是沒有消失的。我們從生命的錯誤中累積，一次一次遇到障礙以後，我們會產生一種經驗，我們總有一天會明白：追求色身的安樂是錯誤的，應該追求內心的安樂，這時我們就真實的厭生死苦，欣求涅槃。

這就是為什麼我們敢肯定每一個人都能夠成佛的因緣，就是因為人的本性都是想要離苦得樂，所以他有這種動力，總有一天會從他的障礙中得到覺悟。而這種覺悟，我們安立做本覺。這種想要追求安樂、離開痛苦的本性是沒辦法改變。

/KEPAN/巳二、釋疑
/KEPAN/午一、疑問

釋疑中又分兩科，午一是疑問，先提出一個疑問：

/VERSE/問曰：若如是義者，一切眾生，悉有真如，等皆熏習，云何有信無信？無量前後差別。皆應一時自知有真如法，勤修方便，等入涅槃？

前面講到自體的熏習是由本覺的內熏，這裡提出一個疑問說：假設每一個眾生內心中都有一個所謂的真如（或者說是佛性、或者說是本覺），不管你起善心、恶心，不管白天、晚上，它都平等的在提醒我們應該要離開痛苦，得到安樂。既然是這樣的平等熏習，為什麼眾生對於佛法的真理，有些人有信心，有些人沒有信心？有這麼多生起信心的前後差別？

意思就是說：既然是平等熏習，大家應該一時之間平等的接受佛法的真理，勤修種種戒定慧的方便，平等的離開生死而趨向於涅槃？就是說大家想要離苦得樂的心是一樣的，應該大家都平等的進入涅槃，以這樣來問難。

/KEPAN/午二、答釋
/KEPAN/未一、直約無明煩惱厚薄釋

回答中分兩科，先看第一科直約無明煩惱的厚薄來解釋。

/VERSE/答曰：真如本一，而有無量無邊無明，從本已來自性差別，厚薄不同故，過恆沙等上煩惱，依無明起差別。我見愛染煩惱，依無明起差別。如是一切煩惱，依於無明所起，前後無量差別，唯如來能知故。

本覺內熏的真如，它在內心中的本性，這點是沒有差別的，每一個人想要離苦得樂的本性是沒差別的。但這地方有一個問題：眾生有無明的顛倒，他想離苦得樂，但是他根本不知道什麼是痛苦？什麼是安樂？他根本搞不清楚狀況。就是他有那個心情，但是他不知道怎麼做？這個無明就是愚癡。每一個人對於生命的觀照，產生的錯誤認知，是由很多的自性的差別跟厚薄的差別，這個自性就是種類的差別。其次，煩惱本身從量來說，也有它熏習的厚跟薄的差別。也就是說我們依止心中的顛倒所引生的煩惱，包括了見煩惱──我執、我見，或者是愛煩惱。

有些人他的慾望很淡薄，你看他修行也沒什麼慾望，所以他也不再須要用什麼強列的方法對治；但是他要去接受大乘佛法有困難，這個人見煩惱重，他的思想剛強。但是有些人他有什麼錯，你勸勸他，他馬上能夠接受；但是這個人愛煩惱重。其實眾生顛倒引生的見愛煩惱是各式各樣的差別，所以本覺內熏引生的覺悟力量就有所差別。

這意思我們講一個譬喻，說是太陽是平等的去照耀整個地球，但是有時候我們看得到太陽，有時候看不到太陽。這怎麼回事？就是有烏雲。就是有時候白天你看不到太陽，其實太陽是存在的，它也在那個地方照，但是我們看不到太陽是怎麼回事？就是有烏雲的遮障，因為烏雲有各式各樣，有白色的烏雲、有黑色的烏雲，烏雲本身有厚薄的不同，就使令我們看到太陽的光明有所差異，是這個意思。

我們佛弟子有時候會去思考一個問題，就是每一個宗教都是引導眾生離苦得樂，但是你發覺有一個地方差別很大：你看基督教的教義就是一部《聖經》，回教它也是一部《可蘭經》；但是你要是相信佛法，那就不得了了，有各式各樣的經典，小乘的《阿含經》，大乘的《法華經》《金剛經》《楞嚴經》各式各樣的很多很多的經典，大藏經有一百部。

我們會說：佛法怎麼會有這麼多的經典要去學習？這裡就是解釋它的道理，就是說良由眾生根機不一，致使如來巧說不同。就是因為每一個人的遮障不同，所以佛陀不得不廣設無量的方便，因為他的無明煩惱是這個方式，他必須用這個藥來對治。你煩惱生起的因緣是另外一個方式，所以你在破解煩惱是用另外一個方法破解。所以這裡煩惱的引生是各式各樣，所以我們對本覺的遮障也各式各樣，當然對治也就各式各樣。這裡是約著我們的遮障來解釋眾生的差別。

/KEPAN/未二、更約因緣互相成辨釋

第二科更約因緣互相成辦解釋，這裡是約善根，你過去的善根不同。

/VERSE/又諸佛法，有因有緣。因緣具足，乃得成辦。如木中火性，是火正因。若無人知，不假方便，能自燒木，無有是處。

先講出一個譬喻來，就是說佛法的功德要成就，佛法的意思是要有因緣。你因緣具足了才能夠成辦功德。比如說你現在發願要做一個國王。你想做一個國王，你要有因緣，你要把國王的因緣成辦了、具足了，這個國王就出現了；你說我來生要做一個阿羅漢，這阿羅漢也是有因緣，你把阿羅漢的因緣具足了，你就成就阿羅漢；菩薩、佛亦復如是。什麼叫因緣呢？這以下講出一個譬喻。說木頭中有成就火的本性，木頭是火生起的一個親因緣，但是你如果不用木頭去磨擦旋轉這種方便，這木頭要生起火，無有是處。

/VERSE/眾生亦爾。雖有正因熏習之力，若不遇諸佛菩薩，善知識等，以之為緣。能自斷煩惱，入涅槃者，則無是處。

我們雖然內心想要離苦得樂，這是成就聖道的一個主要動力，但是如果沒有人、沒有佛菩薩來開導離苦得樂的正確方法，我們想要去斷除煩惱成就安樂，這是不可能的。雖有三寶的熏習之力，而內心中如果沒有本覺的內熏，我們想要厭惡生死、好樂涅槃也是不可能的。

譬如說這個講桌，它在這裡，我們講《大乘起信論》時它也在，但是它聽了很久，它根本不可能離苦得樂，因為它沒有明瞭性，它沒有一種想要離苦得樂的本性。而我們眾生聽聞佛法以後，內心中有要離苦得樂的動機，再假藉佛法的熏習，所以內因外緣才能夠成辦。`;
