QXL.volNum = 21;
QXL.text = `
請大家打開《講義》第四十二頁，壬二、顯示大乘體相用。

這一大科是解釋分，就是解釋生命的真實相。從大乘佛法的角度來說，我們對生命的觀照，主要就是迴光返照，觀照我們一念的心性。觀照心性的方法，本論分成兩個部分：第一個是真如門，第二個是生滅門。這兩門最大的一個差異點：真如門是平等的，離諸對待的；生滅門是對待的，有覺悟的對待、染淨的對待、增減的對待，各種的對待。

我們前面一大科是講到整個內心生滅的因緣相，這個生滅因緣相整個修學的重點有兩個主題，我們可以作一個總結。我們剛開始的修學，依止的是一個對待的法門，所謂的生滅門。生滅門第一個是業力的修學。就是說我們剛開始是依止內心的信心，我們深信三寶的功德，依止這一念信心開始懺悔業障、積集資糧。我們透過對三寶的禮拜、讚歎、觀想，這個身口意的歸依，來滅除我們的罪障。一方面我們靠著持戒、修福，乃至於聽聞正法、如理思惟，來增長我們內心廣大福德跟智慧的二種資糧。所以剛開始是從一種身口意的造作、一種業力的修學，從這裡去斷惡、修善，使令我們生命從痛苦而趨向於安樂。這樣的一個修學，智者大師說：叫做有相行。依止信心來懺悔業障、積集資糧，這都是在有相的三寶境界活動，所以叫有相行。

第二個是心念的修學。就是說我們應該要閑居靜處、息諸緣務，去觀察無常、無我的道理。就是說我們在淨罪集資的剩餘時間，應該要靜坐，觀察整個生命的現象，它是生滅變異、虛偽無主的，整個生命的果報是不斷不斷地變化，而整個變化中，我們是不能主宰的。所以從無常、無我中，我們悟入到空性的真理。這樣的一個觀察，智者大師說是無相行。他能夠透過無常、無我的觀照，使令我們內心中，調伏愛取的煩惱，從有相的境界趨向於無相的真理。

不管是業力的修學，或者是心念的修學，因為這樣的一個修學──有相行、無相行，它的過程都有生滅的對立、染淨的對立、增減的對立，所以都叫做生滅門，這是我們非常重要的道次第基礎，就是剛開始一定從生滅門的斷惡修善、觀察無我來作一個基礎。當我們已經具足了這樣的資糧，就是我們開始仰仗三寶的功德斷惡修善，依止無常、無我的智慧來調伏愛取，從有相、無相雙面的修學，我們接下來幹什麼呢？顯示大乘體相用，我們開始從生滅門正式的趣向真如門。真如的趣向方法有三個內涵，就是從體大、相大、用大趣入。

/KEPAN/壬二、顯示大乘體相用
/KEPAN/癸一、顯示體相
/KEPAN/子一、正顯示

顯示大乘體相用中分兩科，第一科先顯示體大，這當中又分兩科：子一先正式的顯示，第二段再解釋疑惑。先看子一、正顯示：

第一段、體大——如實空

/VERSE/復次，真如自體相者。一切凡夫、聲聞緣覺、菩薩諸佛，無有增減。非前際生，非後際滅，畢竟常恆。

我們講到一心真如的自體相，什麼叫做體大呢？我們剛開始從凡夫，或者二乘人，或者菩薩諸佛，在因地時，我們剛開始修學，就是懺悔業障、積集資糧，內心是有增減。比如說：你今天跟昨天的生命有所增減。怎麼說呢？你內心的煩惱罪業減少了，你的福德智慧的功能增長，所以你的心跟昨天的心是有增減。但是我們從體大來說，它是無有增減的。就是我們要看到沒有增減的那個內心的相貌，它從空間上來說是沒有增減的，說是在凡不減、在聖不增，它沒有增減相，這第一個相貌。

第二個從時間上來說，是非前際生，非後際滅，這裡講到它是無始無終。蕅益大師說：這段的意思是無始無終。無始無終就是等於不生，也是不滅，這個是約時間上來說。

以下作一個總結，畢竟常恆。我們剛開始在調伏內心時，是用對立的，以善來破惡，以空來破有，這是非常的正常，剛開始都是對治觀法。但是我們慢慢地要從對治中，去體驗我們一念心性的本性是畢竟常恆，這個常就是從時間上來說，它是不生也不滅的；這個恆是從空間上來說，是不增也不減，當然也包括了不垢也不淨。這個是講到真如體大悟入的方法。這個一心三大中，我們前面也說過這個體大是最重要，你體大沒辦法悟入，相大、用大都不可能成就，所以剛開始你就是要去找到體大的相貌，就是無有增減、沒有生滅、畢竟常恆的一個內心的狀態。這是告訴我們悟入的一個觀照方法。

第二段、相大——如實不空

/VERSE/從本已來，自性滿足一切功德。所謂自體：有大智慧光明義故，遍照法界義故，真實識知義故，自性清淨心義故，常樂我淨義故，清涼不變自在義故。

前面是講到體大，是講到如實空，真如平等無增減故；這裡是講如實不空，講如來藏具足無漏性功德故。前面只是簡略的說明，我們自性是滿足一切無漏的功德；這以下說明什麼叫無漏的功德呢？以下開出了六種的功德。六種功德前面的三種是般若德，第四個是解脫德，第五個是法身德，就是般若、解脫、法身，第六個等於作一個總結。

我們這一念清淨平等的自體中：

一、大智慧光明義故：這個大智慧古德解釋說：它有破滅無明煩惱的功能，所以叫大智慧光明義故，它有破除無明煩惱的功能。

二、遍照法界義故：它能夠普遍照了十法界諸法的差別相，這個叫遍照法界義故。前面是約著滅惡；這個是生善，它有觀照十法界差別的智慧。

三、真實識知義故：前面是觀照諸法的別相；這段是觀照諸法的總相，它能夠如實了知生命的總相，總相是我空、法空的真理。我們凡夫往往都是隨順生滅門，依止內心的名言生起遍計執；事實上我們內心的本性，它是不顛倒的，它有真實識知義故。這三個是屬於般若德，破除我們的煩惱障。

四、自性心清淨義故：這個自性心清淨，就是沒有罪業的雜染，這個是約著解脫德來說，解脫它沒有罪業的障礙。

五、常樂我淨義故：這個是約法身德。我們凡夫的業報身是一個苦惱的境界，但是我們一念清淨平等的心性，它本身有常樂我淨四種功德。四種功德，古德在開顯時，他是以這個樂來作一個總說，我們先解釋樂。其實我們內心的本來面目，它的相貌是寂靜法喜，它沒有老病死的干擾，本來是沒有的，寂靜法喜叫做樂。這種快樂的感受是常，它是三世不改，過去、現在、未來不改變的，三世不改謂之常。這個我就是自在解脫，它有自在力。第四個就是淨，它是清淨無染，這種安樂的果報，它不夾帶煩惱罪業的，這叫法身德。

六、清涼、不變、自在義故：就是我們內心中，有般若德、解脫德跟法身德。這以下把這三種功德作一個總結，簡而言之就是。這個清涼就是般若德，它沒有煩惱的干擾叫做清涼；不變是法身德，它沒有報障，它沒有老病死的變化；自在是解脫德，它沒有罪業。我們凡夫有罪業，有時候我們要去面對我們不喜歡面對的人事，這個就是業力的牽引，使令我們的生命不自在。

總而言之，我們內心中，我們一念清淨平等的心性，當我們把無始劫來所熏習的業力都撥開時，事實上我們內心的本來面目是大智慧光明義故、遍照法界義故、真實識知義故、自性清淨心義故、常樂我淨義故，簡單的說就是清涼、不變、自在義故。

/VERSE/具足如是過於恆沙，不離、不斷、不異，不思議佛法，乃至滿足無有所少義故，名為如來藏；亦名如來法身。

我們把這個功德作一個總結：在整個相大來說，我們有前面的六種功德，這六種功德它是不離，它是不離開真如的；不斷，它是相續不斷，它過去、現在、未來都是相續存在，不管我們顛倒、不管我們覺悟，它是永遠存在的；第三個不異，它跟真如的法性是平等一味而沒有差別。廣泛的來說，就是一切佛法的功德，乃至是完全的滿足而無有欠缺。這種相大的功德，在因地上，我們安立做如來藏，如來之功德是凡夫在因地時就具足的，所以叫做如來藏；在果地上，我們安立做如來法身，大功德法之所莊嚴故名法身。這個是相大。後面會講到這六種功德主要的開顯方法，是以平等來作一個基礎。

蓮池大師在《竹窗隨筆》，把自己的修行作一個心得報告，這當中有一段說：蓮池大師有一個信徒，有一天來見大師，信徒就說：大師啊！在你的山下有一間小廟，這小廟有一個在家人，看樣子是持道教的咒，相當的感應。任何人有障礙，他為他持咒，他那個障礙就破除，有這種力量。這個在家居士感到很疑惑，請大師去鑒定鑒定，他為什麼會產生這麼大滅惡生善的力量。有一天，蓮池大師就順便散步到那間小廟去，就在旁邊看他怎麼做。後來大師發覺：這個人有一點不可思議，他在為別人加持時，你不管供養他什麼東西，你供養他錢也好、紅包也好，這個東西他一概不看，他要你直接丟到供養箱去供養常住。

後來蓮池大師在《竹窗隨筆》說：我們姑且不論他用什麼法門，他這一念的平等心，就有滅惡生善的功能。就是說我們內心中有六種功德，大智慧光明義故、遍照法界義故，乃至於常樂我淨義故，但是這個功德要開顯，你要能夠掌控它的密碼，你要知道掌握它的因緣。這個人他可能有學佛，也有可能沒有學佛；但是他內心中一念的平等心，他就隨順於真如，當然就產生這麼大的加持力。

就是說我們因為不平等，在有相跟無相的法門產生執取，所以使令我們內心中，那種廣大的力量沒辦法發揮出來，就是在這個有所得的因緣中產生了障礙。所以這裡是說，相大的開顯是由體大來作基礎的。

/KEPAN/子二、釋疑

前面講真如的體大、相大，這以下解釋疑惑：

/VERSE/問曰：上說真如，其體平等，離一切相。云何復說：體有如是種種功德？

我們凡夫的心是一個生滅門，一個對立的思考，所以用對立的思考來質疑真如門：說是前面講到一心真如，其體性是平等的、離一切的對立；怎麼說在相大的相裡面有種種的功德呢？我們想功德當然是對立的，有功德當然就有過失，這不是對立法嗎？提出這樣一個問難。看馬鳴菩薩怎麼回答：

/VERSE/答曰：雖實有此諸功德義，而無差別之相。等同一味，唯一真如。此義云何？以無分別，離分別相，是故無二。

其實我們在學習一心真如時，這六種功德你要有一個觀念：一心真如雖然具足了這六種無漏的性功德，但事實上這六種功德是沒有差別對立之相的，它跟真如是等同一味，法界一心，唯一真如。什麼叫做等同一味呢？簡單的說，它是以無分別，離分別相，是故無二，它沒有凡夫虛妄分別的心念。這裡很重要。就是說我們前面講到本覺，本覺理體的內涵它是離念的心體，也就是說它沒有這種妄念，你動一個念頭，這個就不是真如了，那是一個無明的對立因緣。當然這個動一個念頭，你可能是覺悟、或者不覺，也可能是各式各樣的因緣。這裡就是說，我們前面談到真如的功德，那是一個離念的心體，它是一個不二的，沒有對立思考的，所以才有這種功德的相貌。

其實所有的修學、無量的法門，都是在開顯我們內心的相貌；離開了心，那就沒有所謂的斷惡修善、轉凡成聖這件事情。心念的觀照，天台宗智者大師把整個大乘止觀分成兩類：第一個是次第止觀，第二個是摩訶止觀。

次第止觀：智者大師認為屬於對待的觀法。我們剛開始觀照，思惟業果，我們造善招感安樂的果報，生起惡念會招感痛苦的果報，依止這個有相的觀照生起慚愧心，來調伏惡念、增長善念。這當然是對治的觀法，這也是非常重要。剛開始我們從無量的煩惱中，就是這樣修學。慢慢慢慢地煩惱淡薄以後，我們開始修無相觀，就修四念處──觀身不淨、觀受是苦、觀心無常、觀法無我，以這個不淨、苦、無常、無我的智慧 ，調伏我們愛見煩惱（貪愛的煩惱跟我見的顛倒），這個是無相觀。這種都是屬於對治觀法，叫次第止觀。

摩訶止觀：但是智者大師說：其實在大乘的成佛之道中，它的重點在摩訶止觀，就是你在對治觀法以後，最後一定要入不二法門， 就是入無所得相應的平等觀，這個是成佛的關鍵。否則你只能夠在這種差別的果報──或者聲聞、或者菩薩裡面去得果報。

過去有一個禪師，他在茅蓬裡面修習一段很長的時間以後，他把修行的心得求善知識的印證。禪宗強調不立文字，教外別傳，我們教門的都是以教觀心，但是禪宗不立文字，當然就只好是以心來印心，以善知識的心來相互的印證。他就把他修行的經驗，請法眼文益禪師印證。他說：朗月當空時如何？我這幾年修行的相貌，就是萬里晴空、一輪明月，如何？這個修行人相當的用功，就是他在一片的烏雲中，他能夠建立一輪明月、萬里晴空，內心的烏雲障礙，慢慢慢慢地經過他的懺悔業障、積集資糧以後，慢慢變輕薄了。他就請善知識看：這樣，你老人家覺得怎麼樣？

法眼禪師說：猶是階下漢！你這樣的修學，在整個成佛之道中，還沒有完全相應。真正的修行人，他是非常的謙卑無我，他以真理為依歸，所以他馬上跪下去，就是請善知識開示：請師接上階。我應該怎樣突破這樣的相貌呢？法眼禪師說：月落後來相見。當然相見不是說我跟你相見，就是說你的心要跟真如相見，你要能夠消滅這種對立，入不二法門。

就是說我們修學，剛開始是一定要依止對立的法門，就是以幻化的法門來對治幻化的煩惱，以善來破惡、以空來破有，依止有相、無相行，來調伏心中的顛倒跟罪業。但是如果你想要成就佛道，你要開顯大智慧光明義故、遍照法界義故、常樂我淨義故，你到最後一定要入無念的平等觀。這個是講到我們從生滅門悟入真如門的一個關鍵，就是不二法門。

/VERSE/復以何義得說差別？

前面講到無差別，就是如實空跟如實不空這兩個是沒有差別、沒有對立的心念。那麼凡夫的差別是怎麼來的呢？

/VERSE/以依業識生滅相示。

凡夫的差別是依止我們的業識，這個業識是阿賴耶識，就是我們從一個真如平等無差別故的心念，突然間一念的妄動，妄動以後產生一種自他的對立。這個動當然不是動一次，就不斷地展轉熏習，產生業力，這個業力就叫做業識、阿賴耶識，那就產生很多很多九法界差別的果報。換句話說，這種差別是我們凡夫違背了本性，就是本性不應該是這樣的，但是我們顛倒了，違背本性，所以就產生很多虛妄的差別。前面已經說過，這裡，把這個差別相生起的因緣，再作一個回顧。

/VERSE/此云何示？以一切法，本來唯心，實無於念。而有妄心，不覺念起，見諸境界，故說無明。

阿賴耶識這個業識是怎麼產生呢？就是一切法，本來一心真如，本來是法界一心，離諸對立的，本來是沒有所謂的妄念可得。但是當我們一念妄動以後，這一念的妄動，慢慢地就產生妄心了，這個妄心就是第六意識，一念不覺生三細，再跟境界一接觸時，境界為緣長六粗，所以這個差別簡單的說是不覺念起，見諸境界，就是因為這個愚癡心念的生起，才出現了九法界的差別果報。

這個差別我們也可以作一個分判：假設這種對立的思考是依止增上的恶心，你根本就是邪知邪見，不信因果，這樣的心念的活動，他就很容易出現三惡道刀山油鍋的果報；如果你這個心念的活動是依止增善的善心，你能夠深信因果而生起慚愧來調伏自己，這樣是一個人天的果報；你心念的活動是出離心，觀察我空求出輪迴，這樣的因緣它所現出的境界是二乘的涅槃；如果你心念的活動是依止菩提心，所謂的悲智雙運、上求下化，這樣是趣向於大乘的功德莊嚴。

總之，因為這種心念的活動都是一種對立的、有所得相應的，所以都是屬於無明所收攝的，這個無明就是一種對立的思考，一種有所得的心。因為我們在有所得中，還有四種的差別，就有九法界差別的果報。這裡是說，由一心真如一念的妄動所出現的差別。那應該怎麼辦呢？這以下講到由這個差別的果報，如何返妄歸真，這以下是由細到粗來說明，先講最細。

一、不迷

/VERSE/心性不起，即是大智慧光明義故。

第一個，在六種功德中最難開顯的就是大智慧光明。這個大智慧光明，它若是依止不起，起就是起心動念，就是我們剛開始的一種有所得的心念，不管是對有相境界的得，或者無相境界的得，剛開始那種迷惑心都叫做起。

這個大智慧光明義故，我們解釋一下：蕅益大師在《彌陀要解》中講到念佛法門，他提到念佛法門有兩個差別的內容：一個叫事持，一個叫理持。

第一個事持：是屬於一種自他對立的思考。什麼叫事持？就是我思考：我是業障凡夫，阿彌陀佛是萬德莊嚴，我們兩個是差別的個體，你跟我不一樣，我跟你也不一樣。但是沒關係，我相信你可以救拔我，我對你一心歸命，通身靠倒。這樣當然也不錯，這個叫做念他佛，專念他佛，祈求佛力的加被。因為這樣的修行，你產生滅惡生善的功能就有限了，你這種對立的念佛法門，叫做他力法門，念他佛。

第二個理持：就是念自他不二。就是說你在念佛之前，你就研究過大乘的不二法門，你念佛之前你就相信：我雖業障深重，是彌陀心內的眾生；彌陀雖萬德莊嚴，是我心內之佛。既然心性不二，自然感應道交。就是說我們在念佛之前，我們先把這些差別的果報撥開來，我是業障深重，但這些是因緣所生法是後來有的，那是一念妄動才有的；諸佛菩薩的功德莊嚴，他也是因緣所生法，也把它撥開來，我們看到我們的心是如，阿彌陀佛的心也是如。依止一如無二如的心、平等心來念佛，蕅益大師說 ：這樣念佛法門，一念相應一念佛，念念相應念念佛， 自他不二，這時念念開展我們內心本具的智慧光明義故，這樣的修學是念自跟他。

自他不二的角度，就不是完全向外攀緣，它的思考是說：托彼依正，顯我自性。我們也不否定阿隬陀佛的功德，但是托彼依正，顯我自性，自他不二。同樣的念佛，他能夠以無所得的心來念佛，這時念念所成就的功德那就不同了，產生感應道交的力量也就不同。所以我們要成就大智慧光明義故的方法，就是心性不起，不起一種自他的對立。這是我們在開顯六種功德的第一個方法。第二個：

二、不取

/VERSE/心若起見，則有不見之相。心性離見，即是遍照法界義故。

前面是不迷，對自他的因緣不迷；這裡是不取著，不取著各式各樣的知見。則有不見之相，什麼叫取著？就是凡夫取著有相，二乘人取著無相的空性，所以都有所欠缺，都有他所不見的相貌，你取著一個，你就有所欠缺。那怎麼辦呢？心性離見，則是遍照法界義故。就是說我們內心的這個功德，要遍前面大智慧光明，當然是非常殊勝；但是你要遍照法界，要使令功德遍滿，你應該要遠離取相的執著。

這個見我們解釋一下，我們也說過，我們剛開始從生滅門修行，不是每一個人剛開始就進入真如門，所以智者大師說：你在修不二法門，一定先修對治止觀，再修圓頓止觀。我們出家來到僧團，剛開始是分別善惡，這個是對的、這個是錯的，這個是功德相、這個是過失相，你剛開始一定是從這樣的對立思考來建立你修行的基礎，剛開始是分別善惡。但慢慢慢慢地，如果你還想要突破，你祈求生命再增上，那怎麼辦呢？你要從分別善惡，進入到包容善惡；你知道，但是不要執取，因為眾生各有各的因緣。這時你會從一種對立的思考，而到一種平等的思考。當然這個平等的思考，不是說你搞不清楚狀況，你很清楚什麼是善、什麼是惡；但是你內心中包容，你做你該做的事情，但是隨順眾生的因緣。這裡你的心就是遍照法界義故，你的功德會更加的普遍廣大，這個是開顯遍照法界義的方法。每一個功德的開顯都有一個方法，你把這個方法掌控了，這個功德就出現，世間上就是因緣所生法，就是這麼一回事。第三，

三、不動

/VERSE/若心有動，非真識知無有自性。非常非樂，非我非淨，熱惱衰變，則不自在。乃至具有過恆沙等妄染之義。

我們剛開始內心當然是動，剛開始是迷，迷了以後產生取，取著，第三個就是妄動，這個動當然是一種身口意的造作。由這個造作，身口意向外的攀緣造作，就不能了知一切法的真實相，包括總相、別相都不了知，這時就招感了很多很多痛苦的果報。這些果報有哪些呢？第一個熱惱，第二個衰變。熱惱就是業障，你造了罪業，這個罪業使令你內心不安穩；由這個罪業，慢慢就招感果報，這個果報就有老病死衰變的障礙；老病死的障礙，使令我們的生命就開始不自在，有罪障跟報障。廣泛來說，因為我們的妄動，就有種種虛妄雜染的過失產生，那怎麼辦呢？

/VERSE/對此義故，心性無動，則有過恆沙等，諸淨功德相義示現。

所以我們要能夠開顯常樂我淨的功德，就是不動，以不動來開顯自性清淨義故，乃至於常樂我淨義故。看最後一段，作一個

四、總結

/VERSE/若心有起，更見前法可念者，則有所少。如是淨法無量功德，即是一心，更無所念。是故滿足，名為法身，如來之藏。

我們內心中有所起動，這裡的起動，包括前面的迷、或者是取、或者是動，有所迷惑、有所取著、有所妄動，都叫做有所起。這時我們內心陷入一種對立的思考，認為有真實的法可念，有真實的法可修，這樣我們自性的功德就有所欠缺，因為我們不能入平等法界。從本性來說，其實我們的功德沒有真正的開顯。事實上我們本性的功德是淨法無量功德，是我們一心真如本來具足的，不須要我們去向外攀緣的。這些一心滿足的功德，在果地上稱為法身，在因地上稱為如來藏。

這裡等於是把六種功德的開顯因緣，會歸到不迷、不取、不動。從修學的次第上，剛開始先不動，先從業力，就是我們不要在五欲的境界妄動，先不動；不動以後就不取；最後再消滅對立的不迷：不迷、不取、不動，這樣我們開始隨順我們的真如，就能夠開顯六種的功德。

這裡我想大家會有一個心得，就是方便有多門，歸元無二路，不管你今天用什麼法門來修學，總之你的修行一定是法法銷歸自性，你可以用你內心的狀態，來檢查你的內心是不斷地進步或退步。就是說你內心中，出家的時間，你的心慢慢的趨向於不迷、不取、不動，你的功德就慢慢的成就。假設你的修學是跟這個違背，就表示我們可能要作調整。這裡是把隨順真如的相貌，以不迷、不取、不動來作說明。`;
