QXL.volNum = 23;
QXL.text = `
請大家打開《講義》第四十八頁，庚三、結示證入。

馬鳴菩薩在因緣分講到造作本論的宗旨：使令一切眾生離一切苦，得究竟樂。換句話說，本論語言文字的安立，它不只是一種知識學術的研究，而是能夠真實的改造我們的生命，使令我們的生命從痛苦的因緣，而成就安樂的因緣。

離苦得樂這樣的一個宗旨，在本論中的修學重點有兩個：第一個是生滅門的修學。生滅的意思簡單的說就是一種對立，這種對立的修學有兩個內涵：第一個是有相行，第二個是無相行。

一、有相行

我們剛開始所修學的是一種有相行，有相行就是說依止一念的信心，歸依三寶、斷惡修善。有相行的修行所緣境有兩個：

第一個、三寶的所緣境：就是我們剛開始面對清淨莊嚴的佛法僧三寶，禮拜、讚歎、咒願，透過身業的禮拜、口業的稱名讚歎、意業的觀想歸依，滅除我們重大的罪障；

第二個、所緣境是眾生法界：我們有時候也離開佛堂，面對雜染的眾生法界來修學布施、持戒、忍辱，透過持戒修福、安忍不動來積集廣大的福德資糧。

因為我們修學剛開始的重點，不管是三寶的所緣境、或者是眾生的所緣境，都是一個有相的境界，所以叫做有相行。透過有相行，能夠滅除罪障、積集資糧，使令我們的生命能夠遠離三惡道，而趨向於人天安樂的果報。

但是這個安樂的果報，我們內心在受用時，會感到躁動不安，就是內心中有這種愛取的煩惱。所以這樣的果報就在安樂的過程中產生了障礙。因此在有相行的階段，我們希望能夠從有相行而趨向於無相行，尋求更殊勝的安樂。

二、無相行

無相行它所觀的境界是一個無相的真理，跟前面的三寶、眾生所緣境不同，它是一個無相的真理。就是說我們從前面的斷惡修善，開始去修無常觀、無我觀，觀察這些種種安樂的果報，它的相貌是生滅變化。這個生滅變化的意思，就是無常變化給我們一種不安穩性；這不安穩性當然就是苦，無常所以是苦，我們沒有安全感，我們不知道所擁有的這些安樂果報，什麼時候會失壞。所以說無常故苦，從苦中我們了解到這是虛偽無主的，我們對於果報沒有主宰性的，無我故空。所以這時，從有相的果報，就進入到一種無相的空性，假藉無常、無我的引導，從一種有相的境界中，進入到無相的真理去了。因為所緣的境界是一個空性的真理，所以安立做無相行。

不管有相行、無相行，內心中都是有所得相應，一個是對有相的執取，一個是對空性的執取；既然有所執取，當然它的方向都是向外攀緣，有這種所謂的生滅相、垢淨相、增減相，所以在本論中全部判作生滅門，當然這兩個都是成佛之道一個非常重要的過程。

/KEPAN/庚三、結示證入

現在這一科結示證入，當我們已經開始修習有相的業力，也開始在內心中起動無常、無我的觀照，我們應該怎麼從這種對立的生滅門，而趨向於平等的真如門？這以下講出它的一個修學方便。

再講這一科之前，我們把這一科的內涵作一個說明，首先我們翻到第十五頁解釋分，解釋分有三科：一者顯示正義，二者對治邪執，三者分別發趣道相。我們現在這一科是戊二、正解，這當中又分成了三科：己一、顯示正義，先顯示大乘佛法的正義。又有三科：庚一是總標二門；庚二是各釋二門，各別解釋二門；這是庚三、結示證入。前面是把生滅門跟真如門各別的內涵加以說明，以下就引導我們如何從生滅門的有相行、無相行這種對立的修學，而趨向於平等的真如門，說修學的方便法門。

/VERSE/復次，顯示從生滅門，即入真如門。所謂推求五陰，色之與心。六塵境界，畢竟無念。以心無形相，十方求之，終不可得。如人迷故，謂東為西，方實不轉；眾生亦爾，無明迷故，謂心為念，心實不動。若能觀察，知心無念，即得隨順入真如門故。

這一科的第一段是作一個總標。這一科的重點是顯示從生滅門而入真如門。這個門前面也說過，門有兩層意思：第一個是區別義，第二個是通達義。說生滅門它是一個對立的思考、對立的修學，真如門是平等的修學，所以它有差別；但是這兩個門也有通達，我們也可以從真如門而進入生滅門，當然也可以從生滅門而進入真如門，只要懂得方法，這兩個門是可以互相的通達的 。

生滅門簡單的說就是一種因緣果報，它有所造作，有這種造作的因緣，有所招感的果報；真如門它是非 因緣、非果報的，是眾生本具，諸佛所證的一個平等法界 。應該怎麼證入？這以下有三段的說明，先看第一段的總說。

所謂推求五陰，色之與心。六塵境界，畢竟無念。以心無形相，十方求之，終不可得。當然要趣向真如門，還得依止生滅門，所以我們應該推求，這個推求就是一種如實的觀察，觀察我們生滅的果報體。這個五蘊的果報體有色法跟心法：心法就是受、想 、行、識，有明瞭性的；色法是一個執愛，沒有明瞭性的；開出來的是六塵的境界。

第一個破除所取相

就是剛開始先破除所取相，所取的因緣就是種種的色聲香味觸法的境界，我們 觀察這些境界是畢竟無念。無念，法藏大師的解釋：無念就是沒有真實的體性。沒有真實的體性，這裡有很多的觀法，不過在大乘的角度，它的觀察法門都是從一心，萬法唯是一心來觀察。也就是說我們觀察我們在斷惡 修善所招感的果報，雖然有殊勝的人天色聲香味觸法的果報，或者在涅槃中也有寂靜的這種果報，但是這種所取的果報都是心中所現的影像，它是如夢如幻的，所以這樣叫不可得，從大乘角度是這樣觀察，它只是一個心中所現的影像。就是這一心真如，你用持戒修善的業力去熏習，它出現了人天果報；你用無常、無我的業力來熏習，它現出了涅槃寂靜：所以這些都是畢竟無念的，它的體性是畢竟空寂的，這樣來破除對於所取相的執著。進一步以心無形相，十方求之，終不可得。

第二個就是破除能取相

既然一切法是由心所變現，這個心又是一個什麼相貌？我們觀察心無形相，十方求之，終不可得。這裡心無形相的意思就是說，我們內心沒有一個決定不變的形相。一個人要是不打坐，就不知道你的心有什麼形相，你的心就是在外塵的境界裡面活動，心隨境轉；你要有時間經常打坐，就把外在的所緣境給消滅，就迴光返照這一念明瞭分別的心識，你就發覺我們的是躁動不安的形相。當然這個形相都是因緣所生法，因緣所生法。這裡空的安立，是用這種推求的方式。怎麼推求？

就是說：先假設一切法是由心所變現，這個能變現的心到底有沒有自體？我們先假設它有自體。它有自體，就一定有存在的空間跟時間。先看看它存在的空間哪裡？在空間上，十方求之，終不可得。它不在東西南北上下，不在身內、不在身外，我們找不到它存在的體性。從時間上，我們可以從過去心、現在心、未來心，我們之前也說過：觀察這個心，從時間上觀察說是未生無潛處，說我這善念的心還沒有生起時，它潛伏在哪裡？假設它有自體，它應該有一個潛伏的處所，但是找不到它潛伏在哪裡。正生無住處，這個心在我心中剎那生滅時，它也沒有一個依止處，正生無住處。生已無去處，當它走了以後也不知道跑到哪裡去了。所以從時間上觀察，也是覓之了不可得。

只要有一個東西，它在時間上、空間上找不到，就可以安立說這個東西是自性空的，它的自體是不可得的，它只是暫時的一個因緣所生法所現的一個相狀而已，當因緣結束了，這個相狀就消失了。所以我們也可以知道，雖然說大乘安立的一切法是心所變現，但是它能變現的心也是十方求之，終不可得，它明瞭心性的本性也是畢竟空的。

這裡就是說，基本上從生滅門悟入真如門的一個重點就是破執，破除對外境的執取跟對內心的執取，這是一個方便。

以下講出一個譬喻，如人迷故，謂東為西，方實不轉。說有一個人他起了迷惑，把東方當做西方，雖然他把東方當做西方，但是東方西方不會改變，東方畢竟還是東方，西方還是西方，不會因為我們迷惑而有所改變。眾生亦爾，無明迷故，謂心為念，心實不動。雖然無始劫來，我們內心自從一念不覺、以後，真如不守自性，我們不願意安住在一真法界的平等法界，我們喜歡去追求，總是覺得一定要有所得才快樂。這種有所得的心，就造成一種對立的思考，就是要無明，一個我相、法相自性的執取，這樣就產生一個念，這個念就是一種生滅心。雖然我們依止生滅心不斷地在九法界流轉，但是我們親近的一心真如還是一樣寂靜不動，不會因為我們在這邊打妄想而有所染污、有所改變。

換句話說，若能觀察，知心無念，即得隨順入真如門故。所以我們在修學有相、無相行中，你不要改變你的內涵，再加一個法門知心無念，即得隨順入真如門故。你觀察我們內心中，不管對安樂果報的執取、對空相的執取，這樣執取的心是覓之了不可得，這樣就能夠隨順於悟入真如門。

這裡的隨順入，法藏大師蕅益大師的註解都有說明。法藏大師把這一段分成隨順跟悟入兩個次第，法藏大師說：我們剛開始修學，依止有所得的心，不管是凡夫、不管是二乘，凡夫執著有相、二乘執著無相的空性，雖然他沒有進入到真如門，他也可以說是隨順真如門。隨順，離真如門的距離比較近。但是真實的悟入，那你就必須修知心無念，入平等法界。

這個入平等法界，法藏大師倒是沒有解釋它的方法；不過蕅益大師就有詳細的說明。他說：我們今天要從一個生滅門進入到真如門，最重要的關鍵點──你要能夠深觀動心，即不生滅。就是觀察你這念生滅擾動的心，它的本性就是不生滅，就是自他不二，妄想的本性它的本質就是真如。

我們諸位回憶一下：我們在受菩薩戒時，說是得上品戒體。當然上品戒體不是你向外追求能夠得到的，是你能發願的那一念心，你的心情，在受菩薩戒時，能夠自知我是未成之佛，諸佛是已成之佛，其體無別。雖然你這念心打妄想，但是你能夠很真實的肯定：你這個打妄想的心，它的本質就是一心真如；依止一心真如的心，發起斷惡、修善、度眾生的誓願，而得上品戒體。因為你這個平等法界沒有簡別，在因地就種下了一個圓滿的因種。

這個觀念在《法華經》也非常強調，《法華經》在《信解品》講出一個譬喻說：有一個大富長者，他有很多的珍寶。這個大富長者只有一個獨生子，這獨生子在小時候突然間發狂，離家出走再也找不到了，在外面流浪做了乞丐，展轉經過五十年。這個小兒子慢慢長大了，他已經忘掉了他的家在哪裡，就在外面做乞丐，有一頓沒有一頓的。這個乞丐有一天回到大富長者的家，他已經不認識這個家了，他看到這是一個非常富有的家庭，也許能夠施捨我一點飲食。他在門外偷看時，剛好被他父親看到了，他父親就說：這是我流失的兒子。就叫侍衛去追，這小兒子他流浪太久了，害怕就暈倒了。暈倒以後，這個大富長者就想：現在不是宣布他是我兒子時，因為他流浪太久了，個性卑劣，要廣設方便。

所以把他叫醒以後，請他除糞、掃廁所，發給他一點掃廁所應該有的工資。掃完廁所以後，慢慢慢慢這個人有資糧以後，對自己有信心；再進一步掌管庫房，掌管大富長者種種的珍寶；掌管庫房做得不錯，再升為當家；最後再正式的宣布，長者付財，他就是我的兒子，應該繼承我所有的財產。　　諸佛安立修學也是這個意思。剛開始你一定從生滅門有所得的心下手，或者從有相的因緣來積集福德資糧，或者你願意從無相行來尋求解脫；但是慢慢的，如果我們想要從九法界的因緣果報，而趣向於諸佛的清淨法身，你就必須要觀察知心無念，這時你的心就入一真法界的平等法界，這時你一念不生，一切法如的境界才能夠進入法身。就是說真如門它這個門你要進去有一個軌則，這個軌則你不具足，這個門你是進不去的，這個軌則就是知心無念。不管你對於雜染的果報，乃至於對清淨的果報，你都不能夠有一念有所得的心，這個是進入真如門的一個方法。

佛教的修學，它重視這個行動力，也重視觀照力。就你內心是怎麼觀照，就影響你對整個果報的果證。就是外道也斷惡修善，外道對於他們所歸依的境也禮拜、讚歎、咒願；但是佛教徒的禮拜、讚歎、咒願跟他們有所不同，就是內心中多一個平等的觀照，這時你所積集的善業就不是人天福報，那是一個無上菩提的資糧。

外道的修學，內心沒有一種平等的法界觀，這樣只是一個人天福報。就是說他這樣的一個善業力，不能夠產生返妄歸真、轉凡成聖的力量，所以內心的觀照力非常重要。就是同樣是一個行持，你內心中缺乏那個眼睛的引導，你這樣的善業就不能夠成就所謂的乘，波羅蜜不能夠到彼岸，這只是一個善業力。

所以這裡就是說，我們可以廣泛的在生滅門中追求我們的資糧解脫，但是你一定要加一個修行的重點，就是若能觀察，知心無念，即得隨順入真如門故。剛開始你就要知道你的目標在哪裡，你才不會在這過程中得少為足，不知進取，喪失了成佛的機會。這裡是把顯示正義這一科作個總結。

/KEPAN/己二、對治邪執
/KEPAN/庚一、總標二見

前面是顯示正確的義理，等於是生善；這裡是破惡。就是我們在前面的修學，有可能會產生一種錯誤的理解，又產生一個虛妄的執著，這個應該加以對治。這當中有三科，先看庚一、總標二見，把執取的相貌作一個總說：

/VERSE/對治邪執者，一切邪執，皆依我見。若離於我，則無邪執。是我見有二種。云何為二？一者人我見，二者法我見。

我們在對治邪執，先知道所對治的是有哪些。我們所對治的邪執，簡單的說就是我見。這裡我見指的是無明，無明就是自性執，就是我們在生命中認為有一個真實不變的自體，這個自體是不假藉因緣所生法，這樣的執取就是我見。離開了自性執了，就沒有所謂的邪執可得。這個自性執開展出來有兩個：一個是人我見，一個是法我見。我們先作一個簡單的說明，第二科再詳細的說明。

一、人我見：又叫做補特伽羅我見，就是對於生命本身的一種執取，就是我們在流轉中，我們這個明瞭的心性、一念清淨的平等心，接受業力的熏習，會創造一個果報體。我們在每一個果報體，就認為有一個常一主宰，這個就是人我見。我們這個五蘊果報體，的確有時候也有一點主宰性，當你的善業具足時，你想要做這件事情、那件事情，有些因緣會讓你感到如願；但是你如果認為說這個主宰性是恆常住不能變化的，是永遠存在的，這樣就是人我見。就是說主宰性有時候會存在，當你善業現前時你能夠如意；但是有時候你的生命不能夠如意：所以它是不決定。但是我們認為這個主宰性是決定存在的，這個就是人我見。這個是從無常觀、無我觀就能夠消滅的。

二、法我見：這個法的範圍就比較廣泛。前面只是生命的一個個體的執取，這裡的法是指一切的因緣所生法。因緣所生法，有雜染的果報、有清淨的果報，我們觀察這些果報都是因緣所生法。這個因緣所生法，我們前面也說過。大乘的菩薩修法空觀，他的重點都是觀察萬法唯識。

什麼叫做法執？你認為這個法離開這念心有真實體性，離心別有，這個就是法執。破除這個法執的方法，就是觀察一切的法──雜染法、清淨法，都是一念心所變現。這是一個總說。

我們看東方的文化跟西方的文化有所不同。東方的文化，它的重點偏重在生命科學，就是對這個心有很多很多深入的研究，當然會產生各式各樣的執取。東方文化的整個生命的精神體力，都耗費在對心識的研究。對於去創造物質、船堅炮利，完全沒有興趣，但是它開展出一個非常精緻的人際觀系，所以東方文化的人我見比較重。西方的文化，它是比較重視自然科學，對大自然各式各樣的因緣法好樂去追求，像科學、醫學，所以西方文化它的人際關係比較單純，但是法見會比較重。這個就是眾生的等流習氣。總之，我們這個執取，一個是對生命的執取，一個是對一切因緣所生法的執取，這兩個重點。

/KEPAN/庚二、別釋二見
/KEPAN/辛一、人我見

別釋中先講人我見：

/VERSE/人我見者，依諸凡夫，說有五種。云何為五？

依止這個生死凡夫，說有五種。先看第一個：

/VERSE/一者、聞修多羅說：如來法身，畢竟寂寞，猶如虛空。以不知為破著故，即謂虛空是如來性。云何對治？明虛空相是其妄法，體無不實。以對色故有，是可見相，令心生滅。以一切色法，本來是心，實無外色。若無色者，則無虛空之相。所謂一切境界，唯心妄起故有。若心離於妄動，則一切境界滅。唯一真心，無所不遍。此謂如來廣大性智究竟之義，非如虛空相故。

這裡是分成兩大段，先提出我們執取的相貌，再說明對治的方法。先看

第一大段、執取相貌

一、大乘的經典上說：如來法身，畢竟寂寞，猶如虛空。佛陀說：佛陀所依止的身（這個身就是依止處），就是佛陀清淨明瞭真如平等的心，他也要有一個依止處。佛陀的心依止什麼？依止清淨的法身，不是我們凡夫這種老病死的業報身，佛陀真如平等的心所依止的法身他的一個相貌，是畢竟寂寞的，沒有這種生滅變化的相貌、沒有這種老病死，他是寂靜而不生滅，這樣的一個情況，猶如虛空。一般我們在了解譬喻，要取其義，不能取其相。

虛空有二義：第一個是週遍義，它是週遍的，每一個角落都有虛空；第二個是無差別義，它沒有差別相的。你說房子、桌子、椅子，有各式各樣的差別相，但是虛空沒有差別相。佛陀就用虛空來比喻佛陀清淨的真如心所依止的法身，是無差別義、是週遍義，所以名之為法身。我們凡夫不知道佛陀講虛空是為了破我們這種有所得的執著，就把虛空當做佛陀法身的體性，以虛空的相狀來當做體性。當然這樣就是一個障礙。

第二大段、對治方法

云何對治？我們看對治，

第一段、總說

明虛空相是其妄法，體無不實。以對色故有，是可見相，令心生滅。

虛空其實是一個虛妄的生滅法，它的體性是虛妄性的，也就是說它是一個依他起性，是一個因緣所生法。怎麼說呢？以對色故有，是可見相，令心生滅，它是相對於一切的色法而存在的。我們說這是一個色法，色法以外都叫虛空，所以它是依止色法的相對而安立的，它是眼睛可見之色，可以用眼識加以了別的，所以它能夠使令我們心產生生滅的作用。這是總說，它本身也是一個因緣所生法。

第二段、別明

以一切色法，本來是心，實無外色。若無色者，則無虛空之相。

其實一切的色法，這裡的色法包括有相的色法、無相的虛空，所以虛空也是色法，都是一心真如所顯現，實無外色。這裡就是破除虛空的虛妄性。什麼叫做本來是心，實無外色呢？假設虛空是真實的，當然真實的意思就是它非因緣而改變。比如說：我們人去看虛空，看到的是一個無形相的東西；但是科學家說狗看虛空是灰色的；餓鬼道看虛空也是有不同的形像。

假設虛空是有真實的體性，那每一個眾生看到的虛空應該是無差別，所以說虛空它本來是心，它是心中的業力所顯現出來的，沒有一個真實的色法。若無色者，則無虛空之相，所以離開了心外的法，就沒有虛空可得。

第三段：總結

所謂一切境界，唯心妄起故有。若心離於妄動，則一切境界滅。唯一真心，無所不遍。

所以一切的境界都是我們這一念心的妄動，這個動就是業力的造作，才產生的果報。你這個業力消失了，果報就消失了，唯一真心，無所不遍。

此謂如來廣大性智究竟之義，非如虛空相故。

所以諸佛的清淨心是清淨廣大的，它不像虛空是一個有為的生滅法。這個是以虛空為法身，我看佛弟子很少有這種思想，一般都是外道。就是說外道他也沒辦法聽聞佛陀所開顯的這些大乘真理，他就依止自己的胡思亂想，在胡思亂想中得到一個結論：我們這念心是擾動相、是苦惱相。所以他怎麼辦？

他就想辦法把內心中的擾動相停止下來，去修這個禪定。當然禪定一定要有一個所緣境，依止一個特定的所緣境，心於所緣專一安住，心於所緣相繼安住，他整個心就透過專注集中，慢慢地慢慢地就從一個躁動的粗重相，到了一個寂靜輕安的相貌，就從欲界的心態提升到色界，這時的色法是清淨微細的色法，所以他有殊勝的輕安樂。

但是這時，當然因緣所生法都是有所得，就是這個有所得的果報體，這裡會有個問題，就是長者生厭。你看佛陀長時間安住在真如，他也不會有厭煩的心。凡夫的心、這個果報體、這個因緣所生法，它是對立的，有好就會有壞，所以他在這個寂靜色界的禪定中，他覺得這個色法是一個障礙，如鳥在籠，不得自在，所以他一直想要去超越色法的障礙。佛法認為色法不是障礙，障礙我們的是無明。

他怎麼破滅色法？他就去攀緣無邊的虛空，以虛空為他生命的歸依處，他不斷地去觀取虛空以後（你這念心怎麼造作，就會出現什麼果報），慢慢慢慢地，粗重的業果色法就消失掉了，只有寂靜、只有精緻的定果色，這時就從色界而趨入無色界。因為他所依止的虛空，還是一個有為的生滅法，所以他禪定消失了以後，就繼續受三界的輪迴了。所以他剛開始時，以虛空為法身，這裡是一個錯誤的知見，因為虛空也是心中的一個影像，是這個意思的。所以我們在後面，他有很多的執取。就是說，「一切賢聖，皆以無為法而有差別」。

你今天心中的歸依處選擇的對不對？修行當然有所謂的目標、有所謂的過程，你在過程中，我們可以依止生滅門來加以對治，但是你的目標、你的歸依處不能有錯謬，否則你在整個修學聖道的過程中，就會產生一個迂迴錯誤的果報。這裡是說明這個意思，就是你剛開始所歸依的目標，不能有錯謬。`;
