QXL.volNum = 24;
QXL.text = `
請大家打開《講義》第四十九頁，我們這一大科是對治邪執。

從大乘的角度來說，我們剛開始所依止的是正見。就是說你依止的宗見正確與否，會影響到你後來的果證；所以在前面的開顯正義以後，我們接下來就要對治邪執，怕我們在宗見的確定上有所錯謬。我們看對治邪執的第二段：

/VERSE/二者、聞修多羅說：世間諸法，畢竟體空，乃至涅槃真如之法，亦畢竟空。本來自空，離一切相。以不知為破著故，即謂真如涅槃之性，唯是其空。

第二個對大乘正見的第二個錯謬，就是他也是聽聞大乘的修多羅，這裡主要是指《般若經》，聽到《般若經》上說：世間的這些有為諸法是畢竟體空的。世間的有為法，不管是安樂的果報、不管是痛苦的果報，都是因緣所生法，都是心中的業力所顯現。乃至於涅槃真如之法，亦畢竟空。這個是出世間無為的涅槃法，這個無為法，它也是假藉戒定慧的因緣的業力而顯現的，所以它的本性也是畢竟空。

所以他作一個總結：本來自空，離一切相。諸法的本性，不管是有為法、不管是無為法，都是畢竟空。

什麼叫空呢？簡單的講就是離一切相。他就以離一切相為他生命的一個目標，他不知道佛陀安立的畢竟空，是為了破除凡夫跟二乘的執著而安立的。凡夫在有相的執取，所以佛陀說有為諸法是畢竟空；二乘人修無相行，在空性上執著，得少為足，不知進取，佛陀就告訴他涅槃之法也畢竟空。

總之，佛陀安立空性的目的，是為了破除執著，是一個過渡時期，說是以無所得為方便，它只是趨向真如的一個方便。但是這時，大乘學者就在真如涅槃之性中，產生一個空性的執取，就是空性就是我的本來面目，是我整個無量無邊修行最後的會歸處，是我的一個生命究竟的依止處。那這應該怎麼辦？我們看下一段：

/VERSE/云何對治？明真如法自體不空，具足無量性功德故。

如果有對空性特別好樂執取的這種傾向，你在對治上應該要不斷的思惟：其實我們這個生滅心的目標是真如，它的自體有不空的功德。什麼叫不空呢？具足無量性功德故，你要思惟你內心中，有大智慧光明義故、遍照法界義故、真實識知義故、自性清淨義故、常樂我淨義故、清涼不變自在義故，還有無量無邊的法身、般若、解脫德種種的清淨的功德。你用這種不空的功德莊嚴，來帶動你好樂空性的這種心情。

這裡就是說，假設我們今天以空性為究竟義，到最後就會落入二乘的涅槃去。二乘人他在成就涅槃以後，我們讀《法華經》，他們也有所不同。你看舍利弗尊者跟目揵連尊者都是大阿羅漢，他內心中都是安住在不生不滅、無大無小、畢竟空寂的涅槃。但是舍利弗尊者在《法華經》上，他跟佛陀表達說：我雖然安住在不生不滅的空性裡面，我看到這些大菩薩，隨順諸佛、轉大法輪、廣度眾生，內心中生起慚愧心，對這種功德有好樂。

小乘的學者有兩種：一個是直趨小乘的，所謂的定性聲聞；一個是退大取小的小乘。就是舍利弗尊者以前有修學過大乘，後來因為惡因緣而退大取小。但是你看迦葉尊者，他的心情就有所不同，他在《法華經》上很坦白的跟佛陀說：我看到諸佛菩薩，不管是佛陀、大菩薩，成熟眾生、莊嚴淨土，他內心中一點都沒有好樂的心情，他就是歡喜安住在空、無相、無願的這種三三昧，自己受用就可以了，他覺得這樣他的大事已辦。當然根性有各式各樣，所以當我們對空性執著時，你應該要觀察不空來加以對治。

這裡意思就是說，假設成佛之道的目的是畢竟空，那我們可以這樣講：修習善法、度化眾生，就完全沒有意義了，就是說你成就萬德莊嚴沒有意義，他最後的目的是畢竟空。

所以正確的思考是說：佛陀的整個修學目的是成就妙有。就是我們凡夫剛開始的有是一個雜染的有，經過空性的執著以後，剛開始從假入空，這個過程非常重要，先調伏執取，破執；但是到最後一定是從空出假，開始成熟眾生，莊嚴淨土，廣修福德，成就萬德莊嚴。

所以佛道的究竟義是無量的莊嚴，而不是畢竟空。假設說你這個人修了三大阿僧祗劫的六波羅蜜──布施、持戒、忍辱、精進、禪定、智慧，廣度無量無邊的眾生，結果你得到的果報是一個畢竟空的涅槃，你修善、度眾生就沒有意義，那修行斷惡就夠了。所以這裡就是說，假設我們對空性好樂執取，就以不空來加以對治，觀察你內心中有無量功德的可能性值得我們去開發。看第三：

/VERSE/三者、聞修多羅說：如來之藏無有增減，體備一切功德之法。以不解故，即謂如來之藏，有色心法自相差別。

我相的執取，前面兩個是對空的執取，一個是空相、一個是空性；第二段的執取更高明，他是對義理的執取。第一個是外道的執取，對空的相狀的執取；這三四五都是有相的執取。前面是空，這個是對有的執取。

他說聽到修多羅《楞伽經》《涅槃經》上說：如來之藏無有增減，體備一切功德之法。這個如來藏我們前面說過，真如的因地叫如來藏。如來藏就是我們凡夫打妄想的心，它的本性是無有增減的，在凡不減，在聖不增，心佛眾生三無差別。而且在不增減的心中，它具足了一切的功德，具足了大智慧光明義故，乃至常樂我淨義故。我們聽到了自性具足功德之法的道理以後，因為不了解，就以為如來之藏，有色心諸法的自相差別，有各式各樣的功德法可以去受用。這時應該怎麼辦？這前面是對空的執取，這個是對有相的執取。

/VERSE/云何對治？以唯依真如義說故。因生滅染義示現說差別故。

這裡很重要，就是說假設你聽到前面的真如有不空如來藏，說是如來藏具足無漏性功德故。什麼叫性功德？有大智慧光明義故、遍照法界義故、常樂我淨義故。這時你就想：既然我內心中具足這種功德，就不勞我修了！好像說一個倉庫打開來，所有珍寶都具足了。這樣講就錯誤了。

這裡很重要，佛陀說的具足功德是依止真如義說，是依止平等絕待的，是沒有能所的。你現在的思考，是有一個能受用的我，有一個所受用的法，那是一個生滅門。這裡如來藏具足功德，是約著真如門而安立的，它沒有對立的情況，那是從本性具足而安立的。如果你說這種功德，可以有這種果報的受用，這樣就落入了生滅門裡面的因緣果報，而安立十法界的差別。

這裡我們說明一下。在九十六種外道中，有一種外道叫神我外道，神我外道是說因中有果論：說我們這念心有一個神我，這個神我具足無量無邊的功德，它能夠受用一切的法。這個神我它的問題出在哪裡呢？它這個神我論，跟佛法安立的真如，也具足無量功德的差別：這個神我是一個二元論，是對立的，有一個能受用的神我，有所受用的法，那這樣落入了生滅門。

生滅門在本論中，它不說你的無明具足功德，它不這樣講。因為你落入生滅門以後，那就是你造什麼業，得什麼果報，它不安立無明具足大智慧光明義故，乃至於常樂我淨義故，它不這樣安立。所以說外道的神我，是安立在一種對立的，一種無明中安立的，它是有一個能受用、有所受用的對立法。

本論所安立的如來藏具足無量性功德，是安立在一個平等法界。所以智者大師在安立性具時，他強調說：諸法不自生，亦不從他生，不共不無因，是故知無生。以無生法而性具一切功德。就是說所謂的性具是依止無生，一種沒有對立的平等法界而安立功德。假設你內心中已經產生對立的思考，那這個功德就不存在了，那就是因緣果報了，你造什麼業，得什麼果報。

所以這種自性的功德，就會產生一個自然外道的思考，就否定了生滅門的這種造作，只有真如門。如果我們今天只強調真如門，而不強調生滅門，就會有這種思考：如來藏具足無量功德，那就不勞我修了。那修因證果就沒有意義。本論強調真如門，也強調生滅門，就是在補足這個過失。

/VERSE/四者、聞修多羅說：一切世間生死染法，皆依如來藏而有。一切諸法，不離真如。以不解故，謂如來藏，自體具有一切世間生死等法。

前面是對清淨功德的執取，這個人是太過樂觀了；第四個是太過悲觀了，對雜染法的執取。他聽到大乘經典說：一切世間生死的雜染法，這種煩惱罪業都是依如來藏而有，說是依如來藏所以有生滅心。你要一心真如，才會有一念妄動；你要沒有平等法界，哪有對立法界呢？佛陀在方便演說這個道理時，他說依如來藏故有生滅心，所以他就說：一切諸法，不離真如。以不了解的緣故，就認為真如本來就具足了這些生死的雜染法，煩惱罪業都是眾生本具，本來具足這種煩惱罪業，當然本具的就沒有辦法消滅了，這個人就落入了一種悲觀的思考生命，所謂的離苦得樂完全沒有希望。有這個思考怎麼辦？

/VERSE/云何對治？以如來藏從本已來，唯有過恆沙等諸淨功德。不離不斷，不異真如義故。以過恆沙等煩惱染法，唯是妄有，性自本無。從無始世來，未曾與如來藏相應故。若如來藏體有妄法，而使證會永息妄者，無有是處。

當我們總是覺得自己煩惱業障礙很重，一天到晚就思惟自己的雜染相，那這怎麼辦？應該怎麼對治？你應該想：其實你現在的煩惱罪業不是你的本來面目。不是你的本來面目，那是怎麼有呢？是真如一念妄動以後，去造作業力，這個業力的熏習才出現的，所以它是因緣所生法。它隨因緣生，也就能夠隨因緣而消失。

也就是說，其實講到本性，佛陀在真如門裡面只有說：如來藏具足了種種的清淨的功德，這個功德跟如來藏是不相遠離的，是相續不斷的，是不異如來藏的，跟如來藏是同一體性的。所以佛陀在講如來藏時，他沒有說如來藏具足過失，他只是說如來藏具足功德。

這時我們會問：那這個過失怎麼有的？這就解釋為什麼會有煩惱罪業呢？這本性是清淨，怎麼會有煩惱罪業？以過恆沙等煩惱染法，唯是妄有，性自本無。那是後來的一念妄動以後，造作了業力，這個業力的熏習，這些煩惱障、業障、報障才出現。既然是後來的因緣法，表示它是心中的一個虛妄的影像，如此而已。

所以說我們應該觀察：雖然有煩惱罪業，從依他起的角度，我們承認它存在；但是這個煩惱罪業從無始已來到現在，未曾與如來藏相應故，從來就沒有跟如來藏完全相應。假設如來藏自體有雜染法，我們在修習戒定慧而趣證真如、消滅妄想，就變成不可能，沒有一個眾生可以成佛了。所以我們思考問題，你掌控了真如門，也要掌控生滅門。就是說這個雜染法是生滅門才有的，真如門裡面根本沒有雜染法。這個思考，何期自性本自清淨；何期自性本自具足，是所有修本尊相應法，所必須具足的基本條件。

特別是修淨土法門，淨土法門也是本尊相應法，淨土法門是修感應道交。我們也知道，你能夠往生淨土，不是靠你的戒定慧，是你的心要跟阿隬陀佛的心感應道交。如果你一直覺得你煩惱業障很重，你就沒有辦法跟佛陀感應道交，所以你覺得：我事實是一個雜染相，阿彌陀佛是清淨相，這兩件事情不相配，心心不相應。你要這樣想，你果然不能感應道交，不能感應道交的問題在於我們自己產生障礙。

所以曇鸞大師的《往生論》裡面一再強調：十念往生，臨終的十念一定是具足決定的信願。就是說你能夠深深的知道：這個妄想罪業是虛妄性，我們念佛是一種稱性的真實功德，真實破除虛妄；具足這種信心，十念中念念之間滅除無始罪障，念念跟彌陀感應道交。假設你內心中一直認為你煩惱業障很重，你就沒辦法修本尊相應法了。你認為煩惱罪業是你的本來面目，那本來面目就不能改變！

所以這裡我們要注意。就是說本來面目是清淨的功德、是平等法界，後來一念妄動以後變成對立的思考，有對立就產生個體的生命，就開始造業，就開始熏染很多的煩惱罪業，那是後來的虛妄相，是這個意思。

/VERSE/五者、聞修多羅說：依如來藏，故有生死；依如來藏，故得涅槃。以不解故，謂眾生有始。以見始故，復謂如來所得涅槃，有其終盡，還作眾生。

前面的雜染是一個因地的雜染，這裡是一個果報的執取。說是我們聽到修多羅，這裡修多羅指的是《勝鬘經》。《勝鬘經》說：我們的如來藏這個一心真如，因為一心真如，所以依如來藏，故有生滅心，有生滅心就是對立。有時依止不覺的因緣出現生死的果報，依止覺悟的因緣生起不生不滅的涅槃。生死跟涅槃都依止如來藏而有。他就產生錯誤的理解說眾生有始，這眾生有始就是說真前妄後，就是真如在前，無明在後。說是我們本來是真如，後來一念妄動以後變成無明，意思就是從真起妄。無明怎麼有？從真如而有。這是真前妄後的執取。

這樣就有一個問題了：以見始故，復謂如來所得涅槃，有其終盡，還作眾生。既然剛開始的緣起是清淨的真如，後來從真起妄，生起妄想，慢慢慢慢地變成涅槃。換句話說，可能有一天沒準了，佛陀又起顛倒了，還作眾生。因為你剛開始也是從真起妄，總有一天你也會從真起妄，所以悟後就會再迷，就起這樣一個知見。所以說既然成佛還是不安穩性、還是一個生滅法，那這時對佛的好樂心就失去了。那怎麼辦呢？

/VERSE/云何對治？以如來藏無前際故，無明之相亦無有始。若說三界外，更有眾生始起者，即是外道經說。又如來藏無有後際。諸佛所得涅槃與之相應，則無後際故。

我們在研究本論，你要知道馬鳴菩薩講本論時，依止真如跟無明，當然真如是平等的，無明是生滅門。他說真如是以如來藏無前際故，真如是無始無終的，在凡不減，在聖不增，不管你願不願意承認，它都存在；但是它講到無明時，講到無明也是沒有開始，也是無始無明。本論從來沒有說無明是從某年某月某日開始的，它也是無始的，所以兩個都是無始的。所以我們不應該說從真起妄，應該說迷真起妄，對真如迷惑以後才有妄想。但這是一個方便說，事實上本論一再強調真如是無始，無明也是無始。如果你說在三界之外，當然三界之外那是一個聖人的法界，四聖法界中又有一個聖人開始要起顛倒、煩惱了，那是外道的《大有經》才這樣說的。所以在佛法中，如來藏是無始無終，所以諸佛涅槃跟如來藏相應時也就無始無終，不可能又會起顛倒時。

這裡等於是把我們眾生的本性問題，作最後的探討。我們本論裡面講到一心有二門：有一種清平等的真如門，有一種對立的生滅門。生滅門中，以無明為根本，就是阿賴耶識為根本。但是這裡講真如是無始的，無明也是無始的？這句話的意思就是說，我們的本性如果精準的來說是真妄和合，有真如但是也有妄想、有妄想也有真如，我們的本性是這樣的，就是真如帶妄，從理論上來說是真如帶妄。但是在修證的過程中，我們看很多的祖師會告訴我們：達妄本空，知真本有。就是說妄想是畢竟空，真如是真實存在，不斷地要我們憶念真如這一部分。

蕅益大師在《靈峰宗論》提到一個觀念說：其實我們的心是真妄和合，為什麼我們不經常思惟何期自性本自雜染？因為雜染也是存在的。蕅益大師說：這樣的思惟，理論上說是對的，但是沒有四悉檀的因緣。就是你這樣講不能夠讓我們產生歡喜、生善、破惡、入理。佛法法門的安立，一定要具足四悉檀，要有滅惡、生善的功能。

在日本有一個教育叫生命教育，它裡面提出一個觀念：有一個小孩子他得到肝病，雖然去看醫生，打針、吃藥，肝病都沒有好轉。後來他就找心理醫生分析，原來他的母親告訴他一個觀念說：你呀小心，你從小就肝不好。所以他內心的名言中，總覺得他的本性是肝不好，是不能改變的。他這個肝不好是有自性的，吃藥、打針只是暫時的調伏，肝功能不好是我的本性如此，沒辦法改變。這個因緣所生法被你一執取以後，它變得更堅固了。所以這個心理醫生告訴他母親說：你從現在開始不要跟他講肝不好；你應該跟他說你已經慢慢的好轉了，恢復健康了。你本來是健康的，肝不好是後來才有的。後來果然吃藥、打針就有改善。

就是你一天到晚思惟你是業障凡夫，那你這個業障要懺悔就比較難了。所以這裡就是說，雖然理論上是真妄和合，但是我們在實際修證時，你在觀照時，你要正念真如，你要觀照那個真實的部分，你內心中觀照是觀照那個光明面，真能破妄。所以這裡很重要，有時候理論跟修證上有所不同。這裡意思說，我們本性是真妄和合，但是真實是能夠破除虛妄，所以我們透過生滅門的修證，把真如的功德顯發出來，就能夠破除妄想，是這個意思。

/KEPAN/辛二、法我見

/VERSE/法我見者，依二乘鈍根故，如來但為說人無我。以說不究竟，見有五陰生滅之法，怖畏生死，妄取涅槃。

法我見是二乘人，佛陀對這種二乘的鈍根人（這個是定性聲聞，一路都沒有學習大乘佛法，從初發心就走小乘路線的人），佛陀就講我空觀。佛陀對因緣法，不管生死、涅槃法，就不說生死是空、涅槃也是空；只講反正生死中沒有一個我，那就可以了。佛陀等於是說不究竟，等於是為實施權。所以二乘人他不知道法空，他看到五蘊的這些生死果報，產生極度的怖畏；對涅槃就特別的執取好樂。所以二乘人的修行，對苦諦有很深很深刻的理解。所以他一到涅槃以後，就不敢再從涅槃裡面從空出假。那這怎麼辦？

/VERSE/云何對治？以五陰法，自性不生，則無有滅，本來涅槃故。

當然這個是法空觀，其實這個五蘊之法，它不是真實有的，它是自性不生，本來不生，所以就沒有所謂的滅。也就是說它只是我們一心真如，假藉不覺的因緣而顯現的一個生滅果報，其實它是心中的一個影像，本來涅槃故，我們的本來面目是一心真如的一個大般涅槃。這裡等於是破除法見，對於雜染的生死法、對於清淨的涅槃法的一個自性執，當我們會歸到一心真如的平等法界，這兩種執取就消失了。

/KEPAN/庚三、究竟離妄
/KEPAN/辛一、正明

這是最後一科，這當中有兩段，先看正明：

/VERSE/復次，究竟離妄執者，當知染法淨法，皆悉相待，無有自相可說。是故一切法，從本已來，非色非心，非智非識，非有非無，畢竟不可說相。

這裡作一個總結，我們想要究竟離開人我見、法我見，我們應該要觀察所謂生死的雜染法、清淨的涅槃法，都是一種對待法，都是生滅門，當然生滅門都是心中的一個影像。當我們依止覺悟的因緣起動了，就出現涅槃的功德；隨順不覺所起動的，那是一個生死雜染法。所以把這種生滅、對立的雜染法、清淨法，會歸到本來面目時，一切法是非色非心，非智非識，非有非無，離諸等待，畢竟不可說相。

當然不可說的意思是說：一落入言說，那就是對立，就有好有壞、有雜染有清淨；而我們的本來面目是離諸言說相。不過這裡，如果我們不要產生錯誤理解，應該再加一句話，就是是故一切法，從本已來，非色非心，非智非識，非有非無，畢竟不可說相，唯是一心故。加上這個可能會好一點，否則會跟中觀的學者又會產生混亂，就是這個真如它是有明瞭性。

/KEPAN/辛二、釋疑

/VERSE/而有言說者，當知如來善巧方便，假以言說，引導眾生。其旨趣者，皆為離念歸於真如。以念一切法，令心生滅，不入實智故。

一切法是離言說相，沒有對立的。那麼佛陀為什麼安立很多的言說呢？有時候說：弟子們呀！你們應該歸依三寶、斷惡修善，修有相行。有時候告訴我們：修無常、無我的觀，修無相行。種種的言說其實是佛陀的善巧方便，假藉方便來引導我們眾生，它的關鍵點就是為了要離念，而歸於一心真如，就是離開心中這種有所得的妄念。說我們剛開始是完全忘了真如門的存在，就在生滅門中，而且是生滅門中一個迷惑的因緣、不覺的因緣。

所以剛開始的執著是惡念，以煩惱為自我：我的個性就是這樣，沒辦法！我們活在自己的煩惱中，跟著自己的煩惱而轉，這時佛陀說善法，以善來破惡。你要執著，你起碼依止在善念；到最後從善念中，你發覺善念是擾動的，它是不寂靜的，佛陀就講空性到寂靜。最後佛陀告訴我們：空性也不究竟，一定要從空出假，廣修六波羅蜜，啟發自性的功德，成就佛道。這時才正式趨向於無住，無住了以後就是真空妙有，一心真如。

所以佛陀的目的就是要我們次第的離念，遠離惡念、遠離善念，最後遠離空性的念頭。為什麼？因為你念一切法，不管是有相的念、無相的念，都產生一種生滅對立，你就沒有辦法悟入一心真實的智慧。

就是說我們的果報體，在生滅門中的修學，可以從六道裡面得到人天果報；也可以從無相行成就二乘的涅槃；但是要成就法身菩薩，那你最後一定要入一心真如的平等觀，法界一心，修不二法門，才能夠入法身的境界。這裡是說開方便門，示真實相，就是在這個過程中，佛陀演說布施、持戒、忍辱、精進、禪定、智慧的法門；但是你要知道這個法門是為了要離念。為什麼呢？布施要我們離開慳貪的念，持戒遠離惡念，忍辱遠離瞋念，乃至於智慧遠離愚癡的念頭。就是每一個法門都要有所對治，重點到最後就是入平等觀。所以顯示正義到這裡，已經把整個大乘的正見都說過了；後面的分別發趣道相是講修行方法，講到菩提心、六波羅蜜的修學。正見中，我們作一個總結。

我們的調心方便，當然有時候起動生滅門對治，治亂世用重典，執著有相用空相破除，執著空相用有相破除，有時候是起動生滅門；但是有時候也可以入真如門，入平等的不二法門，這時是一念不生。也就是說圓融不礙行布，行布也不礙圓融。平等法界中，也不妨礙一種方便的對治；但是方便對治中，你要知道你的目標在哪裡。這樣的話，你就能夠正確的掌控我們生命真如的平等，跟對治的生滅門，這兩個都有需要。這就是整個大乘的正見，到這裡全部結束。

下一科分別發趣道相，是講修行的方法，就講到如何的發菩提心，廣修六波羅蜜。簡單的講就是你必須具足了一心二門的這種正見，你才有資格談到修行。以下有同學提問一個問題，我們跟大家共同學習。

【學員提問】法師曾提到修行的次第，是從業力的有相修行到心念無相的觀照；也提到大小乘空觀的不同，小乘是把心性完全的否定而滅色取空，大乘是講到緣起性空，保留心性本具的妙用。在實際的修行上，在進入到心念觀照時，是否是先修小乘的空觀成就以後，再進入大乘的空觀；還是直接修進入修習大乘的空觀；或者兩個可以同時並行？

【師父答疑】我們對大小乘的判定，最好不要用法門來判定，應該是從它的正見跟發心，就像蕅益大師說：敲大磬是小乘？大乘？你敲磬只是一個方便，唱唱爐香讚、唱唱梵唄，他說：梵唄法器是沒有大小乘。那你說：你這個人喜歡修無常觀、無我觀，那也不能說大乘、小乘。就是說你適合修無常觀，你就修無常觀；你適合修緣起性空觀，你就修緣起性空觀。

但是你知道你的目標在哪裡，你的目標是：要成就無上菩提這種清淨的、萬德莊嚴的法身，你就是大乘。假設你所修的法門，你只是希望成就一個偏空的涅槃，你不管修什麼法門，你就是小乘。簡單的說，這個法門是誰來修行？是那個明瞭的心去推動法門，就是這個牛車、這個車乘本身，不能說它決定法門，是那個牛決定方向，就是所有的法門都是那個明瞭的心性來修學。所以蕅益大師講一句話說：圓人受法，無法不圓。你通達了真生不二，真如門跟生滅門的重點以後，你所修的法門，就算你是拜懺這個有相行，都不是人天果報，都是成佛的資糧。

當然方便有多門，在生滅門我們不能說你一定要做什麼。為什麼這樣說？我們諸位回憶一下：無明是不真實的，它是顛倒生、因緣有。無明不是真實的這句話是什麼意思呢？表示消滅無明的方法，就有所不同。假設無明是真實的，真實有一個東西是無明，每一個人都要遵循一個共同的軌則，因為它有真實性，所以消滅它也只有一個方法。但是我們無始劫來每一個人所熏習的無明厚薄有所不同，這個法門可能你需要，他根本就沒有這個病，他不需要這個藥。所以佛陀開出了無量的對治法門，就是你自己要很冷靜的判斷，這個藥你適不適合吃？你只要是為了無上菩提，你所修的法門都趨向無上菩提。

蕅益大師說：諸法無性，盡隨心轉：心為菩提，一切法趨菩提；心為名利，一切法趨名利。你所修的法，諸法無性，它不能決定體性。那誰來決定體性呢？盡隨心轉，你能修的那個明瞭心性，你依止什麼樣的宗見，你依止什麼樣的發心，會決定這個的方向。所以心為菩提，你所有的有相、無相行都趨向菩提。你為了這種世間名聞利養的福報，你就算修空觀，到最後也是趨向於人天的福報。

所以我們應該說：小乘的空觀、大乘的空觀是約發心，其他在生滅門的對治中，那就各得其所了。你有這個病、你有這個障礙，你就要修破障法門；他沒有這個障礙，就不需要破障法門。

但是有一個法門是大家一定要修學的，就是平等觀。我們可以這樣講：一個人不修不二法門，到最後你不能修自他不二、染淨不二，你不可能成佛，因為這個是根本法門，其他是對治法門。對治法門在對治時，每一個人有各式各樣的因緣；但是這個平等不二法門，你一定要修學，是這樣的。`;
