QXL.volNum = 25;
QXL.text = `
請大家打開《講義》第五十二頁。

己三、分別發趣道相

我們這一大科是講到解釋分，就是解釋生命的真實相。這大科中是分成三科：第一科是顯示正義，第二科是對治邪執，這是第三科分別發趣道相。前面兩科是一個修行的理論，這一科是一個修行的方法。

在大乘佛法的理論中，本論的一個基本宗旨，就是所謂的一心二門三大。這個一心，就是整個大乘法的一個所觀境。大乘佛法在觀察生命的真相，是依止所謂的應觀法界性，一切唯心造。也就是說整個十法界的染淨因果，是依止一念的心性而建立的；所以想了解生命的真相，應該是莫向外求，應該要迴光返照我們現前一念心性，所以一念心性，是整個大乘止觀的所觀境。我們應該用什麼樣的智慧來觀察這念心性呢？本論提出了一心法而安立兩種門。

這個門，法藏大師說有兩層意思：第一個是區別義，第二個是通達義。

第一個、區別義

從區別的角度來說：

一、生滅門所詮釋的是一種對立的生命。比如說：我們剛開始依止慚愧心來斷惡修善，這樣的一個思考，是以善來破除惡，從斷惡、修善來成就安樂的果報，所以叫做有相行。我們進一步再依止出離心，來修習無常、無我的道理，來消滅我們對三界果報的愛取。這時我們是以空來破除有，成就一個解脫的果報。這樣一個善惡、空有的對立，整個思考都是站在一種個體生命的思考，所以他不能看到整個全面的生命。因為他的思考方式，是一種對立的、差別性的，所以叫做生滅門。

二、真如門的內涵，它的一個特色是絕待平等，就是依止我們清淨平等的菩提心來上求下化，這時內心是離諸對待的，離開了有相的執取、也離開了空相的執取，是一種空有雙照、真空妙有的平等法界。這種真如法界，基本上他的生命觀是一種整體的生命觀，沒有自他的對立，所以叫做真如門。所以這兩種門，基本上是有它的區別，一個是對立的個體生命，一個是絕待的整體生命，這個是區別義。

第二個、通達義

其次，門有通達義，就是我們現在凡夫有所得的心，不管你怎麼修行都是生滅門。我們應該怎麼從生滅門趨向真如門呢？就依止三大的道理，我們應該修習體相用三大，所謂的真如平等無增減故、如來藏具足無漏性功德故、能生一切世出世間善因果故，透過三大的修學，就能夠使令我們這種生滅的心，趨向於清淨平等的真如的心，所以這兩個門也是有通達義。

前面的整個教義，主要是把這種修行的因果，以一心二門三大作一個說明；以下就正式的講到我們如何從生滅門而趨向於真如門的方法。

先解釋科題。分別發趣道相：發就是發菩提心的意思。發菩提心是幹什麼呢？就是要趣於無上的菩提道，這叫趣道。發菩提心而趣向菩提道，這當中從因到果有很多很多的差別相，所以應該把它加以分別。就是這個菩薩在因地發菩提心時，是什麼相貌呢？這整個過程有什麼樣的差別相貌？把菩提心從因到果的差別相貌加以分別，這個叫做分別發趣道相。這當中分兩科，先看第一科的總標：

/KEPAN/庚一、總標

/VERSE/分別發趣道相者，謂一切諸佛，所證之道，一切菩薩，發心修行趣向義故。略說發心有三種。云何為三？一者、信成就發心；二者、解行發心；三者、證發心。

分別發趣道相中有二個重點：第一個是講到一切諸佛所證之道，講菩提心是一個果相的、果地的菩提心，一切諸佛所發的菩提心是無差別的，佛佛道同。比如說：釋迦牟尼佛在度化眾生的善巧方便，跟阿彌陀佛的方便就有所不同，但是他們內心中所依止的菩提心是沒有差別的，所以這個果相是無差別的。

從因地上來說，一切菩薩他發菩提心修習六波羅蜜，依止六波羅蜜的功德而趣向無上菩提，這個是有很多的差別義、差別相。本科的重點偏重在下面這一段：一切菩薩，發心修行趣向義故，講到菩薩因地的發心差別。菩薩的因地發心有哪幾種差別？略說發心有三種：一者、信成就發心；二者、解行發心；三者、證發心，有三種發心。我們先作簡單的說明，下面再詳細的說明。

第一種、信成就發心：就是他這個菩提心的建立是依止信心，就是對真如法性的信心。我們剛開始是依止多聞的熏習，如理的思惟，內心中仰信真如佛性，在凡不減，在聖不增，心佛眾生三無差別。就是我們剛開始假藉大乘佛法的熏修，我們很真實的了解到我們現前一念打妄想的心，它的本質就是真如，跟十方諸佛明瞭的心性是沒有差別的。只要我們肯努力，我們這種顛倒的心識是可以改造的，依止這樣真實信心發的菩提心，這樣的階位法藏大師判作成就十住，就是十住的不退轉，信心不退轉，這時發起的菩提心。

第二種、解行發心：前面的信成就發心，主要是依止對信心的理解，所以它主要是一種內在的觀照。這個解行發心是依止內在的觀照力，進一步產生六度的行動，生起六度的妙行，來積集福德智慧兩種資糧，所以它的整個發心是有行動的內涵在裡面。它的內涵中，包括了菩薩的十行跟十迴向這兩種階位。

第三種、證發心：就是如實的證入了真如佛性，所產生的一種勝義菩提心，這樣的一個階位，是十地以上的菩薩。

也就是說我們從一個有所得的個體的生滅門趨向真如門，它的修學重點都是修學體相用三大；但是它的差別有三種：有依止信心、依止解行、最後證入，有三個階位。這三個階位法藏大師解釋說：信成就跟解行成就的發心，它只是一個相似的發心，也就是說他的發菩提心必須要假藉理觀，或者事修的因緣，才能夠生起菩提心。當理觀跟事修的因緣消失時，他菩提心就消失了，所以它是一種緣修，假藉因緣來修習菩提心，所以叫做相似菩提心。第三種證發心是真實的菩提心，他不必假藉理觀，乃至於事修，他的一念心任運地跟菩提心、跟真如門相應，任運地相應，所以他是一個真實的發心。

這是我們從凡夫的這種對立的、有所得的心，而趣向於十方諸佛菩提心的一個道次第，有三種次第。從一個理觀，再成就事修，最後真實的證入，有三個次第。這是一個總標，這以下把這三個修習菩提心的內涵詳細的說明。

/KEPAN/庚二、別釋
/KEPAN/辛一、釋信成就發心
/KEPAN/壬一、征起

別釋中，我們先看第一科解釋信成就發心，這當中有兩科：壬一、征起；壬二、解釋。先提出一個征問：

/VERSE/信成就發心者，依何等人？修何等行？得信成就，堪能發心？

這當中提出兩個問題。第一個是提出它的因相，就是信成就發心是何等根機的人所修的？是什麼樣根機的人可以修信成就發心？其次，他修的是什麼法門？這都是一個因相。一個是能修的人，一個是所修的法。這個果相成就的信成就它的內涵是什麼？依止信成就所發的菩提心又是什麼？一個是講到信心成就的相貌，一個是菩提心的相貌，這兩個都是果相。這當中等於是把信成就發心的因相跟果相提出一個問，這以下就針對這個問來回答：

/KEPAN/壬二、解釋
/KEPAN/癸一、釋信成就
/KEPAN/子一、正釋成就

解釋中分兩科，先看信成就，再解釋發心成就。信成就中，先解釋信心成就的相貌。

/VERSE/所謂依不定聚眾生。有熏習善根力故，信業果報，能起十善，厭生死苦，欲求無上菩提。得值諸佛，親承供養，修行信心。經一萬劫，信心成就故。諸佛菩薩，教令發心。或以大悲故，能自發心。或因正法欲滅，以護法因緣故，能自發心。

我們先講到信成就發心它信心成就的相貌。信成就發心他修行的根機是依止不定聚的眾生，不定聚眾生就是十信位的菩薩。我們剛開始去修學內心的體相用三大，主要是依止一念的信心，這樣的信心，基本上善根是不決定的。什麼叫不決定呢？就是我們今生如果是遇到大乘佛法的教授，我們就生起菩提心，生起信心跟菩提心；假設我們來生是生長在一個沒有大乘佛的地方，我們接觸到人天的教法、或者接觸到二乘的教法，我們的菩提心就不再現行了，等於是退失了。所以說這十信位的菩薩，譬如空中的羽毛，可上可下，大乘的善根是不決定的。

就是剛開始時，是依止不定聚的眾生。這不定聚的眾生，應該怎麼修大乘的信心呢？依止熏習善根力故，這熏習就是你要數數修學大乘的善根，不是一次，要一次又一次的加強大乘的善根。應該怎麼加強呢？這以下有兩個方法：

第一個、依止內因力的熏習

內在的因力，所謂的信業果報，能起十善，厭生死苦，欲求無上菩提。內在的因力有三種方法：

一、依止大乘的正見：依止正見來修習。就是我們剛開始深信業力跟果報的因緣來修習十善，斷除十惡。就是我們剛開始對生命的觀察，是了解到生命的果報有快樂跟痛苦，這個快樂跟痛苦都是由因緣而生的，依止我們自己身口意的業力所招感，所謂的善業招感安樂的果報、罪業招感痛苦的果報，這樣的真理是絕對不會錯謬的。依止這樣的信心，我們會強迫自己去斷除身口意的十種惡業，強迫自己去建立身口意的十種善業，依止正見來斷惡修善，這是第一個善根。

二、厭生死苦：從這樣的斷惡修善，我們進一步思惟苦諦，思惟三界的苦諦，苦諦的觀察是依止無常觀。因為思惟三惡道的苦是不普遍的，因為三惡道的苦只是三界中的一部分，所以我們的苦諦是思惟無常。

就是說生命雖然有一些安樂的果報，譬如說你做一個國王、做一個諸天，但是這樣的安樂果報，基本上是生滅變異，虛偽無主的，它有變化。這樣的變化下，使令我們對生命產生一種不安穩性，我們不知道明天會發生什麼事情，所以我們所擁有的一切，隨時會在一念之間全部破壞。

所以三界的果報是非常脆弱而不堅固的，這種不安穩性就是痛苦的根源。因為我們要是從來沒有得到，那也就算了；當我們擁有過以後再失掉，那種內心的刺激是非常嚴重的。所以進一步觀察三界的果報都是不安穩的，不能當作我們整個生命的歸依處，這時生起了出離三界的決心，這是我們觀察自身的苦產生的出離。

三、欲求無上菩提：在大乘佛法中苦諦的觀察，它是先觀察自身的苦，然後把自身的苦再遍及一切眾生的苦，我們必須先把我們個體的生命，跟無量無邊眾生的生命建立一個密切的關係，就是一切的有情眾生，都是我們過去的母親，有這樣的關係，我們就能夠跟一切眾生感同身受，就是我們會把眾生的痛苦，就當做自己的痛苦感受一樣。這時我們會把對自己自身的痛苦，再遍及一切有情，也都是在生死的大海中輪迴，每一期的生命也都受到生老病死的折磨；所以我們也有責任來救拔一切有情，而共同解脫三界的苦海。這樣應該怎麼才做得到呢？只有成就無上菩提，才有這樣的方便力。

所以我們從觀察自身的苦而生出離心，進一步再觀察一切有情的痛苦，這時生大悲心，由大悲心進一步的為利有情願成佛，我們下定決心追求無上菩提，成就種種的方便，廣泛的度化種種有情，這時從出離心而引生菩提心。所以剛開始我們熏修的三個重點，就是出離心、菩提心跟大乘的正見，這三種是內因力的熏習。

第二個、假藉外緣力的熏習

得值諸佛，親承供養，修行信心。大乘善根的熏習，不是一生一世的，它必須多生多劫的熏習，所以我們必須要祈求三寶，加被我們每一期的生命，都能夠遇到諸佛的住世，特別是善知識的住世。由大乘善知識如法的開導，使令我們來熏修大乘的善根，這個是外緣力，就是善知識的攝受力。

從內因跟外緣的和合，這樣要經過一萬劫的時間，這時使令我們大乘的信心真實的成就，堅固而不退轉。這個信心成就，在《瑜伽師地論》上說：大乘信心的成就，等於是產生一個堅固的菩薩種性。

就是說我們剛開始受菩薩戒時，是從一個雜染苦惱的心識中，先生起一朵小蓮花，就是從苦惱的心中，先成就菩薩種性的種子，所謂無漏的善種子。這個無漏的善種子，假藉內因力的熏習、外緣力的熏習，一萬劫以後，這朵蓮花就慢慢地增長廣大，它經得起風吹雨打日曬，產生堅固不退轉的信心，成就堅固的菩薩種性。就是他的生命中，決定不再退入凡夫、二乘，不管遇到什麼惡因緣的刺激，他絕對是菩薩種性成立，他只有一條路，就是直趣無上菩提，這時要經一萬劫的時間。

一個菩薩種性成立以後，他自然會發起心中的願力，依止信心就會發菩提心。菩提心是怎麼生起的？或者是諸佛菩薩教令發心，有諸佛菩薩的善巧開導，使令他發起菩提心；或者依止他自己的力量，依止大悲心而發菩提心，這時念眾生苦而發菩提心；或者是因正法欲滅，以護法因緣故而發菩提心，不忍聖教衰。前面是依止人；這依止法，看到大乘佛法即將衰微，眾生即將面臨一個顛倒黑暗的時代，這時為了弘護正法、續佛慧命的因緣而發起的菩提心。當然他能夠發菩提心，是依止他的大乘的善根，所謂的菩薩種性而發的菩提心。這個是講到不定聚的眾生，他是依止內因力、外緣力，而修習大乘的善根，最後發起的菩提心。我們看總結：

/VERSE/如是信心成就，得發心者，入正定聚，畢竟不退，名住如來種中，正因相應。

這個信心成就，就是十住菩薩，他的信心已經成就了，這個十住位菩薩在大乘佛法已經入了正定聚，他的菩提心，不管你用什麼惡因緣去刺激他，他追求無上菩提的心絕對不退轉，這時叫做安住如來種性，或者叫安住菩薩種性。當然如來種性是約果相安立，菩薩種性是約因來安立。這時他的內心是跟正因相應。正因相應，法藏大師說：他念念之間跟本覺佛性相應，就決定不再墮入二乘的偏空，也不再墮入凡夫的著有，他內心跟本覺的佛性相應，叫正因相應。

這裡有一點值得我們注意，正定聚這句話，我們解釋一下，它後面會說明：

信成就發心有兩種因緣：

一、假設是一個鈍根的菩薩，他的正見是依止生滅門，是對立的正見，就是本論上說的信業果報，能起十善。他先修有相行，依止慚愧心、斷惡修善；再修無相行，修我空、法空的智慧。他依止生滅門的正見，來修習善根，他的正定聚，這時的十住是別教的十住位，就是證得空觀，斷除三界的見思煩惱，這時正定聚的判教是別教的十住，就是鈍根菩薩。

二、假設是利根的菩薩，他依止的正見是真如門，他內心中依止一心三大的道理，能夠自信己身有真如法，因地時就能夠稱性起修。這時他修行一萬劫，所成就的十住是圓教的十住，就直接的破無明、證法身，入法身菩薩位。這個後面會說明。

總之，就是信成就發心，有鈍根、利根的差別，當然根性的差別是來自於智慧的觀照。你智慧觀照有差別，你所產生的行動、所招感的果報，就會有所差別了。這裡是正式說明我們在修習大乘善根的一個因相。

/KEPAN/子二、兼顯未成

在這當中會有一些退轉的情況：

/VERSE/若有眾生，善根微少，久遠已來，煩惱深厚。雖值於佛，亦得供養，然起人天種子，或起二乘種子。設有求大乘者，根則不定，若進若退。

這裡是說明內因力比較薄弱的菩薩，他不能夠成就大乘的善根，不能成就的因緣有兩個：

一、善根淺薄

第一個是他善根微小。佛法的善根，主要講的是智慧，就是這一類菩薩他發了菩提心以後，他多分是喜歡修習福德資糧、修習善法；對於大乘甚深不二法門的聽聞，不生好樂。所以他對生命的觀照就非常的薄弱，這是第一個。

二、煩惱深厚

其次，他是久遠已來，煩惱深厚。這裡的煩惱是說：我們受了菩薩戒發菩提心，這菩提心不是永遠存在，所以菩薩戒有時候就叫做他勝處法。我們發菩提心就以菩提心為自體，但是煩惱會去破壞菩提心，也不是所有的煩惱都會破壞菩提心。

在菩薩戒講到：我們在修學菩薩道中，有三種煩惱最容易傷害菩提心：

第一個是瞋恚心，這種瞋恚心最容易傷害菩提心的；

第二個是高慢心，就是我們經常認為自己是與眾不同的，把自己高舉了；

第三個是嫉妒心，不耐他榮，看到別人有榮耀的事情產生排斥。

這個瞋心、慢心、嫉妒心，假設我們不加對治，我們當初在三寶面前所發的菩提心，這個菩薩的戒體就很容易被破壞了。所以是久遠已來，煩惱深厚，這也會傷害菩提心。

第一個是你善根淺薄，第二個是煩惱深厚，所以即使遇到十方諸佛的住世，聽聞大乘的佛法，也能夠供養十方諸佛，然而我們所起的是人天的種子，我們可能在佛法中追求人天的福報；或者是成就二乘的種子，追求偏空的涅槃、追求自身的安樂；即使有追求大乘者，這個善根是不決定，若進若退。這個不決定，法藏大師說是猶豫不決，進進退退。這個就是我們在修學的過程中，因為善根的淺薄，一方面煩惱沒有善加的對治，結果發起了人天種性、或者二乘種性，就是沒有生起真實的菩提心。

第二種是講到他外緣力的薄弱，雖然成就，結果退失了。

/VERSE/或有供養諸佛，未經一萬劫。於中遇緣，亦有發心。所謂見佛色相，而發其心；或因供養眾僧，而發其心；或因二乘之人，教令發心；或學他發心。如是等發心，悉皆不定。遇惡因緣，或便退失，墮二乘地。

前面是說大乘善根淺薄、煩惱深厚，結果沒有發菩提心；這地方是說雖然發菩提心，結果退轉。為什麼呢？說我們親近十方諸佛，聽聞大乘的佛法，這當中還沒有經過一萬劫，遇到了四種因緣也會發菩提心，而這個菩提心是不純正的菩提心。這不純正菩提心有四種相貌（就是有夾雜）：

一、所謂見佛色相，而發其心：這就講到《楞嚴經》的因緣。《楞嚴經》中阿難尊者，他出家十二年，還是被摩登伽女的邪咒所迷惑。這時佛陀請文殊菩薩持《楞嚴咒》把邪咒破壞，把阿難尊者救回來。阿難尊者那個時候哭得很傷心，想到自己十二年的修行，對邪咒一點抗拒的力量都沒有，非常的慚愧，在佛陀面前非常傷心的悲泣。佛陀種種的訶責以後，佛陀就問阿難尊者說：你當初是什麼因緣出家修行？阿難尊者說：我的出家因緣，我是見到佛陀的相好莊嚴。阿難尊者說：我是你的堂弟，你老人家在家時候的相貌我也看過，沒有那麼莊嚴；但是你成就無上菩提以後，三十二相、八十種好的威德力，令我產生羨慕，我希望成就你的莊嚴而發菩提心。

這樣的發心，基本上是心外求法，這樣的發心當然很容易被破壞。因為轉輪聖王他也具足三十二相，乃至於魔王也能夠變三十二相，所以我們依止身相的莊嚴而發菩提心，這樣的菩提心是很容易被破壞的。

二、或因供養眾僧，而發菩提心：我們看到大眾僧團如法和合的修行，清淨如法的僧團住世，這時發菩提心。你發菩提心的因緣，是依止心外的因緣，假設出家眾他不如法修行，那你就退失菩提心了，所以你這個發心也是不真實的。依止外在大眾的僧團而發菩提心，也是容易退轉的。

三、或因二乘之人，教令發心：你遇到得是二乘的善知識，二乘人修觀的是四聖諦，他在觀四聖諦時，蕅益大師講：偏重苦諦，他對苦諦的感受特別強烈。大乘的學者在觀四聖諦時，偏重道諦。這裡的觀察有所不同。當然你要是一直觀苦諦，你就會變成悲觀的學者，對整個有為諸法不生好樂，沒什麼價值的，這時你發的菩提心是出離心。

四、或學他發心：這是由善知識的攝受，你要發菩提心。

聽說隋煬帝他以前是晉王廣，隋煬帝是一個很放逸的人，但是他跟智者大師有緣，智者大師攝受他修學佛法，乃至於受了菩薩戒。但是智者大師往生以後，隋煬帝就糟糕了，就非常放逸了，兩年之內整個隋朝的帝國就喪失掉了。就是說你的發菩提心是依止善知識的攝受；但是善知識不在，你就沒辦法發菩提心。

「如是等發心，悉皆不定。遇惡因緣，或便退失，墮二乘地」，乃至於退到人天種性等等。

這裡是說：諸法無自性，一切從緣起。我們內心要生起一個惡念，也是要依止因緣所生法；我們想要生起一個清淨平等的菩提心，也是要依止因緣所生法。但是這個因緣，你菩提心的生起不能依止外在的因緣，一定要依止內在的觀照力。你真實的觀察到生死的痛苦，你也真實的觀察到一切有情在痛苦中，依止這樣的觀照力而厭離生死，希求無上菩提，這樣的菩提心你永遠不退轉，就算所有的眾生都在顛倒放逸中，也不會破壞你對無上菩提的追求。

所以你的菩提心是假藉外因緣，這時就容易退轉；你一定要依止內在的觀照，對真如理的觀照，你的菩提心才是堅固的。

《楞嚴經》在修習止觀時，很強調你這個依止的心。你要依止不生滅心，不要依止生滅心。什麼叫生滅心，什麼叫不生滅心？

《楞嚴經》講出一個判斷的方法說：你修行的道心，是離塵無體，離開了外在的塵緣就沒有自體，離塵無體，這個叫生滅心。比如說：過去我知道有幾個中部的信徒，當初學佛的因緣是依止中部一個道場的老和尚，這個老和尚有大威德力、有神通，因老和尚的攝受，他就發心學佛了。結果九二一大地震以後，道場的大殿被破壞，這時大家對佛法的信心動搖了：你說老和尚有神通，怎麼大殿還會被破壞？所以很多人就退失了佛法的善根。就是說你剛開始的發心就是有問題，心外求法，離開了外在的因緣，你這個菩提心就沒有自體了。

什麼叫做不生滅心？就是離塵有體，離開了外在的變化的因緣，你的菩提心還是可以單獨的存在。就像《印光大師文鈔》上有人問印光大師說：「你老人家一生弘揚淨土法門，有真實看到人往生淨土嗎？有真實看到阿彌陀佛嗎？你為什麼一路弘揚淨土法門？」印光大師說：「就算全世界的人都沒有往生淨土，就算大家都不修學淨土，也都沒有人往生，我還是修習淨土法門！」他老人家這個淨土的信心，是依止對於淨土的聖解、內在的觀照力，所以他離塵有體。

所以這裡講完大乘善根以後，我們要抉擇一下。當然我們剛開始的發心，可能會因為善知識的攝受、看到佛寶的莊嚴、看到僧團的莊嚴而發心，這個是可以理解。但是我們慢慢地慢慢地，你要在你現前的一念信心中，產生一個觀照的善根，最後依止這個善根的正念力，來引導你的生命，你不能老是靠外在的因緣，這樣你的菩提心就很脆弱。這裡在講完菩提心以後，提出為什麼有些人容易退轉，有些人不容易退轉的因緣，就在這裡。`;
