QXL.volNum = 27;
QXL.text = `
請大家打開《講義》第五十七頁，子三、釋發心之益。

本論造作的因緣，馬鳴菩薩說：今造此論，為令眾生，除愚捨邪執，起大乘正信，佛種不斷故。馬鳴菩薩造作本論主要是希望：假藉本論的修學，使令我們凡夫妄想的心，能夠除愚捨邪執，破除我們對大乘功德的疑惑跟邪執，進一步建立大乘的功德。這個大乘的功德，在本論中主要的根本，就是講菩提心。就是我們所有大乘的萬德莊嚴，都是依止菩提心，才能夠生起它的作用，所以菩提心是整個大乘的功德。在修習菩提心的過程，本論分成了信、解、行、證，有三個次第。首先在修習菩提心的第一個次第叫做信成就發心，這個信成就發心的修學重點有兩個：

一、觀照力——根本法門

第一個是根本法門：這個根本法門就是說，我們經常要去觀照我們現前一念心性。剛開始觀察我們這念心是自性不生，他明瞭心性種種的作用，都是假藉因緣所生，所以從本性來觀察，它是畢竟空寂的。觀察這樣一個無生的真理，就能夠消滅我們凡夫有所得的妄想，使令我們不住生死，遠離對生死果報的愛取。

其次，我們應該觀察我們這一念心性，它是如實不空，所謂的因緣和合，業果不失。我們這念心雖然是清淨本然，但是具足無量無邊的性功德，所以我們應該要發起大悲心，來廣修善法、廣度眾生，成就萬德莊嚴，使令我們能夠不住涅槃。

所以我們在修菩提心的第一個重點，就是一種觀照力，所謂的觀照現前一念心性，即空、即中、即假的道理，在本論中給它一個專有名詞，叫做正念真如。就是我們從今以後，不要隨順我們有所得的妄想，應該如實的去觀照真如，乃至於安住真如。當我們這念心，能夠平等的即空、即假、即中，這樣我們叫做安住在真如的理性上，也就是安住在整個大乘的根本法門。

二、行動力——方便法門

有根本法門以後，我們應該從內在的觀照力，進一步產生行動力。這樣的一個行動力，有三個方便法門：（前面是根本法門，這是方便法門。）

（一）能止方便：當我們能夠正念真如以後，我們應該要調伏我們身口意的過失，這當中主要是透過對業果的思惟，產生一種增上慚愧，我們內心依止慚愧心，來訶責我們的過失，讚歎種種善法的功德。依止慚愧心，來消滅我們身口意的惡法，這個叫做能止方便，這是我們在修學菩薩道，所應該採取的第一個方便法門。

（二）善根增長方便：善根增長當然是指約生善，我們應該要經常對三寶的功德，禮拜、讚歎、隨喜，增長對三寶的歸依。由這樣歸依的心，進一步的聽聞佛法、如理思惟，產生內在的智慧，就是這個善根增長，包括信進念定慧大乘善根的增長。前面的能止方便跟善根增長方便，都是成就一種自力的功德，內心能夠自受用，不能跟別人分享的。

（三）大願平等方便：當我們經過前面的斷惡、修善以後，我們應該要生起發願迴向的心，我們應該要經常在佛前發願，盡未來際的廣度一切眾生，乃至把所修的功德，平等的普皆迴向一切如母的有情，也希望他們能夠離苦得樂，修這個大願平等。

當我們能夠不斷的在日常生活中，修能止方便、善根增長方便、大願平等方便，這三種方便的加持，就能夠加強我們內在的根本法門，正念真如。也就是說在整個信成就發心中，簡單的說就是無不從此法界流，無不還歸此法界。我們剛開始依止對一心真如的觀照，產生對一心真如的信心，生起斷惡、修善、度眾生的方便，從一真法界，無不從此法界流。修習這三種方便，我們不求人天福報，也不求二乘的涅槃，最後還是在開顯我們內在的一心真如，最後還是無不還歸十法界。如是的展轉經過了一萬劫的時間，我們就成就了所謂的信成就發心，菩提心就真實而堅固的在我們內心中建立起來。

這一科是講到發心的利益。當我們經過信成就的所謂根本法門跟方便法門這樣的熏修以後，生起這樣的菩提心，到底有什麼利益？這一科是講它的功德相，前面是講它因地的修學。這個信成就引生的菩提心的利益有兩科：先看第一科正明勝益，先說明菩提心所引生的利益。

/KEPAN/丑一、正明勝益
/KEPAN/寅一、約實明能

這當中有兩科，先看第一科約實明能。這裡是約著實，就是約著圓教菩薩在因地中，依止一心真如，它菩提心的建立有種種的功能，先依止圓教的菩薩來說明，我們看論文：

/VERSE/菩薩發是心故，則得少分見於法身。以見法身故，隨其願力，能現八種利益眾生。所謂從兜率天退、入胎、住胎、出胎、出家、成道、轉法輪、入於涅槃。

這一段說明：菩薩在因地時，能夠修學根本跟方便兩種的加行，這時他內心中生起了菩提心，那這個菩提心有什麼力量呢？在自受用方面，能夠少分見於法身，這個少分就是說你不還能夠全部見到法身。蕅益大師註解說：什麼叫少分見於法身呢？就是分破無明，分證法身。也就是說我們剛開始修學，是從一個無明妄想開始修學，經過一大阿僧劫以後，我們在內心的黑暗中，出現了第一道的光明，這個叫做清淨法身的出現，這樣的情況，是約著自受用的功德。

這以下講出他受用的功德：以見法身故，隨其願力，能現八種利益眾生。當我們能夠在黑暗的無明妄想中見到法身以後，這樣有什麼好處呢？我們可以根據我們過去在佛堂中所發的願──眾生無邊誓願度。我們過去依止無明妄想在心中發的願，基本上只是一種內心的作意，並不能產生實踐的效果；但是當我們成就信成就發心以後，我們內心的願力跟清淨的法身相結合以後，那就不是只是內心的發願，它能夠實際產生八種利益來利益眾生。哪八種呢？所謂從兜率天退、入胎、住胎、出胎、出家、成道、轉法輪、入於涅槃。我們能夠在人世間示現八相成道來度化眾生。

這個八相成道的成就，主要有兩個因緣：一、是他能夠依止親近法身的力量；二、是依止大悲願力。在天台宗的教理上說：我們內心假設是破一分無明證一分法身，這時可以在一百個世界示現八相成道；假設你是破二分的無明證二分的法身，你能夠在一千個世界示現八相成道；假設你是破三分的無明證三分的法身，你能夠在一萬個世界示現八相成道；如是展轉以十倍而展轉增加。

這裡是說明一個觀念：我們的修行不管你修什麼法門，理論上來說就是在修菩提心，就是從凡夫有漏以自我意識的這個私心，要把它轉成菩提心。轉變的過程其實就是兩個方法：一個是內在的觀照力，一個是外在的行動力。當然我們說一切法因緣生，你在成就菩提心的過程，有不同的因緣，你產生菩提心的功德妙用就會有所不同。這裡蕅益大師說：如果你在因地時，你是根據一心真如的實相道理，你能夠真實的了解到我們一念心性中，達妄本空，知真本有，你在因地時，就能夠生起正念真如的觀照，這時你修能止方便、善根增長方便、大願平等方便，你最後的果報就是少分見於法身。假設你在因地時，只是依止我空、法空的空性來起修，你不能夠向內觀照，還是去向外追求我空、法空的真理，依止這樣生起三種方便，你最後成就的只是斷除見惑的別教初住而已，你當然就不能見到法身了。

所以在大乘佛法中，每一個功德的安立，除了你所產生方便的行動以外，它跟你內在的種性，就是你內在的觀照力有密切的關係。

這一科約實明能是約著圓教菩薩他在因地時，能夠如實的正念真如所產生的方便，所以他能夠見到法身。

/KEPAN/寅二、約權簡過

前面因地的發心是依止真如而發心，這裡只講到權教菩薩他依止空性而發心，他就會產生一些不圓滿的過失。看論文：

/VERSE/然是菩薩未名法身。以其過去無量世來，有漏之業，未能決斷。隨其所生，與微苦相應。亦非業系。以有大願自力故。

假設我們今天在整個大乘的菩薩道，我們在因地時，沒有如實的產生圓滿的觀照，所謂的正念真如，我們只是依止我空、法空的真理來起修，這樣的起修經過一萬劫以後，我們是不能夠證入清淨法身的。

這以下講出它的理由：以其過去無量世來，有漏之業，未能決斷。因為我們因地時，沒有抓到整個大乘的根本，雖然我們在方便的加行中，也能夠斷惡、修善、度眾生，但是因為我們不能從根本的無明上去扭轉，只是從枝末上的對治，所以在很多很多的生死業力中，都不能作根本性的決斷。

也就是說我們每一個人在開始修行時，是帶業修行的，就是修行時，我們不是從清淨的角度開始起修，我們是夾帶了無量無邊的妄想，從這個角度開始修行，這個妄想就夾帶了很多的煩惱跟業力。既然根本的妄想不能扭轉，那只能夠從事相上對治；所以其實還有很多很多的業力沒有消除，因為妄想它是依止無明而住，無明沒有破壞，當然這個業力煩惱就不能完全破壞。所以有業力就必須在三界得果報，有果報就有這個老病死的痛苦。

但是這裡強調：這個別教的初住菩薩，他雖然還有這些業報身，有業力所繫縛的果報身，但是他跟凡夫的業報身有所不同。為什麼呢？以有大願自力故。就是說凡夫在三界得果報，完全是憑著業力；這個別教的菩薩，雖然在三界中得果報，但是他有一部分是業力，又有一部分是他內心的願力。怎麼說呢？比如說這個別教的菩薩，別教初住他可能有因緣能夠到天上去，他不願意到天上去，他願意在人世間求增上身，因為人的果報有利於上求佛道，也有利於下化眾生，人道是整個大乘佛法的法器。所以他不完全是業報身，有一部分是他大悲願力的力量在資持著。所以這裡法藏大師明顯的說：這個別教菩薩根本的依止點，是我空的智慧。

這裡我們說明一下。就是說我們在修行加行時，不管你是斷惡、或者修善、或度眾生，你每一個行動從內心發動時，這樣的一個行動到底在你生命中，產生一個什麼樣的影響力？跟你的觀照有關係！

我們今天以別教菩薩跟圓教菩薩作一個說明：

假設你因地時候發心的起修點是依止空性，你依止空性來修布施，這個布施的法在你內心表現出來時，你觀察沒有一個能布施的我，沒有一個所布施的眾生，這樣但能止妄不能顯真，就是你能夠止住你有所得的妄想。

當你在布施時，能夠觀察達妄本空，知真本有，能夠觀察達妄本空，知真本有，你這樣的布施，不但能夠止住你慳貪的妄想，你還要發明你這種無貪的善根，你又能夠顯真，能夠在內心的清淨心中，建立一個善良的功能，這樣的布施，不但能夠止妄，同時又能夠顯真。

所以同樣是一個布施，在不同人的內心中去操作，會產生不同的效果。有些人布施，他只是止妄；但是有些人布施，他不但止妄，同時又能夠顯真。當然這就是看我們在因地中，對大乘佛法的學習，產生的觀照有所不同。這兩科是就著同樣是信成就發心的圓教菩薩，跟別教菩薩的功德有所差異。

/KEPAN/丑二、顯退不退

/KEPAN/寅一、權說有退

看丑二、顯退不退的差異，這一科是約著別教菩薩來說明退轉跟不退轉的因緣。這當中先講到約權說有退，就是從一個不了義的善巧方便的說法中，安立退轉，我們看論文：

/VERSE/如修多羅中，或說有退墮惡趣者，非其實退。但為初學菩薩，未入正位，而懈怠者，恐怖令彼勇猛故。

這個修多羅就是《菩薩纓絡經》，在《菩薩纓絡經》講到：假設是七住以前的菩薩，如果遇到了惡知識的誘惑，有可能會退入到凡夫，乃至於種種的惡趣中，就是七住以前的菩薩，都還有退失大乘功德的因緣，就是遇到惡知識的因緣。馬鳴菩薩說：其實非其實退，這種退是一種方便的安立，在真實義來看不是退轉。為什麼呢？但為初學菩薩，未入正位，而懈怠者，恐怖令彼勇猛故。這是佛陀的慈悲，看到初學菩薩在修學大乘佛法時，產生了懈怠，他覺得他已經成就了初住了，他就開始懈怠，這時菩薩以三惡道果報的恐怖，使令他能夠勇猛精進的緣故，而安立了退轉。

這裡我們解釋一下：別教的初住，在整個斷惑上來說，是斷除了三界的見惑，跟小乘的初果是相齊等，從斷惡的角度是相齊等。為什麼說初住就不退呢？菩提心的建立，最大的障礙點是我見的煩惱，就是你心中的私慾，這個自我意識、這個自我的保護。我們凡夫在清淨本然的心性中，捏造出自我意識以後，接下來就是我愛，就是愛著這個我們所捏造的虛妄自我。愛著自我以後，我們在斷惡、修善、度眾生就產生了障礙。

但是這個別教菩薩，他自我意識被破壞，即使他還有三界的煩惱、還有貪瞋癡的慾望，但是他的慾望是特別的輕薄。在經論上講一個譬喻說：譬如轉動的輪盤，這個轉動的輪盤，它整個根源，它那個動力已經被消滅了，所以它只是一種剩餘的勢力。所以在小乘的教法中說：一個證得初果的聖人，他即使整天都不去修習觀照，也不做早晚功課，他依止我空聖道的力量，他決定是七番生死來證得阿羅漢果，七上天上、七來人間，經過十四世的時間，決定證得阿羅漢果。就是說它這艘船隻有往前進，不可能往後退。在菩薩經裡面講到的退，是佛陀的方便安立。

/KEPAN/寅二、實則不退

/VERSE/又是菩薩，一發心後，遠離怯弱畢竟不畏墮二乘地。若聞無量無邊阿僧祇劫，勤苦難行，乃得涅槃，亦不怯弱。以信知一切法，從本以來，自涅槃故。

這裡是說明他為什麼能夠不退轉？講出這個道理。這個菩薩他的修學經過一萬劫，成就信成就發心、成就了初住以後，他就不再怯弱。你跟他講善法的修學是多麼的困難，要種種的難行苦行，他不怕；眾生多麼的剛強難調，他也不怕。他絕對不會放棄他對無上菩提的追求，對度化眾生的希望，他絕對不會墮落到二乘地。即使他聽到：成佛之道有無量無邊阿僧祇劫的勤苦難行，來修習六度的菩薩道，他內心中也不生起怯弱之心。為什麼他有這樣的一個堅固的誓願力呢？這以下講出它的道理了：以信知一切法，從本以來，自涅槃故。因為別教的菩薩，他對空性的聖解非常堅固，他能夠依止別教的教法，他知道一切法是自性不生，本來畢竟空寂。他以空觀的智慧，來觀察這些上求佛道的障礙點、跟下化眾生的障礙點，都是如夢如幻，都是不可得的。　　在《攝大乘論》中清楚的講到：這個初住的菩薩之所以不退，有三種的力量在支持著。

第一個是清淨力：住位的菩薩，他內心中能夠觀察我空、法空的真理，產生一種清淨的力量，這是根本，這就是所謂的信知一切法，從本以來，自涅槃故。

第二個是增上力：他內心中有堅定的誓願在支持著他，所以這種增上的力量，他能夠產生一種行力，不能修要他修。

第三個是堅固力：這個初住位的菩薩，遇到種種的惡因緣，他能夠安忍不動，他忍力特別強，他有堅固力，他不但是行力強，他也能夠安忍不動，他有這種堅固力。這個增上力跟堅固力，主要是來自於清淨力，就是我們這裡說的以信知一切法，從本以來，自涅槃故。他有這種我空真理的觀照支持，使令他不退轉。

這裡我們解釋一下退轉的因緣跟不退轉的因緣：

大乘佛法，這個退轉是一個非常嚴重的問題。就是說我們今天因為一時的善根被刺激，發起眾生無邊誓願度、煩惱無邊誓願斷、法門無上誓願學、佛道無上誓願成，生起這樣一個不可思議的四弘誓願，這件事情不是很難，特別是一個初學者，依止一念宗教情操的善根資持，他也能夠生起這樣的一個清淨誓願。但是這樣的清淨的誓願，有些人能夠在心中保持很久，有些人可能沒有幾年就消失掉了。為什麼有這樣的差別呢？就是你內在的觀照力是不是強，有強跟弱的問題。

也就是說我們在菩薩道的過程中，沒有一個人是完全順利的，一定是充滿石頭，充滿著障礙。我們一再強調：菩薩道在凡位起修時，是帶著煩惱跟業障在修行，你雖然建立了菩提心，但是你內在有煩惱，它會障礙你的菩提心；你無始劫造殺盜淫妄的罪業，這些業力都保存在阿賴耶識，這些罪業它也會障礙菩提心；我們現前這個果報體，這個老病死的果報體，它也會障礙你菩提心：就是我們雖然產生菩提心，但是有三種違背菩提心的法，在我們生命中不斷的出現。

問題是我們如何去化解這些障礙？那當然就是依止內在的觀照力。這就是為什麼有些人他發了菩提心以後，他能夠從菩提心生的起到他臨命終時，他能夠不退轉，他遇到這些障礙現前時，其心安如海，不動如須彌。但是有些人他這個菩提心特別的脆弱，遇到煩惱的刺激、罪業的刺激、老病死的折磨，他菩提心就消失掉了。這裡就是講到以信知一切法，從本以來，自涅槃故。這是一個根本問題，就是你內心中是不是有觀照力。這一科講到信成就發心，它一個生起的功德。

/KEPAN/辛二、釋解行發心

前面的信成就發心的重點，還是偏重在內在的觀照力，理觀的成分多，事修的成分少。在解行發心，他就有一種歷事練心，他事相的修學就比較多。

/VERSE/解行發心者，當知轉勝。

一個菩薩經過一萬劫的時間以後，他的菩提心從信的成就發心，而轉成解行發心，他菩提心的功德，就比以前更加殊勝。這裡的殊勝，我們先講時間的殊勝，再講內涵的殊勝。先看時間的殊勝：

/VERSE/以是菩薩，從初正信已來，於第一阿僧祇劫，將欲滿故。

前面的信成就菩薩，是經過一萬劫；這裡的菩薩，是從他剛開始成就大乘的信心，所謂的自信己身，有真如法而發心修行，在三大阿僧祇劫中，他經歷了第一大阿僧祇劫，而且即將圓滿。也就是說他已經經歷過十住、十行、十迴向的整個三賢階段，花了一大阿僧祇劫。這十住、十行、十迴向都叫做解行發心。從十信位到初住，叫做信成就發心；從二住以後到十迴向，叫做解行發心。這裡是說他修行時間的殊勝，這以下就說明他在修習六波羅蜜時的殊勝。

/VERSE/於真如法中，深解現前，所修離相。以知法性體無慳貪故，隨順修行檀波羅蜜。以知法性無染，離五欲過故，隨順修行尸波羅蜜。以知法性無苦離瞋惱故，隨順修行羼提波羅蜜。以知法性無身心相，離懈怠故，隨順修行毗梨耶波羅蜜。以知法性常定，體無亂故，隨順修行禪波羅蜜。以知法性體明，離無明故，隨順修行般若波羅蜜。

這裡就正式說明解行發心在修六波羅蜜時，他有這種殊勝的相貌出現。那這當中分兩科：先總標，再別名。先看總標：

於真如法中，深解現前，所修離相。

一個解行發心的特別相貌，就是他的內心不管是在修習什麼善法，他都能夠具足深解現前跟所修離相。這個深解現前是指他內心的觀照力，能夠真實的了知他內心中是達妄本空，知真本有，他有一種堅定不移的理解。這種理解，就帶動他對於這樣一個法的念念隨順，他不再隨順於這種生滅的妄想──有所得的心。他內心中能夠觀照達妄本空，知真本有，這樣的理解經常的現前。當然他不是只是現前，他採取行動，所修離相，他在修六波羅蜜時，能夠生起能所對立的相，遠離這種能所的對立──沒有一個能布施的我、沒有所布施的眾生，這種我相人相的對立是消滅的，那他的觀照力跟行動力有這樣的殊勝。這是一個總說，這以下別釋：

一、以知法性體無慳貪故，隨順修行檀波羅蜜。

我們凡位的菩薩沒有去正念真如，沒有正念真如的意思就是隨順妄想，隨順妄想我們也可以修波羅蜜，修布施。我們剛開始修布施，佛陀告訴我們：你應該思惟諸未施財無常滅，由施反成有財庫。我們剛開始學習布施的思考是說：我現在有三千塊，假設我選擇把這個三千塊佔為己有，我死掉以後，這三千塊就消失了，諸未施財無常滅，這個錢財就被無常的大火給燒掉了。假設我今天選擇布施，我這個錢不要自受用，把這三千塊錢布施給這些苦惱的眾生，哦！這樣就把這些無常敗壞的錢財，轉成一種堅固的善業力，那這個善業力當死亡到來時，這個死亡不能破壞這個善業，它能夠從今生貫穿到來生，你來生還可以受用。

所以我們剛開始布施時，思考是從業果的思考，當然這是一個出發點，這也是非常的好。但是這個解行菩薩他在布施不是這種思考，他的思考是：我內心中本來就沒有慳貪，達妄本空，這個慳貪的法是不存在的。你內心中沒有慳貪，那你內心中是什麼功能呢？我內心中本來就具足施捨的功能，既然我有這種功能，我應該隨順這種功能來行布施，所以行布施是很正常的。

為什麼？因為我的本性就是有施捨的功能，所以我的布施只是隨順這種功能而已。他有這種思考以後，他在布施就不是像我們只是成就一個善業力而已，他內心在布施時，念念中返妄歸真，破除無明，開顯真如，他的布施有這種力量。他為什麼有這種力量呢？他內心中能夠經常的觀照，因為法性體無慳貪故，而隨順修行檀波羅蜜。這裡就是為什麼一個菩薩他修布施，我們凡夫也修布施，這裡有這麼多的差別。

二、以知法性無染，離五欲過故，隨順修行尸波羅蜜。

這裡講持戒。我們一般人會持戒，主要的理由就是害怕到三惡道去，就是怖畏當來的果報，害怕這個罪業會招感三惡道果報。因為害怕到三惡道去，產生增上慚愧，所以我們不敢去造業，不敢，是很想造業但是不敢。當然剛開始這樣是非常的好，但是我們應該進一步再思考：我們為什麼持戒呢？其實持戒是很正常的，造罪業是不正常的，我們應該恢復正常。

就是說我們內心中本來就沒有染污的煩惱，我們內心中本來就很適合持戒，就是持戒是隨順我們的本性。我們這念心剛開始設計時，是要你去造善，不是要你去造惡的。所以修習持戒，我們姑且不說是來生有個什麼人天果報，這個先不要去思考，你就觀察達妄本空，知真本有，持戒是隨順本性，所以你就可以持戒了，這樣就可以持戒了。

三、以知法性無苦離瞋惱故，隨順修行羼提波羅蜜。

我們剛開始修忍辱，是觀察瞋恚的過失。瞋是心中火，能燒功德林。我們害怕瞋心所帶來的過患，破壞我們的功德林，所以我們不敢發脾氣。雖然不敢發脾氣，但是那個能發脾氣的因種還在，只是我們不敢讓它起現行，所以我們一般的忍辱，只能夠消滅表面上的現行，不能消滅它的因種。

但是解行菩薩不同，他在修忍辱時，觀察何期自性本自清淨，我內心中根本沒有瞋惱的因種，這個瞋惱是顛倒生，因緣有的，是無中生有的。沒有瞋惱，我們內心中本來就具足安忍的力量，知真本有，這時既然我有安忍的力量，我應該隨順它才對，隨順安忍的本性，來修習忍辱波羅蜜，所以修習忍辱是正常的。

四、以知法性無身心相，離懈怠故，隨順修行毗黎耶波羅蜜。

我們觀察我們身心世界，本來是沒有這種懈怠，沒有這種身心世界的業報相，所以我們這念心是沒有所謂的疲憊，沒有老病死的。我們一念清淨本然的心，是具足無量的功能、無量的能量，所以遠離懈怠。

五、以知法性，體無亂故，隨順修行禪波羅蜜。

我們內心中，本身就是寂靜不散亂的，所以我們應該修禪定，隨順寂靜。

六、以知法性體明，離無明故，隨順修行般若波羅蜜。

我們自性中，本來就具足體明，大智慧光明義故，所以我們應該隨順修習般若波羅蜜。這裡等於是說這個解行菩薩修六波羅蜜，的確跟我們有所不同。這樣的一個情況，我們待會再把它作一個總結。`;
