QXL.volNum = 28;
QXL.text = `
請大家打開《講義》第五十九頁，我們上一堂課講到辛二、釋解行發心。

發心就是發菩提心，菩提心是整個大乘佛法一個修學的重點。在菩提心的修學中，有所謂的根本法門跟方便法門。根本法門是我們內在的觀照力，方便法門是我們所產生的斷惡、修善、度眾生的一個加行。在這裡，馬鳴菩薩一再的強調：我們內在的觀照力，是成就菩提心功德的一個最重要因緣。

內在的觀照，在本論中基本上是分成兩類：

一、依止生滅心：比如說：我們一般的凡夫在修六波羅蜜時，我們凡夫的心都是有相行，思惟這個善業能夠招感安樂的果報、罪業招感痛苦的果報 ，依止有相的觀照、有所得的心，來布施、持戒、忍辱等等，我們內心中產生一種善業力，如此而已。在整個權教的菩薩中，就是依止我空、法空的智慧來修六波羅蜜 。他在修習每一個波羅蜜時，觀察三輪體空、觀察我不可得，所布施的眾生也不可得，來消滅人我的對立，這樣能夠止住他的妄想，消滅有所得心的妄想。

二、依止大乘真如門：這是修六波羅蜜時，我們觀察達妄本空，知真本有，我們內心中，本來就具足修學六度的善根，我們只是隨順善根而修學六波羅蜜，所以六波羅蜜的目的只有一個，就是開顯內心的善根。這樣你每一個六波羅蜜的善法，都具足了破惡，也具足了生善，所謂破妄顯真的功能。

所以同樣是修六度，你依止內心不同的觀照，就有不同的結果。我們顯教比較沒有明顯的說明大乘的差別，頂多隻是說權教菩薩跟圓教菩薩；但在密宗就分得很清楚，密宗它把修學的佛法分成小乘、大乘、金剛乘。在密宗裡面的分判，大乘就是依止我空、法空而修六波羅蜜，他只能夠止妄，但是不能開顯真如理；當你能夠達妄本空，知真本有來修習種種的六波羅蜜，這樣叫做金剛乘。金剛乘的特點跟一般大乘顯教的差別，就是生滅門跟真如門的差別。

我們舉一個例子來說明，比如說在念佛方面，念佛的整個操作有兩個重點：一個是能念的心，一個是所念的佛。如果說我們今天以顯教大乘我空 、法空來念佛，我們剛開始念佛，都是依止生滅心來念佛 ，就是蕅益大師說的事相念佛。我們剛開始觀察：我是業障凡夫，我沒有出離的因緣；阿彌陀佛是大功德的境界，他有救拔我的力量。我是業障凡夫，但是沒關係，我對阿彌陀佛通身靠倒，這樣也是非常好。但是這樣的念佛法門 ，叫生滅門的念佛，是一種自他對立，我是一個真實的個體，阿彌陀佛也是一個真實的個體，我比較差，阿彌陀佛比較好。我這個人是有增上慚愧心，我差，沒關係！但是阿彌陀佛會救我，所以我憶念佛陀。這樣的念佛，叫做事相念佛，就依止生滅心念佛，這樣的念佛也是非常不錯。

但是我們也可以依止密教金剛乘念佛的方法，就是依止所謂的真如門。真如門主要的精神就是真如平等，無增減故。你觀想自他不二：我們這念心，雖然無始劫來打很多很多的妄想，但是達妄本空，這個妄想是如夢如幻的，它不能障礙你；在空性中，知真本有，你內心中本來就具足本尊的功德，阿隬陀佛無量無邊依正莊嚴的功德，你本身就是具足這樣的本性。這個本性你怎麼辦呢？你要假藉佛號來托彼名號，顯我自性，假藉阿彌陀佛聖號的加持力，來開顯你自性本具的隬陀功德。

所以蕅益大師說：你能夠以自他不二的真如思想來念佛，那這樣能念的心不可思議，所念的佛也不可思議，念念之間都不可思議，念念之間滅惡生善，返妄歸真，你所產生破惡生善的力量，跟你前面在事相念佛，那就不可同日而語了，套一句蕅益大師的話：日劫相倍，你修一天的佛號，超過事相修一劫。

當然就是說乘，佛法講法門是個乘，就是說你今天從甲方到乙方，你用不同的車乘，你騎腳踏車有腳踏車的速度，你騎摩托車有摩托車的速度，你開大白牛車有大白車的速度，這個乘就是以你內心的觀照 來決定的。在本論中的大乘，他也讚歎別教菩薩的殊勝 ，但是他更讚歎你因地時，依止不生滅心、依止一心真如來起修，這是最圓滿的方法。

/KEPAN/辛三、釋證發心
/KEPAN/壬一、明分證
/KEPAN/癸一、明所證
/KEPAN/子一、明證體

前面的信成就是偏重在理觀，解行發心這個三賢位，是開始由從理觀生起事修；到了證發心，真實的能夠證入一心真如理，那是理事無礙不可思議的境界。證發心中，有分證跟滿證，先看分證。分證中分兩科：先說明他所證的真理，再說明他依止真理所生的妙用。先看所證的真理，所證真理中先看他所證的體。

/VERSE/證發心者，從淨心地，乃至菩薩究竟地。證何境界？所謂真如。以依轉識，說為境界。而此證者，無有境界，唯真如智，名為法身。

證發心，證入真如所成就的菩提心，是從最初的淨心地，這個淨心地就是初地發喜地。乃至於菩薩的究竟地，就是到這個十地，這個十地的滿心就是等覺菩薩，從初地到十地的階位都叫做證發心。

證發心菩薩，他所證入的是一個什麼樣的境界？所謂真如，他所證悟的是真如理。凡夫在有相行，他所證悟的理是業果道理；別教菩薩他所證悟的是空性的道理；圓教菩薩他入了初地以後，所證的真理是達妄本空，自真本有，這種自他平等的一心真如。

這裡把真如安立做境界是怎麼說呢？以依轉識，說為境界。這裡法藏大師說：這個是講到真如所起的後得智，所以安立做境界。境界相的安立，這個真如它是一個所緣境，這個所緣境界是有能所──有能緣的心，有所緣的境界，是約著它還有這個有漏的轉識，這個轉識就是我們前面說過真如起動，故名轉識。這真如一念妄動以後，產生一種有漏的業識，就是阿賴耶識，從阿賴耶識有所得的角度安立做境界，這是一個所謂的後得智。

但是當這個菩薩入根本觀、入根本智時，他內心在一心真如中，是沒有所謂的境界相可得，能所雙亡，諸相叵得，只有一心真如以為法身。他內心中入根本觀時，那是法界一心，如如智照如如理，那是沒有能所的對立。這裡等於是把初地菩薩的菩提心相貌作一個總說。

我們引用《八識規矩頌》對這個初地菩薩的相貌作一個說明。

《八識規矩頌》說：發起初心歡喜地，俱生猶自現纏眠。就是說這個初地菩薩，他成就菩提心時，他第一個相貌是歡喜，他剛開始假藉理觀跟事修來隨順真如。在別教的菩薩來說，他經歷十信、十住、十迴向，都沒有契入真如理，只有到初地時，他內心跟他的本來面目真實見面，他內心中起大歡喜：原來三世諸佛所開顯的一心真如，是真實不虛的，他一大阿僧劫的修行總算是沒有白費了。生起這樣的歡喜，當然是講到他跟真如相應的一個相貌。但是他內心是一個什麼情況呢？俱生猶自現纏眠。前面是讚歎他的功德，這以下是說明他有所不足，就是他還有這些俱生的煩惱，在內心中現纏眠。這個纏就是煩惱的現行，他煩惱現行時，多少會纏繞障礙著我們的菩提心。有時煩惱睡覺了，它不現行。

這地方意思就是說，這個初地的菩薩，他如果在佛堂中入根本觀時，他就從這種有所得的妄想，入到他的一心真如，這時內心是一念不生的，所謂的唯真如智，無有境界，名為法身。假設他從根本智出來、從佛堂出來跟境界接觸時，這時俱生猶自現纏眠，他有漏的妄想還是會活動，這是比較微細的，不是粗重的煩惱，是俱生的煩惱，還有一些微細的我相、人相的對立，有俱生的我法二執的存在。這裡等於是把初地菩薩菩提心的相貌，以根本智的自受用，跟他的後得智加以分別。

/KEPAN/子二、明起用

這個菩提心所產生度化眾生的妙用。

/VERSE/是菩薩於一念頃，能至十方無餘世界，供養諸佛，請轉法輪。唯為開導利益眾生，不依文字。或示超地，速成正覺，以為怯弱眾生故。或說我於無量阿僧祇劫當成佛道，以為懈慢眾生故。能示如是無數方便，不可思議。

這以下是說明證發心的菩提心功德。這個初地以上的菩薩，他依止內在的菩提心，這個菩提心我們說過，他有清淨法身，還有大悲願力的和合。他的清淨法身跟大悲願力和合時，他在一念之間，就能夠到十方世界去了。我們凡夫的願力依止妄想，所以我們只能夠在內心中觀想，如此而已。但是初地菩薩，他能夠心想事成，他內心一動，就能夠產生這個情況出來。

他到十方世界幹什麼呢？供養諸佛，請轉法輪。他以種種的香花珍寶來供養十方諸佛，表達他對三寶的歸依；供養完了，他主要是請佛陀轉法輪。這裡講到這個初地以上菩薩轉法輪，不完全只是為了自利，唯為開導利益眾生，不依文字。即使這個法門他已經通達了，他也是請佛來宣說。為什麼呢？要使令眾生得到歡喜、生善、破惡、入理的四種利益，他不求去聽受這些美妙的言詞。

初地菩薩上求佛道、下化眾生，對於度化眾生，主要採取兩個方便：

一、或示超地，速成正覺，以為怯弱眾生：初地菩薩在宣說法門時，有時候是引用讚歎鼓勵的法門。就是有些眾生根性怯弱，他可能準備要退轉無上菩提了，這時他示現頓超的法門，就先說：其實成佛不難，一念不生即如諸佛，就是一念之間而已，你能把有所得的生滅心──去生滅，守真藏，轉成真如心，如此而已，一念之間而已，凡夫跟成佛之間，就是在一念之間而已。講這個頓超法門有什麼好處呢？他能夠鼓勵這些怯弱眾生。

二、或者他也會開顯呵責對治的法門：他就宣說成佛之道不容易啊，要經過無量無邊阿僧祇劫這樣的難行苦行，才能夠究竟圓滿佛果。他這樣的呵責，主要是針對這些懈怠高慢的眾生。總之，他能夠以種種的無數方便，來開導眾生，使令眾生不斷的進步，這種力量是不可思議的。

這一段，蕅益大師的註解上說：這個地前菩薩的菩提心，縱使是下化眾生，皆是上求佛道，以契會真如法故。就是說前面的解行發心、信成就發心，雖然修六波羅蜜，表面上下化眾生，其實是在完成他自己的契會真如，他還是在自利。地上菩薩縱令他上求佛道，皆是下化眾生，因為方便有多門故。所以地上的菩薩，他表面上是修自利法門，請佛轉法輪，其實都是在開導眾生。

也就是說我們可以這樣分判成佛之道，從凡夫到初地是偏重在成就上求佛道，成就內在的觀照力；從初地以迄到成佛之道，就偏重在大悲，大部分是這樣判斷。

/VERSE/而實菩薩種性根等，發心則等，所證亦等，無有超過之法。以一切菩薩，皆經三阿僧祇劫故。但隨眾生世界不同，所見所聞，根欲性異。故示所行，亦有差別。

這裡就詳細把初地菩薩菩提心的相貌分別出來，這當中分兩段，先講初地菩薩自受用這部分。從自受用角度，這個初地以上的菩薩，他的種性跟根機是相等的。種性是約著他內在的觀照，他觀照力的強弱，他的種性、觀照都是觀一心真如，大家都沒有差別。這個根機是約著他方便的加行，有時候會有精進、懈怠的差別。依止這個種性、根機的因緣所生起的菩提心，不管因地的種性、根機，他果地的菩提心都是相等的，沒有超過之法。所以初地菩薩叫做同生性，他的依止點是完全相同的。為什麼呢？以一切菩薩，皆經三大阿僧祇劫故。所以這裡講菩提心的自受用，是沒有差別。

但是他受用，就有所不同。但隨眾生世界不同，所見所聞，根欲性異。故示所行，亦有差別。但是當這個菩提心，所謂如來現起他受用，這個菩提心依體起用時，他就必須要考慮眾生的三種差異：第一個根，第二個欲，第三個性。

第一個、根：就是眾生的根機。這個根機，蕅益大師的解釋，是約著他過去熏習的智慧。有些人他的根機，他這念心跟境界接觸時，他就喜歡用業果來思考這件事情，這個是人天種性；有些人他這念心跟境界接觸時，他歡喜觀一切法空，這權教菩薩；有些人他的心跟境界接觸時，他觀察這個都是一心真如的影像，達妄本空，知真本有，這個是金剛乘的大乘善根：這個根機有所不同。

第二個、欲：希望有所不同。在這個成佛之道中，每一個人生命的規劃有所不同。有些人他也不急著成佛，他來生要做大國王、轉輪聖王；有些人希望先到偏空涅槃去；有些人希望直趨佛道。所以在整個成佛之道中，每一個人有各式各樣的希望。

第三個、性：這個性是指他未來的果報。過去的熏習；現在的希望；這個性是未來的果報，有各式各樣。有些人果報是到天上，有的到人間，有的到偏空涅槃等等。所以在他受用，必須考慮眾生過去的善根、現在的希望跟未來的果報，所以示現有所不同。

這裡我們說明一下：初地菩薩的菩提心，我們在了解它時，要從兩個角度：

一、從自受用的角度，他已經入了同生性，同是相同的同，生是生命的生，性是習性的性。凡夫的菩提心，以別教來說，這個信成就發心、解行發心，他這個菩提心還是異生性，就是說雖然它隨順真如，但是它本質還是無明妄想，當然無明就是各式各樣不同。比如說：某甲他在佛前發菩提心，某乙也發了菩提心，這二個菩提心是完全不同的，因為每一個人打的妄想不同，所以他發的菩提心自然有所不同。所以我們作一個假設：都是初地以前的菩薩，我們假設有一百個人都發了菩提心，這時菩提心是一百個人都不一樣，這叫異生性；但是初地以上的菩提心就不同了，他們都共同回到一個根本的家中，同生性。從自受用角度是沒有差別的；

二、從他受用的角度來看：當然從本垂跡，他所示現的應化，就要考慮眾生的因緣，那就有所不同。他所生起的妙用，有些人願意去度化善根薄弱的眾生，依止讚歎法門；有些人他願意去攝受剛強的眾生，來訶責他等等：這就是菩提心生起的妙用，有各式各樣不同。

這一科是講到菩提心所證的體性跟他所生的妙用，這以下說明他菩提心的相貌：

/KEPAN/癸二、明心相

/VERSE/又是菩薩發心相者，有三種心微細之相。云何為三？一者真心，無分別故；二者方便心，自然遍行利益眾生故；三者業識心，微細起滅故。

以下把十地菩薩的菩提心，開出三種相貌詳細的加以觀察。初地的菩提心是什麼相貌？我們開展出三種相貌來觀察：

一者真心，無分別故：這個初地以上的菩提心，當他入根本觀在自受用時，他內心中是無分別的，無有少法可得，那完全是一個無住的境界，不住有相、不住無相，那是無有少法可得。

二者方便心，自然遍行利益眾生故：這個初地菩薩依體起用時，這時就千差萬別了，他必須要為不同根機的眾生，開顯不同的法門，示現不同的相貌，所以說他的菩提心從方便心來說，他有時候現慈悲相來攝受你，有時候現怒目金剛相來訶責你，這個相貌就有各式各樣不同的變化。

三者業識心，微細起滅故：前面的直心、方便心，是讚歎初地菩薩的功德；這裡是說明這個菩提心還有所不足，也就是說他既然是分證，所以他還有一部分有漏的業識，他那個生滅心還有一部分。所以他有時候是俱生猶自現纏眠，他心中還是有所不足。有時候在上求佛道、下化眾生時，多多少少還有一些得失的生滅心存在，他還要不斷地去用功，不斷地去處理他心中的這些障礙。這裡是把這個分證菩提心的相貌，把它開展出來加以觀察。

/KEPAN/壬二、明滿證
/KEPAN/癸一、正明

當我們圓滿證得菩提心時，是什麼相貌？這當中分兩科，先看正明：

/VERSE/又是菩薩功德成滿，於色究竟處，示一切世間最高大身。謂以一念相應慧，無明頓盡，名一切種智。自然而有不思議業，能現十方，利益眾生。

一個初地菩薩，他跟我們凡夫不同，他會不斷的進步，從一大阿僧祇劫，到二大阿僧祇劫、到八地、到三大阿僧祇劫，從八地到成佛，最後他的福德智慧都圓滿。圓滿以後，他的佛果有兩個相貌：

第一個、外表的色身：成佛是示現什麼身呢？於色究竟處，示現一切世間最高大身。在他正式成佛時，我們先不講示現，就是他剛開始從本地風光、他最初成佛時，他現的色身，是現出色究竟天的摩醯首羅天的天王天。在三界的果報中，無色界沒有業果色，他最高處點是色界最究竟的摩醯首羅天，那是整個三界的色身中，最為莊嚴尊貴的色身，這是講到他外表的色身。

第二個、內心的相貌：那他成佛是怎麼成佛呢？他是以一念的相應慧，無明頓盡，名一切種智。當我們到了等覺菩薩的時後，入一種禪定叫做金剛喻定，這個禪定特別的堅固，這樣強烈的禪定，再加上大乘的智慧，這裡的智慧很重要，蕅益大師在《楞嚴文句》裡面一再強調：大乘佛法的智慧，就是達妄本空，知真本有。他不斷這樣的熏習，最後一念相應時，無明頓盡，無始劫來虛妄熏習的生滅相全部消失了，他內心中不是一心二門，他一心只有一個門。我們凡夫一心有二門，佛的一心只有一個門，就是真如門。這時一切種智現前，包括根本智、後得智，這樣的智慧現前，自然有不可思議的業用，能在十方無量無邊的世界，隨順眾生的根機來廣度眾生。

前面的信成就發心，法藏大師說：信成就發心，偏重在理觀的成分多，這個理觀是假藉語言文字的觀察，不斷的透過文字的學習思惟，產生正念真如的觀察。正念真如的這個真如是怎麼一回事？是由文字建立的真如，就是理觀，這個信成就是這樣的。解行發心他能夠把這個一心真如表現在六度的作用上，他要事修；這個證發心，他能夠理事無礙，理也不礙事，事也不礙理。那麼佛呢？是事事無礙不可思議。

我們前面講到，我們一般的心有生滅心跟真如心，那說佛沒有生滅心，這句話是什麼意思？我們一般的凡夫到等覺菩薩，比如說你今天看到某甲法師，你今天看到他跟昨天看到他，肯定不一樣，他的生命有變化。比如說你昨天跟你今天也不一樣，你今天又多拜了幾拜佛、又多聽了一堂課，你內在的觀照力、行動力、資糧力都不同，我們每一個生命都不斷的變化。

初地以上的菩薩，他的變化中，出現了一部分的不變化；但佛的生命是完全沒有變化，你昨天看到的佛陀，跟你今天看到的佛陀完全一樣。你不能說：佛陀昨天講了一部《華嚴經》，功德應該增加了。沒有這回事情！佛的功德不會增加，也不會減少。就是說，佛陀不管修什麼功德，他的心永遠是不生不滅、不垢不淨、不增不減，是一個如的境界，那是不可思議的境界，他沒有增減相。我們應該從這種無增減相、無生滅相、無垢淨相來了解佛的菩提心，這就是所謂佛的一切種智。這是說明佛菩提心的相貌，以下就解釋兩個疑惑。

/KEPAN/癸二、釋疑
/KEPAN/子一、釋一切種智疑

先看第一個疑惑，釋一切種智疑，對佛陀的一切種智產生疑惑。

/VERSE/問曰：虛空無邊故，世界無邊。世界無邊故，眾生無邊。眾生無邊故，心行差別亦復無邊。如是境界，不可分齊，難知難解。若無明斷，無有心想，云何能了，名一切種智？

我們說這個宇宙間的虛空是非常廣大，這個虛空中有無量無邊的世界，這世界有無量無邊的眾生在那個地方安住，每一個眾生也打了各式各樣的無明妄想，就這個妄想各式各樣，這都是很難去理解的。佛陀的無明斷盡，已經沒有各種妄想了，他怎麼夠了解眾生這些差別的內心相貌？也就是說我們一般人都要打妄想，才能知道這件事情，我們凡夫要去了解一件事，要靠這個生滅心去打妄想。佛陀不打妄想，他怎麼知道我們在想什麼呢？他提出這個問題，看馬鳴菩薩怎麼回答：

/VERSE/答曰：一切境界，本來一心，離於想念。以眾生妄見境界，故心有分齊。以妄起想念，不稱法性，故不能決了。諸佛如來，離於見想，無所不遍。心真實故，即是諸法之性。自體顯照一切妄法。有大智用，無量方便。隨諸眾生所應得解，皆能開示種種法義。是故得名一切種智。

我們一般的境界，其實他的根源是一心真如所顯現的，他根本是離於妄念的。所以諸法從本來，常自寂滅相，但是我們在寂滅相中，凡夫妄見境界，我們一念的妄動，迷真起妄，向外攀緣，創造很多的業力，就得到很多的果報。依止這個果報，又開始指妄為真，由這個果報又產生很多的名言。前面是三細，這個是六粗。結果我們對很多事就不明瞭，這是講到凡夫的心識，在妄想跟業力中纏繞，所以不明瞭。

那諸佛的心離於見相，無所不遍，這個很重要。我們凡夫的心情，總覺得要有所得，我們才能夠圓滿，去追求，追求愈多我們得到愈多。但是佛法告訴我們這是錯誤的觀念，我們要把有所得的心放下，你的功德才會圓滿。這種圓滿的性，是心真實故，即是諸法之性。內心安置在真實的佛性，這個真實是很重要的。

這裡真實是說，我們凡夫在信成就發心時、在正念真如時，其實我們一天中正念真如的時間非常少，打妄想的時間非常多。為什麼我們會進步呢？說我打妄想的時間，一天至少是二十四小時，大部分都是在打妄想，只有幾分鐘正念真如，為什麼我會進步呢？

因為你正念真如時是真實的，真實的功德不會被虛妄的妄想所破壞，它能夠破壞妄想，而不會為妄想所破壞，所以你會不斷的進步。這個東西，你累積一分它就永遠是一分，你累積二分它永遠是二分。為什麼？心真實故，即是諸法之性。所以它能夠顯現一切的萬法，能夠生起廣大的妙用，生起無量的方便，隨眾生的根機，開示差別的法義，所以名為一切種智。就是佛陀依止不生滅心，基本上是心量廣大的；我們凡夫依止生滅心，心量非常的狹隘。

我個人持咒的經驗，我平常念佛，也會持咒。我白天持《大悲咒》，下午以後持《往生咒》。我個人的感覺：我持咒時，如果依止有所得的心，比如說我有時候有病痛，就觀想那個病痛的處所，就用這個咒去加持它，它會好轉，但是這樣的心是成就一個果報相，就是說那個《大悲咒》變成換一顆小糖果吃。後來我就依止不生滅心，內心中依止真如平等無增減故，依止無所得的心來持咒，空掉自己的有所得心，這時你會覺得你那個持咒的力量，是海闊天空，不可思議的。能念的心不可思議，所念的咒也不可思議。

所以所有的法門，以無住為本，無念法門為本。你要無住，你才能夠跟你所修的法門完全契會。諸佛菩薩為什麼能夠照見眾生的因緣呢？因為佛菩薩無住，所以他能夠遍一切處，是這個道理。

/KEPAN/子二、釋任運利生疑

前面是講到諸佛菩提心的自受用，這裡講諸佛菩提心的他受用。

/VERSE/又問曰：若諸佛有自然業，能現一切處，利益眾生者。一切眾生，若見其身，若睹神變，若聞其說，無不得利。云何世間多不能見？

又問說：假設諸佛的菩提心，能夠任運生起種種的妙用，在一切時、一切處利益眾生。這樣的話，眾生見到佛的色身，看到佛陀的神通，或者聽到佛的說法，都能夠得到歡喜、生善、破惡、入理四種利益。那為什麼眾生都沒有見到佛的功德呢？提出這個問題，佛的功德是遍一切處，我們平常很少看到，是怎麼回事呢？看馬鳴菩薩的回答：

/VERSE/答曰：諸佛如來，法身平等，遍一切處。無有作意，故而說自然，但依眾生心現。眾生心者，猶如於鏡。鏡若有垢，色像不現。如是眾生心若有垢，法身不現故。

論主回答說：諸佛如來他法身的相貌，是平等，遍一切處的，這是約著佛陀自受用的功德。佛在他受用時，依止大悲願力，佛在因地時發了願眾生無邊誓願度，所以佛的願力跟他的清淨法身接觸時，他能夠生起他受用。佛的他受用是無有作意，故說自然，他心中沒有要特別去加持某一個眾生，他沒有有所得的分別，是任運的。任運的佛陀是沒有起心動念，眾生是怎麼能夠得見呢？這以下說出眾生的因緣有差別。眾生的心就像鏡子，每一個人鏡子的污垢有厚薄的不同，所以色相的顯現就有所不同。就是說佛陀其實每天都在鏡子前面，但是有些人的鏡子污垢比較厚，就沒有辦法現出色像；有些人的污垢比較薄，就能夠見到色像。所以眾生的心如果污垢太厚，他這個生滅心太強，法身就不能顯現。

前面是約著一切種智，這個是講到感應道交的問題，就是佛跟眾生之間的感應道交，為什麼有些人很容易跟佛感應道交，有些人就很難跟佛感應道交？這個感應道交的意思，不是色身跟色身的相見，是心心相印，就是凡夫的心跟佛的心兩個要能夠相應，當然佛的心是無住，佛的心是無住而生起他的大悲心，我們如果不能安住在無住，那這樣就很難相應了。

《了凡四訓》講到我們跟天神的感應，講到畫符咒，它說有些人畫符咒，他那個咒一畫下去很有力量，貼在門上所有的惡鬼神都不敢靠近。有些人畫符咒沒有力量，為什麼呢？就是你畫符咒時打妄想，這個符咒就沒有力量。你畫符咒時，一氣呵成，從第一筆到到最後一筆收尾時，一念不生，這個咒的力量就全部表現出來。

所以當我們念佛、持咒也是這樣，你根本思想一定是──莫向外求。你要把你心中的佛號跟《大悲咒》發揮出它的力量，就是無住，空掉你這種有所得的生滅心，把自己的心調整在真如心，這時就跟諸佛菩薩感應道交了。就是感應道交的問題不在佛本身，而在我們自己內在的心，是安住在生滅門、或真如門，這當中有厚薄的不同，也就解釋為什麼感應的力量會有所不同。`;
