QXL.volNum = 29;
QXL.text = `
請大家打開《講義》第六十三頁，丙四、修行信心分。

本論的作者馬鳴菩薩在前面的因緣分，講到造論的因緣，是為了使令一切眾生離一切苦，得究竟樂。那我們學習本論，就不只是增加一些文字上的知識，而是本論的法義經過我們的思惟，能夠真實的生起大乘的信、解、行、證四種功德，假藉這四種功德，能夠在內心中破惡、生善，使令我們離苦得樂。

這大乘的信解行證四種功德，它主要的根本就是菩提心。這菩提心由淺入深的次第，我們剛開始修學的菩提心叫做信成就發心。就是說我們剛開始在凡夫位時，在一個無明妄想的心中，要建立一個清淨莊嚴的菩提心，我們依止的是一種大乘的信心。大乘信心的建立，主要是透過對於前面一心、二門、三大道理的觀照。在大乘佛法中的觀照，它的一個重點，是觀照現前一念心性。

在觀照這一念心性時，有兩個重點要去觀照：

一、從它的差別義來觀照。

就是說我們內心中有兩個相貌：第一個，我們依止有所得的心，也就是一種我相、人相對立的心，我們這樣的心會創造很多很多的煩惱，也會引生很多很多的業力，招感很多很多痛苦的果報。這樣的有所得心是生滅變化的，所以我們叫做生滅心。這個生滅心是一切生死痛苦的根源，這是我們內心的第一個相貌，所謂生滅心。第二個，假設我們依止的是無所得相應的心，這樣的心是清淨本然、週遍法界，離諸對待的。這樣的一個心性，它會成就法身、般若、解脫三種的功德，可以說是一切涅槃安樂的根本。所以我們從這個差別義，我們這一念心有兩個相貌：一個是生滅心，是痛苦的根源；一個是真如的心，是安樂的根源。這是我們在觀修現前一念心性的第一個重點，這樣的第一個重點是約著差別義來觀照的。

二、根據它的通達義來觀照。

就是說其實這兩個心的內涵：當我們是迷惑時，是全真取妄，整個真如的心，就變成生滅的心；當我們能夠生起覺照時，就是全妄即真。所以這二個心基本上是不二的，所以古德說：夢裡明明有六趣，醒後空空無大千。當我們產生顛倒，心外求法時，我們招感很多很多生死痛苦的果報，但是我們一念的迴光返照，這些生死的果報就覓之了不可得。所以禪宗說：生滅心跟真如的心是不隔一條線。這是我們這一念打妄想的心，只要我們能夠迴光返照，去觀照體、相、用三大的真理，我們的心就能夠從生滅心而變成真如的心。

所以我們透過對於這種的大乘正見，所謂染淨不二的正見，我們發起了眾生無邊誓願度、煩惱無盡誓願斷、法門無量誓願學、佛道無上誓願成的一個菩提心，這樣的一個菩提心，是依止大乘的正見，所謂的大乘的信心所引生的。

前面的菩提心，是完全依著對一心、二門、三大的一個理觀而引生的菩提心，法藏大師說：前面是一個利根的人所能夠成就的。這以下的修行信心分是約著鈍根人，鈍根人他只約著理觀是不夠的，他必須要有一些六度的事修的輔助，輔助他一心二門的觀照，才能夠成就他的菩提心，所以這個以下的修行信心分是鈍根的眾生，他必須有一些事相的修學來作滅惡生善的輔助。

/KEPAN/丙四、修行信心分
/KEPAN/丁一、結前起後

這當中有兩科，先看丁一、結前起後，看論文：

/VERSE/已說解釋分，次說修行信心分。

前面已經針對利根的菩薩宣說一心、二門、三大的道理，使利根的眾生髮起了菩提心，成就了大乘的正定。現在，馬鳴菩薩的慈悲，為了帶動這些鈍根菩薩修行信心，為實施權，使令他的信心加強而引生菩提心。這當中先作一個總標，這以下丁二、正說修信，正式的說明修習信心的一個方法。

/KEPAN/丁二、正說修信
/KEPAN/戊一、正明修習信心
/KEPAN/己一、總征

這當中有兩科，先解釋修習信心。我們所修的信心是什麼？先看總標：

/VERSE/是中依未入正定聚眾生，故說修行信心。

這裡是說明修行信心所加被的根機是誰呢？是根據未入正定聚的眾生。就是說一個十信位不定聚的眾生，有時候生起大乘善根，有時候退轉大乘善根，他的大乘善根是不決定的，應該要修行這個信心分。我們作一個解釋。

前面的信成就發心，法藏大師說：他是一個根利遮輕的眾生，他的大乘善根強，而且宿世所栽培的煩惱跟罪業也特別的輕薄，所以他只要透過對一心、二門、三大的一個理觀，悟入內心染淨不二的道理，他就能夠生起真實的菩提心，而真實的不退轉於阿耨多羅三藐三菩提。這以下是根據這個根鈍遮重，他的大乘善根本身就薄弱，而且無始劫來引生很多很多的煩惱罪業，所以他必須要透過這個修行信心來破除罪障，栽培他的善根，才能夠悟入的，所謂的信成就發心的正定聚。所以這裡是說，依止根鈍遮重的不定聚眾生來說明修行信心分。先說明這個法門所加被的根機。

/VERSE/何等信心？云何修行？

這以下就提出一個問，先說明我們今天修行的目標是什麼呢？就是修行大乘的信心。云何修行？是說明它下手的方法，這以下的論文都是在回答這兩個問題。

/KEPAN/己二、別釋
/KEPAN/庚一、釋信心

先說明信心的功德、果地的功德，再說明因地的修學。先看第一科，這是信心的相貌。

/VERSE/略說信心有四種。云何為四？一者、信根本。所謂樂念真如法故。二者、信佛有無量功德。常念親近、供養、恭敬，發起善根，願求一切智故。三者、信法有大利益。常念修行諸波羅蜜故。四者、信僧能正修行，自利利他。常樂親近諸菩薩眾，求學如實行故。

這裡，我們在修習信心時，先把我們所要成就的大乘信心作一個說明。這信心的基本定義，就是忍可隨順，也就是說我們對於整個大乘的真實功德，我們跟這個功德接觸時，我們很任意的能夠對它隨順歸依。當你對大乘的功德能夠隨順歸依時，我們安立你對大乘佛法生起的信心。當然你能夠對這個大乘功德隨順歸依，這個大乘的功德就能夠從你內心中生起來。大乘的功德到底有哪些是我們所要歸依的、所要隨順的呢？這以下有四種：

一、信根本：接下來是佛、法、僧，先看根本。信根本。所謂樂念真如法故。大乘的功德，主要有正報的莊嚴跟依報的莊嚴，這些莊嚴的功德，基本上都是依止真如法而生起，所以它是一切大乘佛法的根本，所以我們剛開始的歸依，就是樂念真如法故。

從本論的解釋：我們眾生有很多很多的煩惱，而且造了很多很多的罪業，而招感很多的痛苦。這些煩惱障、業障、報障，都不是上帝給我們的，就是我們內心中的歸依處有問題，就是我們凡夫對無明妄想有信心。就是我現在打一個妄想，我就隨順這個妄想去做了；我昨天打另外一個妄想，我就跟著另外一個妄想去活動：我們凡夫痛苦的根源，一言以蔽之，就是心隨妄轉，跟著我們的感覺來活動。

所以這裡就是說，我們今天要生起大乘的功德，第一個要改造你內心的歸依處，從現在開始，你要能夠樂念真如法故，你不要再跟著妄想而活動，你要能夠強迫自己去隨順、去憶念這種清淨本然、週遍法界的一心真如，這是一切功德的根本。也就是說，我們過去的心歡喜向外攀緣，這時，我們應該強迫它把心帶回家，迴光返照我們內心深處的一心真如，這是我們所有大乘佛法功德的根本，就是你應該對你內心的這個歸依處有所調整。這個根本是大乘內在的善根，其他的佛、法、僧是外在的善根。

二、信佛：有無量功德。常念親近、供養、恭敬，發起善根，願求一切智故。前面是對內在的歸依，這裡是外在的歸依。外在的歸依，第一個是講佛寶，在歸依之前，先讚歎佛的功德。佛有無量的功德，有三身、四智、五眼、六通、無量百千陀羅尼門，一言以蔽之，佛陀有救護之義。我們在對佛陀歸依之前，我們要思惟佛的功德。思惟佛的功德，宗大師強調兩個觀念：第一個，你要相信佛陀的功德是無所不在的──深信諸佛皆充滿，你相信佛陀的功德是無所不在的；其次，你相信佛陀有救拔我們的力量，這時我們對佛陀的功德就能夠產生歸依。所以這是講到第一個讚歎佛的功德。

那應該怎麼歸依呢？常念親近、供養、恭敬，發起善根，願求一切智故。我們應該要經常的去親近佛陀，用種種的香、花、燈燭來供養，乃至於恭敬。這個恭敬包括禮拜、讚歎，身業的禮拜、口業的讚歎，透過這樣的一個身、口、意的歸依，來發起我們大乘的善根，成就一切種智。

這裡值得我們注意的就是親近這兩個字，我們身為大乘的佛弟子，經常的親近佛陀，這當然是非常重要，求佛力的加被。但這裡有一個問題，就是佛陀的應化身已經滅度了，我們怎麼親近呢？我們經常說是一心歸命極樂世界阿彌陀佛。從淨土宗的角度，以彌陀的功德當作我們一個本尊的觀修內涵，你要一心歸命極樂世界阿彌陀佛。你要歸命之前，阿彌陀佛功德必須現前，否則你怎麼歸依呢？但是阿彌陀佛在十萬億佛土外，你怎麼歸依呢？所以就是我們在觀修時，我們雖然觀修深信諸佛皆充滿、佛的功德是無所不在的，但是我們主要的應該觀想佛的身像跟佛的名號，所以大乘佛法強調名以召德，或者是以他的身相來招感佛的功德。所以我們對於名號的憶念、對於身像的禮拜，這個就是親近，所以第二個就是我們對佛功德的歸依。這樣的歸依，有幫助我們成就善根、成就智慧的力量。

三者、信法：有大利益。常念修行諸波羅蜜故。前面的佛有救護，救拔、保護的意思；這個法有開啟智慧的利益，能夠使令我們內心中，從黑暗中出現光明，能夠知道什麼是善、什麼是惡。我們對法應該怎麼樣的去歸依呢？常念修行諸波羅蜜故，生起這種好樂的心，修習種種的波羅蜜，這個波羅蜜主要是六波羅蜜。

四者、信僧：能正修行，自利利他。常樂親近諸菩薩眾，求學如實行故。這大乘佛法的第四個歸依，是對僧寶的歸依。僧寶有住持的功德，他有住持正法、續佛慧命的功德。所以我們對於僧寶應該怎麼歸依呢？應該要經常親近如法和合的菩薩眾，依止這個大眾的力量，來求學、來如實的依止這個教法修行。

這裡我們說明一下，佛有救護之恩，法有開慧之恩，僧有住持之恩，這是三寶的恩惠。這個僧寶的意思就是說，在修學過程中，其實歸依佛、歸依法也就夠了，但是為什麼要歸依僧呢？因為我們長時間的修行，我們內心的善根往往容易退轉，所以我們依眾靠眾，依止大眾的威德攝受，能夠使令我們不退轉。所以依止僧團而修學，基本上有助於我們對佛法的修學，所以我們也應該對僧寶的歸依。

法藏大師的意思：這個根本是內在的善根。法藏大師的意思：這個根本是內在的善根，是一個主修。我們經常的樂念真如、正念真如，這是成就大乘的善根。但是大乘善根在修學過程中，我們會有一些遮障，我們依止外在的善根，對佛、法、僧寶的恭敬、禮拜、讚歎，來破除障礙。

佛法的修學，有些內涵是共外道的，有些是不共外道的。比如說我們有對佛、法、僧三寶的禮拜、讚歎、供養；外道也有他們所謂的三寶，他們有他們的教主、有他們的教法、有他們的僧團，他們也是修禮拜、讚歎、供養。但是大乘佛法不共於外道的地方，最重要的就是這個信根本，就是相信我們這一念心，達妄本空、知真本有，心佛眾生三無差別，就是大乘的一個因地，從大乘佛法的角度，就是你要生起佛的功德，你要能夠安住在大乘的因種。說是你今天要煮飯，你要拿米去煮飯；你拿沙去煮飯，頂多是一個熱沙，不能成就飯。就是我們希望能夠離苦得樂、成就佛的功德，你內心的依止處是非常重要的點。你要依止一心真如來稱性起修，根據佛、法、僧三寶的法門來破障，但是主修還是根本，這個就是我們在成就大乘的四種信心。

所以這裡先把功德相標出來，當我們內心中跟佛、法、僧接觸時，能夠生起歸依的心，乃至於內心中對於我們一心真如能夠隨順忍可，這個就成就了大乘信心，你就有資格發菩提心了。前面的四種信心應該怎麼成就呢？以下就講到因地的修法。這當中，先看總標：

/KEPAN/庚二、釋修習
/KEPAN/辛一、總標

/VERSE/修行有五門，能成此信。云何為五？一者施門，二者戒門，三者忍門，四者進門，五者止觀門。

我們希望能夠對於佛、法、僧、根本，成就隨順歸依，有五個法門。這五個法門就是六度，值得我們注意的是第五個止觀，這止觀是正修，主要是修學根本。前面的四門，是依止三寶的修學來滅惡、生善，它是一個方便法門；這個止觀，我們前面講唯識止觀時、或者說別教的止觀時，這個止觀的內涵是分開的，止觀各有各的體性，各有它的操作方法。這裡的大乘圓頓止觀，止跟觀是不能分開的，這後面會說明，就是你在止時是有觀，在觀時也是有止，在這裡它把止觀合成一門，就看得出來這個就是圓頓止觀。

/KEPAN/辛二、別釋
/KEPAN/壬一、釋施門

別釋中，我們先看成就大乘信心的第一個門──布施。首先我們對布施的定義作一個解釋。什麼叫布施呢？宗喀巴大師說：我們依著施捨的心所發起的身語二業，這個就是布施。比如說你現在有一個東西，這個東西你不喜歡，你把這個不喜歡的東西送給別人，這樣只是成就善業，不能說是本論的布施；這裡的布施，要依止施捨無貪的心所造作的身業跟口業，才能夠安立這個布施，也才能夠生起我們對大乘的功德善根。

所以這裡的施，它不是依止你所布施的財物來安立的，是依止你能施捨的心。當你施捨的心生起時，你所做的身業跟口業，都是屬於通達大乘善根，布施的法門。我們看論文：

/VERSE/云何修行施門？若見一切來求索者，所有財務隨力施與；以自捨慳貪，令彼歡喜。若見厄難、恐怖危逼，隨己堪任，施與無畏。若有眾生來求法者，隨己能解，方便為說。不應貪求名利恭敬，唯念自利利他，迴向菩提故。

我們依止施捨的心，來修習布施有三個內涵：

第一個、財施

若見一切來求索者，所有財物隨力施與。

一切眾生他來跟我們乞求財物，或者是飲食、或者是生活的種種資具，這樣的飲食跟財物資具，我們本身有多餘的情況，就是我們有布施的能力，這時菩薩應該要隨順我們的能力，來布施給對方。這樣的布施有什麼好處呢？有兩個功德：一、從成就內在的善根來說，自捨慳貪，能夠對治我們的慳貪；二、從外在的福德來說，能夠令彼歡喜，能夠成就廣結善緣，成就我們來世的福報受用。

其次，我們在修習六度的著眼點，當然是成就內在的善根──自捨慳貪。這個慳貪，《瑜伽師地論》上說：一個人修布施時，你要能夠成就內在無私的善根，你必須依止清淨心來布施。什麼叫依止清淨心來布施呢？《瑜伽師地論》上說：你要具足三個法門：

一、施前歡喜：就是這個布施的因緣還沒有成就之前，你想到你即將要布施，內心充滿了期待歡喜──你即將要因為布施，而成就一個善根；你的生命會因為這個法的操作而更加的離苦得樂，這時你充滿了期待歡喜。

二、施時清淨：當你正式布施時，你內心不求回報，並沒有因為這樣的布施，而祈求對方的回報；你只是希望透過布施的操作，來栽培你內心無貪的善根，依止無貪的善根來加強你的菩提心，所以是不求回報的。

三、施後無悔：布施的法門也剎那剎那的生滅變化過去，當這個布施的法結束時，你回憶你過去布施的因緣，你內心不生悔恨。當然這裡你要量力而為，你要念念的對布施的法門，產生隨順歡喜而不生悔恨。

而當你能夠施前歡喜、施時清淨、施後無悔時，你所作的每一個布施，不管布施的東西是什麼，都能夠自捨慳貪，成就內在的善根。這是講到財施。

第二個、無畏施

若見厄難、恐怖危逼，隨己堪任，施與無畏。

前面的布施，偏重在外在資具的缺乏，這是屬於外在色身感受的痛苦；這裡的布施，針對的是內心有憂愁的眾生，他內心有障礙。我們若見厄難、恐怖危逼，眾生在人世間活動，他遇到了很多的災難，或者遇到一些恐怖，由於這個災難跟恐怖的危逼，他內心憂愁不安，心有千千結。菩薩遇到這樣的眾生，應該隨順自己的能力，施與無畏。這裡的施無畏，主要的意思是佛法去安慰、開導眾生。

這個無畏施，在《瑜伽師地論》上說：有兩個法門能夠使令眾生遠離怖畏：

一、依止無常、無我的道理來開導眾生。就是眾生會產生憂愁，主要的就是指妄為真，把這些生滅變化的因緣法當作是真實的，產生執著，所以他的生命就通不過去。就是說這個事情已經過去了，但是他內心中揮之不去，這時你應該以諸行無常、諸法無我的道理來開導他，使他從內心的執著裡面解脫出來，這是第一個。

二、應該讚歎三寶的功德，使令他能夠憶念三寶，祈求救護。這時他就能夠從生命的災難中，得到安穩，這是無畏施。

財施所破除的是眾生外在資具的缺乏，無畏施所破除的是眾生內心的障礙。

第三個、法施

若有眾生來求法者，隨己能解，方便為說。

如果這個眾生他已經具足了聽法的善根，而且具足了求法的儀軌，來向我們求法，我們應該用種種五乘的解脫法門來為他宣說。在《瑜伽師地論》上說：在所有布施中，功德最為殊勝的就是法施。因為前面的財施跟無畏施，它只能夠使令眾生暫時的離苦得樂。他沒有飯吃，你給他一碗飯；他得到了憂鬱症，你用佛法的道理開導他，從憂鬱症裡面解脫出來，當然這都非常好。

但是他的根本問題沒有解決。眾生一切痛苦的根源來自於內心的愚癡，所以愚癡是生命中最大的罪業。就是說你今天能夠為他說法，他在黑暗的愚癡中產生光明，讓他知道什麼樣的因緣是一個功德相、什麼樣的因緣是過失相，你為什麼會痛苦？你為什麼會有快樂出現？你讓他能夠抉擇是非。這樣在他的生命中，就能夠有一個努力的方向。他這樣的利益，是生生世世的受益，這樣才能夠究竟離苦得樂。所以在《瑜伽師地論》中，讚歎法施的功德能夠利及來世，前面的財施跟無畏施只能夠利及今世。這裡是講到布施的三個內涵，這以下說明布施內心的依止處。

不應貪求名利恭敬，唯念自利利他，迴向菩提故。

我們在施捨時，應該要遠離名利恭敬，應該用這樣的心情用來對治慳貪，令彼歡喜而迴向無上菩提。大乘的布施法門，功德主要有兩類：

一、從內在的善根來說，是破除慳貪，成就施捨的心。我們在修菩提心時，除了我們能夠正念真如這個根本法門以外，我們要注意這個障礙菩提心的法。就是你在內心的妄想中，建立一個菩提心的幼苗，你要適當的保護；會障礙菩提的，這裡所說的就是貪慾的煩惱，你對於資具、對於佛法的慳貪，會障礙你菩提心的增長。所以我們以施捨的法門，來破除這個慳貪的障礙，所以這是第一個善根，成就無貪的一個施捨心。

二、成就廣大的福報受用，這是兼帶外在的福德。這裡我們說明一下。本論所說的六度法門，跟我們過去的六度可能會有所不同，這裡的六度，它的施設完全是以成就大乘善根而施設的，簡單一句話就是要你莫向外求，就是藉事修心，假藉六度的修學來成就你大乘的善根，依止大乘的善根而增長你的菩提心。所以你每一個施捨的過程中，每一個六度的過程中，你就要生起觀照力，否則只是成就人天的福報。

/KEPAN/壬二、釋戒門

在戒門中，先解釋持戒的定義。什麼叫做大乘的持戒？宗喀巴大師說：遮止損害他，令欲起厭離。就是我們去傷害眾生的心，要加以遮止；對於這種損害他的心，內心產生厭離之想，這叫做持戒。這裡我們說明一下。持戒的意思，不是說你在非常順利的人事，今天也沒什麼事，你心平氣和，這個叫做持戒，這不是，這只是緣缺不生。就是我們的內心，在各式各樣的人事因緣中，我們內心能夠產生一種防非止惡的功能。

就是有這人事的境界來刺激你，我們第一個反應當然是起煩惱，一開始會顛倒，顛倒以後會起煩惱，一般人起煩惱就一直起下去了，這種人就是沒有持戒的功德了。有持戒的人，他也會生起煩惱，但是他生起煩惱時，會產生一個警覺的功能，他內心中有一種自動的警覺訊號產生，這種警覺功能生起時，就會產生防非止惡。當你遇到障礙現前時，你內心能夠起動你的警覺功能──不可以，這個警覺功能的生起，就表示你有持戒的功德。所以這裡，我們先把持戒作一個定義。好，我們看持戒的內涵：

/VERSE/云何修行戒門？所謂不殺、不盜、不淫、不二舌、不惡口、不妄言、不綺語，遠離貪嫉、欺詐、諂曲，瞋恚、邪見。若出家者，為折伏煩惱故，亦應遠離憒鬧，常處寂靜；修習少欲、知足、頭陀等行。乃至小罪，心生怖畏，慚愧改悔。不得輕於如來所制禁戒。當護譏嫌，不令眾生妄起過罪故。

修習持戒的內涵，法藏大師以三聚淨戒來作分判：

第一個、攝律儀戒

這個攝律儀戒，在這裡是講到遠離十惡業──身業是不殺、不盜、不淫，口業是不二舌、不妄言、不綺語，意業是遠離貪、瞋、癡。這裡的十惡業，諸位應該都很清楚，我們就不說了，我講一個重點就好。

這個十惡業的業性呢，當然業的力量主要是由心來帶動的，說心為業主。當然業的觀點，有很多不同的觀點。但是這裡我們是在修習大乘的善根，我們就從大乘菩提心的觀點，來判定這個業性。《瑜伽師地論》上所說，是就著引生菩提心的角度來說。

這個貪、瞋、癡的煩惱，過失最重的是愚癡。為什麼依止愚癡造業是最重呢？因為愚癡的造業，是無慚無愧，所以你造業是沒有期限。你無慚無愧，這時你這個業就相續下去，你就不能夠有對治的力量出現，所以第一個愚癡造的業，對菩提心的傷害是最嚴重。

第二個是瞋恚心。這個瞋是心中火，能燒功德林，所以這個瞋心的發作，它是直接傷到我們的大悲心。而菩提心的基礎是大悲心，以大悲心而引生菩提心，所以當你傷害到你的大悲心時，你的菩提心就消失了，好一點的轉成小乘的出離心，差一點的連小乘的出離心也沒有了，所以瞋心的嚴重是第二個。

第三個是貪慾心，貪慾也會遮蔽障礙菩提心的增長。

所以從成就大乘善根的角度，愚癡最重，瞋恚第二，貪慾第三。`;
