QXL.volNum = 30;
QXL.text = `
請大家打開《講義》第六十六頁。

這一科是講到持戒門。這個持戒在大乘的菩薩戒是分成三聚淨戒，前面一科是講到攝律儀戒。攝律儀戒它的所對治的是一個惡法，所以它的一個態度是斷惡；這個攝善法戒它的所觀境，所面對的是一個善法，對善法它的修學。我們看

第二個、攝善法戒

「若出家者，為折伏煩惱故，亦應遠離憒鬧，常處寂靜；修習少欲、知足、頭陀等行。乃至小罪，心生怖畏，慚愧改悔。不得輕於如來所制禁戒。」

這裡馬鳴菩薩的意思是說：前面的斷惡，修習十善業來破十惡業，這是通於出家、在家；這以下的修善，是偏重出家。那出家眾跟在家居士的差別在哪裡呢？

為折伏煩惱故。

一般的在家居士，多分就是修習福報，他的內心基本上是向外追求，積聚一點善業，做來世福報的一個根本；但是內心這些雜染的因緣，沒有辦法去調伏。但是我們出家眾不行，我們追求解脫，我們也修習善業，但更重要的是，我們要向內觀照來折伏煩惱。折伏煩惱，這當中講出兩個方法：

第一個是遠離憒鬧，常處寂靜。

這是非常重要的。就是說我們的生命中，假設你的生命只是要追求一些很粗糙的功德，你就是布施，做做慈善事業，那就罷了，你就不一定要遠離憒鬧，就在這個熱鬧的人群中打滾也就可以了。但是如果你對生命的規劃，你要成就一些比較精緻的功德，特別是達到臨終的正念，這種止觀的力量要現前，你一定要遠離憒鬧。就是這種清淨莊嚴的禪定跟智慧，一定是在寂靜的心中生起的，沒有例外的。

所以《遺教經》上說：這個憒鬧的過失，譬如大樹眾鳥集之，則有枯折之患。即使你有高深的禪定跟智慧，你一天到晚在那個地方人事往來──今天我找你、明天你找我，這樣你的禪定智慧就消失掉了。所以我們要注意：菩薩雖然有時候為了攝受眾生的緣故，也會到熱鬧的場所；但是菩薩的內心，他的心情是遠離憒鬧，好樂寂靜的，這個是重點。在寂靜中，過著少欲、知足的一個簡單朴素的生活，這是我們修習善法的一個基礎。因為你要求生活的資具愈多，你就要跟居士多多的祈求；你對眾生有所求，他對你也有所求，這樣你的精神體力就耗損在應付這些居士上。所以我們少欲、知足，能夠保存更多的精神體力來修行，當然這是前方便。

第二個是重點，修習善法最重要的就是乃至小罪，心生怖畏、慚愧改悔，產生慚愧心。

慚愧心的基礎來自於對佛法的正見，這是一種智慧。你能夠看到善業決定招感安樂的果報，罪業決定招感痛苦的果報，你自然就會崇重賢善，輕拒暴惡，對惡法就自動的排斥，對善法就盡量的讚歎。我們一般人的正見非常薄弱，就是對佛法的思惟太過少；太過少時，你內心產生罪業，這個罪業的相續心就很難斷。你今天造這個罪業，你明天也一定造這個罪業，這個罪業在你生命中不斷的累積。一個有大乘正見的人，他內心中也會出現罪業，但是他這個罪業生起時，他會產生一個嚴重的慚愧心，會產生警覺，知道這個是一個過失相。然後這個警覺心、慚愧心生起，就會帶動你內心的止觀。所以這裡是一個關鍵點，而這個止觀就能夠調伏煩惱。所以他這裡的慚愧心，就是生起大乘的正見，所有的善法以正見作根本。

第三個、攝眾生戒

當護譏嫌，不令眾生妄起過罪故。

這裡是講攝眾生戒。我們應該要具足一個出家眾美好的威儀，因為三寶的住世來自於僧寶的住世，所以我們今天僧寶的威儀，等於是代表整個三寶。我們有美好的威儀，使令眾生未生信心令生信心，已生信心令倍增長。

這是講到三聚淨戒。這三聚淨戒持戒的功德，從內在的善根來說，它能夠對治惡業、增長善業，就是我們善業強的人，內心會感到安穩，內心安穩就容易生起菩提心；從外在的福德來說，持戒能夠引生尊貴身，這尊貴身就是兩隻腳。也就是說，如果我們只有布施而不持戒，我們這個福報可能是在三惡道受用，就是只有福報但是不尊貴，在卑賤的果報裡面去受用福德。

這裡的持戒，它的一個根本精神，從大乘佛法的持戒來說，主要就是增上慚愧，就是你內心出現惡法時，你會產生一種防非止惡的警覺性。我們一般人不太可能止觀隨時現前，你內心中有止有觀的法寶，一般來說是保存在內心的種子階位。當我們惡法生起時，第一個的警覺是持戒，所以持戒是第一個關卡。就是你要先產生一個警訊，當你的心出了狀況，這個警覺性就把你內心的法寶止觀帶動出來，來調伏煩惱。假設你沒有持戒，這個止觀就沒有一個引導者，雖然你有止觀的力量來調伏煩惱，但是沒有人把這止觀調動出來，所以這個持戒，是止觀的基礎。

/KEPAN/壬三、釋忍門

這是忍辱。我們先把這個忍辱作一個定義，龍樹菩薩在《大智度論》上說：什麼叫忍辱呢？於諸境緣，內心不動。你內心跟境界接觸時，內心不動。龍樹菩薩說：這個禪定也是內心不動，忍辱也是內心不動，這兩個有什麼差別呢？龍樹菩薩說：這是粗、細的不同。禪定的不動是比較精細的，這個忍辱的不動是比較粗糙的，但是本質都是不動。好，我們看忍辱的內涵：

/VERSE/云何修行忍門？所謂應忍他人之惱，心不懷報。亦當忍於利、衰、毀、譽、稱、譏、苦、樂等法故。

這個忍辱中有兩個所緣境：第一個是生忍，第二個是法忍。

一、生忍：所謂應忍他人之惱，心不懷報。

忍辱的基本定義就是於諸緣境，內心不動。這第一個境緣就是一個有明瞭性的眾生，這個眾生對我們產生一種非理的惱害，身為一個菩薩對於這種非理的惱害，最低的標準是心不懷報。

菩薩戒的意思：身為一個菩薩，內心安住在菩薩種性，我們依止大乘信心建立的菩提心，當然有菩提心的眾生，也會起瞋心，這很正常。當菩薩遇到境界刺激時起瞋心，沒有結罪；但是你把這個瞋心累積成恨，就結罪了，所以菩薩瞋心的最低的底線是終不結恨。說你發脾氣，這是可以理解的，因為我們這個菩提心也夾雜很多煩惱，你不可以刺激他的，你刺激時起瞋心，這個菩薩就應該趕快修習止觀加以對治。而這個菩薩沒有對治，把這個瞋心轉成一個長時間的恨，乃至對方來懺悔，我們都不能接受，這樣就是結罪了。所以第一個，我們對眾生的惱害，起碼不結恨，要趕快化解自己的瞋心，這是所謂的生忍。

二、法忍：對於這個因緣所生法——世間八法的安忍：

利、衰：這個衰是逆境，我們初學者在修學佛法時，有很多很多的損耗、侵害這種逆境，我們應該安忍不動。慢慢慢慢地，你經過長時間的懺悔業障、積集資糧，這個衰境界消失了，變成了利，對於財富榮耀的境界這種順境，這時你也要安忍不動，你要告訴自己：這些路旁的小花，只是一個小資糧的境界，你追求的是無上菩提的廣大的功德，你應該繼續往前走。所以我們剛開始對於利、衰的順逆境界安忍不動，跟著我們當初的生命規劃繼續的往前走。

毀、譽：譭謗跟稱譽，這個毀、譽跟稱、譏很類似。這個毀、譽是超越之法，就是你沒有這種情況，他講得超過了，不管是好、是壞都是超過了。

稱、譏：是如實之法，你原來就是這樣，那別人也是講這樣，不管是稱讚、不管是譏嫌，這都是如實之法。前面的六個法，都是偏重在內心感受的刺激，不管是苦、不管是喜、不管是憂，總是偏重在心受。

苦、樂：是偏重在色身的感受。就是我們在修行的過程中，遇到了炎熱、寒冷等等的這樣一個環境逼迫所產生的苦受跟樂受，我們都應該安忍不動。

忍辱的功德，從內在的善根，能夠對治瞋恚成就安忍。一個人能夠安忍的心，他的一個特點在《瑜伽師地論》上說：一個人成就安忍以後，內心心無憂悔。你看有些人的心，經常感到憂愁，產生悔恨、懊惱，他修止觀就靜不下心，憂悔，這個悔箭穿心，就是他不能忍。所以我們成就忍辱，能夠心無憂悔。從外在的福德，能夠功德不失，你已經成就的功德，能夠不失掉。

龍樹菩薩說：佛陀講完布施、持戒以後，為什麼講忍辱呢？他講一個譬喻說：譬如一個大富長者，積聚很多的珍寶，他接下來要做一個倉庫，把這個珍寶加以保存下來。我們菩薩亦復如是，我們透過布施、持戒以後，積集很多很多的資糧跟善根，積集了無貪的善根，也積集了這個善業的善根，這時應該用忍辱來加以保護，否則這個善根就容易退失掉了。

佛法的忍辱，它不是強忍，它是用智慧來疏導。蕅益大師說：我們遇到逆境刺激時，有兩個觀想方法能，夠把這樣的一個負面的情緒加以疏導：

一、隨緣消舊業想：當我們內心跟這個逆境接觸時，我們可能會產生瞋恚，這是很自然的，但是你接下來要趕快觀想：這個境界會在我的生命出現，一定是我心中有這個業力，我內心沒有這個業力而招感這個果報，那佛法因果的真理就不能成立。所以我們信仰佛陀，對佛法歸依，我們相信因為我們修行的緣故，重報輕受，既然是我自己造的業，我們應該要安忍不動，這樣你就能從這個逆境中悄悄的走過去。有些人他障礙現前，他走不過去，他就是沒有智慧的觀照；有些人他就是如夢如幻一樣的走過去，不當一回事的走過去。所以我們應該要隨緣消舊業想，當然這是比較消極。

二、當善知識想：那這樣就很重要。就是說我們有些功德是在順境中成就，心平氣和時能夠禮拜、讚歎、修止修觀；但是有的功德是在逆境中成就。譬如：我們對一切眾生的寬恕、包容，而寬恕、包容是修大悲心的基礎。寬恕、包容這種功德，沒辦法在順境中成就，一定是在逆境成就。你因怨家的刺激，才能夠生起寬恕跟包容，這樣這個逆境對你來說是非常重要的，因為你的寬恕跟包容是從這裡建立起來的。

也就是說：在成佛之道，我們所面對的境界，就像我們吃飯菜一樣，酸甜苦辣一個都不能缺少。一個人在修學的過程中，你完全是順境，你這個人不吉祥，營養不良，你老是只吃某一道菜，你可能某一種功德會生起，某一種功德你就沒辦法生起。所以我們應該把逆境，當作你的善知識想，因為他對你的寬恕跟包容有增長的力量。

/KEPAN/壬四、釋進門
/KEPAN/癸一、總明精進意

這個精進的體性，在《成唯識論》的定義是說：於善惡品，修斷事中，勇悍為性。在斷惡、修善時，內心不管遇到什麼境界的刺激，他不感到畏縮，一定要把它做圓滿，這叫精進。這當中分兩科：先說明精進意它的內涵，再說明它的方法。先看精進的內涵：

/VERSE/云何修行進門？所謂於諸善事，心不懈退。立志堅強，遠離怯弱。當念過去久遠已來，虛受一切身心大苦，無有利益。是故應勤修諸功德，自利利他，速離眾苦。

法藏大師把這個精進內容分成三科：

第一個、勤勇精進——所謂於諸善事，心不懈退，勤勇精進。他精進的所緣境是善法，不管是布施、持戒、忍辱種種的善法，我們應該要不懈怠、不退縮。這菩薩對於善法應該怎麼觀想？在經論上說：一個菩薩面對種種的善法，應該是如貧得寶想。這個貧窮人去追求珍寶，他的心情是多多益善，他不會得少為足的；菩薩亦復如是，對於種種的波羅蜜，內心中心無厭足，永不懈怠，這是第一個精進。

第二個、難壞精進——立志堅強，遠離怯弱，這是難壞精進，很難破壞的精進。這裡的精進，所面對的境界是惡法。菩薩對於惡法應該怎麼觀想呢？如病得藥想。一個生重病的菩薩，他在吃藥時，不是吃一天二天，他要不斷的吃藥，這個病才能夠徹底治好。所以我們在斷惡的過程中，遇到任何的逆境決不放棄，不能有怯弱的心，一定要把它做究竟圓滿。

第三個、無足精進——當念過去久遠已來，虛受一切身心大苦，無有利益，這是無足精進，沒有滿足的精進，這裡非常重要。就是說我們在斷惡修善時，為什麼能夠勇悍呢？就是我們應該觀想：雖然我們斷惡、修善的事情是很痛苦，我們必須違背我們的習氣，去做我們不想做的事情。但是我們過去生中，在三惡道中受刀山油鍋的痛苦，比現在的痛苦更為重大。而以前的痛苦，是白白的去承受，完全沒有增上的力量；我們現在這種痛苦，對生命是有大利益，有滅惡生善、離苦得樂的利益。所以我們應該要精勤的斷惡、修諸功德，成就自利利他的事業來遠離眾苦，這個就是精進的內涵。這以下說明精進的方法：

/KEPAN/癸二、別示精進法

/VERSE/復次，若人雖行信心，以從先世來，多有重罪惡業障故，為邪魔諸鬼之所惱亂。或為世間事務，種種牽纏。或為病苦所惱。有如是等眾多障礙。是故應當勇猛精勤，晝夜六時，禮拜諸佛，誠心懺悔，勸請隨喜，迴向菩提，常不休廢。得免諸障，善根增長故。

前面是講到精進的內涵，這以下講出它的方法。若人修行信心，我們一般人，你要不修行佛法，你過去所造的罪業，就是這樣很安穩的保存在阿賴耶識中。但是你發了菩提心以後，就表示你的生命是從根本上要產生一個很大的扭轉，就是說你生命的方向要改變了，你本來是要再繼續流轉的方向，就轉成趣向無上無菩提的方向，這時你內心的障礙，就會浮現了。

從內在的業障來說，所謂的內因力，「以從先世來，多有重罪惡業障故」。就是說我們過去生，也不完全是生生世世都學習佛法的，有時候沒有遇到佛法的攝受，內心中只好跟著感覺走，就造了很多的罪業。這個罪業等到我們現在要扭轉生命時，它就會被逼迫出來了，這個是內在的因，內因。

第二段是講外緣，外感報障。前面是內有業障，這裡是外感報障。這當中有四段：

一、「為邪魔諸鬼之所惱亂」，就是有鬼神的障礙，鬼神障礙簡單的說就是冤親債主。就是說可能我們跟某一個人，過去生中結了一個很重大的惡緣，而不幸的是，這個人他到鬼神道去了。他到天上去，天上的福報很大，他也不會跟你計較；到畜生道、地獄，他也沒辦法跟你計較；到鬼神道，這個鬼神有神通，他看到你發了菩提心要出離三界，這時他來障礙你。

二、「或為世間事務，種種牽纏。」有些人內心中，就是人事的障礙特別多，人在江湖，身不由己，那這個也是過去的業障。

三、「或為病苦之所苦惱」，這身體的病痛、四大不調特別厲害，當然這裡跟殺生應該是有關係的。

總之，這些所有的障礙，都是跟罪業有關。我們修學佛法的人，第一個觀念就是莫向外求。我們遇到障礙，反求諸己，觀想這個是我自己的罪業，所以我們不去改變外境。那怎麼辦呢？應該去改造內心，勤加懺悔。

這以下講出懺悔五個法門：是故應當勇猛精勤，晝夜六時，禮拜諸佛、誠心懺悔、勸請、隨喜、迴向菩提。

一、禮拜諸佛：法藏大師說：禮拜諸佛能夠破除我們的根本障業障。我相信每一個人都有拜佛的經驗，就是我們在拜佛之前的心情，跟你拜完佛的心情有明顯的不同。就是我們拜佛之前的心，是躁動不安；但拜完佛以後，心就安定下來。這裡就是講佛力的加被，就是我們內心在念念禮拜中，念念中即眾生心，投大覺海，跟我們的本尊功德相應，所以破除罪障。

二、誠心懺悔：前面的禮敬諸佛是破除根本障；這裡的懺悔，是對治惡業障，就是以這個懺悔心來拜懺，當然持咒也是可以。

三、勸請：破除謗法之障。我們應該經常的請求善知識的住世，來弘揚佛法，來破除我們過去的譭謗正法的障礙。第四個是隨喜，破除嫉妒障。

四、隨喜：破除嫉妒障。經常觀察：十方一切諸眾生，二乘有學及無學，一切如來與菩薩，所有功德皆隨喜。就是說我們在修學善法時，我們的精神體力有限，不可能五乘的功德都去做，我們可能會選擇性的去做一些我們覺得比較重要的功德。一個修學淨土的人，他會偏重在加強達到臨終的正念，當然也要加強你的菩提心。這兩個功德成就菩提心，成就臨終的正念。但是我們對於所有的善法都要隨喜，有人蓋醫院、有人蓋寺廟，這種人天的善法我們也隨喜；有人修無常、無我，趣向偏空涅槃我們也隨喜。所有的功德我們都隨喜，來破除我們的嫉妒障。

經常這樣，常不休廢，得免諸障，善根增長故。這個精進的果報，從內在的善根對治我們的懈怠，成就勇悍的體性，養成一種勇猛強悍，不畏縮的體性。從外在的福德呢，所修功德展轉增勝。前面的忍辱，他功德成就是就著已經成就功德的保護；這個精進是就著還沒有成就的功德，要急速成就。

其實這個六度法門，我們如果詳細的觀察，這個布施、持戒跟禪定、智慧，都有它一定的體性跟修行的方法；但是這個忍辱跟精進，基本上這兩個沒有特定的方法，他只是就著把前面布施、持戒、禪定、智慧的功德加以增上。

所以印光大師說：修行人要成功的兩大因素，就是你的性格上忍人所不能忍、行人所不能行。一個人在大乘佛法修學要成功，一個是你要忍力，你要忍人所不能忍。你一個人遇到境界的刺激，你就馬上發脾氣，你絕對做不了什麼大事業，你不可能成就大功德，所以你這個安忍的力量要強，安忍不動，這是第一個。第二個你要有行力，你遇到逆境時，不管斷惡修善，不能念要他念，煩惱不能斷要他斷，這個善法不能修要他修，你要有行力。你能夠具足忍力跟行力，你在修習布施、持戒、止觀時，你就能夠成就廣大的功德，是這個意思。

/KEPAN/壬五、釋止觀門
/KEPAN/癸一、總標

前面的布施、持戒、忍辱、精進，是一個道前基礎，是約著懺悔業障、積集資糧；這裡的止觀，就正式的修習我們大乘主要的善根。這當中有三科，先看第一個總標：

/VERSE/云何修行止觀門？所言止者，謂止一切境界相，隨順奢摩他觀義故。所言觀者，謂分別因緣生滅相，隨順毘缽舍那觀義故。云何隨順？以此二義，漸漸修習，不相捨離，雙現前故。

這裡把這個止觀的體性作一個總標：

先看止。什麼叫止呢？就是「止一切境界相」。我們過去講唯識止觀時，止的定義叫做心一境性，內心安住在一個所緣境，或者是呼吸、或者佛號，專一相續的安住。但是這裡止觀的定義有所不同，它是停止一切的虛妄相，內心中，一言以蔽之，就是無住，以無住為住，我們先作這樣的一個定義，這樣就「隨順了大乘的奢摩他」。這裡無住的意思，法藏大師說：他是先觀後止，先觀察萬法唯是一心，破除對外境的執取相，這時安住在一心的真如，內心中是無住的，這裡叫做止。

「所言觀者，謂分別因緣生滅相，隨順毘缽舍那觀義故」。前面止的所觀境是真如；這裡的觀是生滅門，是對治。這是觀察因緣生滅相，就是觀察業性。從無相觀來說，是觀察這個業性本空，觀察這個業性本身是無常、無我，觀察法性本來空寂。從有相觀來說，是觀察這個因果絲毫不爽，因緣合和，業果不失。這個觀是有相觀跟無相觀來加以對治，所以它所依止的是生滅門。

「云何隨順？以此二義，漸漸修習，不相捨離，雙現前故」。最後的目標是漸漸修習，止、觀彼此不相捨離。這裡法藏大師說：前面專修止跟專修觀，只是前方便，所以叫做隨順，隨順於止跟隨順於觀；那真正的正修止觀是兩個都要現前，那是一個不可思議的境界。我們在修次第止觀時，這個止的所觀境都是有為諸法。譬如你觀察眾生法界，觀察我們的五蘊諸法，以不淨、苦、無常、無我加以訶責；或者觀察佛菩薩的功德莊嚴來當所緣境，這個是讚歎歸依。但這裡的止，是安住在無為法，無為法是止一切境界相，是安住在真如的無住法門，就叫真如三昧。這裡值得我們注意的，他是圓頓止觀。所以這個圓頓止觀的正修是止，這個觀是對治。就是我們生起障礙時，以觀加以對治。

/KEPAN/癸二、別釋
/KEPAN/子一、釋止
/KEPAN/丑一、明修相
/KEPAN/寅一、修前方便

我們先看止的部分，止中有四科，先看所修，修行的相貌。所修相中，分成三科，先看修前方便：

/VERSE/若修止者，住於靜處，端坐正意。

修習真如三昧，有三個前方便：

一、修行的處所，要閑居靜處：你剛開始要找一個寂靜的處所，就是一個山林道場，遠離干擾。

二、端坐：在修習止的一個姿勢，行住坐臥中以坐姿最為安穩，剛剛始的初學者，先以坐姿為下手方便。

三、正意：就是端正我們的心意。就是我們為什麼修真如三昧呢？不求世間名利，唯求無上菩提故，你要真正發心。這都是你在修習真如三昧之前，必須具足的前方便。

/KEPAN/寅二、正明修法

/VERSE/不依氣息，不依形色，不依於空，不依地、水、火、風，乃至不依見、聞、覺、知。一切諸想，隨念皆除。亦遣除想。以一切法，本來無想，念念不生，念念不滅。亦不得隨心外念境界，後以心除心。心若馳散，即當攝來住於正念。是正念者，當知唯心，無外境界。即復此心，亦無自相，念念不可得。

這裡，我們分成兩大段。第一大段是真如三昧的正修，第二大段是對治。先看正修，說明真如三昧的所緣境：

「不依氣息」：以小乘的止觀來說，是偏重在觀這個氣息，或者數息、或者隨息；但真如三昧它不依氣息。

「不依形色」：我們在修不淨觀時，修這個白骨，是依止形色；但是真如三昧是不依止形色。

「不依於空」：我們在修四空定時，依止虛空來當做所觀境；這裡也不依於空。

「不依地、水、火、風，乃至不依見、聞、覺、知」：意思就是說，在修真如三昧之前，你這個所緣境，是先觀察：一切境緣，唯是一心故，一切的境界都是內心所現的影像，這時安住在這一念的一心真如中，當做所緣境。這裡，智者大師說這叫做體真止。這個止，你要先觀，要體達真如以後，再安住在這個真如中。所以我們一般在次第止觀的修止，就直接修止了，不必先修觀；但是真如三昧的止是先修觀，先觀察萬法唯心，對外境的執取都消滅了，這時在清淨本然的心性中現前，就在那個地方安住。這裡是講到這個止的所緣境，這以下說明能分別的心。依止什麼心來安住呢？

「一切諸想，隨念皆除。亦遣除想。以一切法，本來無想，念念不生，念念不滅」：在真如三昧安住時，當一心真如的明瞭心現前時，你要一切諸想，隨念皆除。你內心中不能有任何的名言妄想，乃至於遣除，乃至於能遣除的這個想也要遣除。

我們說明一下：我們在對治止觀時心是有想，就是說我們假設在修習厭離法時，我們對於這種凡夫的五蘊身心，所謂的不淨、苦、無常、無我，以這種訶責的心來加以對治，產生出離。有時候我們要修歸依法時，是觀想彌陀的功德，或者是觀想彌陀的正報莊嚴、依報莊嚴，乃至觀想佛陀的名號，這時我們是讚歎歸依，這都是想。

但是這個對真如三昧來說，都是一個對治法門，他的正修是一切諸想，隨念皆除。這時內心中是一念不生，不能有任何的想，就是在那個地方安住，如此而已。為什麼這樣？以一切法，本來無想，念念不生，念念不滅。就是說，其實一切法本來是沒有妄想，那就是本來面目。

我們正念真如時，這個正念真如跟一般對治止觀有什麼不同？對治止觀的修法，從一心的角度來說，是比較表層的東西；這個一心真如等於是把心帶回家，回到我們的本來面目，觀察到本來面目時，眾生的雜染法不可得，佛的法也不可得，這本來就是這樣。所以一切法是念念不生、念念不滅，它本來就是不生不滅、不垢不淨、不增不減。

這地方我們說明一下。這個次第止觀，它的法門是對立的，所謂「時時勤拂拭，莫使惹塵埃」，你對這個法產生執著，就用破斥：你對惡法執著，用善法來破斥；你對有執著，用空來破斥。這樣是時時勤拂拭，莫使惹塵埃。但這裡的圓頓止觀，它的根本思想是「本來無一物，何處惹塵埃」，就是你已經回歸到你生命最初的原點。這個原點怎麼說呢？念念不生，念念不滅，以一切法本來無想。所以這時候你就如實安住就好了。

如實安住，《圓覺經》上說：這個圓頓止觀根本的精神，是「知妄即離，離妄即真」。當我們生起妄想時，在真如三昧中，不要管它，知道它是妄想就好。因為你知道它是妄想，就表示你已經跟它脫離了，你要知道它是妄想，表示你的心安住在真如，它自然是虛妄的，它也不能障礙你。一個人會有障礙，是心隨妄轉，這妄想本身不是障礙，是你內心隨順它，所以這裡就是知妄即離，這是關鍵點了，這是講到正修。

以下講到對治亦不得隨心外念境界，後以心除心。心若馳散，即當攝來住於正念。當我們打妄想時，真如三昧的根本思想是不加以對治，以心除心。我們生起貪慾就用不淨觀的相來對治，瞋恚用慈悲觀來對治，以心除心；但是真如三昧不是這樣，當你遇到境界時，就觀想當知唯心，無外境界，其實它是心中的影像，你也不要去管它，它自然會消失掉，即使是能念的心，它本身也是自性畢竟空寂的，這就是真如三昧。

所謂真如三昧，跟我們一般的無記不同，它是有觀照的智慧，它知道它是妄想，你不隨順它就可以了。套一句印光大師說的：心常覺照，不隨妄轉。這個不隨妄轉是真如三昧的根本精神。

這裡我們說明一下，到後面會讚歎真如三昧，說這真如三昧是一切三昧的根本。在《楞嚴經》上把這個真如三昧安立做首楞嚴王三昧，它說：你一個人經常安住在真如三昧有什麼好處？你經常能夠把心帶回家，攝用歸體，安住在真如三昧，你慢慢慢慢的從真如三昧出來時，你的心情跟以前會完全不同，就是再來觀世間，猶如夢中事，這時候你內心中，不管是要調伏煩惱、滅除罪障，或者要修習廣大的善法，你會覺得很容易。有些人他惡法出現時要斷很困難，有些人他生起一個功德也很困難，就是因為你依止這個生滅心，所以斷惡、修善、度眾生就障礙重重。那你能夠經常觀修真如三昧的人，你斷惡、修善、度眾生，你會覺得這些都不是障礙，所以它是一切三昧的根本。後面會把這真如三昧的功德再詳細的說明。好，今天先講到這裡。後面的真如三昧，的確有一點不思議境，不思議境希望大家能稍作預習。後面的真如三昧先作預習，你在聽講時就容易進入狀況。

我們回答三個問題。

【學員提問】法師上課時講到顯教大乘跟密宗金剛乘有所不同，講到金剛乘的殊勝處是依止真如門而修一切法。不知這與顯教的圓教菩薩所修的無作四諦或者稱性六度有何不同？法師也引用蕅益大師理持念佛的方法來詮釋金剛乘，所謂自他不二的修行法。是否顯教中，也有金剛乘的觀念，只是中國祖師沒有強調出來而已？

【師父答疑】四聖諦，以天台宗的教觀來說，它是認為所有的大、小乘都是觀察四聖諦。就是我們對生命的看法，基本上就是一個流轉門跟還滅門。苦集是流轉門，滅道是還滅門。就是我們生命基本上就是兩個選擇：一個是流轉生死，一個是安住涅槃。藏、通、別的四諦法門，要以天台宗的判教，都是方便法門，就是它沒有依止一心來修四聖諦，就是心外求法。

圓教的無作四諦，說四聖諦的安立，什麼是苦？其實就是你一念心的顛倒引生出來的，所以苦集的流轉是一念迷，就是苦集流轉；一念的悟，就是滅道二諦。一念迷，生死浩然；一念悟，輪迴頓息。蕅益大師經常用迷悟來安立四聖諦，這個就是無作四諦，或者講稱性四諦，當然這種思想在金剛乘是完全一樣的。

金剛乘的思想也就是依止一心來修一切的法門。當然我們中國祖師理論上的傳承是有，我們是覺得密宗它是比較善巧，它有一定的傳承，一定的次第。但是在理論上，金剛乘的思想跟大乘的圓頓思想，根本的思想都來自於不二法門，不二法門的依止點就是一心真如，所謂的現前一念心性。

把十法界的差別相都消滅以後，就是十法界的每一個眾生都把心帶回家，這時我們看到十法界眾生有一個共同點，那就是一切法如的心性。你從這裡起修，所有的法門都是金剛乘，這個金剛乘的乘，當然就是到彼岸。我們每一個人都是帶著煩惱跟罪業在修行，但是有些人在破除煩惱跟罪業時，他特別快。三年前我看到他時，他有這種障礙，他現在過去了。有些人你看他剛出家時是這種境界，十年後還是這種境界。他也是不斷拜佛？他就是沒有找到這個乘，所以他增上的力量非常的慢。這是一個問題，一切法因緣生，他沒有找到一個快速消滅煩惱罪業的因緣，他內心中所依止的法，是一個比較緩慢的法門。當然這個也是個人的根機，也不能強求，你跟他講金剛乘，他也不見得能夠接受；不能接受，那只好是為實施權，只要你能夠踏出第一步，都好。但是你要能夠相信金剛乘，套一句蕅益大師說的話，那是日劫相倍。

我們今天從一個實際的角度說臨終的正念，如果諸位有志於來生求生淨土，你應該很清楚，臨終的正念是關鍵。求生淨土不是說你有多大的善業力，重點是你想辦法跟彌陀感應道交，因此印光大師再三強調：你要往生淨土，是彌陀本願力的攝受。你如果不仰仗佛力，不要說凡夫不能去，連阿羅漢都去不得。阿羅漢的神通力，不要說一般的阿羅漢，就是具足三明、六通、八解脫的大阿羅漢舍利弗，他的神通也只有一個三千大千世界，而這個極樂世界有十萬億個三千大千世界！所以我們生求生淨土，是來自於臨終的正念現前。當然你正念要現前，煩惱會障礙你、你的無始罪業也會障礙你、老病死也會障礙你，這三個法都是跟正念相違背。

為什麼有些人在臨終正念現前時，煩惱不能障礙他，罪業也不能障礙他？色身在家護病房，插滿了管子，這個老病死的臭皮囊也不能障礙他？這裡諸位想一想，有些人會是障礙，有些人不是障礙，這裡就是千差萬別。就是你那個法寶，法寶力量有薄弱的問題。所以我們經常的聽聞佛法，你在滅惡生善時，你會有方便力。所以智者大師為什麼要判教說藏、通、別、圓，這不是智者大師多事，而是佛陀的法門在操作中，的確有快慢的不同，真的是有它的差別。你用這個法門來修，跟他用這個法門來修，當然我們說目標是一樣，但是過程的確有快慢不同。這裡我們也應該清楚，的確是有圓頓跟次第的差別，所以祖師才要判教。當然金剛乘是圓教的法門，我發覺密宗的菩薩有大善巧，他們能夠講出一個比較好的名詞，安排出一個明確的次第。

【學員提問】法師曾於課堂中講到本論的修學法要，第一個是觀照內心。依止觀照力，達到觀照內心。

【師父答疑】我們前面說過，這個觀照力主要是成就大乘正信。因為大乘的信心是依止大乘的正見。依止一心、二門、三大的思想，由觀照力產生菩提心，生起直心，生起大悲心。這個菩提心以後，就產生所謂的行動，修習悟門。【學員提問】又提到以我空、法空來消滅執取，再直下承當。不知修習我空、法空是屬於上面何等階位？

【師父答疑】修習我空、法空的這個我空、法空，當然是屬於觀照力，就是我們在正念真如時，這後面會說。你在真如門時，你有時候很容易就能夠安住在一心真如，內心不偏空，也不著有。只是知道這一切法都是如夢如幻，知道而已。但是有時候會有困難，就是你對某一個人、或對某一件事，你會覺得這個影像經常出現，揮之不去。就是說我們一個人能夠修真如三昧以後，你馬上會發覺你對某一個東西特別執著，就是說他內心中的影像，出現的次數特別多，甚至於已經干擾你安住真如，你的心隨這個境界的出現，已經開始躁動了，這時你可能要對治了，這時修我空觀、法空觀，觀察一切法自性不生，以不住生死故，用空觀來破除。觀察你心中所出現的影像是因緣所生法，它沒有一個真實的體性。

所以這個我空觀、法空觀是在修真如門中的一個對治。或者，有些人實在偏空太厲害了，這時候觀察一切法因緣和合，業果不失。所以這個我空觀、法空觀是在正念真如的一個對治，當然你對治完了以後，你繼續的又回歸到安住於一心真如，只是知道妄想就可以。

【學員提問】兩者的修習次第，彼此的關係是先肯定，還是先否定？

【師父答疑】一般人都是先修空觀再假觀。因為我們的執著比較重，剛開始都是否定以後再肯定。當然從對治的角度，你也可以看因緣，就是我這時好像內心比較沉默，你也可以修肯定法門，思惟如來藏具足無漏性功德故，我們只要努力的修學，我們能夠成就諸佛的功德，修習這個假觀。如果我們今天對一切法的執著比較重，我們可以修空觀。這個是看個人的因緣來決定。

【學員提問】法師曾提到佛法是心念跟業力的修學，平日除了斷惡修善之餘，更應時常觀照我們的真如。古人說修行人要常帶三分病，面對大小的病魔，是否也應該勤加懺悔，求佛力加被，來善觀病痛之源，取代世間醫藥？這個病痛的因緣，應該如何正確觀察處理？

【師父答疑】這個病痛是難免的，我們是從一個煩惱障、業障、報障的身體來修行。當然病痛，智者大師的意思是說：你有時候真的該吃藥，也是應該吃藥。這病痛有三種因素：有時候是鬼神障，那就要持咒；有時候是業障引生的，那就要拜懺；有時候也不是鬼神障、也不是業障，是四大不調，是風病、熱病，那你就應該用藥物來調治。

不過蕅益大師對病痛，倒是有比較正面的看法，他在《靈峰宗論》上說：病是吾輩良藥，為什麼呢？

第一個，能夠消盡塵寰妄想。我們一個身體健康的人，很容易打很多妄想，對生命有很多很多的規劃，這很難生起出離心。你有病痛的折磨，你能夠專心的念佛，這個人念佛妄想會比較少一點。身體健康的人念佛妄想會比較多。就是這個病痛，你能夠如實觀察，有調伏妄想的力量。

第二個，覷破此身虛幻。我們身體健康的人，對色身會產生執取，你看修習外道法的人，身見特別重，他臨終要把這個色身放下很難。一個有病痛的人，你臨終時，要把這個色身放下，你會覺得這是解脫。這個衣服實在破舊的太嚴重，把它脫掉就比較容易；你這個衣服穿的漂漂亮亮的，你要脫掉就有困難。所以覷破此生虛妄。

第三個深明苦、空、無常、無我觀門。前面是破惡，破除妄想，破除身見，第三個是增長你無常、無我的觀照，皆賴有病境耳。就是有這個病痛，你能夠減少妄想，看破此身的虛幻，增加你苦、空、無常、無我的觀照智慧。

這樣講的話，病痛就是你的善知識。你要沒有病痛的刺激，你在佛堂中要產生這三種功德：調伏妄想、減少身見、增加無常、無我的智慧，你還要花很多的時間。現在有病痛刺激你，你一下子就成就這三種功德，這個病痛對你就有很大的加持力、善知識。`;
