createGP('明心', CAT_ELSE)
.setLayout(`
〇〇〇〇若信邪倒知見，起惑造業〇〇〇〇〇〇〇〇〇則成三塗苦果〇〇〇〇〇〇〇〇/ail|有情眾生五種種性，/
明〇〇〇若於世間因果起信〇〇〇〇〇〇〇〇〇〇〇〇則成人天、色、無色界樂果〇〇/ail|約生滅門而立。/
心〇〇〇若於四諦，十二因緣起信〇〇〇〇〇〇〇〇〇則成二乘出世法門〇〇〇〇〇〇/ail|種性就是你的知見。/
〇〇〇〇若於六度，四攝起信〇〇〇〇〇〇〇〇〇〇〇則成菩薩自利利他法門〇〇〇〇/ail|知見生好樂、行動，/
〇〇〇〇若於介爾心性，不可思議，絕待大乘起信〇〇則成無上圓頓法門〇〇〇〇〇〇/ail|從而決定你的生命。/`)
.XFT(1,[2,3],0,0.5)
.FO(2,1,5).L([3,1],"%r0.875").L([3,5],"%r0.875")
.FO(2.75,2,4,3)
.L([24,1],"%l8")
.L([24,2],"%l11")
.L([24,3],"%l8")
.L([24,4],"%l10")
.L([24,5],"%l1")
.GROUPR(37,0.75,5.25)
;

createGP('淨心', CAT_ELSE)
.setLayout(`
〇〇〇一、理即起信〇〇雖復不信自心大乘妙理，起惑造業，而信心之性，未曾稍減，如水成冰，濕性不改。
〇〇〇二、名字起信〇〇若聞此論，能知現前介爾心性即是大乘，直下承當，不復疑惑，如知冰即水。〇〇〇〇〇/ail|六/
淨〇〇三、觀行起信〇〇若能念念觀此心性，知其念即無念，不起無明諸顛倒惑。〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|即/
心〇〇四、相似起信〇〇若任運消除粗染，淨於六根。〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|佛/
〇〇〇五、分證起信〇〇若入正位，從淨心地乃至菩薩究竟地。
〇〇〇六、究竟起信〇〇若超過菩薩地，微細分別，究竟永盡，心性根本，常住現前。`)
.FO(2,1,6,6)
.L([9.75,1],"%r1.25")
.L([9.75,2],"%r1.25")
.L([9.75,3],"%r1.25")
.L([9.75,4],"%r1.25")
.L([9.75,5],"%r1.25")
.L([9.75,6],"%r1.25")
.GROUPR(49,1,6)
.XFT(51,[2,3,4],0,0.5)
;

createGP('起信', CAT_ELSE)
.setWidth(49)
.setLayout(`
〇〇〇〇信者，於諸善心所最為上首。
〇〇〇〇謂於實德能，深忍樂欲，心淨為性，對治不信，樂善為業。
起
信〇〇〇信根本〇〇樂念真如法故。〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|內因力/
〇〇〇〇信佛〇〇〇信佛具無邊功德，常樂禮敬供養；聞法修行，迴向一切智故。
〇〇〇〇信法〇〇〇信法有大利益，常樂修行諸波羅蜜故。〇〇〇〇〇〇〇〇〇〇〇〇/ail|外緣力/
〇〇〇〇信僧〇〇〇謂常樂供養諸菩薩眾，正修自利利他故。`)
.XFT(1,[2,3],0,-0.725)
.FO(2,1,5.5).L([3,1], "%r0.75")
.FO(2.75,4,7,4)
.L([9,4], "%l1.25")
.L([9,5], "%l2.25")
.L([9,6], "%l2.25")
.L([9,7], "%l2.25")
.FI(36.5,5,7)
.L([37.5,4],"%l21")
.T(43,4,'/ail|兩者和合，方能/')
.T(43,5,'/ail|生起大乘的功德，/')
.T(43,6,'/ail|即所謂起信。/')
.GROUPR(41.25,4,6)
;

createGP('釋大乘', CAT_ELSE)
.setStyle(AIL)
.setLayout(`
〇〇〇〇大〇〇言大者，絕待無外，強名曰大。
〇〇〇〇〇〇〇即是指眾生介爾心性，法爾具足體大、相大、用大三種義故。
〇〇〇〇〇〇〇如此三大，不一不異，不可思議，唯是一心，故言大也。
釋〇〇〇乘〇〇乘以運載為義，即是直指眾生現前介爾心性，
大〇〇〇〇〇〇法爾運載至於佛地，自利利他，無休息故，名為乘也。
乘
〇〇〇〇〇〇〇一、體大〇〇只此現前介爾之心，隨緣不變，全體真如，名為體大。
〇〇〇〇合〇〇〇〇〇〇〇〇〇/ail|▸所謂的體大，重在清淨，從我空、法空觀當中，消滅自我意識，達成滅惡的功能。/
〇〇〇〇釋〇〇二、相大〇〇只此全妄即真體中，本具恆沙稱性功德，在凡不滅，在聖不增，名為相大。
〇〇〇〇大〇〇〇〇〇〇〇〇〇/ail|▸清淨本性具足無量無邊的稱性功德，本性善良，所以修戒定慧等善業乃本性使然。/
〇〇〇〇乘〇〇三、用大〇〇只此心性體相，不變隨緣，出生十界染淨因果，達此緣生無性，
〇〇〇〇〇〇〇〇〇〇〇〇〇便能翻染成淨，名為用大。
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|▸翻染成淨，讓我們清淨本性如實表達出來，就是所謂用大。/`)
.XFT(1,[4,5,6],0,0.75)
.FO(2,2.5,9).L([3,9],"%r1")
.FO(3,1,4).L([5.75,1],"%r1.25").L([5.75,4],"%r1.25")
.L([11.75,7],"%r1.25")
.L([11.75,9],"%r1.25")
.L([11.75,11],"%r1.25")
.FO(6,7,11,3)
.XFT(5,[8,9,10,11],0,-0.5)
;
