new MyBookInfo('佛說阿彌陀佛根本祕密神呪經•增插部分')
.set('paraPrefix', '')
.addContent(
`
　「又舍利弗，阿彌陀佛有根本祕密陀羅尼神呪，是名『拔一切業障根本得生極樂淨土神呪』。即說呪曰：

　　南無阿彌多婆夜　哆他伽跢夜　哆地夜他　阿彌利都婆毗　阿彌利哆　悉耽婆毗　阿彌利哆　毗迦蘭諦　阿彌利哆　毗迦蘭哆　伽彌膩　伽伽那　枳多迦隸　莎婆訶

　　佛言：「若有善男子善女人，能誦此呪者，阿彌陀佛常住其頂，日夜擁護，無令怨家而得其便，現世常得安穩，臨命終時任運往生極樂國土。

　「又舍利弗，阿彌陀佛名號，/
具足無量無邊、/
　　不可思議甚深祕密，/
　　殊勝微妙無上功德。/
所以者何？阿彌陀佛三字中，/
有　十方三世一切諸佛，/
　　一切諸菩薩，聲聞，阿羅漢，/
　　一切諸經陀羅尼神呪，無量行法。/
是故，彼佛名號/
　　即是為無上真實至極大乘之法，/
　　即是為無上殊勝清淨了義妙行，/
　　即是為無上最勝微妙陀羅尼。」/
而說偈曰：

#　　阿字十方三世佛　彌字一切諸菩薩/
#　　陀字八萬諸聖教　三字之中是具足

　　舍利弗，若有眾生，聞說阿彌陀佛不可思議功德，歡喜踊躍，至心稱念，深信不懈，於現在身，受無比樂，或轉貧賤獲得富貴，或得果免宿業所追病患之苦，或轉短命得壽延長，或怨家變恨，得子孫繁榮，身心安樂，如意滿足。如是功德不可稱計。
`
);
