var prevVol;
function ch(vol, num, ttl, isLocal) {
  var len = 13 - new Astral(ttl).getLength();
  for (; len > 0; --len) ttl += '　';
  var zn = zNumber(num);
  if (zn.length <= 1) zn += '　';
  var ret = `<a href="?vol=${vol}&loc=a${to2d(num)}">${ttl}第${zn}</a>`;
  if (vol == prevVol) vol = '/L/　　　';
  else { prevVol = vol; vol = `/L/<a href="?vol=${vol}">卷${znum(vol)}</a>　`; }
  return isLocal ? `${vol}${ret}<ail>（本闕）</ail>` : `${vol}${ret}`;
}

SC.volNum = 0;
SC.text = `
${COL_START}
${ch(1,  1, '釋迦始祖劫初剎利相承姓緣譜')}
${ch(1,  2, '釋迦始祖劫初姓瞿曇緣譜')}
${ch(1,  3, '釋迦六世祖始姓釋迦氏緣譜')}
${ch(1,  4, '釋迦降生釋種成佛緣譜')}
${ch(1,  5, '釋迦在七佛末種姓眾數同異譜')}
${ch(1,  6, '釋迦同三千佛緣譜')}
${ch(1,  7, '釋迦內外族姓名譜')}
${ch(1,  8, '釋迦弟子姓釋緣譜')}
${ch(1,  9, '釋迦四部名聞弟子譜')}
${ch(2, 10, '釋迦從弟調達出家緣記', true)}
${ch(2, 11, '釋迦從弟阿那律跋提出家記', true)}
${ch(2, 12, '釋迦從弟孫陀羅難陀出家緣', true)}
${ch(2, 13, '釋迦子羅云出家緣記', true)}
${ch(2, 14, '釋迦姨母大愛道出家記')}
${ch(2, 15, '釋迦父淨飯王泥洹記')}
${ch(2, 16, '釋迦母摩耶夫人記')}
${ch(2, 17, '釋迦姨母大愛道泥洹緣')}
${ch(2, 18, '釋迦滅宿業緣記')}
${COL_DIV30}
${ch(3, 19, '釋迦竹園精舍緣記')}
${ch(3, 20, '釋迦祇洹精舍緣記')}
${ch(3, 21, '釋迦髮爪塔緣記')}
${ch(3, 22, '釋迦天上四塔記')}
${ch(3, 23, '優填王造釋迦栴檀像記')}
${ch(3, 24, '波斯匿王造釋迦金像記')}
${ch(3, 25, '阿育王弟出家造釋迦石像記')}
${ch(3, 26, '釋迦留影在石室記')}
${ch(4, 27, '釋迦雙樹般涅槃記')}
${ch(4, 28, '釋迦八國分舍利記')}
${ch(4, 29, '釋迦天上龍宮舍利寶塔記')}
${ch(4, 30, '釋迦龍宮佛𣯃塔記')}
${ch(5, 31, '阿育王造八萬四千塔記')}
${ch(5, 32, '釋迦獲八萬四千塔宿緣記')}
${ch(5, 33, '釋迦法滅盡緣記')}
${ch(5, 34, '釋迦法滅盡相記')}

/L/　　　<a href="?vol=1">序</a><ail>　(第一卷首)</ail>
${COL_END}`;
