const kepan = 
`// 
　　    （甲）初，序分*
//
// 序分分二。
//   初、通序，諸經皆有故。亦名證信序，有此五事，人方信故。亦名經前序，諸經初標故。又名經後序，集家安立故。
//   二、爾時十方下，別序，別在此經故。亦名發起序，發起正說故。
//
　　    　：　（乙）初，通序*
　　    　：　　：　（丙）初，舉五事證信+
　　A001　：　　：　　：　（丁）初，所聞法體
　　A002　：　　：　　：　　：　次，能聞之人
　　A003　：　　：　　：　　：　三，聞持之時
　　A004　：　　：　　：　　：　四，佛及住處
　　A005　：　　：　　：　次，點三月所為+
　　    　：　　：　次，別序*
　　    　：　　：　（丙）初，果因集讚序+
　　A006　：　　：　　：　（丁）初，同來集會
　　    　：　　：　　：　　：　次，共申讚歎
　　A007　：　　：　　：　　：　（戊）初，同歎釋迦難事
　　A008　：　　：　　：　　：　　：　次，各遣侍者問訊
　　    　：　　：　　：　次，現相集眾序+
　　    　：　　：　　：　（丁）初，現瑞
　　    　：　　：　　：　　：　（戊）初，放光明雲
　　A009　：　　：　　：　　：　　：　（己）初，總示
　　A010　：　　：　　：　　：　　：　　：　次，別明
　　    　：　　：　　：　　：　　：　次，出微妙音
　　A011　：　　：　　：　　：　　：　（己）初，結前起後
　　A012　：　　：　　：　　：　　：　　：　次，正明眾音
　　    　：　　：　　：　　：　次，集眾
　　A013　：　　：　　：　　：　（戊）初，結前起後
　　    　：　　：　　：　　：　　：　次，正集大眾
　　    　：　　：　　：　　：　　：　（己）初，天龍等眾
　　    　：　　：　　：　　：　　：　　：　（庚）初，別列三界天眾
　　A014　：　　：　　：　　：　　：　　：　　：　（辛）初，六欲天
　　A015　：　　：　　：　　：　　：　　：　　：　　：　次，色界天
　　A016　：　　：　　：　　：　　：　　：　　：　　：　三，無色天
　　A017　：　　：　　：　　：　　：　　：　　：　次，總指八部等眾
　　A018　：　　：　　：　　：　　：　　：　次，一切神眾
　　A019　：　　：　　：　　：　　：　　：　三，大鬼王眾
　　    　：　　：　　：　三，問答釋疑序+
　　    　：　　：　　：　（丁）初，略問答以發起
　　    　：　　：　　：　　：　（戊）初，問答所集眾數
　　A020　：　　：　　：　　：　　：　（己）初，如來以眾數問
　　A021　：　　：　　：　　：　　：　　：　次，文殊以神力答
　　A022　：　　：　　：　　：　　：　　：　三，世尊以佛眼證
　　A023　：　　：　　：　　：　　：　次，點示能度本尊
　　    　：　　：　　：　　：　次，廣問答以發起
　　    　：　　：　　：　　：　（戊）初，初文殊設疑問因地
　　    　：　　：　　：　　：　　：　（己）初，先設詞興問
　　A024　：　　：　　：　　：　　：　　：　（庚）初，明己智信
　　A025　：　　：　　：　　：　　：　　：　　：　次，舉眾疑謗
　　A026　：　　：　　：　　：　　：　　：　次，願說行願
　　    　：　　：　　：　　：　　：　次，世尊舉因答度人
　　    　：　　：　　：　　：　　：　（己）初，略讚功德+
　　    　：　　：　　：　　：　　：　　：　（庚）初，明大小果位功德
　　A027　：　　：　　：　　：　　：　　：　　：　（辛）初，舉喻
　　A028　：　　：　　：　　：　　：　　：　　：　　：　次，正明
　　A029　：　　：　　：　　：　　：　　：　　：　　：　三，結顯
　　A030　：　　：　　：　　：　　：　　：　　：　次，示聞讚供像功德
　　    　：　　：　　：　　：　　：　　：　次，廣說行願+
　　    　：　　：　　：　　：　　：　　：　（庚）初，明長者求佛相好+
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，騰昔見佛發願
　　A031　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，敘遠劫佛號
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正問因發願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，問得相之因
　　A032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，長者問佛
　　A033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，佛示長者
　　A034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，發度生之願
　　A035　：　　：　　：　　：　　：　　：　　：　　：　次，示今因位度生
　　    　：　　：　　：　　：　　：　　：　　：　次，示聖女憶母感佛+
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，騰昔行願
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，舉所行因事
　　A036　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，舉佛號劫壽
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述聖女因行
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述生前勸母正見
　　A037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，明聖女福厚
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明邪母罪重
　　A038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，聖女方便勸母
　　A039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，邪母罪重墮苦
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述死後憶母生界
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，賣宅興供，感空聲慰諭
　　A040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，為母賣宅興供
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，見像默念空示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，見佛興疑
　　A041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，見佛禮敬
　　A042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，私念疑情
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，空聲示處
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，泣戀聞聲
　　A043　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（己）初，空聲慰諭
　　A044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，問空何神
　　A045　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，空聲告示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，聞聲自撲
　　A046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（己）初，求說母生界
　　A047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示返舍念佛
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，受教念佛，夢鬼王指示
　　A048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，歸舍憶母念佛
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，到獄知母生處
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，身到獄海
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，見獄海惡相
　　A049　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（己）初，惡獸飛馳食噉
　　A050　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，夜叉形異畏視
　　A051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，念佛力無懼
　　A052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，鬼王迎讚
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，問答獄處
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，通問地獄有無
　　A053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（己）初，略問答
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣問答
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，問答地獄有無
　　A054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，問答獄事實不
　　A055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，問答我何到獄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，問答獄海苦境
　　A056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（申）初，約境疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，據事直答
　　A057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（酉）初，正答
　　A058　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指類
　　A059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結名
　　A060　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，問答地獄何在
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正問我母生界
　　A061　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（己）初，聖女問母生趣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，鬼王徵其來歷
　　A062　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，問答行業
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，問答姓氏
　　A063　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答
　　A064　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（申）初，聖女直答姓氏
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，鬼王委說生天
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（酉）初，正說其由
　　A065　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（戌）初，願聖者返本
　　A066　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明罪女生天
　　A067　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，示同罪受樂
　　A068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，言畢而退
　　A069　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯所發弘願
　　A070　：　　：　　：　　：　　：　　：　　：　　：　次，結會古今
//
　　    　：　次，正說分*
//
// 正說分為四段。
//   初、分身集會一品，明能化主；
//   二、業緣、業感、問獄三品，明所化機；
//   三、如來讚歎、利益存亡、閻羅讚歎三品，明度脫緣；
//   四、稱佛、較施兩品，明成佛因。
//
　　    　：　（乙）初，明能化主*
　　    　：　　：　（丙）初，品題
　　    　：　　：　　：　次，品文
　　    　：　　：　　：　（丁）初，地藏來儀+
　　B001　：　　：　　：　　：　（戊）初，敘分身地藏
　　    　：　　：　　：　　：　　：　次，敘業道眾機
　　B002　：　　：　　：　　：　　：　（己）初，率眾同來供佛
　　B003　：　　：　　：　　：　　：　　：　次，因化不退菩提
　　B004　：　　：　　：　　：　　：　　：　三，至天心喜觀佛
　　    　：　　：　　：　　：　次，釋迦詔告+
　　    　：　　：　　：　　：　　：　（己）初，如來摩頂付囑+
　　B005　：　　：　　：　　：　　：　　：　（庚）初，經家敘通
　　    　：　　：　　：　　：　　：　　：　　：　次，發言付囑
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，明已所化眾
　　B006　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，總示化門調機
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明分身度脫
　　B007　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，略明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣示
　　B008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，結前起後
　　B009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，普現色身
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，付囑未調眾
　　B010　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，勅觀累劫度生
　　B011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，令憶天宮付囑
　　    　：　　：　　：　　：　　：　　：　次，地藏合身領教+
　　    　：　　：　　：　　：　　：　　：　（庚）初，地藏正領
　　B012　：　　：　　：　　：　　：　　：　　：　（辛）初，敘合身宗本
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，申化事受旨
　　B013　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，佛引使獲通慧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，化身沙界利生
　　B014　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，分身度人
　　B015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，小善獲利
　　B016　：　　：　　：　　：　　：　　：　　：　　：　三，慰世尊勿慮
　　B017　：　　：　　：　　：　　：　　：　　：　次，如來讚喜
　　    　：　　：　次，明所化機*
　　    　：　　：　（丙）初，示業緣差別*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　C001　：　　：　　：　　：　（戊）初，聖母啟問+
　　    　：　　：　　：　　：　　：　次，地藏敬答+
　　C002　：　　：　　：　　：　　：　（己）初，通示諸界業緣+
　　    　：　　：　　：　　：　　：　　：　次，的示閻浮惡趣+
　　C003　：　　：　　：　　：　　：　　：　（庚）初，聖母重白
　　    　：　　：　　：　　：　　：　　：　　：　次，地藏載答
　　C004　：　　：　　：　　：　　：　　：　　：　（辛）初，彼此謙恭
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，答明罪報
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，地藏詳示
　　C005　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，正答閻浮罪報+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，別明罪報
　　C006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，不孝二親
　　C007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，不敬三寶
　　C008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，侵損婬污
　　C009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，破戒誑人
　　C010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，偷常住物
　　C011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結顯墮苦
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，重問無間獄名+
　　C012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，聖母問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，地藏釋
　　C013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總示諸獄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明無間
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正明業報+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，正明
　　C014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，示獄城出名
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明獄相顯報+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，示相
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，示
　　C015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，獄火相
　　C016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，獄牀相
　　C017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯報
　　C018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，標
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋
　　C019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，夜叉惡鬼報苦
　　C020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，銕鷹蛇報苦
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結
　　C021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，生死萬千
　　C022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，苦報億劫
　　C023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，重示業感+
　　C024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，標舉
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，徵釋
　　C025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋
　　C026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，時無間+
　　C027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，形無間+
　　C028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，苦無間+
　　C029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，果無間+
　　C030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，命無間+
　　C031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，廣說不盡
　　C032　：　　：　　：　　：　　：　　：　　：　　：　　：　次，聖母禮退
　　    　：　　：　　：　次，示業感差別*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，地藏重述付囑+
　　    　：　　：　　：　　：　　：　（己）初，大士述事
　　    　：　　：　　：　　：　　：　　：　（庚）初，述
　　D001　：　　：　　：　　：　　：　　：　　：　（辛）初，昔承佛力分化
　　D002　：　　：　　：　　：　　：　　：　　：　　：　次，今蒙佛囑度生
　　D003　：　　：　　：　　：　　：　　：　　：　次，慰
　　    　：　　：　　：　　：　　：　　：　次，如來示意+
　　    　：　　：　　：　　：　　：　　：　（庚）初，生性無定
　　D004　：　　：　　：　　：　　：　　：　　：　（辛）初，法示
　　D005　：　　：　　：　　：　　：　　：　　：　　：　次，喻顯
　　D006　：　　：　　：　　：　　：　　：　　：　　：　三，合明
　　D007　：　　：　　：　　：　　：　　：　　：　次，汝願度罪
　　    　：　　：　　：　　：　　：　次，當機正問誓願
　　    　：　　：　　：　　：　　：　（己）初，自在問累劫發何願+
　　D008　：　　：　　：　　：　　：　　：　（庚）初，以地藏各發何願問
　　    　：　　：　　：　　：　　：　　：　　：　次，約眾生業感發心答
　　D009　：　　：　　：　　：　　：　　：　　：　（辛）初，誡聽許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，騰昔願事
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，正明昔願利益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，述昔誓願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，小國王所發願+
　　D010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，述王佛劫號
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，騰昔王願事
　　D011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，敘二王友善
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述二王發願
　　D012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，出願本
　　D013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正發願
　　D014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結二王今古
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，光目女所發願+
　　D015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，述佛號劫壽
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，騰羅漢度生
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，敘昔願事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，罪母墮苦
　　D016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，舉能度羅漢
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述所遇孝女
　　D017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，出名
　　D018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，問願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，白事
　　D019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，孝女陳事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，羅漢入定
　　D020　：　（未）初，　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，述定中見母
　　    　：　　：　次，　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述出定問答
　　D021　：　　：　（申）初，問行業
　　    　：　　：　　：　次，答所習
　　D022　：　　：　　：　（酉）初，述事求救
　　    　：　　：　　：　　：　次，方便度脫
　　D023　：　　：　　：　　：　（戌）初，念佛塑像
　　D024　：　　：　　：　　：　　：　次，畵像供禮
　　    　：　　：　　：　　：　　：　三，夜夢見佛
　　    　：　　：　　：　　：　　：　（亥）初，孝女見佛告語
　　D025　：　　：　　：　　：　　：　　：　（東）初，女見勝相
　　D026　：　　：　　：　　：　　：　　：　　：　次，佛告生處
　　    　：　　：　　：　　：　　：　　：　次，罪母托生婢家
　　D027　：　　：　　：　　：　　：　　：　（東）初，生後求救
　　    　：　　：　　：　　：　　：　　：　　：　次，審問業行
　　    　：　　：　　：　　：　　：　　：　　：　（南）初，初正問本罪
　　D028　：　　：　　：　　：　　：　　：　　：　　：　（西）初，以作何行業徵
　　D029　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以殺罵受報答
　　D030　：　　：　　：　　：　　：　　：　　：　　：　次，轉徵獄報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，孝女發願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，光目聞苦為母發願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，泣向空界，陳母苦報
　　D031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，願脫現生報
　　D032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，願脫後生報
　　D033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，願對本佛發我誓心
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，空佛感孝讚願告生
　　D034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，印證前願
　　D035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，告轉後報
　　D036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結會古今
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示今利益
　　D037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，結指大願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，讚勸歸敬
　　D038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，惡者歸敬脫報
　　D039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，志心奉事受福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結顯神力通經
　　D040　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，如來結顯。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，當機承命
　　D041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，慰佛通經
　　D042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，白已敬退
　　D042　：　　：　　：　　：　　：　　：　次，天王問何更立誓願+
　　    　：　　：　　：　　：　　：　　：　（庚）初，天王躡前疑問
　　D043　：　　：　　：　　：　　：　　：　　：　（辛）初，經家敘儀
　　D044　：　　：　　：　　：　　：　　：　　：　　：　次，天王述疑
　　D045　：　　：　　：　　：　　：　　：　　：　　：　三，願佛為說
　　    　：　　：　　：　　：　　：　　：　　：　次，如來為後答釋
　　D046　：　　：　　：　　：　　：　　：　　：　（辛）初，讚許
　　D047　：　　：　　：　　：　　：　　：　　：　　：　次，願聞
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，正告
　　D048　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，略示重發願意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣明隨機說法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明大士度脫
　　D049　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，總示方便
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明說法
　　D050　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正明隨機說化
　　D056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結示業感差別
　　D057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸天王擁護
　　D058　：　　：　　：　　：　　：　　：　　：　三，天王聞已悲退
　　    　：　　：　　：　三，示業報差別*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　E001　：　　：　　：　　：　（戊）初，普賢請說+
　　    　：　　：　　：　　：　　：　次，地藏承答+
　　E002　：　　：　　：　　：　　：　（己）初，謙恭許說
　　    　：　　：　　：　　：　　：　　：　次，答釋獄報
　　    　：　　：　　：　　：　　：　　：　（庚）初，答地獄名號+
　　E003　：　　：　　：　　：　　：　　：　　：　（辛）初，總示獄處
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別開獄名
　　E004　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，正主地獄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，眷屬等獄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，獄數無限
　　E005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，列名
　　E006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指廣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，獄名不同
　　E007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，列名
　　E008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指廣
　　    　：　　：　　：　　：　　：　　：　　：　次，答罪報惡事+
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，正示惡業感報
　　E009　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，標示業感
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋業力大
　　E010　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正舉
　　E011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，誡勸
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，願仁聽言
　　E012　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，地藏勸聽
　　E013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，普賢釋意
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別明獄報差別
　　E014　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，總示
　　E015　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明
　　E016　：　　：　　：　　：　　：　　：　　：　　：　三，結顯業感苦器
　　E017　：　　：　　：　　：　　：　　：　三，結示指廣
　　    　：　　：　三，明度脫緣*
　　    　：　　：　（丙）初，化主放光讚歎*
　　    　：　　：　　：　（丁）初，世尊讚歎功德*
　　    　：　　：　　：　　：　（戊）初，品題
　　    　：　　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　　：　（己）初，如來歎慈悲事+
　　F001　：　　：　　：　　：　　：　　：　（庚）初，敘光聲稱歎
　　F002　：　　：　　：　　：　　：　　：　　：　次，令方便護經
　　    　：　　：　　：　　：　　：　　：　次，普廣請利益事
　　F003　：　　：　　：　　：　　：　　：　（庚）初，當機請說
　　    　：　　：　　：　　：　　：　　：　　：　次，世尊垂答
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，如來正答
　　F004　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，誡聽許說
　　F005　：　　：　　：　　：　　：　　：　　：　　：　　：　次，承旨願聞
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，廣明利益+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，教主說利益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，廣說利益之事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，通示聞名等益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，供養得福
　　F006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，聞名讚禮福
　　F007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，塑畵形像福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，厭女供像福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，厭女身供像轉報
　　F008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，明供像
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉報果
　　F009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，明轉女身
　　F010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，願不轉女
　　F011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結不受女
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，厭醜病禮像獲福
　　F012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，瞻禮
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉報
　　F013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，相貌圓滿
　　F014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，貴姓受生
　　F015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結成
　　F016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，伎樂讚供福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，譏毀獲報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，正示
　　F017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，示譏毀相
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯譏毀報
　　F018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，直墮阿鼻
　　F019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉生惡道
　　F020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結況
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示久病等益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，久病惡相乃至五齋誦感報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，示病中惡相
　　F021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，示相
　　F022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明修福脫罪
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，正示方軌
　　F023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，對像讀經
　　F024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，為病捨物
　　F025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，脫罪知命
　　F026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，況顯利益
　　F027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結勸修功德
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，夢寐見鬼
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，夢見惡境
　　F028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，示相
　　F029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋意
　　F030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勑遣讀經
　　F031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，存亡得益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，下賤求悔
　　F032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，標能懺人
　　F033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋所悔法
　　F034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結轉報益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，新產獲福
　　F035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，舉種類新產
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示經名利益
　　F036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，誦經念名
　　F037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，脫殃增壽
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，齋誦感報
　　F038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，標齋日之意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋讀經之益
　　F039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，舉閻浮罪狀
　　F040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示齋日讀經
　　F041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，釋現世福利
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總結威神之
　　F042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正結地藏利益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示閻浮有緣
　　F043　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，略示有緣
　　F044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣明聞益
　　F045　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，普廣請經名+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，結顯請意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正請經名
　　F046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答
　　F047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，答經名
　　F048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結流布
　　F049　：　　：　　：　　：　　：　　：　　：　　：　次，普廣禮退
　　    　：　　：　　：　　：　次，地藏利益存亡*
　　    　：　　：　　：　　：　（戊）初，品題
　　    　：　　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　　：　（己）初，地藏正明+
　　    　：　　：　　：　　：　　：　　：　（庚）初，通示眾生善退惡增+
　　G001　：　　：　　：　　：　　：　　：　　：　（辛）初，法示
　　G002　：　　：　　：　　：　　：　　：　　：　　：　次，喻顯
　　G003　：　　：　　：　　：　　：　　：　　：　　：　三，事明
　　    　：　　：　　：　　：　　：　　：　　：　次，正示習惡宜為設福+
　　G004　：　　：　　：　　：　　：　　：　　：　（辛）初，總示
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，設福存亡利益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，臨終設福
　　G005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，示意
　　G006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，設福
　　G007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，得益
　　G008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，死後造善
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，造惡亡人增罪
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，法示
　　G009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，躡前正勸
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉釋所以
　　G010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直釋
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，複疎
　　G011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，應報善者反得惡
　　G012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，應受惡者更增業
　　G013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，喻合
　　G014　：　　：　　：　　：　　：　　：　　：　三，結顯修善多少自得+
　　    　：　　：　　：　　：　　：　　：　次，大辯助顯
　　G015　：　　：　　：　　：　　：　　：　（庚）初，大辯興問+
　　    　：　　：　　：　　：　　：　　：　　：　次，地藏垂答+
　　G016　：　　：　　：　　：　　：　　：　　：　（辛）初，許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，答示
　　G017　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，示臨終聞名悉脫+
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示終後造福獲一
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，略明
　　G018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，直明終後獲一
　　G019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，反顯自修悉得
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，詳示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，示亡人望救
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，罪福未定
　　G020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，求救之意
　　G021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，求救之時
　　G022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，審定受報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸眷屬修齋
　　G023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，示營齋法
　　G024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明供養力
　　G025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結存亡利
　　G026　：　　：　　：　　：　　：　　：　　：　　：　　：　三，鬼神發心
　　G027　：　　：　　：　　：　　：　　：　　：　三，長者禮退
　　    　：　　：　　：　次，閻羅興問讚歎*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，經家敘
　　H001　：　　：　　：　　：　　：　（己）初，主伴來儀
　　H002　：　　：　　：　　：　　：　　：　次，列鬼王號
　　H003　：　　：　　：　　：　　：　　：　三，承力俱來
　　    　：　　：　　：　　：　　：　次，正興問
　　    　：　　：　　：　　：　　：　（己）初，閻羅興問正歎+
　　H004　：　　：　　：　　：　　：　　：　（庚）初，經家提起
　　H005　：　　：　　：　　：　　：　　：　　：　次，天子述意
　　H006　：　　：　　：　　：　　：　　：　　：　三，許問為說
　　    　：　　：　　：　　：　　：　　：　　：　四，申疑致請
　　H007　：　　：　　：　　：　　：　　：　　：　（辛）初，敘儀
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，申請
　　H008　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，直歎神通
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉申疑事
　　H009　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正陳疑本
　　H010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，覆申疑事
　　H011　：　　：　　：　　：　　：　　：　　：　　：　三，願說
　　    　：　　：　　：　　：　　：　　：　　：　五，答示顯德
　　H012　：　　：　　：　　：　　：　　：　　：　（辛）初，總示難化
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別歎方便
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，以法直示
　　H013　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，約地藏方便救拔
　　H014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約眾生惡習難脫
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以喻釋明
　　H015　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，迷入險道
　　H016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，知識指迷
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，迷求出路
　　H017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，迷聞退步求路
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，知識接引告語
　　H018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，接引
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，告語
　　H019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正告迷人
　　H020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，囑令轉告
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，以法合顯
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，合方便捄拔
　　H021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，直以法合
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，法喻合釋
　　H022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，合迷人入險
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合知識指迷
　　H023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，迷人自出
　　H024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉告他人
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合惡習難脫
　　H025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，喻合
　　H026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，法合
　　    　：　　：　　：　　：　　：　　：　次，鬼王護法助揚+
　　    　：　　：　　：　　：　　：　　：　（庚）初，惡毒擁護
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，鬼王護世
　　H027　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，敘己行處
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，護人修為
　　H028　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，所歷善處
　　H029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，令護惡事
　　H030　：　　：　　：　　：　　：　　：　　：　　：　次，如來讚喜
　　    　：　　：　　：　　：　　：　　：　　：　次，主命助修
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，當機白事
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，主命述意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，陳我業緣主命
　　H031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，經家敘名
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，鬼王陳事
　　H032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，陳己所主事
　　H033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明人不會意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉釋人不會意
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，禁生時殺害
　　H034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，修善得樂
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，作惡受殃
　　H035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，直示勿殺
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉釋其意
　　H036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，產時惡鬼噉血
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，我令土地荷護
　　H037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，護令安樂
　　H038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，不知設福
　　H039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結示殃損
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸死時修善
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，陳己本意
　　H040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，示善惡俱超
　　H041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明鬼神變惡
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示人不會
　　H042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，亡者神識惛昧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，眷屬當為修福
　　H043　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，多善緣離惡道苦
　　H044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，少善緣除無間罪
　　H045　：　　：　　：　　：　　：　　：　　：　　：　　：　次，世尊讚勸
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，鬼王受命
　　H046　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明已擁護
　　H047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，願生信受
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，如來發本
　　H048　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，發遠本
　　H049　：　　：　　：　　：　　：　　：　　：　　：　　：　次，記劫國
　　H050　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結度人
　　    　：　　：　四，明成佛因*
　　    　：　　：　（丙）初，示成佛正行*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　I001　：　　：　　：　　：　（戊）初，地藏為說利益+
　　    　：　　：　　：　　：　　：　次，如來許救罪苦+
　　I002　：　　：　　：　　：　　：　（己）初，敦逼速說
　　I003　：　　：　　：　　：　　：　　：　次，讚慰無憂
　　    　：　　：　　：　　：　　：　三，大士正稱佛名+
　　    　：　　：　　：　　：　　：　（己）初，稱名
　　    　：　　：　　：　　：　　：　　：　（庚）初，別出十名自為十一
　　I004　：　　：　　：　　：　　：　　：　　：　（辛）初，無邊身佛
　　I005　：　　：　　：　　：　　：　　：　　：　　：　次，寶性如來
　　I006　：　　：　　：　　：　　：　　：　　：　　：　三，波頭摩勝如來
　　I007　：　　：　　：　　：　　：　　：　　：　　：　四，師子吼佛
　　I008　：　　：　　：　　：　　：　　：　　：　　：　五，拘留孫佛
　　I009　：　　：　　：　　：　　：　　：　　：　　：　六，毗婆尸佛
　　I010　：　　：　　：　　：　　：　　：　　：　　：　七，寶勝如來
　　I011　：　　：　　：　　：　　：　　：　　：　　：　八，寶相佛
　　I012　：　　：　　：　　：　　：　　：　　：　　：　九，袈裟幢佛
　　I013　：　　：　　：　　：　　：　　：　　：　　：　十，大通山王佛
　　I014　：　　：　　：　　：　　：　　：　　：　次，總指諸佛，九例此
　　    　：　　：　　：　　：　　：　　：　次，結益
　　    　：　　：　　：　　：　　：　　：　（庚）初，生時稱名益
　　I015　：　　：　　：　　：　　：　　：　　：　（辛）初，約一多況益
　　I016　：　　：　　：　　：　　：　　：　　：　　：　次，約生死得利
　　    　：　　：　　：　　：　　：　　：　　：　次，臨終稱名益
　　I017　：　　：　　：　　：　　：　　：　　：　（辛）初，示稱名滅罪
　　I018　：　　：　　：　　：　　：　　：　　：　　：　次，釋滅無間疑
　　I019　：　　：　　：　　：　　：　　：　　：　　：　三，況自稱福罪
　　    　：　　：　　：　次，顯成佛助道*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，地藏請較施福+
　　J001　：　　：　　：　　：　　：　（己）初，經家敘儀
　　J002　：　　：　　：　　：　　：　　：　次，地藏疑請
　　    　：　　：　　：　　：　　：　次，如來對眾較量+
　　J003　：　　：　　：　　：　　：　（己）初，誡聽許說
　　J004　：　　：　　：　　：　　：　　：　次，因疑願聞
　　    　：　　：　　：　　：　　：　　：　三，正申較量
　　    　：　　：　　：　　：　　：　　：　（庚）初，正較
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，王臣施福
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，正較多少
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，施卑劣根闕福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明施人尊
　　J005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，能施主
　　J006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，所施田
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯施福勝
　　J007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正明能施慈悲
　　J008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉釋所施卑劣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，施塔寺聖像福
　　J009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明能所施
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯所施福
　　J010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，三劫受帝釋樂
　　J011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，十劫為大梵王
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，施修補經像福
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明修因
　　J012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，自修補經像
　　J013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸布施結緣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯施福
　　J014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，自他千生為王
　　J015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，迴向盡成佛道
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，施老病產婦福
　　J016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，能所施人
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，所施因果
　　J017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，修因
　　J018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，獲果
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結向成佛
　　J019　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，結迴施報
　　J020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勑普勸學
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，男女施福
　　J021　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，標佛法中福利
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，較佛法中福利
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，施供聖像福
　　J022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直明施福
　　J023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，迴向叵喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，施供大乘福
　　J024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直明施福
　　J025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，迴向叵喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，施修經典福
　　J026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，自他修福
　　J027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，自他獲報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結向法界功德
　　J028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，指修善事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示迴向法
　　J029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，向理千生受樂
　　J030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，向已三生受福
　　J031　：　　：　　：　　：　　：　　：　　：　次，結示
//
　　    　：　三，流通分*
//
　　    　：　（乙）初，別流通*
　　    　：　　：　（丙）初，地神護法流通*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，堅牢歎德+
　　K001　：　　：　　：　　：　　：　（己）初，通明昔遇
　　    　：　　：　　：　　：　　：　　：　次，別讚今聞
　　    　：　　：　　：　　：　　：　　：　（庚）初，讚地藏德
　　K002　：　　：　　：　　：　　：　　：　　：　（辛）初，歎誓願深重
　　K003　：　　：　　：　　：　　：　　：　　：　　：　次，舉大士例顯
　　K004　：　　：　　：　　：　　：　　：　　：　　：　三，顯教化難量
　　    　：　　：　　：　　：　　：　　：　　：　次，護供養人
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，塑像供讚得利益
　　K005　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，修因
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，得益
　　K006　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，標示十利
　　K007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，徵列十名
　　K008　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結成
　　K009　：　　：　　：　　：　　：　　：　　：　　：　次，讀經供像銷橫事
　　    　：　　：　　：　　：　　：　次，教主述成歎德+
　　    　：　　：　　：　　：　　：　（己）初，讚德
　　K010　：　　：　　：　　：　　：　　：　（庚）初，直讚神力
　　K011　：　　：　　：　　：　　：　　：　　：　次，轉釋主物
　　    　：　　：　　：　　：　　：　　：　次，述事
　　K012　：　　：　　：　　：　　：　　：　（庚）初，述成稱揚利益事
　　    　：　　：　　：　　：　　：　　：　　：　次，述成讀供擁護事
　　K013　：　　：　　：　　：　　：　　：　　：　（辛）初，男女供像讀經
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，擁護除災證果
　　K014　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，地神擁護除災
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，諸天擁護證樂
　　K015　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，示擁護人
　　K016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋擁護意
　　    　：　　：　　：　次，見聞利益流通*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，釋迦現相歎德事+
　　L001　：　　：　　：　　：　　：　（己）初，頂門放光證事
　　L003　：　　：　　：　　：　　：　　：　次，口輪出音歎事
　　    　：　　：　　：　　：　　：　次，觀音請說為流通+
　　    　：　　：　　：　　：　　：　（己）初，當機述請
　　L004　：　　：　　：　　：　　：　　：　（庚）初，經家提名敘儀
　　    　：　　：　　：　　：　　：　　：　　：　次，大士述歎請說
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，述前所歎功德
　　L005　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，述地藏威神
　　L006　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述諸佛讚德
　　L007　：　　：　　：　　：　　：　　：　　：　　：　次，述今欲讚益事
　　L008　：　　：　　：　　：　　：　　：　　：　　：　三，正請為眾揚德
　　    　：　　：　　：　　：　　：　　：　次，如來讚許
　　    　：　　：　　：　　：　　：　　：　（庚）初，讚德
　　L009　：　　：　　：　　：　　：　　：　　：　（辛）初，讚娑婆有緣功德
　　L010　：　　：　　：　　：　　：　　：　　：　　：　次，讚聽宣地藏功德
　　L011　：　　：　　：　　：　　：　　：　　：　次，誡聽
　　L012　：　　：　　：　　：　　：　　：　　：　三，願聞
　　    　：　　：　　：　　：　　：　　：　　：　四，正告
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，長行
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，別示不思議事文有八段
　　L013　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，五衰相現
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，見聞轉報
　　L014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，示增天福
　　L015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，況施供利
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉臨終惡業
　　L016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，臨終聞名離苦
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，眷屬塑像轉報
　　L017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，修塑像因
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉現未報
　　L018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，病人知因
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，承功報轉
　　L019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，重病尋愈增壽
　　L020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，命盡滅障生天
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，示先亡生界
　　L021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述思憶之事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示修敬之功
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，先亡解脫
　　L022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，修勝因
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，得樂報
　　L023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，墮惡趣者解脫
　　L024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，生人天者增因
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，具告生界
　　L025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，念名菩薩現身
　　L026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，夢神領見眷屬
　　L027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，現獲妙報
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四、成度生證果
　　L028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述發心度人
　　L029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明修因成願
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，成欲求願事
　　L030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述所求願事
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明修因成就
　　L031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，願求成就
　　L032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，夢感摩頂
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，發現生智慧
　　L033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述宿障根鈍
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示修因發慧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，修因又二
　　L034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，對像陳心
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，求慧方軌
　　L035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，修敬法
　　L036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，服水法
　　L037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，戒慎法
　　L038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，發慧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　七，轉惡相遂求
　　L039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述其晝夜惡事
　　L040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，修善消滅安樂
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　八，安水陸險道
　　L041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，述經歷惡事
　　L042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示稱名利益
　　L043　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總說利益無盡
　　L044　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結勸大士流布
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，重頌
　　L045　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，總頌神力難盡
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別頌不思議事
　　L046　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，頌轉衰相
　　L047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌示生界
　　L048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，頌成度生
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，頌發現智
　　L049　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，頌宿障根鈍
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌修因發慧
　　L050　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，頌修因
　　L051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌服水
　　L052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，頌戒慎
　　L053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，頌發慧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，頌轉惡相
　　L054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，頌晝夜惡事
　　L055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌修因安樂
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，頌安水陸
　　L056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，頌經歷惡事
　　L057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌稱名利益
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結頌普告流布
　　L058　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，勸聽地藏神力
　　L059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總頌聞瞻利樂
　　L060　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結勸音告布
　　    　：　　：　　：　三，囑累人天流通*
　　    　：　　：　　：　（丁）初，品題
　　    　：　　：　　：　　：　次，品文
　　    　：　　：　　：　　：　（戊）初，化主憂天人囑累+
　　    　：　　：　　：　　：　　：　（己）初，世尊摩頂付囑
　　    　：　　：　　：　　：　　：　　：　（庚）初，呼名大讚功德
　　M001　：　　：　　：　　：　　：　　：　　：　（辛）初，初敘舉臂摩頂
　　M002　：　　：　　：　　：　　：　　：　　：　　：　次，歎眾德叵思
　　    　：　　：　　：　　：　　：　　：　　：　次，呼名載囑人天
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，長行
　　    　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，火宅眾生勿令墮苦
　　M003　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正以三界天人付囑
　　M004　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，復明生性無定分形
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，少善眾生勿令>退失
　　M005　：　　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，種少善擁護勿退
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，念佛經碎獄生天
　　M006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，隨業墮落惡趣
　　M007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，神力方便救拔
　　M008　：　　：　　：　　：　　：　　：　　：　　：　次，偈頌
　　    　：　　：　　：　　：　　：　　：　次，地藏互跪承旨
　　M009　：　　：　　：　　：　　：　　：　（庚）初，經家敘儀
　　    　：　　：　　：　　：　　：　　：　　：　次，大士領命
　　M010　：　　：　　：　　：　　：　　：　　：　（辛）初，安慰世尊
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，度脫眾生
　　M011　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，少善解脫生死
　　M012　：　　：　　：　　：　　：　　：　　：　　：　　：　次，深修不退道果
　　    　：　　：　　：　　：　　：　次，空藏問瞻禮福利+
　　    　：　　：　　：　　：　　：　（己）初，述贊問福利
　　M013　：　　：　　：　　：　　：　　：　（庚）初，經家提名
　　    　：　　：　　：　　：　　：　　：　　：　次，當機發問
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，因聞歎致請
　　M014　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，述聞神力叵思
　　M015　：　　：　　：　　：　　：　　：　　：　　：　　：　次，因問福利幾種
　　M016　：　　：　　：　　：　　：　　：　　：　　：　次，願為眾略說
　　    　：　　：　　：　　：　　：　　：　次，許說示利益
　　M017　：　　：　　：　　：　　：　　：　（庚）初，誡聽許說
　　    　：　　：　　：　　：　　：　　：　　：　次，分別利益
　　    　：　　：　　：　　：　　：　　：　　：　（辛）初，見像聞經供讚利益
　　M018　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，總示修因
　　M019　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別列益數
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，聞經禮形讚歎利益
　　M020　：　　：　　：　　：　　：　　：　　：　　：　（壬）初，總示修因
　　M021　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別列益數
　　    　：　　：　次，總流通*
　　M022　：　　：　（丙）初，因果聖凡聞讚致歎
　　M023　：　　：　　：　次，天主眾會供養禮退
`;
