VOLUMES.push(
`/TEXT339/後跋

原夫大士，悲願分形，劫量叵測。今之九華者，太倉之一粟也。每購山誌未得，稽考應蹟末由。相傳是新羅國王太子，二十四歲，擕白犬善聽，航海而來，止九子山石洞有年。時有閣老閔公，素懷善念，每齋百僧必虗一位，因請洞僧足數。廼乞一袈裟地，公許。衣遍覆九峰，遂盡喜捨。其子求出家，即道明和尚是。公後亦離俗網，反禮其子為師。故今侍像左道明而右閔公，織此故也。公里族諱號，亦未詳世行。唐詩選名英華集中，有金地藏送童子還家詩。其曰：空門寂寞汝思家，禮別雲房下九華。愛向竹欄騎竹馬，嬾於金地佈金沙。添瓶㵎底休招月，煑茗甌中罷弄華。好去不須頻下淚，老僧相伴有煙霞。附刊紙尾，公諸同好云：

/TEXT339/經讚附

佛升忉利，為報慈親。放光地藏集分身，緣感業宣陳。廣說弘因，歷劫度沈淪。　第一卷
獄名啟問，苦楚堪哀。如來讚歎福門開，鬼主悉皆來。佛號奇哉，存沒離塵埃。　第二卷
地藏請較，布施因緣。堅牢護法歎功玄，聞見利無邊。囑累人天，世世廣流傳。　第三卷

/TEXT339/陳九陶先生贈言併序附

匡菴運遐法師，頹齡善病，日夕註經不休。同門全彰法師，年富力強，遊燕甫還，遽以微眚示寂。輒為全師慨傷，深為運師愉快云：

全彰法師徤無比，都門往返六千里。佛法傾動諸公卿，方欲奏加國師禮。陡嬰微恙遂西歸，法臘纔逾知命耳。惜乎楞嚴說法堂，幾回欲建仍拋圮。匡菴運師係法兄，全師却是運師弟。全師忽辭運師去，運師長病大仙矣。長病得毋僥倖乎，又復註經勞不已。註經弘願銘肺肝，孜孜深闡而曲體。考盡千函大藏經，載無疑義與剩理。脉脉陰叨佛護持，病魔疊疊能強起。地藏經今得解之，解地藏經世罕此。瀝心嘔血醒時流，敷演欺人莫浪恃。登壇集眾每宣揚，恭聽伊誰不歡喜。一從釋迦涅槃後，是經今始得知已。莫大功德在後頭，豈僅目前報增紀。更兼師長燄口遺，歷久未獲壽於梓。二帙運師傾鉢資，齊刊頓貴洛陽紙。他年入藏不須憂，幸值當今係聖主。寄聲恭賀景老人，嗣法有此爭氣子。
/TEXT339R/寓武原禾人陳鏞拜艸

/TEXT339/跋

寶池真常禪德偶得此科註，歡喜踊躍，即欲廣流布于世。不辭鯨浪犬牙之危險，頓發崎陽，緬赴京洛。時沈疴新痊，而形氣未復原。然勇志奮起如此，可謂為弘法利生忘軀命矣。因屬余以訓點刊行之事。(余)素歸地藏菩薩，間又讀誦此經，每憾闕註疏之久也。而今幸遇希有勝緣，寔所謂如闇得燈、如貧得寶，喜感交生，不知手之舞之、足之蹈之。只願早流行之，以成常師志，而普與眾共利。於是不暇顧謭陋，漫污和點以鋟梓云。
/TEXT339R/旹元祿三庚午載十月上旬
/TEXT339R/沙門玅幢淨慧謹䟦`);
