var list = `
序品〇〇〇〇〇〇第一
純陀品〇〇〇〇〇第二
哀歎品〇〇〇〇〇第三|p03
長壽品〇〇〇〇〇第四
金剛身品〇〇〇〇第五|p05
功德品〇〇〇〇〇第六|p06
四相品〇〇〇〇〇第七〇〇之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
四依品〇〇〇〇〇第八
邪正品〇〇〇〇〇第九
四諦品〇〇〇〇〇第十|p10
四倒品〇〇〇〇〇第十一|p11
如來性品〇〇〇〇第十二
文字品〇〇〇〇〇第十三|p13
鳥喻品〇〇〇〇〇第十四|p14
月喻品〇〇〇〇〇第十五
菩薩品〇〇〇〇〇第十六|p16
大眾所問品〇〇〇第十七
現病品〇〇〇〇〇第十八|p18
聖行品〇〇〇〇〇第十九〇之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
〇〇〇〇〇〇〇〇〇〇〇〇之三
梵行品〇〇〇〇〇第二十〇之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
〇〇〇〇〇〇〇〇〇〇〇〇之三
〇〇〇〇〇〇〇〇〇〇〇〇之四
〇〇〇〇〇〇〇〇〇〇〇〇之五
嬰兒行品〇〇〇〇第二十一|p21
<span style="font-size:12px">光明遍照高貴德王菩薩品</span>第二十二之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
〇〇〇〇〇〇〇〇〇〇〇〇之三
〇〇〇〇〇〇〇〇〇〇〇〇之四
〇〇〇〇〇〇〇〇〇〇〇〇之五
〇〇〇〇〇〇〇〇〇〇〇〇之六
師子吼菩薩品〇〇第二十三之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
〇〇〇〇〇〇〇〇〇〇〇〇之三
〇〇〇〇〇〇〇〇〇〇〇〇之四
〇〇〇〇〇〇〇〇〇〇〇〇之五
〇〇〇〇〇〇〇〇〇〇〇〇之六
迦葉品〇〇〇〇〇第二十四之一
〇〇〇〇〇〇〇〇〇〇〇〇之二
〇〇〇〇〇〇〇〇〇〇〇〇之三
〇〇〇〇〇〇〇〇〇〇〇〇之四
〇〇〇〇〇〇〇〇〇〇〇〇之餘
憍陳如品〇〇〇〇第二十五之一|p25
〇〇〇〇〇〇〇〇〇〇〇〇之二
`.trim().split('\n');

var buf = new Buffer();
buf.w(`/TEXTC/Mahāparinirvāṇa Sūtra

/TEXT030C/宋代沙門慧嚴等依泥洹經加之

/VOLSEP/
<center><table><tr><td>`);

function volNumDisp(n) {
  var ret = `卷第${zNumber(n)}`;
  for (; ret.length<5; ret+='　');
  return ret;
}

var volNum = 0;
for (var i=0; i<list.length; ++i) {
  if (i>0) buf.w('<br>');
  var ln = list[i].split('|');
  if (ln.length >= 2)
    buf.w(`<a href="?vol=${volNum}&pin=${ln[1]}">　　　　　　`);
  else
    buf.w(`<a href="?vol=${++volNum}">${volNumDisp(volNum)}　`);
  buf.w(ln[0].replaceAll('〇', '　'), '</a>');
}

buf.w(`</td></tr></table></center>
/VOLSEP/
`);

NJ.text = buf.render();
