NJ.volNum = 12;
NJ.text = `

/TEXT339/聖行品第十九之二

「善男子!云何菩薩摩訶薩住於大乘大般涅槃觀察集諦?善男子! 菩薩摩訶薩觀此集諦是陰因緣，所謂集者，還愛於有。愛有二種: 一、愛己身，二、愛所須。復有二種:未得五欲，繫心專求;既求 得已，堪忍專著。復有三種:欲愛、色愛、無色愛。復有三種:業 因緣愛、煩惱因緣愛、苦因緣愛。出家之人有四種愛。何等為四? 衣服、飲食、臥具、湯藥。復有五種:貪著五陰、隨諸所須一切愛 著、分別挍計無量無邊。 

「善男子!愛有二種:一者、善愛，二、不善愛。不善愛者，凡愚 之求;善法愛者，諸菩薩求。善法愛者復有二種:不善與善。求二 乘者，名為不善;求大乘者，是名為善。善男子!凡夫愛者，名之 為集，不名為諦;菩薩愛者，名之實諦，不名為集。何以故?為度 眾生所以受生，不以愛故而受生也。」 

迦葉菩薩白佛言:「世尊!如佛世尊於餘經中為諸眾生說業為因 緣，或說憍慢、或說六觸、或說無明為五盛陰而作因緣。今以何義 說四聖諦獨以愛性為五陰因?」 

佛讚迦葉:「善哉，善哉。善男子!如汝所說。諸因緣者，非為、 非因;但是五陰要因於愛。善男子!譬如大王若出遊巡，大臣、眷 屬悉皆隨從;愛亦如是，隨愛行處，是諸結等亦復隨行。譬如膩 衣，隨有塵著著則隨住;愛亦如是，隨所愛處業結亦住。復次，善 男子!譬如濕地則能生牙;愛亦如是，能生一切業煩惱牙。 

「善男子!菩薩摩訶薩住是大乘大般涅槃，深觀此愛凡有九種: 一、如債有餘，二、如羅剎女婦，三、如妙花莖有毒蛇纏之，四、 如惡食性所不便而強食之，五、如婬女，六、如摩樓迦子，七、如 瘡中瘜肉，八、如暴風，九、如彗星。 

「云何名為如債有餘?善男子!譬如窮人負他錢財，雖償欲畢，餘 未畢故，猶繫在獄而不得脫。聲聞、緣覺亦復如是，以有愛習之餘 氣故，不能得成阿耨多羅三藐三菩提。善男子!是名如債有餘。 

「善男子!云何如羅剎女婦?善男子!譬如有人得羅剎女納以為 婦，是羅剎女隨所生子，生已便食;食子既盡，復食其夫。善男 子!愛羅剎女亦復如是，隨諸眾生生善根子，隨生隨食;善子既 盡，復食眾生，令墮地獄、畜生、餓鬼;唯除菩薩。是名如羅剎女 婦。

「善男子!云何如妙花莖毒蛇纏之?譬如有人性愛好花，不見花莖 毒蛇過患即便前捉，捉已蛇螫，螫已命終。一切凡夫亦復如是，貪 五欲花，不見是愛毒蛇過患而便受取，即為愛蛇之所毒螫，命終即 墮三惡道中;唯除菩薩。是名如妙花莖毒蛇纏之。 

「善男子!云何所不便食而強食之?譬如有人所不便食而強食之， 食已腹痛，患下而死。愛食如是，五道眾生強食貪著，以是因緣墮 三惡道;唯除菩薩。是名所不便食而強食之。 

「善男子!云何如婬女?譬如愚人與婬女通，而彼婬女巧作種種諂 媚現親，悉奪是人所有錢財;錢財既盡，便復驅逐。愛之婬女亦復 如是，愚人無智與之交通，而是愛女奪其所有一切善法，善法既 盡，驅逐令墮三惡道中;唯除菩薩。是名婬女。 

「善男子!云何如摩樓迦子?譬如摩樓迦子，若鳥食已，隨糞墮 地，或因風吹來在樹下即便生長，纏繞束縛尼拘羅樹，令不增長遂 至枯死。愛摩樓迦子亦復如是，纏縛凡夫所有善法，不令增長遂至 枯滅，既枯滅已，命終之後墮三惡道;唯除菩薩。是名如摩樓迦 子。 

「善男子!云何如瘡中瘜肉?如人久瘡中生瘜肉，其人要當勤心療 治，莫生捨心。若生捨心，瘜肉增長、蟲疽復生，以是因緣即便命 終。凡夫愚人五陰瘡痍亦復如是，愛於其中而為瘜肉，應當勤心治 愛瘜肉。若不治者，命終即墮三惡道中;唯除菩薩。是名如瘡中瘜 肉。 

「善男子!云何如暴風?譬如暴風能偃山夷岳，拔於深根。愛欲暴 風亦復如是，於父母所而生惡心，能拔大智舍利弗等無上深固菩提 根本;唯除菩薩。是名如暴風。 

「善男子!云何如彗星?譬如彗星出現，天下一切人民饑饉、病 瘦、嬰諸苦惱。愛之彗星亦復如是，能斷一切善根種子，令凡夫人 孤窮、饑饉、生煩惱病、流轉生死、受種種苦;唯除菩薩。是名如 彗星。 

「善男子!菩薩摩訶薩住於大乘大般涅槃，觀察愛結如是九種。善 男子!以是義故，諸凡夫人有苦、無諦;聲聞、緣覺有苦、有苦 諦，而無真實;諸菩薩等解苦無苦，是故無苦而有真諦。諸凡夫人 有集、無諦;聲聞、緣覺有集、有集諦;諸菩薩等解集無集，是故 無集而有真諦。聲聞、緣覺，有滅、非真;菩薩摩訶薩，有滅、有 真諦。聲聞、緣覺，有道、非真;菩薩摩訶薩，有道、有真諦。 

「善男子!云何菩薩摩訶薩住於大乘大般涅槃，見滅、見滅諦?所 謂斷除一切煩惱。若煩惱斷則名為常，滅煩惱火則名寂滅，煩惱滅 故則得受樂。諸佛、菩薩求因緣故，故名為淨。更不復受二十五 有，故名出世;以出世故，故名為我。常於色、聲、香、味、觸等，若男、若女，若生、住滅，若苦、若樂，不苦、不樂，不取相 貌故，名畢竟寂滅真諦。善男子!菩薩如是住於大乘大般涅槃觀滅 聖諦。 

「善男子!云何菩薩摩訶薩住於大乘大般涅槃觀道聖諦?善男子! 譬如闇中因燈得見麁細之物。菩薩摩訶薩亦復如是，住於大乘大般 涅槃，因八聖道見一切法，所謂常、無常，有為、無為，有眾生、 非眾生，物、非物，苦、樂，我、無我，淨、不淨，煩惱、非煩 惱，業、非業，實、不實，乘、非乘，知、無知，陀羅驃、非陀羅 驃，求那、非求那，見、非見，色、非色，道、非道，解、非解。 善男子!菩薩如是住於大乘大般涅槃觀道聖諦。」 

迦葉菩薩白佛言:「世尊!若八聖道是道聖諦，義不相應。何以 故?如來或說:『信心為道，能度諸漏。』或時說:『道，不放逸 是。諸佛、世尊不放逸故，得阿耨多羅三藐三菩提;亦是菩薩助道 之法。』或時說言:『精進是道。』如告阿難:『若有人能勤修精 進，則得成就阿耨多羅三藐三菩提。』或時說言:『觀身念處，若 有繫心精勤修習是身念處，則得成就阿耨多羅三藐三菩提。』或時 說言:『正定為道。』如告大德摩訶迦葉:『夫正定者，真實是 道;非不正定而是道也。若入正定，乃能思惟五陰生滅，非不入定 能思惟也。』或說一法:『若人修習能淨眾生，滅除一切憂愁、苦 惱，逮得正法，所謂念佛三昧。』或復說言:『修無常想是名為 道。』如告比丘:『有能多修無常想者，能得阿耨多羅三藐三菩 提。』或說空寂阿蘭若處獨坐思惟，能得速成阿耨多羅三藐三菩 提。或時說言:『為人演法，是名為道。若聞法已，疑網即斷;疑 網斷已則得阿耨多羅三藐三菩提。』 

「或時說言:『持戒是道。』如告阿難:『若有精勤修持禁戒，是 人則度生死大苦。』或時說言:『親近善友，是名為道。』如告阿 難:『若有親近善知識者，則安淨戒。若有眾生能親近我，則得發 於阿耨多羅三藐三菩提心。』或時說言:『修慈是道。修學慈者， 斷諸煩惱，得不動處。』或時說言:『智慧是道。』如佛昔為波闍 波提比丘尼說:『姊妹!如諸聲聞以智慧刀能斷諸流、諸漏、煩 惱。』或時如來說:『施是道。』如佛往昔告波斯匿王:『大王當 知:我於往昔多行惠施，以是因緣，今日得成阿耨多羅三藐三菩 提。』 

「世尊!若八聖道是道諦者，如是等經豈非虛妄?若彼諸經非虛妄 者，彼中何緣不說八道為道聖諦?若彼不說，如來往昔何故錯謬? 然我定知諸佛如來久離錯謬。」 

爾時，世尊讚迦葉菩薩: 「善哉，善哉。善男子!汝今欲知菩薩大 乘微妙經典所有祕密，故作是問。善男子!如是諸經悉入道諦。

「善男子!如我先說:『若有信道。』如是信道是信根本，是能佐 助菩提之道。是故，我說無有錯謬。 

「善男子!如來善知無量方便，欲化眾生故，作如是種種說法。善 男子!譬如良醫識諸眾生種種病源，隨其所患而為合藥。并藥所 禁，唯水一種不在禁例，或服薑水、或甘草水、或細辛水、或黑石 蜜水、或阿摩勒水、或尼婆羅水、或鉢晝羅水、或服冷水、或服熱 水、或蒲萄水、或安石榴水。善男子!如是，良醫善知眾生所患種 種，藥雖多禁，水不在例。如來亦爾，善知方便於一法相，隨諸眾 生分別廣說種種名相。彼諸眾生隨所說受，受已修習，除斷煩惱， 如彼病人隨良醫教，所患得除。 

「復次，善男子!如有一人善解眾語，在大眾中。是諸大眾熱渴所 逼，咸發聲言:『我欲飲水，我欲飲水。』是人即時以清冷水隨其 種類說言是水，或言波尼、或言欝特、或言紗利藍、或言婆利、或 言婆耶、或言甘露、或言牛乳，以如是等無量水名為大眾說。善男 子!如來亦爾，以一聖道為諸聲聞種種演說，從信根等至八聖道。 

「復次，善男子!譬如金師以一種金隨意造作種種瓔珞，所謂鉗 鎖、環釧、釵鐺、天冠、臂印。雖有如是差別不同，然不離金。善 男子!如來亦爾，以一佛道隨諸眾生種種分別而為說之。或說一 種，所謂諸佛一道無二。復說二種，所謂定、慧。復說三種，謂 見、慧、智。復說四種，所謂見道、修道、無學道、佛道。復說五 種，所謂信行道、法行道、信解脫道、見到道、身證道。復說六 種，所謂須陀洹道、斯陀含道、阿那含道、阿羅漢道、辟支佛道、 佛道。復說七種，所謂念覺分、擇法覺分、精進覺分、喜覺分、除 覺分、定覺分、捨覺分。復說八種，所謂正見、正思惟、正語、正 業、正命、正精進、正念、正定。復說九種，所謂八聖道及信。復 說十種，所謂十力。復說十一種，所謂十力、大慈。復說十二種， 所謂十力、大慈、大悲。復說十三種，所謂十力、大慈、大悲、念 佛三昧。復說十六種，所謂十力、大慈、大悲、念佛三昧，及佛所 得三正念處。復說二十道，所謂十力、四無所畏、大慈、大悲、念 佛三昧、三正念處。善男子!是道一體，如來昔日為眾生故，種種 分別。 

「復次，善男子!譬如一火因所燃故得種種名，所謂木火、草火、 糠火、䴬火、牛馬糞火。善男子!佛道亦爾，一而無二。為眾生 故，種種分別。 

「復次，善男子!譬如一識分別說六，若至於眼則名眼識，乃至意 識亦復如是。善男子!道亦如是，一而無二。如來為化諸眾生故， 種種分別。

「復次，善男子!譬如一色眼所見者則名為色、耳所聞者則名為 聲、鼻所嗅者則名為香、舌所甞者則名為味、身所覺者則名為觸。 善男子!道亦如是，一而無二。如來為欲化眾生故，種種分別。善 男子!以是義故，以八聖道分名道聖諦。 

「善男子!是四聖諦，諸佛、世尊次第說之。以是因緣，無量眾生 得度生死。」 

迦葉菩薩白佛言:「世尊!昔佛一時在恒河岸尸首林中。爾時，如 來取小樹葉，告諸比丘:『我今手中所捉葉多?一切因地草木葉 多?』諸比丘言:『世尊!一切因地草木葉多，不可稱計;如來所 捉少不足言。』『諸比丘!我所覺了一切諸法如因大地生草木等， 為諸眾生所宣說者如手中葉。』世尊爾時說如是言:『如來所了無 量諸法。』若入四諦則為已說;若不入者，應有五諦。」 

佛讚迦葉:「善哉，善哉。善男子!汝今所問則能利益、安隱、快 樂無量眾生。善男子!如是諸法悉已攝在四聖諦中。」 

迦葉菩薩復白佛言:「如是等法若在四諦，如來何故唱言不說?」 

佛言:「善男子!雖復入中，猶不名說。何以故?善男子!知四聖 諦有二種智:一者、中，二者、上。中者，聲聞、緣覺智;上者， 諸佛、菩薩智。善男子!知諸陰苦，名為中智;分別諸陰有無量 相，悉是諸苦，非諸聲聞、緣覺所知，是名上智。善男子!如是等 義我於彼經竟不說之。 

「善男子!知諸入者，名之為門、亦名為苦，是名中智;分別諸入 有無量相，悉是諸苦，非諸聲聞、緣覺所知，是名上智。如是等義 我於彼經亦不說之。 

「善男子!知諸界者，名之為分、亦名為性、亦名為苦，是名中 智;分別諸界有無量相，悉是諸苦，非諸聲聞、緣覺所知，是名上 智。善男子!如是等義，我於彼經亦不說之。 

「善男子!知色壞相，是名中智;分別諸色有無量相，悉是諸苦， 非諸聲聞、緣覺所知，是名上智。如是等義，我於彼經亦不說之。 

「善男子!知受覺相，是名中智;分別諸受有無量覺相，非諸聲 聞、緣覺所知，是名上智。善男子!如是等義，我於彼經亦不說 之。 

「善男子!知想取相，是名中智;分別是想有無量取相，非諸聲 聞、緣覺所知，是名上智。如是等義，我於彼經亦不說之。 

「善男子!知行作相，是名中智;分別是行無量作相，非諸聲聞、 緣覺所知，是名上智。善男子!如是等義我於彼經亦不說之。 

「善男子!知識分別相，是名中智;分別是識無量知相，非諸聲 聞、緣覺所知，是名上智。善男子!如是等義，我於彼經亦不說 之。 

「善男子!知愛因緣能生五陰，是名中智;一人起愛無量無邊，聲 聞、緣覺所不能知，能知一切眾生所起如是等愛，是名上智。如是 等義，我於彼經亦不說之。 

「善男子!知滅煩惱，是名中智;分別煩惱不可稱計、滅亦如是不 可稱計，非諸聲聞、緣覺所知，是名上智。如是等義我於彼經亦不 說之。 

「善男子!知是道相能離煩惱，是名中智;分別道相無量無邊、所 離煩惱亦無量無邊，非諸聲聞、緣覺所知，是名上智。如是等義， 我於彼經亦不說之。 

「善男子!知世諦者，是名中智;分別世諦無量無邊不可稱計，非 諸聲聞、緣覺所知。是名上智。如是等義，我於彼經亦不說之。 

「善男子!一切行無常、諸法無我、涅槃寂滅是第一義，是名中 智;知第一義無量無邊不可稱計，非諸聲聞、緣覺所知，是名上 智。如是等義，我於彼經亦不說之。」 

爾時，文殊師利菩薩白佛言:「世尊!所說世諦、第一義諦，其義 云何?世尊!第一義中有世諦不?世諦之中有第一義不?如其有 者，即是一諦;如其無者，將非如來虛妄說耶?」 

「善男子!世諦者，即第一義諦。」 

「世尊!若爾者，則無二諦。」 

佛言:「善男子!有善方便，隨順眾生說有二諦。善男子!若隨言 說則有二種:一者、世法，二者、出世法。善男子!如出世人之所 知者，名第一義諦;世人知者，名為世諦。 

「善男子!五陰和合稱言某甲，凡夫眾生隨其所稱，是名世諦;解 陰無有某甲名字、離陰亦無某甲名字，出世之人如其性相而能知 之，名第一義諦。 

「復次，善男子!或復有法，有名有實;或復有法，有名無實。善 男子!有名無實者，即是世諦;有名有實者，是第一義諦。善男 子!如我、眾生、壽命、知見、養育、丈夫、作者、受者、熱時之 炎、乾闥婆城、龜毛、兔角、旋火之輪、諸陰界入，是名世諦; 苦、集、滅、道，名第一義諦。 

「善男子!世法有五種:一者、名世，二者、句世，三者、縛世， 四者、法世，五者、執著世。善男子!云何名世?男、女、瓶、 衣、車乘、屋舍，如是等物是名名世。云何句世?四句一偈，如是 等偈是名句世。云何縛世?捲合繫結、束縛合掌，是名縛世。云何 法世?如鳴椎集僧、嚴鼓誡兵、吹貝知時，是名法世。云何執著 世?如望遠人有染衣者生想執著，言:『是沙門，非婆羅門。』見 有結繩橫佩身上便生念言:『是婆羅門，非沙門也。』是名執著 世。

「善男子!如是名為五種世法。善男子!若有眾生於如是等五種世 法心無顛倒，如實而知，是名第一義諦。 

「復次，善男子!若燒、若割、若死、若壞，是名世諦;無燒、無 割、無死、無壞，是名第一義諦。 

「復次，善男子!有八苦相名為世諦;無生、無老、無病、無死、 無愛別離、無怨憎會、無求不得、無五盛陰，是名第一義諦。 

「復次，善男子!譬如一人多有所能，若其走時則名走者、或收刈 時復名刈者、或作飲食名作食者、若治材木則名工匠、鍛金銀時言 金銀師，如是一人有多名字。法亦如是，其實是一而有多名。依因 父母和合而生，名為世諦;十二因緣和合生者，名第一義諦。」 

文殊師利菩薩白佛言:「世尊!所言實諦，其義云何?」 

佛言:「善男子!言實諦者，名曰真法。善男子!若法非真，不名 實諦。善男子!實諦者無顛倒，無顛倒者乃名實諦。善男子!實諦 者，無有虛妄;若有虛妄不名實諦。善男子!實諦者，名曰大乘; 非大乘者，不名實諦。善男子!實諦者，是佛所說，非魔所說;若 是魔說、非佛說者，不名實諦。善男子!實諦者，一道清淨，無有 二也。善男子!有常、有樂、有我、有淨，是則名為實諦之義。」 

文殊師利白佛言:「世尊!若以真實為實諦者，真實之法即是如 來、虛空、佛性。若如是者，如來、虛空及與佛性無有差別。」 

佛告文殊師利:「有苦，有諦、有實;有集，有諦、有實;有滅， 有諦、有實;有道，有諦、有實。善男子!如來，非苦、非諦，是 實;虛空，非苦、非諦，是實;佛性，非苦、非諦，是實。 

「文殊師利!所言苦者，為無常相、是可斷相，是為實諦。如來之 性，非苦、非無常、非可斷相，是故為實;虛空、佛性亦復如是。 

「復次，善男子!所言集者，能令五陰和合而生，亦名為苦、亦名 無常，是可斷相，是為實諦。善男子!如來非是集性、非是陰因、 非可斷相，是故為實;虛空、佛性亦復如是。 

「善男子!所言滅者，名煩惱滅，亦常、無常。二乘所得名曰無 常;諸佛所得是則名常、亦名證法，是為實諦。善男子!如來之性 不名為滅，能滅煩惱，非常、無常，不名證知，常住無變，是故為 實;虛空、佛性亦復如是。 

「善男子!道者能斷煩惱，亦常、無常，是可修法，是名實諦。如 來非道，能斷煩惱，非常、無常，非可修法，常住不變，是故為 實;虛空、佛性亦復如是。 

「復次，善男子!言真實者，即是如來;如來者，即是真實。真實 者，即是虛空;虛空者，即是真實。真實者，即是佛性;佛性者， 即是真實。

「文殊師利!有苦、有苦因、有苦盡、有苦對。如來非苦乃至非 對，是故為實，不名為諦;虛空、佛性亦復如是。苦者，有為、有 漏、無樂。如來非有為、非有漏，湛然安樂，是實非諦。」 

文殊師利白佛言:「世尊!如佛所說:『不顛倒者，名為實諦。』 若爾者，四諦之中有四倒不?如其有者，云何說言:『無有顛倒， 名為實諦。』一切顛倒不名為實。」 

佛告文殊師利:「一切顛倒皆入苦諦。如諸眾生有顛倒心，名為顛 倒。善男子!譬如有人不受父母尊長教勅、雖受不能隨順修行，如 是人等名為顛倒。如是顛倒非不是苦，即是苦也。」 

文殊師利言:「如佛所說:『不虛妄者即是實諦。』若爾者，當知 虛妄，則非實諦。」 

佛言:「善男子!一切虛妄皆入苦諦。如有眾生欺誑於他，以是因 緣墮於地獄、畜生、餓鬼，如是等法名為虛妄。如是虛妄非不是 苦，即是苦也。聲聞、緣覺、諸佛世尊遠離不行，故名虛妄。如是 虛妄，諸佛、二乘所斷除故，故名實諦。」 

文殊師利言:「如佛所說:『大乘是實諦。』者，當知聲聞、辟支 佛乘則為不實。」 

佛言:「文殊師利!彼二乘者，亦實、不實。聲聞、緣覺斷諸煩 惱，則名為實;無常、不住，是變易法，名為不實。」 

文殊師利言:「如佛所說:『若佛所說名為實者，當知魔說則為不 實。』世尊!如魔所說，聖諦攝不?」 

佛言:「文殊師利!魔所說者，二諦所攝，所謂苦、集。凡是一切 非法、非律，不能令人而得利益，終日宣說亦無有人見苦、斷集、 證滅、修道，是名虛妄。如是虛妄名為魔說。」 

文殊師利言:「如佛所說:『一道清淨，無有二。』者，諸外道等 亦復說言:『我有一道，清淨無二。』若言一道是實諦者，與彼外 道有何差別?若無差別，不應說言:『一道清淨。』」 

佛言:「善男子!諸外道等有苦、集諦，無滅、道諦，於非滅中而 生滅想、於非道中而生道想、於非果中而生果想、於非因中而生因 想。以是義故，彼無一道清淨無二。」 

文殊師利言:「如佛所說:『有常、有我、有樂、有淨是實義。』 者，諸外道等應有實諦，佛法中無。何以故?諸外道輩亦復說言: 『諸行是常。』云何是常?可意、不可意、諸業報等受不失故。可 意者，名十善報;不可意者，十不善報。若言諸行悉皆無常，而作 業者於此已滅，誰復於彼受果報乎?以是義故，諸行是常。殺生因 緣故名為常。世尊!若言諸行悉無常者，能殺、可殺，二俱無常。 若無常者，誰於地獄而受罪報?若言定有地獄受報者，當知諸行實 非無常。

「世尊!繫心專念亦名為常，所謂十年所念，乃至百年亦不忘失， 是故為常。若無常者，本所見事誰憶?誰念?以是因緣，一切諸行 非無常也。 

「世尊!一切憶想亦名為常。有人先見他人手、足、頭項等相，後 時若見便還識之。若無常者，本相應滅。 

「世尊!諸所作業以久修習，若從初學、或經三年、或經五年，然 後善知，故名為常。 

「世尊!算數之法從一至二、從二至三，乃至百、千。若無常者， 初一應滅。初一若滅，誰復至二?如是常一，終無有二。以一不滅 故得至二，乃至百、千，是故為常。 

「世尊!如讀誦法，誦一阿含，至二阿含，乃至三、四阿含。如其 無常，所可讀誦終不至四。以是讀誦增長因緣，故名為常。 

「世尊!瓶、衣、車乘，如人負債;大地形相、山、河、樹林、藥 木、草葉、眾生治病皆悉是常，亦復如是。 

「世尊!一切外道皆作是說:『諸行是常。』若是常者，即是實 諦。 

「世尊!有諸外道復言有樂。云何知耶?受者定得可意報故。世 尊!凡受樂者必定得之，所謂大梵天王、大自在天、釋提桓因、毘 紐天及諸人天。以是義故，名定有樂。 

「世尊!有諸外道復言有樂，能令眾生生求望故，飢者求食、渴者 求飲、寒者求溫、熱者求涼、極者求息、病者求差、欲者求色。若 無樂者，彼何緣求?以有求者，故知有樂。 

「世尊!有諸外道復作是言:『施能得樂。』世間之人好施沙門、 諸婆羅門、貧窮、困苦，衣服、飲食、臥具、醫藥、象馬車乘、末 香、塗香、眾花、屋宅依止、燈明。作如是等種種惠施，為我後世 受可意報，是故當知決定有樂。 

「世尊!有諸外道復作是言:『以因緣故，當知有樂。』所謂受樂 者，有因緣故名為樂觸。若無樂者，何得因緣?如無兔角則無因 緣，有樂因緣則知有樂。 

「世尊!有諸外道復作是言:『上、中、下故，當知有樂。』下受 樂者，釋提桓因;中受樂者，大梵天王;上受樂者，大自在天。以 有如是上、中、下故，當知有樂。 

「世尊!有諸外道復言有淨。何以故?若無淨者，不應起欲;若起 欲者，當知有淨。又復說言，金、銀、珍寶、琉璃、頗梨、車璩、 馬瑙、珊瑚、真珠、璧玉、珂貝、流泉、浴池、飲食、衣服、花 香、末香、塗香、燈燭之明，如是等物悉是淨法。 
「復次，有淨，謂五陰者即是淨器，盛諸淨物，所謂人、天、諸 仙、阿羅漢、辟支佛、菩薩、諸佛。以是義故，名之為淨。

「世尊!有諸外道復言有我，有所覩見、能造作故。譬如有人入陶 師家，雖復不見陶師之身，以見輪繩，定知其家必是陶師。我亦如 是，眼見色已，必知有我。若無我者，誰能見色?聞聲乃至觸、 法，亦復如是。 

「復次，有我。云何得知?因相故知。何等為相?喘息、視眴、壽 命、役心、受諸苦樂、貪求、瞋恚，如是等法悉是我相，是故當知 必定有我。 

「復次，有我，能別味故。有人食果，見已知味，是故當知必定有 我。 

「復次，有我。云何知耶?執作業故。執鐮能刈、執斧能斫、執瓶 盛水、執車能御，如是等事我執能作，是故當知必定有我。 

「復次，有我。云何知耶?即於生時欲得乳哺，乘宿習故，是故當 知必定有我。 

「復次，有我云何知耶?和合利益他眾生故。譬如瓶、衣、車乘、 田宅、山林、樹木、象、馬、牛、羊，如是等物若和合者則有利 益。此內五陰亦復如是，眼等諸根有和合故則利益我，是故當知必 定有我。 

「復次，有我。云何知耶?有遮法故。如有物故則有遮礙，物若無 者則無有遮。若有遮者則知有我，是故當知必定有我。 

「復次，有我。云何知耶?伴非伴故。親與非親非是伴侶，正法、 邪法亦非伴侶，智與非智亦非伴侶，沙門、非沙門，婆羅門、非婆 羅門，子、非子，晝、非晝，夜、非夜，我、非我，如是等法為伴 非伴，是故當知必定有我。 

「世尊!諸外道等種種說有常、樂、我、淨，當知定有常、樂、 我、淨。世尊!以是義故，諸外道等亦得說言:『我有真諦。』」 

佛言:「善男子!若有沙門、婆羅門，有常、有樂、有淨、有我 者，是非沙門、非婆羅門。何以故?迷於生死，離一切智大導師 故。如是沙門、婆羅門等沈沒諸欲，善法羸損故。是諸外道繫在貪 欲、瞋恚、癡獄，堪忍愛樂故。是諸外道雖知業果自作自受，而猶 不能遠離惡法。是諸外道非是正法、正命、自活。何以故?無智慧 火，不能消故。是諸外道雖欲貪著上妙五欲，貧於善法、不勤修 故。是諸外道雖欲往至正解脫中，而持戒足不成就故。是諸外道雖 欲求樂，而不能求樂因緣故。是諸外道雖復憎惡一切諸苦，然其所 行未能遠離諸苦因緣。是諸外道雖為四大毒蛇所纏，猶行放逸，不 能謹慎。是諸外道無明所覆，遠離善友，樂在三界無常熾然大火之 中而不能出。是諸外道遇諸煩惱難愈之病，而復不求大智良醫。是 諸外道方於未來當涉無邊險遠之路，而不知以善法資糧而自莊嚴。 是諸外道常為婬欲災毒所害，而反抱持五欲霜毒。是諸外道瞋恚熾盛，而復反更親近惡友。是諸外道常為無明之所覆蔽，而反推求邪 惡之法。 

「是諸外道常為邪見之所誑惑，而反於中生親善想。是諸外道悕食 甘果，而種苦子。是諸外道已處煩惱闇室之中，而反遠離大智炬 明。是諸外道患煩惱渴，而復反飲諸欲醎水。是諸外道漂沒生死無 邊大河，而復遠離無上船師。是諸外道迷惑顛倒，言:『諸行 常。』諸行若常，無有是處。
`;
