GSZ.volNum = 0;
GSZ.text = `
/BQKaiTi/南北朝時，南朝梁僧人慧皎（497年～554年）撰，記東漢永平至南朝梁天監間著名僧人257人事蹟，附见274人，又分僧人為譯經、義解、神異、習禪、明律、遺身、誦經、興福、經師、唱導等10類。其中錄有多位高僧與譯經師。凡十四卷。後人稱之為《梁高僧傳》，與後唐代道宣撰《<a href="9071.htm">續高僧傳</a>》30卷、宋代贊寧等撰《<a href="9072.htm">宋高僧傳</a>》30卷、明代如惺撰《<a href="9073.htm">大明高僧傳</a>》8卷，合稱「四朝高僧傳」。

/BQKaiTi/《高僧傳》大量引用史料，可考者計八十種，“及晉、宋、齊、梁春秋書史，秦、趙、燕、涼荒朝偽曆，地理雜篇，孤文片記。並博諮古老，廣訪先達，校其有無，取其同異。”孫星衍評價：“遁入釋道，故多通品，辭理可觀，且足資考史，地方古跡亦可藉証，實爲有用之書。”
/VOLSEP/
<center><table border=0>
${ GSZ.bookGetter().toTRs() }
<tr><td nowrap><a href="?vol=14">卷十四</a></td><td nowrap>序錄</td></tr></table></center>`;
