SongGSZ.volNum = 0;
SongGSZ.text = `
/BQKaiTi/《宋高僧傳》，或稱《大宋高僧傳》，三十卷，宋代釋贊寧著。大宋興國七年（982年）贊寧任右街副僧錄時，奉令回杭州編纂《大宋高僧傳》，撰成於端拱元年（988年），序称正传五三三人，附见一三〇人，實則少於此數，前後歷時七年，宋太宗令僧錄司編入大藏經，賜絹三千匹。至道二年（996年），又重新整理。全書分为十科：〈譯經〉三十二人<ail>（附見十二人）</ail>；〈義解〉七十二人<ail>（附見二十二人）</ail>；〈習禪〉一〇三人<ail>（附見二十九人）</ail>；〈明律〉五十八人<ail>（附見十人）</ail>；〈護法〉一十八人<ail>（附見一人）</ail>；〈感通〉八十九人<ail>（附見二十三人）</ail>；〈遺身〉二十二人<ail>（附見二人）</ail>；〈讀誦〉四十二人<ail>（附見八人）</ail>；〈興福〉五十人<ail>（附見六人）</ail>；〈雜科〉四十五人<ail>（附見一十二人）</ail>。每篇之末有論，與《<a href="9071.htm">續高僧傳</a>》同。它一直與《<a href="9070.htm">梁高僧傳</a>》和《<a href="9071.htm">唐高僧傳</a>》一起，被視為僧傳中之名著。另加《<a href="9073.htm">明高僧傳</a>》八卷，合稱「四朝高僧傳」。

/BQKaiTi/本書最精彩者爲〈習禪篇〉，反映南頓北漸之爭，是研究禪宗史的很好資料。《宋高僧傳》多用野史，常有怪誕之談，如〈善無畏傳〉載天寶年間北邙山巨蛇事，時善無畏早已逝世，乃誤引《宣室誌》事。又載法藏參與玄奘譯經，麟德元年（664）玄奘去世時，法藏才二十一歲。
/VOLSEP/
<center><table border=0>
<tr><td></td><td nowrap colspan=3><a href="?vol=1">進《高僧傳》表</a></td></tr>
<tr><td></td><td nowrap colspan=3><a href="?vol=1&pin=a_001">《宋高僧傳》序</a></td></tr>
${SongGSZ.bookGetter().toTRs()}
<tr><td></td><td><a href="?vol=30&pin=epilog">後序</a></td></tr>
</table></center>`;
