new MyBookInfo('善財童子第二十七參「觀自在菩薩」', '大方廣佛華嚴經　入法界品第三十九之九')
.addContent(

"爾時！善財童子一心思惟彼居士教，" +
"|入彼菩薩解脫之藏，" +
"|得彼菩薩能隨念力，" +
"|憶彼諸佛出現次第，" +
"|念彼諸佛相續次第，" +
"|持彼諸佛名號次第，" +
"|觀彼諸佛所說妙法，" +
"|知彼諸佛具足莊嚴，" +
"|見彼諸佛成正等覺，" +
"|了彼諸佛不思議業，" +
"|漸次遊行至於彼山，處處求覓此大菩薩。",

"見其西面巖谷之中，泉流縈映，樹林蓊鬱，香草柔軟，右旋布地，觀自在菩薩於金剛寶石上結跏趺坐，無量菩薩皆坐寶石恭敬圍遶，而為宣說大慈悲法，令其攝受一切衆生。",

"善財見已，歡喜踊躍，合掌諦觀，目不暫瞬，作如是念：" +
"|善知識者則是如來，" +
"|善知識者一切法雲，" +
"|善知識者諸功德藏，" +
"|善知識者難可值遇，" +
"|善知識者十力寶因，" +
"|善知識者無盡智炬，" +
"|善知識者福德根芽，" +
"|善知識者一切智門，" +
"|善知識者智海導師，" +
"|善知識者至一切智助道之具，" +
"|便即往詣大菩薩所。",

"爾時！觀自在菩薩遙見善財，告言：善來！汝發大乘意普攝衆生，起正直心專求佛法，大悲深重救護一切，普賢妙行相續現前，大願深心圓滿清淨，勤求佛法悉能領受，積集善根恆無厭足，順善知識不違其教，從文殊師利功德智慧大海所生，其心成熟，得佛勢力，已獲廣大三昧光明，專意希求甚深妙法，常見諸佛生大歡喜，智慧清淨猶如虛空，既自明了復為他說，安住如來智慧光明。",

"爾時！善財童子頂禮觀自在菩薩足，遶無數匝合掌而住，白言：聖者！我已先發阿耨多羅三藐三菩提心，而未知菩薩云何學菩薩行，云何修菩薩道，我聞聖者善能教誨，願為我說。",

"菩薩告言：善哉！善哉！善男子。汝已能發阿耨多羅三藐三菩提心。",

"善男子！我已成就菩薩大悲行解脫門。",

"善男子！我以此菩薩大悲行門，平等教化一切衆生，相續不斷。",

"善男子！我住此大悲行門，常在一切諸如來所，普現一切衆生之前。",

"或以布施，攝取衆生。",

"或以愛語，或以利行，或以同事攝取衆生。",

"或現色身，攝取衆生。",

"或現種種不思議色，淨光明網攝取衆生。",

"或以音聲，或以威儀，或為說法，或現神變，令其心悟而得成熟。",

"或為化現同類之形，與其共居而成熟之。",

"善男子！我修行此大悲行門，願常救護一切衆生，願一切衆生" +
"|離險道怖、" +
"|離熱惱怖、" +
"|離迷惑怖、" +
"|離繫縛怖、" +
"|離殺害怖、" +
"|離貧窮怖、" +
"|離不活怖、" +
"|離惡名怖、" +
"|離於死怖、" +
"|離大衆怖、" +
"|離惡趣怖、" +
"|離黑闇怖、" +
"|離遷移怖、" +
"|離愛別怖、" +
"|離怨會怖、" +
"|離逼迫身怖、" +
"|離逼迫心怖、" +
"|離憂悲怖。",

"復作是願！願諸衆生，若念於我，若稱我名，若見我身，皆得免離一切怖畏。",

"善男子！我以此方便令諸衆生離怖畏已，復教令發阿耨多羅三藐三菩提心，永不退轉。",

"善男子！我唯得此菩薩大悲行門，如諸菩薩摩訶薩，已淨普賢一切願，已住普賢一切行，" +
"|常行一切諸善法，" +
"|常入一切諸三昧，" +
"|常住一切無邊劫，" +
"|常知一切三世法，" +
"|常詣一切無邊剎，" +
"|常息一切衆生惡，" +
"|常長一切衆生善，" +
"|常絕衆生生死流，" +
"|而我云何能知能說彼功德行。",

"爾時！東方有一菩薩，名曰正趣。從空中來，至娑婆世界輪圍山頂，以足按地，其娑婆世界六種震動，一切皆以衆寶莊嚴。",

"正趣菩薩放身光明，映蔽一切日月星電，天龍八部，釋梵護世，所有光明皆如聚墨，其光普照一切地獄、畜生、餓鬼、閻羅王處，令諸惡趣衆苦皆滅，煩惱不起，憂悲悉離。",

"又於一切諸佛國土，普雨一切華香瓔珞，衣服幢蓋，如是所有諸莊嚴具供養於佛。",

"復隨衆生心之所樂，普於一切諸宮殿中而現其身，令其見者皆悉歡喜，然後來詣觀自在所。",

"時！觀自在菩薩告善財言：善男子！汝見正趣菩薩來此會不？",

"白言：已見。告言：善男子！汝可往問，菩薩云何學菩薩行，修菩薩道。"
);
