function linksTD(vol, pin, title, pref, lst) {
  function lnk(s) {
    var post = '', br = '';
    if (s[0] == '*') { br = '<br>'; s = s.substring(1); }
    if (s.endsWith('）')) {
      var idx = s.indexOf('（');
      post = '<ail>' + s.substring(idx) + '</ail>';
      s = s.substring(0, idx);
    }
    return `${br}<a href="?vol=${vol}&pin=${pref}${s}">${s}</a>${post}`;
  }
  var a = lst.split('\|'), buf = new Buffer(),
      idx = title.indexOf('<br>');
  if (pin) pin = `&pin=${pin}`; else pin = '';
  if (idx > 0) {
    var atag = `<a href="?vol=${vol}${pin}">`;
    title = `【${atag}${title.substring(0,idx)}</a>】${atag}${title.substring(idx)}</a>`;
  }
  else if (title[0] == '　')
    title = `<a href="?vol=${vol}${pin}">${title}</a>`;
  else
    title = `【<a href="?vol=${vol}${pin}">${title}</a>】`;
  buf.w('<td nowrap valign=top>', title, '</td><td>', lnk(a[0]));
  for (var i=1; i<a.length; ++i)
    buf.w('　').w(lnk(a[i]));
  return buf.w('</td>').render();
}
JTSXL.volNum = 0;
JTSXL.text = `
/C/<a#a01>淨土聖賢錄敘</a>　<a#a02>淨土聖賢錄發凡</a>　<a#a03>淨土聖賢錄偈</a>
/VOLSEP/
<table>
<tr><td nowrap valign=top rowspan=2>卷一</td>
${linksTD(1, null, '淨土教主第一', '', '阿彌陀佛')}</tr>
<tr>
${linksTD(1, 'a02', '闡教聖眾第二', '', '觀世音菩薩|大勢至菩薩|普賢菩薩|文殊師利菩薩|祈婆迦尊者|馬鳴尊者|龍樹尊者|天親論師|*覺明妙行菩薩')}</tr>
<tr><td valign=top>卷二</td>
${linksTD(2, null, '往生比邱第三<br>　　　　　之一', '3', '慧遠（慧持）|慧永|僧顯|慧虔|僧濟|慧恭（僧光、慧蘭）|曇恒|道敬|曇順|佛䭾䟦陀羅|道昞|僧叡|曇詵|慧崇|曇鑒（道海、惠龕、惠恭、曇汊、道廣、道光）|慧通|曇宏|慧進|道珍|曇鸞|法琳|慧光|僧柔|道憑|慧命（法音）|靜靄|慧敬|曇延|道喻|智舜|登法師|智顗|慧成|慧命|慧海|智通|真慧|法智|善胃|道傑（樊綽）|灌頂|僧藏|法喜|道昂|智琰|等觀|壽洪|道綽（道撫）|僧衒（啟芳、圓果）|普明|二沙彌|德美|慧滿|神素|明瞻|元會|慧璿|明濬|善導|懷感|法祥|寶相|功迥|惟岸|法持|懷玉|慧日|常慜|法善|神皓|道光|飛錫|齊翰|自覺')}</tr>
<tr><td valign=top>卷三</td>
${linksTD(3, null, '　　　　　之二', '3', '承遠|法照|少康|辯才|善道|智欽|知元|端甫|雄俊|惟恭|大行|志通|可止|紹巖|守真|延壽|晤恩（文備）|文輦|義通|有基|省常|知禮|遵式|義懷|本如|仁岳|處謙|慧才|靈照|思義|宗賾|元淨|從雅|可久（勳公、孫十二郎、徐道姑）|擇瑛|宗本|有嚴|妙生|曇異|善本|宗坦|中立|元照|法宗|了然|智仙|智深|思照|若愚（則章）|仲閔|介然')}</tr>
<tr><td valign=top>卷四</td>
${linksTD(4, null, '　　　　　之三', '3', '齊玉|蘊齊|道言|元肇|思淨|如湛|宗利|道琛|子元|妙雲|睎顏|道因|有朋|惟月|思敏|慧亨|行詵|用欽|惟渥|仲明|沖益|本空|法因|智廉|慧明|了義|慧誠|祖南|晞湛|法持|了宣（善榮）|曇懿|祖朗|太微|思聦|淨觀|利先|師安|如寶|顯超|有開|道生|若觀|瑩珂|智印|戒度|祖輝|如鑑|祖新|妙文|善住|旨公|性澄|蒙潤|明本|優曇|宏濟|必才|悅可|維則|善繼|子文|盤谷|文慧|妙叶')}</tr>
<tr><td valign=top>卷五</td>
${linksTD(5, null, '　　　　　之四', '3', '梵琦|可授|慧日|普智|景隆（琴公）|寶珠|本明|義秀|雪梅|性專|祖香|圓果|真清|明證（真定）|明玉|法祥|袾宏|如榮|如清|廣製|真緣|傳記|德清|傳燈|古松|仲光|金童廟僧|海寶|大雲|無名僧')}</tr>
<tr><td valign=top rowspan=2>卷六</td>
${linksTD(6, null, '　　　　　之五', '3', '智旭|如會|大勍|大真|道樞|崇文|具宗|讀體|林谷|萬緣|勝慈|成時|行策|海潤（長涇僧）|指南|超城|明宏|明德|實賢|明悟|德峻|聞言|道徹|成註|了庵|實定（際會）|實圓|恒一|慧端|法真|佛安')}</tr>
<tr>
${linksTD(6, 'a02', '往生比邱尼第四', '4', '慧木|法盛|淨真|法藏|悟性|能奉|慧安|袾錦|廣覺|成靜|潮音')}</tr>
<tr><td valign=top rowspan=2>卷七</td>
${linksTD(7, null, '往生人王第五', '5', '烏萇國王')}</tr>
<tr>
${linksTD(7, 'a02', '往生王臣第六', '6', '七萬釋種|劉程之|于昶|馬子雲|韋文晉|張抗|文彥博|楊傑（王仲回）|王古（葛繁）|鍾離瑾（景融松）|馬圩（永逸）|江公望|陳瓘|王衷|張廸|胡闉|馮楫|吳秉信|張揄|李秉|陸沅|錢象祖|昝家國（計公）|梅汝能|朱綱|陳瓚|嚴澂（樸）|蔡承植|虞湻熙|唐時|袁宏道（中道登）|丁明登|黃翼聖|金光前（龔氏）')}</tr>
<tr><td valign=top>卷八</td>
${linksTD(8, null, '往生居士第七', '7', '差摩竭|闕公則|張野|張詮|何曇遠|魏世子|庾詵|宋滿|鄭牧卿|高浩象|李知遙|孫忠|左伸|孫良|賈純仁|范儼|孫忭|唐世良|陸浚|王闐|王日休|樓汾|張元祥|元子平|姚約|梅福|胡嵩|陸偉|閻邦榮|吳克己|陳君璋|王九蓮|楊嘉禕|陳道民|唐廷任|戈以安|孫叔子|郭大林|劉通志|郝熙載|杜居士|吳大恩|吳繼勛|華居士|顧原|朱元正|周廷璋|程見山|張守約|莊廣還|鮑宗肇|莊嚴|黃承惠|聞啟初|沈咸（宏）|朱鷺|吳瞻樓|吳鳴珙|王醇|陳至善|張光緯|袁列星|皇甫士坊|羅允枚|周夢顏（王孟隣、余鶴亭）|沈中旭|楊廣文|顧天瑞（陸氏、俞氏）|姜見龍|沈炳|王恭')}</tr>
<tr><td valign=top rowspan=3>卷九</td>
${linksTD(9, null, '往生雜流第八', '8', '張鍾馗|張善和|金𠁗|馮氓|吳瓊|李彥通|黃生|徐六公|沈三郎|師贊|倪道者|大善寺行童|張愛|吳澆燭|吳毛|王仰泉|梁維周')}</tr>
<tr>
${linksTD(9, 'a02', '往生女人第九', '9', '韋提希夫人（五百侍女）|樂音老母|紀氏|魏氏女|獨孤皇后|王氏|姚婆|溫靜文妻|任氏|王氏|陳媼|袁媼|陳媼|于媼|王氏|馮氏|吳氏|龔氏|孫氏女|郭氏|施氏|姚婆|王氏|王百娘|朱氏|陸氏|蔡氏|項氏|沈氏|鍾婆|梁氏女|黃婆|崔婆|陶氏|李氏|盛媼|黃氏|王氏女|樓氏|周婆|朱氏|裴氏女|孫媼|秦媼|蔣十八妻|沈媼|孟氏|陳氏|胡媼|周氏|鄭氏|周婆|張夫人|薛氏|方氏|徐氏|許氏婦|于媼|潘氏|朱氏|祝氏|張太宜人|楊選一妻|鍾氏|吳氏女|盧氏|費氏|李氏|李氏|陳嫗|張寡婦|陸寡婦|楊氏|江氏|徐太宜人|凌氏|余媼|楊媼|余氏')}</tr>
<tr>
${linksTD(9, 'a03', '往生物類第十', '10', '鸚鵡|鴝鵒|白鸚鵡')}</tr>
</table>
/VOLSEP/

/SECTION:a01/淨土聖賢錄敘

至哉！淨土之教，其諸聖人所由以踐形者乎？孟子曰：形色，天性也。知形色之為天性，則不容離土以言心；知天性之為形色，則不容外心以求土。離土以言心，是以天性為有外也，其所謂心，一介然者而已矣；外心以求土，是以形色為有外也，其所謂土，一塊然者而已矣。是皆不明乎踐形之說者也。華嚴圓教，理事無礙，事事無礙。普賢偈曰：一切剎海劫無邊，以一方便皆清淨。此踐形之極則也。又曰：願我臨欲命終時，盡除一切諸障礙，面見彼佛阿彌陀，即得往生安樂剎。此踐形之正軌也。或以毗盧遮那徧一切處，何得偏指西方，有乖全體？曾不知華藏海中，一塵一毛，具足十方無邊器界，極樂莊嚴，亦復如是。然則但見阿彌陀一佛，即已徧見十方諸佛；但生西方極樂一土，即已徧歷十方佛土。何以故？即一即多，無二無差別故。唯此法門，我釋迦尊金口所宣，十方恒河沙諸佛所共讚，諸大菩薩流通護持，轉轉無盡。自大教東來，單傳直指，外以念佛得度者，若緇若白，未易悉數。際清素服儒風，兼修淨行，常欲薈萃舊聞，用資警策，而日力倉卒，因循至今。會兄子希涑，初發信心，願成此錄，以堅向往。因為標指體要，載稽經論，次支那著述，續以耳目所及，斟酌損益，勒成一編，名之曰淨土聖賢錄。庶幾見聞隨喜，得預法流，一念歸誠，同登彼岸，豈不善哉！詩有之：緡蠻黃鳥，止于邱隅。夫淨土亦聖賢之邱隅也，隨其心淨，則佛土淨，得所止矣。而下學之功，莫先於知止，故曰於止知其所止，可以人而不如鳥乎？經云：彼國常有白鶴、孔雀、鸚鵡、舍利、迦陵頻伽、共命之鳥，晝夜六時，出和雅音，其音演暢五根、五力、七菩提分、八聖道分，如是等法。其土眾生，聞是音已，皆悉念佛、念法、念僧，心邪？土邪？形色邪？天性邪？直下知歸，絕諸戲論，蓮華種子，只在當人。覽是錄者，其諸有樂於踐形之說矣乎！踐形者，往生之謂也。

/TEXT339R/乾隆四十八年孟春之月淨業學人彭際清撰

/SECTION:a02/淨土聖賢錄發凡
/ul/
凡錄往生者，祇載支那著述。至經論所明淨教緣起，多從闕略。譬之治河不由積石，導江不自岷山。既昧其原，其流將壅。茲首標教主，著所宗也。次觀音、勢至，明有輔也。普賢、文殊，左右遮那，而同讚西方，同揚淨業。故知十方諸大菩薩，莫不以淨土為歸矣。至如西天諸祖，及諸論師，即不盡著往生之驗。而既登果地，豈局東西。凡諸議論，有關斯教者，亦並著之，廣資勸誘云爾。
華嚴入法界品，如德雲比邱，解脫長者，鞞瑟胝羅居士，俱不離念佛而入解脫門。乃至一念之頃，現無邊剎土，見無量諸佛。斯唯達自心原，窮諸行海，方能親證如斯三昧。修淨業人，決當刳心頂受。然事屬通塗，不專一剎。理周沙界，匪局西方。倘濫入此編，恐有乖全例。故概略其文，獨標其義如此。
歷代高僧傳、佛祖統紀、佛祖通載諸書，但載諸師事蹟，而議論激揚，概從簡棄。雲棲往生集又唯標事驗，行實罕詳，遂可合張李為一身，溷淄澠而同味，覽未及終，倦而思臥者多矣。茲則該羅細行，圓具全身，綜貫千章，獨標警策，如智者十疑論、紫閣寶王論、永明萬善同歸、虎溪蓮宗寶鑑、天如或問、鄞江直指、西齋淨土詩、雲棲法彚截流警語，以及方內諸公種種論述，網全帙而難周，扼片言而奚欠，用代遒人之詔，宛同天鼓之鳴，願諸仁者敬而聽之。
向之錄往生者，必著事驗，事驗無聞，遂多闕漏。雖然，不覩其形，願察其景，但自淨心，往生何待？首楞嚴經云：若飛心中，兼福兼慧，自然心開，見十方佛，一切淨土，隨願往生。故知紫閣、天衣、中峯、天如、妙叶、空谷、憨山諸尊宿，及陳瑩中、馮濟川諸前輩，密因有在，正果非虗，撒手便行，不移跬步，何待臨終十念，始能決定往生？不宜逐迹而求，轉乖教理。
往生集，唯以吉祥善逝為高。其有捐軀舍命者，概斥而不錄。獨尊庸行，曲為時宜。雖慮出萬全，而事難一概。普賢行願品言，毗盧遮那如來，從初發心，精進不退。以不可說不可說身命，而為布施。六度經中，廣明斯事，故如此錄。靜藹為法捐軀，常愍忘身濟物。悲心深廣，淨願堅牢。載覽遺言，猶懷悚厲。他如善導，志通文輦，慧誠超城。諸公速捨報身，求生淨土。神明安定，不震不撓。是則以普賢願王，回向彌陀法界。憑茲猛烈，不退菩提。如斯榜樣，祗應隨學，詎可輕排。然則魔可毋慮乎。曰，魔之與佛，只在一心。但辦正因，決成正果。了知四大本空，五蘊非有。當捨身時，如遺迹等，如委蛻等，誰為能捨，誰為所捨。然則刀山火聚，悉是道場。寶樹華池，不離當處。是心是佛，是心作佛，夫何遠之有。如其三昧未成，我執未化。祗因欣厭之情，激成取捨之行。竊恐痛苦所逼，煩惱轉強。九品難期，波旬得便。雲棲所慮，良在於斯。末法行人，切宜自審。
從上諸家紀述，繁簡不齊，雅俗並奏，不經甄別，難免淆訛。茲斟酌舊文，參稽往牒，加之潤飾，就我準繩，要於本旨，初無乖剌。仍各注原書，以明左證。
淨土諸書，標指古德，概以師稱。而高僧傳，則凡屬二名，但舉一字。此錄前有佛菩薩，後有宰官居士。若不書名，頗難合轍。故於出家二眾，準高僧傳，但書一字。其在家者，準前史例，仍書二名。
往生集載周續之臨終見佛，合掌而逝。攷諸前史及東林傳，都無此文，當屬後人和會。又載白樂天、蘇子瞻、張天覺三人，謂據因攷果，當生西方。夫白公雖有繪圖回向之誠，而平生信樂，多在兜率，集中文句，確然可徵。<ail>（集中畫彌勒上生幀記，次畫西方幀記之後，並題開成五年三月。或謂白先蘄兜率，後歸安養者，非也。）</ail>子瞻臥病時，向徑山長老口占偈言，灑然解脫，洵為希有。至語及西方，則曰：西方不無，然箇裏著力不得。夫修淨業者，必具三心，所謂深心、至誠心、回向發願心，乃至臨終十念，未有不由著力而得者。至云著力不得，則三心未具，難保往生。無盡居士深入法原，眼空四海，今所錄發願文，有類童蒙，頗同寒乞，與他所傳文字不類，亦未可信，故并刪之。
居士傳、善女人傳，所錄諸賢，必徵素行，苟有瑕疵，概從簡斥。茲則但以末後為憑，不論既往之失，故如雄俊、惟恭之輩，鍾馗、善和之徒，既登末品，便預聖流，其他概可知矣。是知彌陀願力，極樂莊嚴，如大海不拒夫百川，杲日不遺於一孔，但肯回心，都無棄物，凡屬有情，普應信受。
//
/L/右鄙見數條，當是錄草創之始，即口授希涑，每一篇成，輒為隨手勘定。全帙既具，大旨無乖，復筆之簡端，以告來者。

/TEXT339R/淨業學人彭際清記

/SECTION:a03/淨土聖賢錄偈
/TEXT339R/淨業弟子彭希涑述
/gatha/
大哉眾生心，微妙難思議，
究竟如虗空，無一法可得，
普能作佛事，成熟菩提果。

一念不自覺，迷妄起空華。
由諸業力持，建立十方土，
眾方於其中，顛倒靡已時。
百萬有八千，亂想無根緒，
七趣如輪轉。了達唯一心，
心心互周徧，剎剎分勝劣。

或淨寶莊嚴，或瓦礫穢聚，
或照曜明朗，或無日月光，
或菩薩住處，安隱壽無量，
或是雜生居，苦多而樂少，
或餓鬼充滿，幽魄長叫喚，
或純現地獄，碾磑受苦楚。
諸佛普住持，隨所宜說法。

彌陀大願王，發心取淨土，
成就安樂剎，十方莫能比。
備諸珍寶性，有情所愛樂。
正覺華化生，聞法悟無上。
他方諸眾生，起心信慕者，
佛力悉加護，命終得往生。

嗟彼無智人，聞言盡狂惑，
不知是淨土，我心所畢具。
凡夫一念閒，諸佛悉炳現，
香水無邊剎，光明互徧滿，
念佛便見佛，求生便往生。
如取自家珍，東西非窒礙。

良哉諸上人！善能了實相，
知諸法如夢，而不趨寂滅。
隨順修多羅，嚴淨佛國土，
我今普歸依。讚歎并隨喜。
廼以至誠心，深心回向心，
願捨此堪忍，疾生清淨域。

佛力不可說，心力不可說，
轉彼穢濁居，悉作蓮華藏。
我今說偈已，頂禮諸賢聖，
願舒白毫光，攝盡微塵眾，
華開彈指頃，畢入菩提場。
//
`;
