var c7;

(()=>{
  var sectionTitle = '【品分標題】';
  var DATA = `
${sectionTitle}         |夏:法會聖眾第一    |王:法會大眾分第一 |
                比丘人數|夏:萬二千          |王:千二百五十        |魏:萬二千人|唐:萬二千人  |宋:三萬二千  |漢:千二百五十|吳:萬二千  |
              尊者列名數|夏:5               |王:10                |魏:31      |唐:25        |宋:31        |漢:35        |吳:31      |
          其他四衆列名數|夏:                |王:                  |魏:        |唐:          |宋:          |漢:32        |吳:        |
            大菩薩列名數|夏:3               |王:3                 |魏:3       |唐:3         |宋:無        |漢:無        |吳:無      |
${sectionTitle}         |夏:德遵普賢第二 |
          十六正士列名數|夏:16              |王:5                 |魏:15      |唐:11        |宋:無        |漢:無        |吳:無      |
                八相成道|夏:無              |王:無                |魏:有      |唐:有        |宋:無        |漢:無        |吳:無      |
                正士德行|夏:多              |王:無                |魏:多      |唐:多        |宋:無        |漢:無        |吳:無      |
      比丘尼清信士清信女|夏:有              |王:無                |魏:無      |唐:無        |宋:無        |漢:有        |吳:無      |
${sectionTitle}         |夏:大教緣起第三    |王:阿難發問分第二 |
                世尊容光|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:有        |吳:有      |
            阿難承佛聖旨|夏:無              |王:無                |魏:有      |唐:無        |宋:無        |漢:無        |吳:無      |
                阿難祈請|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
      佛徵天人教阿難答無|夏:無              |王:有                |魏:有      |唐:有        |宋:無        |漢:有        |吳:有      |
              佛讚阿難問|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:有        |吳:有      |
                自述佛德|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:無        |吳:有      |
${sectionTitle}                             |王:五十三佛分第三 |
            過去佛列名數|夏:無              |王:53                |魏:53      |唐:36        |宋:37        |漢:36        |吳:33      |
${sectionTitle}         |夏:法藏因地第四 |
          世自在王如來名|夏:世間自在王      |王:世自在王          |魏:世自在王|唐:世間自在王|宋:世自在王  |漢:樓夷亘羅  |吳:樓夷亘羅|
${sectionTitle}                             |王:法藏本因分第四 |
      阿彌陀佛因地菩薩名|夏:法藏            |王:法藏              |魏:法藏    |唐:法處      |宋:作法      |漢:曇摩迦留  |吳:曇摩迦  |
              菩薩讚佛偈|夏:7字40句         |王:5字46句           |魏:4字80句 |唐:7字42句   |宋:7字36句   |漢:5字80句   |吳:無      |
${sectionTitle}         |夏:至心精進第五    |王:大願問佛分第五 |
            說大海斗量譬|夏:有              |王:有                |魏:有      |唐:無        |宋:無        |漢:有        |吳:        |
          佛示現諸佛剎土|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:        |
${sectionTitle}         |夏:發大誓願第六    |王:四十八願分第六 |
                  發願數|夏:48              |王:48                |魏:48      |唐:48        |宋:36        |漢:24        |吳:24      |
${sectionTitle}         |夏:必成正覺第七    |王:願後說偈分第七 |
                願後說偈|夏:5字44句         |王:5字44句           |魏:5字44句 |唐:7字48句   |宋:5字52句   |漢:無        |吳:無      |
${sectionTitle}         |夏:積功累德第八    |王:初修善行分第八 |
${sectionTitle}                             |王:親近諸佛分第九 |
        勇猛精進建立常然|夏:有              |王:有                |魏:有      |唐:無        |宋:有        |漢:          |吳:        |
                積植德行|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:有      |
                常供諸佛|夏:有              |王:有                |魏:有      |唐:無        |宋:有        |漢:          |吳:        |
                善護三業|夏:有              |王:有                |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
                不著世間|夏:有              |王:無                |魏:無      |唐:有        |宋:有        |漢:          |吳:        |
                恆修六度|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}                             |王:願成作佛分第十 |
                自利功德|夏:有              |王:有                |魏:無      |唐:有        |宋:有        |漢:          |吳:        |
                利他功德|夏:有              |王:有                |魏:無      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:圓滿成就第九    |王:蜎蠕亦度分第十一  |
          阿難問過現來佛|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
      告極樂世界阿彌陀佛|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
            成佛于今__劫|夏:十              |王:十                |魏:十      |唐:十        |宋:十        |漢:十八      |吳:十小    |
              極樂世界名|夏:                |王:                  |魏:        |唐:          |宋:          |漢:          |吳:須摩題  |
${sectionTitle}         |夏:皆願作佛第十    |王:阿闍世王分第十四  |
        阿闍王子等願成佛|夏:有              |王:有                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
${sectionTitle}         |夏:國界嚴淨第十一  |王:地平氣和分第十五  |
        永無苦難惡趣魔惱|夏:有              |王:有                |魏:無      |唐:有        |宋:無        |漢:有        |吳:有      |
              無時季雨冥|夏:有              |王:有                |魏:有      |唐:無        |宋:無        |漢:有        |吳:有      |
              無江海坑山|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
    七寶黃金為地寬廣平正|夏:有              |王:有                |魏:有      |唐:無        |宋:有        |漢:有        |吳:有      |
                飲食自來|夏:                |王:有                |魏:        |唐:無        |宋:無        |漢:有        |吳:有      |
${sectionTitle}                             |王:佛智無極分第四十  |
    阿難惑無須彌二天所居|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
        佛謂汝有疑於佛耶|夏:無              |王:有                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
            佛智無量無邊|夏:無              |王:有                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
${sectionTitle}                             |王:獨無須彌分第四十一|
  阿難聞佛大恐怖而告其由|夏:無              |王:有                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
        佛解業因果報之法|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
虛空住止無所依因由佛威神|夏:                |王:                  |魏:        |唐:          |宋:          |漢:有        |吳:有      |
        阿難無疑為眾而問|夏:有              |王:無                |魏:有      |唐:有        |宋:無        |漢:無        |吳:無      |
${sectionTitle}         |夏:光明遍照第十二  |
    阿彌陀佛光照無數佛剎|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:光明獨勝分第十二  |
        佛光遠近前世所求|夏:有              |王:有                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
        佛光遠勝日月之明|夏:有              |王:                  |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
        光中極尊佛中之王|夏:有              |王:有                |魏:有      |唐:無        |宋:無        |漢:有        |吳:有      |
${sectionTitle}                             |王:十三佛號分第十三  |
          阿彌陀佛別名數|夏:13              |王:13                |魏:13      |唐:16        |宋:14        |漢:無        |吳:        |
            衆生遇光得脫|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}         |夏:壽衆無量第十三  |王:佛壽人數分第三十八|
        無量壽佛壽命無量|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
              聲聞衆無量|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
          聲聞衆壽命無量|夏:有              |王:無                |魏:無      |唐:有        |宋:無        |漢:          |吳:        |
        掌中能持一切世界|夏:有                                    |魏:有      |唐:無        |宋:無        |漢:          |吳:        |
    目犍連及所有衆生難量|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
        大海水毛塵水之譬|夏:有              |王:無                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:寶樹徧國第十四　|
                    寶樹|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
                出微妙音|夏:有              |王:                  |魏:有      |唐:無        |宋:無        |漢:有        |吳:        |
${sectionTitle}         |夏:菩提道場第十五　|王:道場寶樹分第二十七|
      道場菩提樹衆寶合成|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}                             |王:寶網音香分第二十八|
            珍妙寶網羅覆|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}                             |王:樹音妙樂分第二十四|
        風吹寶樹出微妙音|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
  十方世界音聲中最為第一|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
    佛剎花果樹木與作佛事|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
        衆生觸得不退三忍|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
皆無量壽威神力至究竟願故|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
${sectionTitle}         |夏:堂舍樓觀第十六　|王:講堂宅宇分第十六  |
        精舍宮殿寶化妙飾|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:        |
${sectionTitle}                             |王:澡畢進業分第二十一|
      衆生在地在空修行者|夏:有              |王:有                |魏:        |唐:          |宋:          |漢:有        |吳:有      |
          衆生皆得不退位|夏:有              |王:有                |魏:        |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:泉池功德第十七　|王:寶池大小分第十七  |
        泉池交流縱廣皆等|夏:有              |王:有                |魏:有      |唐:無        |宋:無        |漢:有        |吳:有      |
            無海而有諸河|夏:無              |王:無                |魏:無      |唐:有        |宋:有        |漢:          |吳:        |
                沐浴蓮坐|夏:無              |王:無                |魏:無      |唐:無        |宋:無        |漢:有        |吳:有      |
${sectionTitle}                             |王:池岸花樹分第二十三|
        華樹芬芳七寶金沙|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:澡雪形體分第二十  |
                水隨人意|夏:有              |王:無                |魏:有      |唐:無        |宋:有        |漢:無        |吳:有      |
${sectionTitle}                             |王:池流法音分第二十二|
    法音波揚聞者聞不退心|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:蓮華化生分第十八  |
    生者池華化生無有惡惱|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:超世希有第十八　|
        極樂衆生色妙希有|夏:有              |王:                  |魏:有      |唐:有        |宋:          |漢:有        |吳:有      |
${sectionTitle}                             |王:𠣏者比類分第十九  |
        乞人帝王天主之譬|夏:有              |王:有                |魏:有      |唐:有        |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:受用具足第十九　|
極樂衆生色智神通福德無量|夏:有              |王:                  |魏:有      |唐:有        |宋:無        |漢:          |吳:有      |
                衣服自來|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:自然飲食分第二十五|
                飲食自來|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
        樓觀堂閣應念現前|夏:有              |王:                  |魏:無      |唐:有        |宋:有        |漢:          |吳:有      |
${sectionTitle}         |夏:德風華雨第二十　|
    食時風起吹網出音說法|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
        吹林飄華如是六反|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:寶蓮佛光第二十一|王:蓮花現佛分第二十九|
寶蓮周滿百千億葉無量色光|夏:有              |王:有                |魏:有      |唐:有        |宋:          |漢:          |吳:        |
光中出佛佛又放光說微妙法|夏:有              |王:有                |魏:有      |唐:有        |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:決證極果第二十二|
        無變無別清淨快樂|夏:有              |王:                  |魏:        |唐:有        |宋:有        |漢:有        |吳:有      |
        皆住正聚決證菩提|夏:有              |王:                  |魏:        |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:十方佛讚第二十三|王:十方稱讚分第四十二|
                十方佛讚|夏:有              |王:有                |魏:        |唐:有        |宋:有        |漢:          |吳:有      |
欲令衆生一念淨信迴向求生|夏:有              |王:有                |魏:        |唐:有        |宋:有        |漢:          |吳:無      |
        惟除五逆誹謗正法|夏:無              |王:有                |魏:        |唐:有        |宋:無        |漢:          |吳:無      |
${sectionTitle}         |夏:三輩往生第二十四|王:三輩往生分第四十三|
      願生彼國者凡有三輩|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
  上輩者捨家棄欲而作沙門|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
發菩提心專念淨土善根迴向|夏:有              |王:無                |魏:有      |唐:有        |宋:          |漢:無        |吳:有      |
          行六度專念彌陀|夏:無              |王:有                |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
      中輩者非沙門行同上|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
                第二中輩|夏:                |王:                  |魏:        |唐:          |宋:          |漢:有        |吳:有      |
  下輩者發菩提心專念彌陀|夏:有              |王:無                |魏:有      |唐:無        |宋:          |漢:無        |吳:無      |
下輩者不發菩提心專念彌陀|夏:無              |王:有                |魏:無      |唐:無        |宋:          |漢:有        |吳:有      |
            第二輩狐疑者|夏:                |王:                  |魏:        |唐:          |宋:          |漢:有        |吳:有      |
修諸功德迴向彼佛願欲往生|夏:無              |王:無                |魏:無      |唐:有        |宋:          |漢:無        |吳:無      |
住大乘者十念願生一念淨心|夏:有              |王:無                |魏:無      |唐:有        |宋:          |漢:無        |吳:無      |
${sectionTitle}         |夏:往生正因第二十五|
持誦供養此經發心晝夜求生|夏:有              |王:                  |魏:        |唐:無        |宋:有        |漢:無        |吳:無      |
${sectionTitle}                             |王:必修十善分第四十四|
行十善業晝夜志心歸依供養|夏:有              |王:有                |魏:        |唐:          |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:復有三等分第四十五|
  慈心精進十日一日不斷絕|夏:有              |王:有                |魏:        |唐:          |宋:          |漢:有        |吳:有      |
發菩提心持戒益眾作善得生|夏:無              |王:有                |魏:        |唐:          |宋:          |漢:無        |吳:無      |
${sectionTitle}                             |王:一生補佛分第四十六|
當得阿惟越致三十二相作佛|夏:有              |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
              當一生補處|夏:                |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
        皆住正聚決證菩提|夏:                |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
除發願度衆生擐甲胄生惡世|夏:                |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
${sectionTitle}                             |王:大會寶池分第四十七|
      眾會寶池中各坐蓮華|夏:無              |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
    自陳前世修持淺深多寡|夏:無              |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:禮供聽法第二十六|王:十方聽法分第三十一|
                    長偈|夏:5字70句         |王:5字54句           |魏:5字120句|唐:5字50句   |宋:7字40句   |漢:6字128句  |吳:無偈    |
${sectionTitle}                             |王:觀音發問分第三十二|
觀音問彌陀面門放光照佛剎|夏:無              |王:有                |魏:偈有    |唐:          |宋:有        |漢:          |吳:        |
    佛答曾發誓令見光解脫|夏:無              |王:有                |魏:無      |唐:          |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:歌嘆佛德第二十七|
${sectionTitle}                             |王:菩薩出供分第三十三|
欲供他方佛無量壽佛然可之|夏:無              |王:無                |魏:        |唐:無        |宋:無        |漢:有        |吳:有      |
      一食頃往十方剎供佛|夏:有              |王:有                |魏:        |唐:有        |宋:有        |漢:有        |吳:有      |
散華遍覆三千大千共奏天樂|夏:有              |王:有                |魏:        |唐:有        |宋:有        |漢:種種大小  |吳:種種大小|
  還國聽無量壽佛演暢妙法|夏:有              |王:有                |魏:        |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}                             |王:景象殊勝分第二十六|
                無有婦女|夏:無              |王:有                |魏:        |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}                             |王:大會說法分第三十  |
        無量壽佛廣宣大教|夏:有              |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
諸天皆齎華香伎樂熙怡快樂|夏:有              |王:                  |魏:        |唐:          |宋:          |漢:          |吳:        |
          衆生皆得不退位|夏:                |王:有                |魏:        |唐:          |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:大士神光第二十八|王:光明大小分第三十六|
        掌中能持一切世界|夏:                |王:有                |魏:        |唐:          |宋:無        |漢:          |吳:        |
        洞視徹聽皆豫知之|夏:有              |王:有                |魏:        |唐:          |宋:無        |漢:有        |吳:有      |
        聲聞菩薩身色光明|夏:有              |王:有                |魏:有      |唐:          |宋:有        |漢:有        |吳:有      |
  二菩薩威神光明最尊第一|夏:有              |王:有                |魏:有      |唐:          |宋:有        |漢:有        |吳:        |
              觀世音名號|夏:觀世音          |王:觀世音            |魏:觀世音  |唐:          |宋:觀自在    |漢:廅樓亘    |吳:廅樓亘  |
              大勢至名號|夏:大勢至          |王:大勢至            |魏:大勢至  |唐:          |宋:大精進    |漢:摩訶那缽  |吳:摩訶那缽|
急難恐怖歸命觀音皆得解脫|夏:有              |王:有                |魏:無      |唐:          |宋:無        |漢:有        |吳:有      |
${sectionTitle}         |夏:願力宏深第二十九|王:恩德無窮分第三十七|
              當一生補處|夏:有              |王:                  |魏:有      |唐:有        |宋:          |漢:          |吳:        |
除發願度衆生擐甲胄生惡世|夏:有              |王:                  |魏:有      |唐:有        |宋:          |漢:          |吳:        |
意欲度脫十方世界諸衆生類|夏:有              |王:有                |魏:無      |唐:無        |宋:          |漢:          |吳:        |
        生生之處常識宿命|夏:有              |王:無                |魏:有      |唐:有        |宋:          |漢:          |吳:        |
  國常一法不增多如海納川|夏:有              |王:無                |魏:無      |唐:          |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:菩薩修持第三十　|王:菩薩功德分第三十四|
  菩薩依七覺聖道修持五眼|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
辯才無礙遠離顛倒樂在正論|夏:有              |王:有                |魏:有      |唐:無        |宋:有        |漢:          |吳:        |
  無愛無厭無彼我違怨之想|夏:有              |王:                  |魏:有      |唐:有        |宋:無        |漢:有        |吳:        |
        究竟一乘不由他悟|夏:有              |王:                  |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
${sectionTitle}         |夏:真實功德第三十一|
菩提光潔比海須彌日月雪山|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
  忍辱淨熾不著如地水火風|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
法音甘露雷震至尼拘鐵圍山|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
            擊法鼓建法幢|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
            摧伏一切魔軍|夏:有              |王:無                |魏:無      |唐:有        |宋:無        |漢:          |吳:        |
            奉諸佛作福田|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
佛共稱讚住三摩地遠二乘境|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
${sectionTitle}                             |王:遞次作佛分第三十九|
彌陀入滅觀音勢至遞次作佛|夏:無              |王:有                |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:壽樂無極第三十二|
    其國妙若此何不力為善|夏:有              |王:                  |魏:有      |唐:          |宋:          |漢:無        |吳:無      |
        外緩內急中表相應|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
        隨經約令若於繩墨|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
淡安無欲苞羅表裏過度解脫|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
  自然中自然相至轉變最勝|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
  鬱單成七寶至洞達無邊際|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
    宜各勤精進往生極樂國|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
  橫截於五趣至壽樂無有極|夏:有              |王:                  |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
    何為著世事譊譊憂無常|夏:有              |王:                  |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:勸諭策進第三十三|王:世人極苦分第四十八|
        世人共爭不急之務|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
累念積慮貧富同然憂苦萬端|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
世間親屬當相敬愛無相憎嫉|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
        人在愛中苦樂自當|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
善惡不見禍福競作哀哉可傷|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
先人不善無語不信死生之趣|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
死生顧戀年壽旋盡無可奈何|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
惑道衆悟道少入惡道無出期|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
        遠離眾惡擇善勤行|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
榮欲無樂勿負經戒落於人後|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:心得開明第三十四|王:壽數隨意分第五十  |
        敬佛大善實當念佛|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
十方人民輾轉五道憂苦不絕|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
人能自度一世勤苦須臾間耳|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:濁世惡苦第三十五|
五惡五痛五燒之中為最劇苦|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
      衆生類欲為衆惡第一|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
    不順法度任心自恣第二|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
    相因寄生身心不正第三|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
            不念修善第四|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
    徙倚懈怠不肯作善第五|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}                             |王:五道昭明分第四十九|
        天地之間五道分明|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
善人行善惡人行惡獨佛知耳|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
一心制意端身正念為五大善|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:重重誨勉第三十六|
    五惡五痛五燒輾轉相生|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
天道施張自然糺舉痛哉可傷|夏:有              |王:無                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}                             |王:八端檢束分第五十一|
得佛經語各自端守當離三塗|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
當端心身與善相應安定徐為|夏:有              |王:                  |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:如貧得寶第三十七|
      此修一日勝他方百歲|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
      此修十日勝他方千歲|夏:有              |王:有                |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
苦心誨喻洒心易行所願輒得|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
佛所行處強不凌弱各得其所|夏:有              |王:                  |魏:有      |唐:          |宋:          |漢:有        |吳:有      |
我哀五燒五痛轉劇無犯經法|夏:有              |王:                  |魏:無      |唐:          |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:禮佛現光第三十八|王:眾見佛相分第五十二|
欲見極樂當向西頂禮稱念佛|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:有        |吳:有      |
            阿難頂禮恭敬|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
            阿彌陀佛現身|夏:有              |王:有                |魏:有      |唐:無        |宋:有        |漢:有        |吳:有      |
                諸佛稱讚|夏:有              |王:無                |魏:無      |唐:無        |宋:有        |漢:無        |吳:無      |
        阿難求生世尊告言|夏:有              |王:有                |魏:無      |唐:無        |宋:有        |漢:無        |吳:無      |
                彌陀放光|夏:有              |王:有                |魏:無      |唐:有        |宋:有        |漢:有        |吳:有      |
大開闢如劫水彌滿萬物不現|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
此會皆見極樂世界種種莊嚴|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
            彼亦悉睹娑婆|夏:有              |王:無                |魏:有      |唐:有        |宋:有        |漢:無        |吳:無      |
${sectionTitle}         |夏:慈氏述見第三十九|
    證見極樂佛剎依報莊嚴|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
    證見極樂佛剎正報莊嚴|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:無        |吳:無      |
          極樂有胎生化生|夏:有              |王:                  |魏:有      |唐:有        |宋:無        |漢:無        |吳:無      |
${sectionTitle}         |夏:邊地疑城第四十　|王:疑城胎生分第五十三|
      悔疑彼佛剎不信往生|夏:無              |王:有                |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
不信佛智猶信罪福願生其國|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:          |吳:        |
求佛智不信自善根意志猶豫|夏:有              |王:無                |魏:無      |唐:有        |宋:          |漢:          |吳:        |
        篤信衆生蓮花化生|夏:有              |王:                  |魏:有      |唐:有        |宋:          |漢:          |吳:        |
    舍宅在地不能隨意高大|夏:有              |王:                  |魏:無      |唐:無        |宋:          |漢:          |吳:        |
胎生者五百歲不得修習功德|夏:有              |王:有                |魏:有      |唐:有        |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:惑盡見佛第四十一|
      輪聖王有七寶獄之譬|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
        衆生識罪悔責乃出|夏:有              |王:有                |魏:有      |唐:有        |宋:無        |漢:          |吳:        |
      衆生修善而不求生者|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
智慧微淺分別西方不及天界|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
      衆生不求佛剎輪迴者|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
不求佛慧深著世樂人間福報|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
世智聰辯增益邪心何出輪迴|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:菩薩往生第四十二|王:菩薩往生分第五十四|
      彌勒問菩薩往生者數|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
    世尊告娑婆世界往生者|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
世尊告他方十三世界往生者|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
${sectionTitle}         |夏:非是小乘第四十三|
  聞名生心者法中第一弟子|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
此經書寫供養受持讀誦演說|夏:有              |王:                  |魏:無      |唐:無        |宋:有        |漢:          |吳:        |
  為求法設入大火不應疑悔|夏:有              |王:無                |魏:有      |唐:有        |宋:有        |漢:          |吳:        |
${sectionTitle}         |夏:受菩提記第四十四|
常樂修行使無疑滯皆獲善利|夏:有              |王:                  |魏:有      |唐:有        |宋:          |漢:          |吳:        |
      一億菩薩生異門退轉|夏:有              |王:無                |魏:無      |唐:有        |宋:          |漢:          |吳:        |
${sectionTitle}                             |王:聞法因緣分第五十五|
書寫供養持誦演說大火能超|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:          |吳:        |
${sectionTitle}         |夏:獨留此經第四十五|
來世經滅特留此經止住百歲|夏:有              |王:有                |魏:有      |唐:無        |宋:          |漢:此言千歲  |吳:此言千歲|
    得聞佛法斯經難之又難|夏:有              |王:                  |魏:有      |唐:無        |宋:          |漢:有        |吳:有      |
  聞法或喜或疑皆前世因緣|夏:有              |王:有                |魏:無      |唐:無        |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:勤修堅持第四十六|
    佛法知識難得當作守護|夏:有              |王:                  |魏:無      |唐:有        |宋:有        |漢:有        |吳:有      |
當念師恩令法久住勿妄增減|夏:有              |王:                  |魏:無      |唐:有        |宋:          |漢:有        |吳:有      |
常念不絕則得道捷行如來行|夏:有              |王:                  |魏:無      |唐:無        |宋:          |漢:有        |吳:有      |
${sectionTitle}         |夏:福慧始聞第四十七|王:正法難聞分第五十六|
                    長偈|夏:7字36句         |王:7字22句           |魏:無      |唐:7字42句   |宋:7字24句   |漢:無        |吳:無      |
${sectionTitle}         |夏:聞經獲益第四十八|
無數天人菩薩聞佛說法成就|夏:有              |王:                  |魏:有      |唐:有        |宋:無        |漢:有        |吳:有      |
世界六種震動種種希有神變|夏:有              |王:                  |魏:有      |唐:有        |宋:有        |漢:無        |吳:無      |
    會眾皆大歡喜信受奉行|夏:有              |王:有                |魏:有      |唐:有        |宋:有        |漢:有        |吳:有      |
`;

  var a = DATA.split('\n'), id=1;
  c7 = [];
  for (var i in a) {
    var ln = a[i].trim();
    if (!ln) continue;
    var b = ln.split('\|'), o = {}, val = b[0].trim(), hasVals = false;
    if (val == sectionTitle) {
      o.isTitle = true;
      o.id = '';
    } else {
      o.id = id++;
    }
    if (!b) continue;
    o.label = val;
    for (var j=1; j<b.length; ++j) {
      var c = b[j].trim().split(':');
      if (c < 2) continue;
      val = c[1].trim();
      if (val) {
        o[c[0].trim()] = val;
        hasVals = true;
      }
    }
    if (hasVals) c7.push(o);
  }
})();

function showC7(elid, full) {
  function aTH(type, uri, ttl, zis, vows) {
    return `<th class=c339 bgcolor=lightgray>${type}</th><th nowrap align=center><a href="../books/0360${uri}">${ttl}</a><br>${zis}萬字<br>${vows}願</th>`;
  }
  var buf = new Buffer(), len = c7.length, types = '夏王魏唐宋漢吳';
  buf.w('<center><table border=0 cellspacing=0 cellpadding="2px"><caption>七本內容精細對照</caption>',
        '<tr><th colspan=2 valign=top align=right><dim>原經文</dim>&nbsp;</th>',
        aTH('　<br>民<br>國',           '.htm', '夏蓮居會集', 1.6, '四十八'),
        aTH('宋', '/WLSJ-Wang.htm', '王日休會集', 1.7, '四十八'),
        aTH('魏', '/WLSJ-WEI.htm',  '康僧鎧',     1.7, '四十八'),
        aTH('唐', '/WLSJ-TANG.htm', '菩提流志',   1.4, '四十八'),
        aTH('宋', '/WLSJ-SONG.htm', '法賢',       1.2, '三十六'),
        aTH('漢', '/WLSJ-HAN.htm',  '支婁迦讖',   2.8, '二十四'),
        aTH('吳', '/WLSJ-WU.htm',   '支謙',       2.5, '二十四'), '</tr>');
  for (var i=0; i<len; ++i) {
    var r = c7[i];
    if (!full && r.id == 8) {
      buf.w(`<tr bgcolor="lightyellow"><td colspan=16 align=center><br><a href="javascript:showC7('${elid}', 1)">（展開全部）</a><br>&nbsp;</td></tr>`);
      break;
    }
    buf.w('<tr><td align=right style="color:gray">', r.id, '.&nbsp;</td>')
       .wIf(!r.isTitle, '<td nowrap align=right style="color:blue; padding-right:10px">', r.label, '</td>')
       .wIf(r.isTitle, '<td></td>');
    for (var j=0; j<types.length; ++j) {
      var k = types[j], v = r[k];
      if (k && v) {
        if (v == '有')      v = '<darkgreen>有</darkgreen>';
        else if (v == '無') v = '<red style="opacity:0.5">無</red>';
        buf.w('<td class=c339 bgcolor=lightgray>', k, '</td>')
           .wIf(r.isTitle, '<td nowrap align=center class=c339 style="font-weight:bold">',
                v.replace('分第','<pnum>&nbsp;').replace('第','<pnum>&nbsp;'), '</pnum></td>')
           .wIf(!r.isTitle, '<td nowrap align=center>', v, '</td>');
      } else
        buf.w('<td bgcolor=lightgray></td><td></td>');
    }
    buf.w('</tr>');
  }
  buf.w('<tr><td class=end colspan=16></td></tr></table></center>').render(elid);
}

