const BFNN_WORKS = [];
var BFNN_READ = window['BFNN_READ'] || {};
var STATS;

function volNumDisp(n) { return (n<20) ? n : `<b style="color:brown">${n}</b>`; }

class BfnnWork {
  constructor(nums, title, type) {
    if (Array.isArray(nums)) {
      this.id = nums[0];
      if (nums.length > 1) this.idEnd = nums[1];
    } else {
      this.id = nums;
    }
    this.isFamiliar = BFNN_READ[this.id];
    this.title = title;
    this.type = type;
    if (this.id >= 9000) this.idCls = 'extra';
  }
  getTopic()    { return this.topic || (!this.type ?'所有經論':'其他文章'); }
  isTopic(tpc)  { return tpc == this.getTopic(); }
  getCategory() { return this.type ? '經論' : (this.topic || '其他文章'); }
  isSutraOrSastra() { return this.type == 'sutra' || this.type == 'sastra'; }
  isCategory(cat) { return cat == this.getCategory(); }
  setToken(tkn) { this.token = tpc; return this; }
  isAvail()     { return this.token != '-' && this.token != '?'; }
  isToGet()     { return this.token == '?'; }
  setTopic(tpc) { this.topic = tpc; return this; }
  set(key, val) { key && val && (this[key]=val); return this; }
  isMulti()     { return !!this.idEnd; }
  numOfParts()  { return this.isMulti() ? (this.idEnd-this.id+1) : 1; }
  getSimpleData() {
    return { id:    this.idDisp(),
             token: this.token,
             title: this.title,
             topic: this.topic,
             maker: (this.author||this.translator||'').replaceAll('|','，')
           };
  }
  idDisp() {
    if (!this.isMulti()) return to4d(this.id);
    var a = to4d(this.id), b = to4d(this.idEnd), i;
    for (i=0; (i<4) && (a[i]==b[i]); ++i);
    if (i>0) b = b.substring(i);
    return `${a}~${b}`;
  }
  getSubfolder() {
    if (this.id <= 1000) return 'books';
    if (this.id <= 2016) return 'books2';
    if (this.id <= 2999) return 'books3';
    if (this.id >= 9000) return 'books9';
    throw `Don't know where to find ${this.id} work.`;
  }
  getIdAt(i) { return this.id + (i||0); }
  getURI(i) { return `${this.getSubfolder()}/${to4d(this.getIdAt(i))}.htm`; }
  getLinkDisp(i, lbl) {
    if (this.isAvail())
      return `<a class=${this.type||'orig'} href="book/${this.getURI(i)}">${lbl}</a>`;
    if (this.isToGet() && window['MY_BFNN'])
      return ` <a href="${MY_BFNN}/${this.getURI(i)}" target=ext>${lbl}</a>`;
    return lbl;
  }
  renderMultiPiece(buf, needTotal) {
    var len = this.numOfParts(), buf1 = new Buffer(' ');
    for (var i=0; i<len; ++i) {
      var n = i+1;
      if (n <= 10) n = zNumber(n);
      buf1.w(' ', this.getLinkDisp(i, n));
      if (len >= 30 && i == 24) buf1.w('<br>');
    }
    if (len > 10) {
      if (needTotal) buf.w(` (共${volNumDisp(this.numOfParts())}卷)`);
      return buf1.render();
    }
    buf.w(buf1.render(), '</td>');
    return null;
  }
  getTitleDisp() {
    if (!this.title) return '';
    var cls = this.type || (this.isAvail() ? 'orig' : '');
    return `<span class="${cls}">${this.title}</span>`;
  }
  render(buf) {
    var ident = this.idDisp();
    switch (this.token) {
    case 'x': ident = `<WORKING>${ident}</WORKING>`; break;
    case 'f': ident = `<FOSSIL>${ident}</FOSSIL>`; break;
    case 'o': ident = `<u>${ident}</u>`; break;
    }
    var bgc = this.isToGet() ? ' bgcolor=lightgray' : '', nxtln,
        styl = this.isFamiliar ? ' style="background-color:#ffddbb"' : '';
    buf.w(`<tr${bgc}><td valign=top${toAttr('class', this.idCls)}${styl}>${ident}</td>`);
    var n = !this.note ? '' : (' ' + this.note);
    if (this.isMulti()) {
      buf.w(`<td nowrap valign=top>${this.getTitleDisp()}${n}`);
      nxtln = this.renderMultiPiece(buf, !n);
    } else {
      var a = this.title.split(' ');
      for (var i=0; i<a.length; ++i)
        a[i] = this.getLinkDisp(0, a[i]);
      var styl = '', disp = a[0];
      a.shift();
      if (!this.isAvail()) styl = ' style="opacity:0.5"'
      buf.w(`<td nowrap valign=top${styl}>${disp}`)
         .wIf(a.length>0, `<dim>又名</dim>${a.join('<dim>、</dim>')}`)
         .w(`<dim>${n}</dim></td>`);
    }
    buf.w(`<td nowrap valign=top align=right>${(this.author||this.translator||'').replaceAll('|','，')}</td></tr>`);
    nxtln && buf.w(`<tr${bgc}><td></td><td colspan=2>${nxtln}</td></tr>`);
  }

} // end of BfnnWork.

class BfnnWorkSpecial extends BfnnWork {
  constructor(nums, title, type, author, translator) {
    super(nums, title, type, author, translator);
  }
  renderMultiPiece(buf) {
    var me = this;
    function writeNand1(n, firstName) {
      buf.w(` (共${n+1}卷)`);
      buf.w('<br>　', me.getLinkDisp(null, firstName));
      for (var i=1; i<=n; ++i)
        buf.w(' ', me.getLinkDisp(i, zNumber(i)));
    }
    switch (this.id) {
    case 969:    // 969~82    大乘本生心地觀經講記 太虛大師
      writeNand1(13, '懸論');
      return null;
    case 1643:   // 1643~53   楞嚴經懸鏡、通議 憨山大師
      writeNand1(10, '懸鏡');
      return null;
    case 880:    // 880~90    大佛頂如來密因修證了義諸菩薩萬行首楞嚴經文句 蕅益智旭
    case 2162:   // 2162~2172 大佛頂首楞嚴經講記 湛山倓虛大師
      writeNand1(10, '玄義');
      return null;
    case 1746:   // 1746~8 流浪者群歌—聖者的生命故事 明暘法師
      buf.w('<br>',
            '　<a href="book/books2/1746.htm">佛陀的一生</a>',
            '　<a href="book/books2/1747.htm">十大弟子</a>',
            '　<a href="book/books2/1748.htm">五大菩薩</a>');
      return null;
    case 1762:   // 1762~99 大佛頂首楞嚴經正脈疏 交光大師
      buf.w(` (共${volNumDisp(38)}卷)`);
      var buf1 = new Buffer();
      buf1.w(`　<a href="book/books2/1762.htm">序</a>`);
      for (var i=1; i<=37; ++i) {
        if (i == 19) buf1.w('<br>　');
        var vol = i+3;
        buf1.w(' ', this.getLinkDisp(i, (vol<=10) ? zNumber(vol) : vol));
      }
      return buf1.render();
    }
    return super.renderMultiPiece(buf);
  }
}

class Bfnn0119 extends BfnnWork {
  constructor(nums, title, type, author, translator) {
    super([119,143], '妙法蓮華經淺釋', false, '宣化上人');
    this.pinInfo = [
      { id:119, vol:1, pin:'序品' },
      { id: 34, vol:1, pin:'方便品' },
      { id:120, vol:2, pin:'譬喻品' },
      { id:121, vol:2, pin:'信解品' },
      { id:122, vol:3, pin:'藥草喻品' },
      { id:123, vol:3, pin:'授記品' },
      { id:124, vol:3, pin:'化城喻品' },
      { id:125, vol:4, pin:'五百弟子授記品' },
      { id:126, vol:4, pin:'授學無學人記品' },
      { id:127, vol:4, pin:'法師品' },
      { id:128, vol:4, pin:'見寶塔品' },
      { id:129, vol:4, pin:'提婆達多品' },
      { id:130, vol:4, pin:'勸持品' },
      { id: 35, vol:5, pin:'安樂行品' },
      { id:131, vol:5, pin:'從地涌出品' },
      { id:132, vol:5, pin:'如來壽量品' },
      { id:133, vol:5, pin:'分別功德品' },
      { id:134, vol:6, pin:'隨喜功德品' },
      { id:135, vol:6, pin:'法師功德品' },
      { id:136, vol:6, pin:'常不輕菩薩品' },
      { id:137, vol:6, pin:'如來神力品' },
      { id:138, vol:6, pin:'囑累品' },
      { id:139, vol:6, pin:'藥王菩薩本事品' },
      { id:140, vol:7, pin:'妙音菩薩品' },
      { id: 73, vol:7, pin:'觀世音菩薩普門品' },
      { id:141, vol:7, pin:'陀羅尼品' },
      { id:142, vol:7, pin:'妙莊嚴王本事品' },
      { id:143, vol:7, pin:'普賢菩薩勸發品' },
    ];
  }
  numOfParts() { return this.pinInfo.length; }
  getIdAt(i) { return this.pinInfo[i||0].id; }
}

function parseBfnnWorks(data) {
  var a = data.split('\n'), pgs=0, allPgs=0, items=0, cntOld=0,
      topics = new Counter();
  for (var i in a) {
    var ln = a[i], note = null, topic = null;
    var token = ln[0];
    if (token == 'o' || token == 'f') ++cntOld;
    ln = ln.substring(1);
    var idx = ln.indexOf('//');
    if (idx >= 0) {
      if (ln.trim().startsWith('//')) continue;
      note = ln.substring(idx+2).trim();
      ln = ln.substring(0,idx);
      var idx1 = note.indexOf('卷');
      var idx2 = note.indexOf('共');
      if ((idx2 < idx1) && (idx2 => 0)) {
        var volcnt = note.substring(idx2+1,idx1);
        if (volcnt >= 20)
          note = note.substring(0,idx2+1) + volNumDisp(volcnt) + note.substring(idx1);
      }
    }
    if (ln.trim().length == 0) // empty line or comment only
      continue;
    idx = ln.indexOf('#');
    if (idx > 0) {
      topic = ln.substring(0,idx).trim();
      topics.add(topic);
      ln = ln.substring(idx+1).trim();
    }
    // get the number(s)
    idx = ln.indexOf(' ');
    var nums = ln.substring(0, idx),
        segs = ln.substring(idx+1).split('|'),
        ttl = segs[0],
        ttlextra = null,
        author = segs[1],
        translator = null,
        type = null;
    if (author && (author.indexOf('譯')>0)) { translator = author; author = null; }
    if (nums.endsWith('=!')) { type = 'sutra'; nums = nums.substring(0,nums.length-2); }
    if (nums.endsWith('~!')) { type = 'sastra'; nums = nums.substring(0,nums.length-2); }
    if (nums.endsWith('~')) {
      nums = parseInt(nums.substring(0, nums.length-1));
      nums = [ nums, nums ]; // single container htm for multiple pages
    } else {
      var nums = nums.split('~');
      if (nums.length == 1) // a single page
        nums = parseInt(nums[0]);
      else { // a series of a few pages
        var len1 = nums[0].length, len2 = nums[1].length;
        if (len2 < len1)
          nums[1] = nums[0].substring(0, len1-len2) + nums[1];
        nums[0] = parseInt(nums[0]);
        nums[1] = parseInt(nums[1]);
      }
    }

    const ADHOC = 'ADHOC';
    var wk;
    if (Array.isArray(nums) && nums[0] == 119)
      wk = new Bfnn0119();
    else if (note && note.startsWith(ADHOC))
      wk = new BfnnWorkSpecial(nums, ttl, type).set('note', note.substring(ADHOC.length).trim());
    else
      wk = new BfnnWork(nums, ttl, type).set('note', note);
    wk.set('author',     author)
      .set('translator', translator)
      .set('token',      token)
      .set('topic',      topic);
    BFNN_WORKS.push(wk);
    allPgs += wk.numOfParts();
    if (wk.isAvail()) { ++items; pgs += wk.numOfParts(); }
  }
  console.log(`${items}/${BFNN_WORKS.length} items in ${pgs}/${allPgs} pages.`);
  if (cntOld) console.log(`${cntOld} items in old style.`);
  var a = topics.getNamesByCount(), txt = '', total = 0;
  for (var i in a) {
    var n=a[i], c=topics.getCount(n), cdisp = '' + c;
    while (cdisp.length < 4) cdisp = ' ' + cdisp;
    txt += cdisp + '  ' + (n||'*') + '\n';
    total += c;
  }
  txt += '----  -------\n' + total + '  TOTAL';
  console.log(txt);
  STATS = `${items}/${BFNN_WORKS.length} items in ${pgs}/${allPgs} pages.`;
  if (cntOld) STATS += ` ${cntOld} items in old style.`;
}

parseBfnnWorks(`
-　　　　#1 廣公上人事蹟續編（附開示錄•行持語錄）|承天禪寺編
-　　　　#2 佛說八大人覺經疏|清浙水崇壽沙門 灌頂續法集
 淨土　　#3 龍舒淨土文|<gdd>王日休</gdd>居士譔
-淨土　　#4 淨土指導|林俠菴居士編述
 　　　　#5 十二因緣|淨空法師
 理修　　#6 十法界不離一念心|宣化上人主講
-　　　　#7 十善業道經的啟示|濟群法師主講
 華嚴經　#8=! 大方廣佛華嚴經普賢行願品|唐罽賓國三藏般若奉詔譯
-淨土　　#9 大勢至菩薩念佛圓通章白話及注釋|王智隆居士
 淨土　　#10 大勢至菩薩念佛圓通章親聞記|淨空法師主講
 壇經　　#11=! 六祖壇經|宗寶編 // （不知何故，獨缺此經！補遺）
-　　　　#12 佛說八大人覺經講註|寶靜法師
-　　　　#13 打開滿足之門|堪忍法師著述
-　　　　#14 正信的佛教|聖嚴法師
 圓覺經　#15=! 大方廣圓覺修多羅了義經|唐佛陀多羅譯
-地藏經　#16=! 地藏菩薩本願經|唐于闐國三藏沙門 鳩摩實叉難陀譯
 地藏經　#17 地藏經的啟示|淨空法師
-　　　　#18 如何消除貪瞋癡慢疑|元音老人
-淨土　　#19 行策大師淨土警語精華講記|淨空法師
-　　　　#20 佛法與人生|淨空法師主講
-　　　　#21 佛教科學論|索達吉堪布
-　　　　#22=! 佛說父母恩重難報經|姚秦三藏法師 鳩摩羅什奉詔譯
-　　　　#23 佛說父母恩重難報經白話翻譯
-　　　　#24 佛說四十二章經淺釋|宣化上人主講
-　　　　#25 佛說盂蘭盆經解|純果法師
 　　　　#26=! 佛說長壽滅罪護諸童子陀羅尼經|罽賓國沙門 佛陀波利奉紹譯
-　　　　#27 佛說長壽滅罪護諸童子陀羅尼經白話翻譯|釋常愍語譯
-淨土　　#28 佛說阿彌陀經白話|姚秦三藏法師鳩摩羅什譯
-淨土　　#29 佛說阿彌陀經淺釋|宣化上人講解
-淨土　　#30 佛說阿彌陀經講錄|道源法師講
 淨土　　#31=! 佛說觀無量壽佛經|劉宋西域三藏法師 彊良耶舍譯
-淨土　　#32 佛說觀無量壽佛經白話解釋|黃智海居士
-　　　　#33 佛遺教經淺釋|宣化上人主講
-        #34 妙法蓮華經方便品淺釋|宣化上人 // 在119～43 之內
-        #35 妙法蓮華經安樂行品淺釋|宣化上人 // 在119～43 之內
-淨土　　#36 大勢至菩薩念佛圓通章講義|靜權法師講述
-　　　　#37 初機學佛決疑|知義法師
-淨土　　#38 近代往生的實例|倓虛法師主講
-金剛經　#39 金剛決疑|明曹溪沙門 <gdd>憨山</gdd>釋德清
-金剛經　#40=! 金剛般若波羅蜜經
-人生　　#41 誰扼殺了赤子之心|羅曉南博士
-金剛經　#42 金剛般若波羅蜜經講錄|太虛主講
-金剛經　#43 金剛經一滴|黃念祖居士
-金剛經　#44 金剛經的研究（精簡版）|沈家楨居士述
-金剛經　#45 金剛經校勘記|江味農居士
-　　　　#48 阿難問事佛吉凶經講記|淨空法師
-　　　　#50 為甚麼要做佛事|聖嚴法師著
-　　　　#51 『悟心銘』淺釋|元音老人
-淨土　　#52 消業往生與帶業往生|元音老人
-　　　　#53 做你自己的治療專家|耶喜喇嘛開示
-　　　　#54 惟覺老和尚佛法禪法問答|惟覺法師主講
-淨土　　#55 淺說淨土|紫雲
 淨土　　#56 淨土十疑論|<gdd>智者</gdd>大師
 　　　　#57=! 佛說四十二章經|摩騰、竺法蘭共譯
-淨土　　#58 淨空法師法語（續編）|淨空法師
 華嚴經　#59 大方廣佛華嚴經普賢行願品淺釋|宣化上人
 淨土　　#60 無住生心集|淨空法師
-淨土　　#61 無量壽經玄義親聞記|淨空法師
-淨土　　#62 勢至圓通疏鈔菁華|淨空學
-人物　　#63 保富法|聶雲台原
-楞嚴經　#64 楞嚴經清淨明誨章親聞記|淨空法師
-　　　　#65 『解脫歌』淺釋|元音老人
-　　　　#66 與青年朋友談學佛|佛日居士
-人生　　#67 談因果|淨空法師
-淨土　　#68 談談往生西方的關鍵問題|元音老人
-　　　　#69 學佛群疑|聖嚴法師
 人生　　#70 飭終須知|釋世了敬述
-　　　　#71 勸發菩提心文講記|演培法師釋
-觀世音　#72=! 妙法蓮華經觀世音菩薩普門品|姚秦三藏法師 鳩摩羅什譯
-        #73 妙法蓮華經觀世音菩薩普門品淺釋|宣化上人 // 在119～43 之內
-　　　　#74 觀經四帖疏上品上生章講記|淨空法師
-地藏經　#75 地藏菩薩本願經淺釋|宣化上人
 金剛經　#77 金剛經講義節要|淨空法師 // (對應0868.htm)
 佛學基礎#78 認識佛教—幸福美滿的教育|淨空法師會本// (一九九一年邁阿密)
-　　　　#79~80 大佛頂首楞嚴經白話|北京社科院宗教研究所
-淨土　　#81 達拉斯佛七講話|淨空法師主講
 楞嚴經　#82=! 大佛頂首楞嚴經|般剌密帝譯 // (共10卷)
 　　　　#83=! 阿難問事佛吉凶經|安世高譯
 　　　　#84=! 佛垂般涅槃略說教誡經 佛遺教經|鳩摩羅什譯
 　　　　#85=! 佛說八大人覺經|安世高譯
 淨土　　#86=! 佛說阿彌陀經|鳩摩羅什譯
-淨土　　#87 兩個世界的味道|李炳南居士編述
-淨土　　#88 當生成就之佛法|李炳南居士編
 淨土　　#89=! 佛說無量壽經|康僧鎧譯
 施食　　#90=! 佛說盂蘭盆經|西晉三藏法師竺法護譯
-淨土　　#91 佛說觀無量壽佛經講記|道源法師講
-　　　　#92 四十二章經講錄|蘇行三博士
-淨土　　#93 念佛的功德|淨空法師
-淨土　　#94 阿彌陀佛助念法|大光法師在香港佛教醫院講
 心經　　#95 心經略說|黃念祖居士
-人物　　#96 具行禪人修行略傳
 人物　　#97 徹悟大師遺集|徹悟大師
 理修　　#98 洗濯垢汙　顯明清白|黃念祖居士
 淨土　　#99 華嚴念佛三昧論講記|黃念祖居士
-淨土　　#100 大佛頂首楞嚴經觀世音菩薩耳根圓通章舉要|黃念祖居士主講
 淨土　　#101 淨宗心要|黃念祖居士
 佛學基礎#102 佛法的基本與要徑|黃念祖居士主講
-　　　　#103 訪美雜談|黃念祖居士主講
-　　　　#104 谷響集|黃念祖敬答客問
-淨土　　#105 讀《角虎集》有感|黃念祖居士主講
-　　　　#106 佛教的大光明與大安樂|黃念祖居士述
-淨土　　#107 淨土資糧|黃念祖居士述
-淨土　　#108 蓮宗妙諦—淨語三則|黃念祖居士主講
-淨土　　#109 從《金剛經》到《無量壽經》|黃念祖居士主講
-淨土　　#110 大乘無量壽經白話解
-善書　　#111 了凡四訓語解精編|黃念祖敬解
-善書　　#112 了凡四訓|袁了凡居士
-善書　　#113 了凡四訓精解
-　　　　#114 向智識份子介紹佛教|于凌波居士
 唯識論　#115 八識規矩頌講記|于凌波居士
 唯識論　#116 唯識二十頌講記|于凌波居士
 唯識論　#117 唯識三十頌講記|于凌波居士
-人物　　#118 人間佛陀|于淩波居士
 法華經　#119~43 妙法蓮華經序品淺釋|宣化上人
-　　　　#144 慧明法師開示錄|慧明法師主講
 楞嚴經　#145~54 大佛頂首楞嚴經譯解|王治平居士
-　　　　#155 普賢大士行願的啟示|淨空法師
-　　　　#156 學為人師行為世範|淨空法師
-　　　　#157 三歸傳授|淨空法師
-彌勒　　#158 彌勒菩薩所問經要義|淨空法師
-心經　　#159 心經抉隱|元音老人
-　　　　#160 禪海微瀾|元音老人
-　　　　#161 《碧巖錄》講座|元音老人
-　　　　#162 略論明心見性|元音老人
-　　　　#163 觀世音菩薩靈感錄|李圓淨居士原
-　　　　#164 觀世音菩薩普門品講錄|寶靜法師
-淨土　　#165 淨業三福講記|淨空法師
 地藏經　#166~216 地藏菩薩本願經講記|淨空法師主講
 理修　　#217 學佛第一要知見正|元音老人主講
 理修　　#218 心中心密法打七開示|元音老人主講
 理修　　#219 傳心中心法灌頂時之開示|元音老人主講
 楞嚴經　#220 耳根圓通法門|元音老人主講
 理修　　#221 學佛無難，但觀自在|元音老人主講
 理修　　#222 融禪淨密於一體的心中心法|元音老人主講
-　　　　#223 橋流水不流|元音老人主講
 佛學基礎#224 法身、報身、化身|元音老人主講
-　　　　#225 聖一法師方便開示|聖一法師
-心經　　#226 心經講記|聖一法師
-　　　　#227 聖一法師禪七開示|聖一法師
-淨土　　#228 佛七講話第一集（六十九年）|智諭法師主講
 金剛經　#229 金剛般若波羅蜜經講記|智諭法師
-　　　　#230 文殊師利所說摩訶般若波羅蜜經釋要|智諭法師主講
-佛學基礎#231 佛學基礎知識|廣超法師主講
-淨土　　#232 佛說阿彌陀經白話及注釋|王智隆居士
-地藏經　#233 地藏菩薩本願經白話及注釋|王智隆居士
-人物　　#234~5 影塵回憶錄|倓虛大師自述
-　　　　#236 看淡世俗的纏縛—出污泥而不染|黃念祖居士
-淨土　　#237 黃念祖老居士答問|黃念祖居士主講
-淨土　　#238 阿彌陀經宗要——信願持名|黃念祖居士
-佛學基礎#239 佛學入門|佛陀教育基金會編
-金剛經　#240 金剛經淺易|聖一法師主講
 人物　　#241 憨山大師的一生|宋智明編述
?善書　　#242 俞淨意公遇灶神記|淨空法師主講
-　　　　#243 生活的藝術|淨空法師講于達拉斯僑教中心
-　　　　#244 生活的藝術(2)|淨空法師
-　　　　#245 未來理想的修學環境|淨空法師
-淨土　　#246 大乘無量壽經指歸|淨空法師
-淨土　　#247 倓虛法師佛七開示簡介|淨空法師講於聖荷西
-善書　　#248 了凡四訓大意—改造命運的祕訣|淨空法師
-　　　　#249 弘一大師晚晴集講記|淨空法師
-淨土　　#250 佛說阿彌陀經略解|聖一法師主講
-　　　　#251 十大願王淺說|聖一法師主講
-　　　　#252 心地法門|如本法師主講
-心經　　#253 般若波羅蜜多心經講記|淨空法師主講
-善書　　#254 了凡四訓大意親聞記|淨空法師主講
-　　　　#255 蕅益大師彌陀要解玄義講記|淨空法師主講
-　　　　#256 晚晴集講記|弘一律師集
-楞嚴經　#257 大佛頂首楞嚴經清淨明誨章講記|淨空法師主講
-　　　　#258 臨終備覽|慧律法師講述•編
-淨土　　#259 淨土修證心要|元音老人
-人生　　#260 因果可轉變（佛教通俗講座）|李炳南居士講
-淨土　　#261 淨宗入門|淨空法師1996年講於達拉斯
-　　　　#262 情到深處人孤獨|黃威南居士
-淨土　　#263 念佛論|湛山倓虛大師為初機學佛略說
 淨土　　#264 倓虛老法師佛七開示|倓虛大師講
-金剛經　#265 《金剛經》的現代意義|濟群法師
-心經　　#266 《心經》的人生智慧|濟群法師
-淨土　　#267 大佛頂首楞嚴經大勢至菩薩念佛圓通章淺釋|宣化上人講
-故事　　#268 傾聽恆河的歌唱|郭惠珍醫師（道證法師）講
-　　　　#269 普門品聞記|聖一法師
-　　　　#270 清蓮飄香|道證法師主講
-　　　　#271 蓮音小故事|郭惠珍醫師（道證法師）主講
-淨土　　#272 佛說大乘無量壽莊嚴清淨平等覺經介紹|淨空法師主講
-　　　　#273 重寫戒淫證輯|夢醒居士編
-故事　　#274 歡喜菩薩真人真事|道證法師
-壇經　　#275 壇經講座|賈題韜居士
-理修　　#276 論開悟|賈題韜居士主講
-淨土　　#277 佛說大乘無量壽莊嚴清淨平等覺經玄義|淨空法師
-淨土　　#278~87 佛說大乘無量壽莊嚴清淨平等覺經玄義講記|淨空法師
-淨土　　#288~335 佛說大乘無量壽莊嚴清淨平等覺經講記|淨空法師
-　　　　#336 佛教科學觀|尢智表居士
-　　　　#337 歧路指歸|李德明參定
-　　　　#338 學醫與學佛|郭醫師（道證法師）主講
-　　　　#339 一夢漫言千華寺繼任主持|見月老人自述
-戒律　　#340 梵網經菩薩戒略註|聖一法師
-　　　　#341 弘一大師講演錄|弘一大師
-　　　　#342 弘一大師講演續錄|弘一大師
-人生　　#343 電視帶大的孩子|雷久南博士
-淨土　　#344 淨土法門疑難問題解答|李炳南
-淨土　　#345 當生成佛——韓館長往生的啟示|淨空法師
-淨土　　#346 勸修念佛法門|福建鼓山湧泉禪寺沙門 圓瑛宏悟述
-地藏經　#347 地藏菩薩本跡因緣|南亭和尚
-地藏經　#348 地藏菩薩化度事蹟|南亭和尚
-　　　　#349 拿出地獄未空誓不成佛的精神來|演培法師
-地藏經　#350 學習地藏菩薩的孝親精神|演培法師
-佛學基礎#351 什麼是佛法|張澄基教授講
-　　　　#352 八大人覺經十講|星雲法師講
 彌勒　　#353=! 發起菩薩殊勝志樂經|唐三藏法師菩提流志奉詔譯
-　　　　#354~5 發起菩薩殊勝志樂經講記|淨空法師
-　　　　#356 印光大師護國息災法語|<gdd>印光</gdd>大師撰
-　　　　#357 三皈傳授|淨空法師講
-淨土　　#358 淨語|夏蓮居居士
-　　　　#359 六信四願三幸一行齋自警錄|夏蓮居居士
 淨土　　#360=! 佛說大乘無量壽莊嚴清淨平等覺經|夏蓮居居士會集
 善書　　#361 了凡四訓序文講記|淨空法師
 淨土　　#362 印光大師文鈔菁華錄|<gdd>印光</gdd>大師
 佛學基礎#363 認識佛教|淨空法師 // (一九九〇年講于新加坡)
 人物　　#364 因果報應錄|唐湘清居士
-淨土　　#365~78 淨土聖賢錄易解|慧律法師著
-　　　　#379~82 生死關全集|陳由斌居士編
 理修　　#383~99 恆河大手印|元音老人
-　　　　#400 佛學十四講表|李炳南居士
-　　　　#401~14 佛學十四講講記|淨空法師
-　　　　#415 一個科學者研究佛經的報告|尢智表居士
-　　　　#416 學佛？學魔？|諾那華藏精舍編輯室
-　　　　#417 切莫誤解佛教|印順法師
-淨土　　#418 蓮池海會念佛往生見聞記|思歸子居士
-淨土　　#419 雪廬老人的淨土思想|鳥慚居士
-　　　　#420~2 佛堂講話|道源法師
-　　　　#423 一個學物理的人對佛教的認識|紫虛居士
-　　　　#424 我願健康幸福|果真法師
-淨土　　#425 印光大師淨土開示|<gdd>印光</gdd>大師開示
-　　　　#426 參禪的先決條件|虛雲和尚
-　　　　#427 上海玉佛寺禪七開示|虛雲老和尚
-　　　　#428 虛雲和尚開示錄|蔣中和筆記
-　　　　#429 雲居山方便開示|虛雲老和尚
-　　　　#430~9 修行者的消息|恆實、恆朝法師著
-　　　　#440 佛學問答|淨空法師
-人物　　#441 金山活佛|煮雲法師
-　　　　#442 禪淨密互融互通的修法|元音上師開示
-淨土　　#443 妙音居士往生見聞記|廖榮尉居士
-善書　　#444~7 了凡四訓講記|淨空法師
-壇經　　#448~57 六祖法寶壇經淺釋|宣化上人主講
-地藏經　#458~70 地藏本願經講記|聖一法師述
-淨土　　#471 怎樣念佛往生成佛|淨空法師
-　　　　#472 佛說八大人覺經講記|淨空法師
-　　　　#474 駱全通居士念佛往生淨土事蹟|翁霓居士述
-　　　　#475 陳邱菊妹居士往生見聞記|陳居士述
-　　　　#476 戒淫修福保命|天華出版社編著
 善書　　#477 太上感應篇 
-　　　　#478 佛說清淨心經講記|淨空法師
-　　　　#479 佛說當來變經講記|淨空法師
-　　　　#480 拜佛要訣|大醒法師
 人物　　#481 金山活佛神異錄|樂觀法師
 理修　　#482~4 學為人師行為世範|淨空法師
 淨土　　#485~6 淨空法師嘉言錄|淨空法師
-　　　　#487 南海普陀山傳奇異聞錄|煮雲法師
-淨土　　#488 念佛三要|毛凌雲纂述
-淨土　　#489 導歸淨土|行芊居士選編
-淨土　　#490 人生最大的一件事|余定熙居士編
-淨土　　#491 臨終一念往生|智敏慧華金剛上師
-淨土　　#492 成佛捷徑|毛凌雲纂述
-淨土　　#493 不可思議之念佛功德——黃錫勳醫師的生平與往生經過|黃施翠娥居士
-　　　　#494 驚天地，動鬼神|了凡弘法學會倡印
-人生　　#495 臨終關懷注意事項（摘錄自回歸蓮花的故鄉）|了凡弘法學會倡印
-人生　　#496 飲食與健康|張慶祥居士稿
-人生　　#497 素食的利益|廣化法師
-人生　　#498 肉食之害|楊梓茗居士譯
-人生　　#499 拍手功治百病|侯秋東教授
-人生　　#500 放生問答—放生文集|圓因法師
-人生　　#501 壽康寶鑑|<gdd>印光</gdd>大師增訂
-　　　　#502~5 佛教聖典|關世謙居士譯
 善書　　#506 太上感應篇感應選錄|林園佛教堂節錄
 善書　　#507 太上感應篇直講
-人生　　#508 臨終三大要|<gdd>印光</gdd>大師
 淨土　　#509 一函遍復|<gdd>印光</gdd>大師
 善書　　#510 太上感應篇大意|淨空法師
 人物　　#511 濟公活佛傳奇錄
-淨土　　#512 念佛四十八法節要|清<gdd>妙空</gdd>大師編
-故事　　#513 近代往生隨聞錄|寬律法師錄
 理修　　#514 永嘉大師證道歌淺釋|宣化上人
-人生　　#515 人生之最後|弘一大師著述
-淨土　　#516 大乘無量壽經菁華|淨空法師
-故事　　#517 與癌症搏鬥的真正勇者|張瑞琪居士著述
-故事　　#518 真愛與慈悲|陳居士著述
-故事　　#519 觀世音菩薩靈感記|林慈超居士
-　　　　#520 夢參老和尚開示|夢參老和尚
-　　　　#521 如何學佛|靜波法師
-人生　　#522 從科學與佛學看因果觀|王守益居士
-　　　　#523 佛法與科學|智行居士
-　　　　#524 怎樣實踐佛法|徐恆志居士著
-　　　　#525 學佛是怎麼一回事|徐恆志居士著
-淨土　　#526 念佛感應見聞記|林看治居士
-佛法基礎#527 學佛入門|淨空法師主講
-　　　　#528 文化復興與宗教|淨空法師
-佛法基礎#529 認識佛陀教育|淨空法師
-　　　　#530 觀世音菩薩感應事跡實錄|林園佛教堂編
-淨土　　#531 佛說大乘無量壽莊嚴清淨平等覺經親聞記（節錄）|淨空法師
-　　　　#532 親愛的孩子，請原諒我|林園佛教堂編
-人生　　#533 子女與父母之業緣|林園佛教堂編
-人生　　#534 從佛法觀點談感情問題|釋惠空法師
-　　　　#535 佛陀的啟示|顧法嚴居士譯
-　　　　#536 學佛護法的心得及對佛法未來的展望講記|李木源居士主講
-淨土　　#537 佛法導論《淨土篇》|李圓淨居士
-　　　　#538 佛教聖眾因緣集|丹仁絨臬編
-　　　　#540 毛毛蟲變蝴蝶—獻給慈父的感恩與懺悔|道證法師 // 系列，之一
 地藏經　#541 論地藏經是佛對在家弟子的遺教|朱鏡宙居士 // (經文引用已加色)
-淨土　　#542 念佛入門白話解|律航法師遺
-　　　　#543 來自靈巖的法音|見愚居士選集
-　　　　#544 放生功德甘露妙雨|索達吉堪布
-　　　　#545 百日念佛自知錄律航法師遺著|釋律航
-淨土　　#546 大乘無量壽經簡註易解(上）|淨空法師
-淨土　　#547 大乘無量壽經簡註易解|淨空法師
-淨土　　#548 淨宗緣起|淨空法師主講
-淨土　　#549 助念生西須知|台中蓮社編
-淨土　　#550 念佛伽陀弁言|倓虛大師宣講
-　　　　#551 李濟華居士遺集|廣化法師敬輯
-　　　　#552 蕅益大師法語|<gdd>蕅益</gdd>大師
 人生　　#553 常禮舉要|李炳南教授編述
-　　　　#554 記夢！請聽胎兒求救的呼喚|林美惠居士
-人生　　#555 福、惜福、如何惜福|于凌波居士
-人生　　#556 戒殺與吃素|于凌波居士
-人生　　#557 勸注重因果|<gdd>印光</gdd>大師
-摩訶衍　#558 大乘空義|印順法師
-人生　　#559 論三世因果的殊勝|印順法師
-人生　　#560 佛法的因果論|演培法師
-人生　　#561 略說佛教因果|仁俊法師
-人生　　#562 佛教因果原理|聖德法師
-人生　　#563 佛教的因果觀念|周中一居士
-人生　　#564 佛教因果的特質|法信居士
-人生　　#565 業與輪迴|梁啟超居士
-人生　　#566 可畏可愛的業力|方倫居士
-心經　　#567 談「空即是色」澹思居士
-　　　　#568 佛教的根本特質是什麼|演培法師
-人生　　#569 用佛法來剖析人生|金明法師
-人生　　#570 生命可貴作業必慎|仁俊法師
-人生　　#571 夢兆與籤卜|劉太希居士
-人生　　#572 屠刀—現實的因果報應|羅鍊伯居士
-人生　　#573 轉世奇蹟|竹根先生譯
-人生　　#574 離奇因果談|張一勉居士
-人生　　#575 論「神滅論」|詹勵吾居士
-人生　　#576 因果報應實證|淨松居士編述
-人生　　#577 因果報應實證|淨松居士編述
-人生　　#578~81 因果報應實證|淨松居士編述
-　　　　#582 回歸蓮花的故鄉|葉芳佐居士編錄
 法華經　#583 妙法蓮華經普門品說明|溫光熹居士
-　　　　#584 念佛感應記|林慈超居士輯錄
-人生　　#585 因果輪迴實錄|俞明哉居士選錄
-人生　　#586 眼前的幾件奇事
 人物　　#587 元音老人略傳|元音老人自述
-人生　　#588 怎樣了生死|元音老人
-　　　　#589 人人皆當成佛|元音老人
 理修　　#590 打坐方法|元音老人
-　　　　#591 中有成就秘笈（中有聞教得度釋義）|元音老人述
 佛學基礎#592~7 佛學常見辭彙|陳義孝居士編
-　　　　#598 一九九八年佛七圓滿開示|慧律法師主講
-　　　　#599 一九九九年佛七圓滿開示|慧律法師主講
-　　　　#600 頓悟本心|慧律法師主講
-　　　　#601 毛毛蟲變蝴蝶—考古變今用|道證法師 // 歸於0540系列，之二
-　　　　#602 毛毛蟲變蝴蝶—「枉死」變「往生」|道證法師 // 歸於0540系列，之三
-　　　　#603 佛門禮儀
-人物　　#604 弘一大師之娑婆因緣|菩提法師
-　　　　#605 靜坐問答|鄭鴻祺居士
-　　　　#606 本煥老法師開示|本煥法師主講
-　　　　#607 佛教對命運的看法|星雲大師
 善書　　#608~11 太上感應篇例證語譯|釋海山等
-人物　　#612 虛雲老和尚見聞事略|福建鼓山門人純果敬編
-金剛經　#613 金剛般若波羅蜜經白話解說
 淨土　　#614 往生論節要|淨空法師
-淨土　　#615 佛七講話|會性法師主講
-淨土　　#616 佛說阿彌陀經易解|韓鍈居士講述
-人生　　#617 五福臨門|陳柏達居士
-華嚴經　#618 普賢行願品親聞記|慈舟法師
-善書　　#619 了凡四訓白話篇|民初黃智海先生演述
-地藏經　#620 地藏菩薩本跡記|心然法師等編述
-地藏經　#621 地藏菩薩靈感錄|心然法師等編述
-地藏經　#622 地藏菩薩靈感近聞錄|心然法師等編述
-地藏經　#623 地藏菩薩現代靈感錄|心然法師等編述
-人生　　#624 請珍惜自己的生命—認清自殺的真相
-地藏經　#625 地藏菩薩靈感記|林慈超居士
-地藏經　#626 地藏王菩薩靈感錄
 華嚴經　#627~61 普賢行願品講記|淨空法師
 淨土　　#662~82 佛說阿彌陀經講記|淨空法師
-人生　　#683 談死亡問題|紫虛居士
-人生　　#684 前世今生談愛情|紫空居士
-人生　　#685 佛教的命運觀|紫虛居士
-人生　　#686 談修行中的福報問題|紫虛居士
-金剛經　#687 金剛般若蜜多經白話述義|王驤陸居士
-人生　　#688 怎樣了生死|元音老人講
-　　　　#689~98 僧璨大師信心銘講記|淨空法師
-　　　　#699 可許則許|陳海量居士
-淨土　　#701 淨修捷要|夏蓮居居士
-　　　　#702 佛教小常識|毛坤居士編
-故事　　#703 地獄見聞記
-　　　　#704 在家人如何修行的商討|沈家楨居士
-淨土　　#705 念佛法樂知多少|妙蓮老和尚
-人生　　#706 閻王老子三封信|妙蓮老和尚
-人生　　#707 要為後代培福慧|妙蓮老和尚
-　　　　#708 佛法在原子時代|羅無虛居士
-人生　　#709~29 種善因得善果|淨空法師
-　　　　#730 觀世音菩薩普門品講記|演培法師
-金剛經　#731~62 金剛經講錄|道源法師
-地藏經　#763~75 地藏菩薩本願經講記|道源法師
-淨土　　#776 佛說阿彌陀經講錄|會性法師
-淨土　　#777~9 佛說阿彌陀經要解講記|清西有沙門 蕅益智旭解
-淨土　　#780~828 佛說大乘無量壽莊嚴清淨平等覺經解|黃念祖敬解
-淨土　　#829 楞嚴經大勢至菩薩念佛圓通章今譯淺解|毛凌雲今譯
-楞嚴經　#830 楞嚴經講話（四種決定清淨明誨）|悟慈法師
-華嚴經　#831 普賢十大願王別釋|諦閑法師講述——在永嘉城——
-華嚴經　#832 大方廣佛華嚴經入不思議解脫境界普賢行願品輯要疏|諦閑法師
-人物　　#833 廣公上人事蹟初編（附神異篇）|承天禪寺編印
-淨土　　#834 蓮宗正範|陳海量居士編輯
-人物　　#835~9 印光大師年譜|沈去疾居士編
-　　　　#840 勸發菩提心文講義錄要|諦閑法師
-　　　　#841 菩薩學處|太虛大師
 淨土　　#842 入香光室|了然法師
-淨土　　#843 中國人口頭上心頭上的阿彌陀佛|太虛大師
-淨土　　#844 南無阿彌陀佛解|范古農居士
-　　　　#845 信心銘|<gdd>僧璨</gdd>大師
-　　　　#846 勸發菩提心文|<gdd>省庵</gdd>大師
-　　　　#847 菩提達磨大師略辨大乘入道四行觀|<gdd>達磨祖師</gdd>
-　　　　#848 達磨大師血脈論|<gdd>達摩祖師</gdd>
-　　　　#849 達磨大師悟性論|<gdd>達磨祖師</gdd>
-　　　　#850 達磨大師破相論|<gdd>達磨祖師</gdd>
-　　　　#851 最上乘論|弘忍禪師
-　　　　#852 頓悟入道要門論|大珠慧海禪師
-　　　　#853 傳心法要|黃蘗山斷際禪師
-人生　　#854 了生脫死|繆滌源居士編輯
-人生　　#855 一個母愛打造的金牌|安金鵬居士
-故事　　#856 苦妞啊！父愛是你的菩提樹|劉高貴居士
-　　　　#857 緇門崇行錄淺述|明<gdd>蓮池</gdd>大師作
-人生　　#858 放生殺生現報錄|江慎修居士選錄
-　　　　#859 印光大師法語擷錄|<gdd>印光</gdd>大師著述
-　　　　#860 佛遺教經解|明古吳<gdd>蕅益釋智旭</gdd>述
-　　　　#861 佛說四十二章經解|明古吳<gdd>蕅益釋智旭</gdd>
-　　　　#862 八大人覺經略解|明<gdd>蕅益釋智旭</gdd>解
-　　　　#863 放生儀軌
-　　　　#864 戒殺放生嘉言
-心地觀經#865 大乘本生心地觀經講記（節錄）|太虛大師述
-　　　　#866 信心紮根—菩薩戒前言由藝術觀點及臨床經驗談戒律|道證法師
-淨土　　#867 淨土輯要|苦行居士原
 金剛經　#868 金剛般若研習報告|淨空法師 // (經文加anchor。標題上加9868鏈接)
-佛學基礎#869 佛學問答|如本法師
-佛學基礎#870 佛學問答第二輯|如本法師
 淨土　　#871 佛說阿彌陀經要解|<gdd>蕅益智旭</gdd>
-人生　　#872 孝經（兒童啟蒙經典）
-人生　　#873 佛說報恩孝親經句集要
-人生　　#874 兒童讀經教育說明手冊|王財貴教授
 法華經　#875=! 妙法蓮華經|鳩摩羅什譯
-人生　　#876 改造命運的原理與方法|陳柏達居士
-人生　　#877 防癌手冊|圓因法師編輯
-心經　　#878 般若波羅蜜多心經註|唐三藏沙門 鳩摩羅什譯
-金剛經　#879 金剛經百家集註大成
 楞嚴經　#880~90 大佛頂如來密因修證了義諸菩薩萬行首楞嚴經文句|<gdd>蕅益智旭</gdd> // ADHOC
-人生　　#891 家庭寶筏（少年叢書第一編）|漢陽別樵居士編纂
-人生　　#892 養生論|王驤陸居士
-淨土　　#893 佛說阿彌陀經經義略說|王驤陸居士
-　　　　#894 見性與著相之別|元音老人
-　　　　#895 學佛成道沒有難處|元音老人
-　　　　#896 四十二章經講錄|太虛大師
-人生　　#897 如何面對兩性關係|了凡弘法學會譯整
-圓覺經　#898 大方廣圓覺修多羅了義經講義附親聞記|諦閑大師遺著
-　　　　#899 供佛會開智慧|大醒法師弘法集
 淨土　　#900~3 佛說阿彌陀經疏鈔演義會本|淨空法師
 地藏經　#904 地藏菩薩本願經演孝疏|知性法師
-人生　　#905 勸家庭行孝文|知性法師述
 淨土　　#906 彌陀疏鈔|<gdd>蓮池</gdd>大師
 華嚴經　#907 華嚴經要解|宋溫陵比丘戒環集
-華嚴經　#908 華嚴三昧章|唐魏國西寺沙門 法藏述
-淨土　　#909 佛說阿彌陀經通贊疏|唐大慈恩寺沙門 窺基
-人生　　#910 建設佛化家庭|陳海量居士
?楞嚴經　#911~20 大佛頂首楞嚴經妙心疏|守培法師
-　　　　#922 毛毛蟲變蝴蝶—缺陷變寶蓮|道證法師 // 歸於0540系列，之四
-　　　　#923 佛法要領|四川中江劉洙源先生說
-　　　　#924 劉洙源先生書札|四川中江劉洙源先生
-　　　　#925 別雲門後的第一封信|朱鏡宙居士
-　　　　#926 觀世音菩薩靈應事蹟實錄|智成居士
-　　　　#927 觀音靈感錄續編|毛凌雲敬述
-淨土　　#928 楞嚴經大勢至菩薩念佛圓通章疏鈔|續法法師
-淨土　　#929 略論安樂淨土義|釋曇鸞
 天台　　#930 五方便念佛門|天台<gdd>智者</gdd>大師
 圓覺經　#943 圓覺經略釋|太虛大師講述
 楞伽經　#944~7 楞伽經義記|太虛大師
 圓覺經　#948 大方廣圓覺修多羅了義經抉隱|王驤陸居士
-淨土　　#949 阿彌陀佛四十八願|淨空法師
-淨土　　#950~63 淨宗朝暮課誦經文講記|淨空法師
-　　　　#964 佛說四十二章經講記|自立法師
-圓覺經　#965 大方廣圓覺修多羅了義經述要|釋智諭
-　　　　#966 「信心銘」直解|耕雲先生
-人物　　#967~8 中國佛教人物|呂徵等
 心地觀經#969~82 大乘本生心地觀經講記|太虛大師 // ADHOC
-　　　　#983 佛說盂蘭盆經講記|顯明法師
-　　　　#984 佛教的孝道思想|南懷瑾先生
-　　　　#985 毛毛蟲變蝴蝶—癌細胞變快樂佛細胞|道證法師講述 // 歸於0540系列，之五
-　　　　#986 學醫、學佛、學生死|黃錫信醫師
-　　　　#987 一場大病換來了世間的無價之寶|楊牧貞博士
-故事　　#988 癌症讓我活得更健康|謝清佳博士
-　　　　#989 健康靠自己|李豐醫師
-淨土　　#990 我願念彌陀|果真法師
-淨土　　#991 淨空法師嘉言錄（三）|淨空法師
-　　　　#992 佛學問答第三輯|如本法師
-　　　　#993 蓮池大師戒殺文|蓮池大師
-　　　　#994 護生痛言|李圓淨居士
-　　　　#995~7 竹窗隨筆|蓮池大師
-　　　　#998 緇門崇行錄|明•蓮池大師
-　　　　#999 佛學問答第四輯|如本法師
-　　　　#1000 佛學問答第五輯|如本法師
-　　　　#1001 雪廬老人事略|李老居士炳南教授治喪委員會謹述
-淨土　　#1002 淨宗簡介|李炳南居士講述
-淨土　　#1003 極樂真詮|李炳南居士講述
-　　　　#1004 門餘大道|李炳南居士講述
-淨土　　#1005 淨法解脫要義|李炳南居士講述
-人物　　#1006 隨師聞法記|李炳南居士講述
-淨土　　#1007 憶佛念佛|李炳南居士講述
-淨土　　#1008 苦口婆心話放下|李炳南居士講述
-淨土　　#1009 學佛求成佛成佛仗彌陀|李炳南居士講述
-　　　　#1010 乘三資糧發願•憶念|李炳南居士講述
 淨土　　#1011 契道之法|李炳南居士講述
-人生　　#1012 知果畏因宜謹慎逢緣遇境好修行|李炳南居士講述
-淨土　　#1013 助念之意義與規矩|李炳南居士講述
-淨土　　#1014 往生問答（鍾居士淨土往生問答）|李炳南居士講述
-淨土　　#1015 大勢至念佛圓通章要義|李炳南居士講述
-淨土　　#1016 淨土精華|李炳南居士講述
-　　　　#1017 正是用功時節|李炳南居士講述
-淨土　　#1018 佛說阿彌陀經義蘊|菩薩戒優婆塞德明李炳南述
-　　　　#1019~24 雪廬老人淨土選集|李炳南居士著述
-淨土　　#1025 淨土安心法門|李炳南居士講述
-　　　　#1026 世出世法 本立道生|李炳南居士講述
-人物　　#1027 李炳南老居士與台灣佛教|于凌波居士等著
 戒律　　#1028 優婆塞戒經講錄|太虛大師
-戒律　　#1029 五戒表解|懺雲法師編
-戒律　　#1030~1 在家居士如何修行|大願法師講述
-戒律　　#1032 在家菩薩戒本釋義|道源法師講述
 戒律　　#1033 在家律學|二埋法師編著
 戒律　　#1034 三皈依講義|宏泰法師整理
 戒律　　#1035 五戒講義|宏泰法師整理
 戒律　　#1036 八關齋戒講義|宏泰法師整理
 法華經　#1037~64 法華經講演錄|太虛大師講述
-　　　　#1065 臨終切要|慧律法師講述•編撰
 楞嚴經　#1066 大佛頂首楞嚴經攝論|太虛大師著
 楞嚴經　#1067 大佛頂首楞嚴經研究|太虛大師講述
 楞嚴經　#1068 楞嚴大意|太虛大師講述
-淨土　　#1069 觀經四帖疏|善導大師集記
-　　　　#1070 萬善同歸集|杭州慧日永明寺智覺禪師延壽述
-　　　　#1071 禪學隨筆|鈴木大拙著
-淨土　　#1072 佛說無量壽經義疏|慧遠撰疏
-　　　　#1073~7 佛法修証心要問答集|元音老人著
 圓覺經　#1078 大方廣圓覺修多羅了義經直解|明<gdd>憨山</gdd>大師著
-　　　　#1079 幸福之道|耕雲先生主講
-　　　　#1080 吃素與學佛|惟覺老和尚講述
-善書　　#1081~100 了凡四訓電視弘法講記|淨空法師講述
-　　　　#1101 佛法與生活|于凌波居士講述
-　　　　#1103 六祖的「三無」和「二三昧」|楊佛興居士講述
-　　　　#1104 禪宗精要與修持|楊佛興大阿闍黎講述
-　　　　#1105 中國佛教儀軌制度|中國佛教協會編
-　　　　#1106 深信因果—源源話說刀兵劫|盧守中居士著
-　　　　#1107 修行法語•淨土篇|懺雲法師集
 金剛經　#1108~10 金剛般若波羅蜜經講義|江味農居士 // (經文引用皆加序號)
-淨土　　#1111 精進佛七開示|學誠法師講述
 禪修　　#1112 禪宗大意|正果法師
 人物　　#1113 虛雲老和尚十難四十八奇|蘇芬居士
-　　　　#1114 佛教的精神與特色|林世敏居士著
-淨土　　#1115 公案|淨空法師講述
 淨土　　#1116=! 大勢至菩薩念佛圓通章|唐天竺沙門 般剌密帝譯
-淨土　　#1117 淨土要典|靈峰<gdd>蕅益</gdd>大師著
-淨土　　#1118 淨土玄門|靈峰<gdd>蕅益</gdd>大師著
 淨土　　#1119 大勢至菩薩念佛圓通章釋—錄楞嚴經文句卷五|靈峰<gdd>蕅益</gdd>大師
-　　　　#1120 起信論示勝異方便釋|靈峰<gdd>蕅益</gdd>大師著
-　　　　#1121 選佛譜—淨土橫超門|靈峰<gdd>蕅益</gdd>大師著
-淨土　　#1122 蕅益大師四十八願文|靈峰<gdd>蕅益</gdd>大師著
-淨土　　#1123~6 蕅益大師淨土選集|靈峰<gdd>蕅益大</gdd>師著
-人物　　#1127 蕅益大師年譜|弘一大師撰
-　　　　#1128 戒殺長壽的真相|了凡弘法學會譯整
-　　　　#1129 人鑑|李圓淨編著
-人物　　#1130 旅行者言—印光大師生西紀念|李圓淨編著
-戒律　　#1131 五戒心法|周秉清居士著
-　　　　#1132 世界真奇妙|聖法法師著
-　　　　#1133 人生指南|毛凌雲纂述
-　　　　#1134~6 慈舟法師開示錄|慈舟法師講述
-　　　　#1137 來果禪師禪七開示錄|來果禪師講述
-淨土　　#1138 阿彌陀經要解講義|清圓瑛法師講義
-淨土　　#1139 阿彌陀經要解親聞記|寶靜法師講述
-淨土　　#1140 阿彌陀佛和他的極樂世界|陳義孝居士著
-淨土　　#1141 彌陀圓中鈔|姚秦 鳩摩羅什譯
-淨土　　#1142~5 念佛法要|毛凌雲敬輯
 摩訶衍　#1146~! 大乘起信論|馬鳴菩薩，梁真諦三藏譯
-摩訶衍　#1147 大乘起信論講話|慈航法師著
 摩訶衍　#1148 大乘起信論裂網疏|<gdd>蕅益</gdd>大師講述
-摩訶衍　#1149 大乘起信論新釋|日本湯次了榮著
-摩訶衍　#1150 大乘起信論述記|慈舟法師述
-摩訶衍　#1151~60 大乘起信論疏記會閱 大乘起信論疏筆削記會閱|續法法師會編
 摩訶衍　#1161 大乘起信論講記|印順導師述
 摩訶衍　#1162 大乘起信論直解|明<gdd>德清</gdd>直解
-理修　　#1163 佛陀法語|達爾卡法師著
-佛學基礎#1164~76 佛學問答類編|李炳南居士解答
-人物　　#1177 慈舟大師傳|道源法師著
-淨土　　#1178 佛說阿彌陀經講記|慈舟法師講
-淨土　　#1179 楞嚴經大勢至菩薩圓通章講義|慈舟法師講
-　　　　#1180 佛說盂蘭盆經講錄|慈舟法師講
-　　　　#1181 八大人覺經淺釋|鄂隨州沙門 慈舟講
-金剛經　#1182 金剛經中道了義疏|慈舟法師講述
-人物　　#1183 慈舟大師事蹟|道源法師等著
-人物　　#1184 虛雲和尚年譜|鼓山門下弟子順德岑學呂寬賢編輯
-人物　　#1185~90 虛雲和尚法彙|鼓山門下弟子順德岑學呂寬賢編輯
-人物　　#1191 虛雲老和尚追思文選|知定法師等著
-淨土　　#1192~3 佛說大乘無量壽莊嚴清淨平等覺經親聞記|淨空法師講述
-地藏經　#1194 地藏菩薩聖德大觀|弘一大師編述
-地藏經　#1195 普勸淨宗道侶兼持誦地藏經|弘一大師講述
-地藏經　#1196 地藏菩薩本願經白話解釋|宅梵胡維銓演述
-戒律　　#1197~202 南山律在家備覽略編|弘一大師遺著
-心經　　#1203 般若波羅蜜多心經講錄|弘一大師著
-　　　　#1204~8 弘一大師文集|弘一大師著述
-人物　　#1209 弘一大師追思文集|夏丏尊居士等著
-人物　　#1210 法味-紀念弘一大師|豐子愷居士述
-地藏經　#1211 弘一律師對地藏菩薩的禮讚|演培講述
-佛學基礎#1212 弘一大師晚晴集|弘一大師編著
-　　　　#1213 般若淨土中道實相菩提論|了然法師著
-地藏經　#1214 地藏菩薩本願功德頌|了然法師著
-心經　　#1215 般若波羅蜜多心經幽贊|窺基大師著
-心經　　#1216 般若波羅蜜多心經略疏|唐翻經沙門 法藏述
 心經　　#1217 般若波羅蜜多心經直說|<gdd>憨山</gdd>大師
-心經　　#1218 般若波羅蜜多心經釋要|明智旭法師述
-心經　　#1219 般若波羅蜜多心經添足|明弘贊大師述
-心經　　#1220 般若心經指掌|清永覺禪師著
-心經　　#1221 般若波羅蜜多心經請益說|為霖禪師著
-心經　　#1222 般若波羅蜜多心經表解|李炳南居士著
-楞嚴經　#1223 楞嚴經五十陰魔淺釋|宣化上人講述
-　　　　#1224 斌宗大師略傳|皈依弟子鄭焜仁敬述
-心經　　#1225 般若波羅蜜多心經要釋|斌宗法師講述
-淨土　　#1226 佛說阿彌陀經要釋|斌宗法師著
 金剛經　#1227 金剛般若波羅密經講義|圓瑛大師 // (經文加anchor，對應0868.htm)
-心經　　#1228 般若心經講義|圓瑛大師著
-　　　　#1229 勸發菩提心文講義|圓瑛大師著
-　　　　#1230 仁王護國經講義|圓瑛大師著
-地藏經　#1231~43 地藏菩薩本願經講義|知定法師著述
 淨土　　#1244 印光大師文鈔論集|<gdd>印光</gdd>大師
 占察經　#1245 占察善惡業報經講記|夢參老和尚
 占察經　#1246 占察善惡業報經論|默如論師
-　　　　#1247 清涼小品|張有恆教授著
-淨土　　#1248 阿彌陀佛四十八大願講記|淨空法師講述
-　　　　#1249 無名比丘尼隨訪錄|陳慧劍居士著
-　　　　#1251 藥師經析疑|弘一大師著
-　　　　#1252 藥師本願經講記|太虛大師講述
-　　　　#1253! 藥師琉璃光如來本願功德經|唐三藏法師玄奘奉詔譯
-　　　　#1254 藥師琉璃光七佛本願功德經釋義|吳立民（信如）居士著
-　　　　#1255 東方淨土發微|印順導師講述
-　　　　#1256 誓願宏深的藥師如來|洪啟嵩居士著
-　　　　#1257 藥師經提要|洪啟嵩居士著
-　　　　#1258 藥師如來法門|弘一大師講述
-　　　　#1259 藥師法門文彙|竺摩法師等講述
-　　　　#1260 自殺以後的真相|紅葉居士編著
-占察經　#1261 占察善惡業報經講記|周家麟居士講述
 占察經　#1262 占察善惡業報經疏|古吳蕅益沙門 智旭述
-占察經　#1263=! 占察善惡業報經|天竺三藏菩提燈譯
-　　　　#1264 淨空法師談墮胎|淨空法師講述
-　　　　#1265 學佛行儀|善因法師述
-　　　　#1266 放生感應奇蹟記|蓮子居士編述
-　　　　#1267 畫佛因緣|道證法師著
-　　　　#1268 中陰身的自救法|張通文居士著
-　　　　#1269~70 素食、生食與健康|傅永益居士編著整理
-　　　　#1271 圓滿臨終關懷|道昇居士整理
-　　　　#1272 茅篷札記|圓因法師著
-　　　　#1273 修心法要－利器之輪|法護尊者原著
-淨土　　#1274 印光大師開示(敦倫盡分.閑邪存誠.老實念佛.求生淨土)|淨空法師講述
-　　　　#1275 佛法與科學之比較|王季同居士著
-　　　　#1276 佛法省要|王季同居士著
-　　　　#1277 勸全世界學者研究佛法書|王季同居士著
-　　　　#1278 甚麼是佛法|達道居士著
-　　　　#1279 科學時代的輪迴錄|楊大省居士編
-　　　　#1280 業及依業而有的輪迴|演培法師著
-淨土　　#1281 淨宗科學觀|淨空法師講述
-善書　　#1282 文昌帝君陰騭文廣義節錄|清朝•懷西居士周安士著述
-　　　　#1283 萬善先資集|清朝•懷西居士周安士著述
-　　　　#1284 欲海回狂|清朝•懷西居士周安士著述
-　　　　#1285 西歸直指|清朝•懷西居士周安士著述
-心經　　#1286 心經講記|純果法師著
-　　　　#1287 印光大師永思集|陳海量居士編
 淨土　　#1288~91 印光大師文鈔（增廣正編）|<gdd>印光</gdd>大師著
-善書　　#1292 論《安士全書》的思想內涵|曾琦雲居士述
-佛學基礎#1293~4 佛教基本知識|正果法師著
-壇經　　#1295 六祖壇經箋註|丁福保居士著
-壇經　　#1296 《六祖壇經白話譯義》序—兼論六祖的禪宗思想體系|徐恆志居士著
-壇經　　#1297 《六祖壇經》的般若思想|濟群法師著述
 理修　　#1298 成佛必經之路—圓滿布施之道|大寂法師著
-　　　　#1299 淤泥不染|竺摩法師著
-地藏經　#1300 地藏菩薩本願經講話|竺摩法師講述
-　　　　#1301~13 佛教各宗大意|黃懺華居士編述
-壇經　　#1314 六祖壇經講記|淨空法師講述
-　　　　#1315 戒殺放生|淨空法師講述
-　　　　#1316 宣化上人開示錄（四）|宣化上人講述
-　　　　#1317~8 印光大師文鈔續編|<gdd>印光</gdd>大師著
-　　　　#1319 不可思議的因果現象|雲鶴教授著
-　　　　#1320 佛陀的格言|陳柏達居士選譯
-　　　　#1321 見聞錄白話|（明）古吳沙門 智旭隨筆
-　　　　#1322 現果隨錄白話|靈隱罷翁晦山樵戒顯筆記
-　　　　#1323 冥報記白話|（唐）吏部尚書唐臨撰
-　　　　#1324 佛說鬼問目連經白話|後漢安息國三藏安世高譯
-　　　　#1325 長阿含經（卷第二十）白話|凡夫白話譯
-　　　　#1326 佛說罪福報應經白話|凡夫白話譯
-　　　　#1327 法苑珠林（卷六）白話|唐西明寺沙門 釋道世撰
-　　　　#1328 廈門流通佛經緣起序白話|（民）<gdd>印光</gdd>
?楞嚴經　#1329~38 大佛頂首楞嚴經淺釋|宣化上人講述
-淨土　　#1339 蓮池警策|圓因法師述
-　　　　#1340 毛毛蟲變蝴蝶—黑社會變蓮池海會|道證法師講述 // 歸於0540系列，之六
-淨土　　#1341 印光大師全集問答擷錄|<gdd>印光</gdd>大師述
-淨土　　#1342 淨土十要問答擷錄|蕅益大師選錄
-戒律　　#1343 為在家弟子略說三歸五戒十善義白話|<gdd>印光</gdd>大師著
-　　　　#1344 舍利弗問經白話|凡夫白話譯
-　　　　#1345 宋澋州釋智嚴白話|唐惠詳
-戒律　　#1346 受十善戒經白話|凡夫白話譯
-　　　　#1347 為判府蔣樞密開講要義白話|（宋）元照
-　　　　#1348 善恭敬經白話|（隋）天竺三藏闍那崛多譯
-　　　　#1349 大般涅槃經（卷第四）白話|（北涼）天竺三藏曇無讖譯
-　　　　#1350 戒殺四十八問|清崑山周思仁述
-　　　　#1351 佛說八大人覺經講記|自立法師講述
-　　　　#1352 佛說八大人覺經講記|于凌波居士著
-　　　　#1353 佛學的真實面目|妙澤居士著
-佛學基礎#1354 佛法真實的面貌|佛使比丘著
-　　　　#1355~99 宗鏡錄略講上冊|南懷瑾教授講述
-　　　　#1400~46 宗鏡錄略講下冊|南懷瑾教授講述
-　　　　#1447~50 集福消災之道—感應篇彙編白話節本|了凡弘法學會譯整
-　　　　#1451 集福消災之道精簡本|了凡弘法學會編輯
-淨土　　#1452~3 淨土探究|大寂法師
 地藏經　#1454 地藏菩薩本願經唯識觀|趙亮杰居士
 金剛經　#1455 金剛經持驗錄|許添誠
-佛學基礎#1456 學佛者的信念|濟群法師著述
-華嚴經　#1457 普賢菩薩行願品白話解釋|黃智海居士演述
-戒律　　#1458 得戒和尚開示錄|妙蓮法師講述
-　　　　#1459 法海釋疑|妙蓮老和尚開示
-　　　　#1460~6 古農佛學答問卷一|范古農居士主答
-人生　　#1467 學佛與素食—諦聽佛陀的說法|蔡慧明居士編譯
-　　　　#1468 懺雲法師開示集|懺雲法師講述
-　　　　#1469 七十二條鐵證—出家人為社會為國家為世界的貢獻|度能法師著
-地藏經　#1470 地藏經簡答壹佰條|蓮懺法師整理
 善書　　#1471 玉歷寶鈔 
 楞嚴經　#1472~95 大佛頂首楞嚴經講義|圓瑛大師
-　　　　#1496 修行筆記|海濤法師編著
-　　　　#1497 真愛手冊|海濤法師編著
-　　　　#1498 放生手冊|海濤法師輯
 圓覺經　#1499 大方廣圓覺經講義|圓瑛大師著
-　　　　#1500 天下太平之根本（印光大師遺教摘錄之二——家庭教育）|<gdd>印光</gdd>大師著
-　　　　#1501 逆耳言（弘護叢書之五）|李炳南居士講述
-華嚴經　#1502 華嚴經淨行品淺釋|宣化上人講述
-　　　　#1503 學佛隨筆|徐恆志居士著
-　　　　#1504 關於佛教經論的研究方法|徐恆志居士著
-心經　　#1505 心經的理論和實踐|徐恆志居士著
-　　　　#1506 學般若 化二執|徐恆志居士著
-　　　　#1507 「三無漏學」略講|徐恆志居士著
-　　　　#1508 佛海拾趣序|徐恆志居士著
-淨土　　#1509 淨宗講話|徐恆志居士著
-佛學基礎#1510 佛教的形成、教理和 人生價值觀|徐恆志居士著
-佛學基礎#1511 論佛學研究中的幾個問題|徐恆志居士著
-　　　　#1512 有關佛性答問|徐恆志居士著
-　　　　#1513 略述修禪次第|徐恆志居士著
-　　　　#1514 書簡節錄|徐恆志居士著
-淨土　　#1515 佛說阿彌陀經講義|圓瑛大師著
-摩訶衍　#1516 大乘起信論講義|圓瑛大師著
 人物　　#1517 圓瑛老法師事略|皈依弟子葉性禮謹識
-　　　　#1518 百喻故事廣釋|聖法法師著
-淨土　　#1519 龍舒增廣淨土文|王日休居士譔
-淨土　　#1520 無量壽經起信論|清•彭際清居士述
-　　　　#1521 談心|耕雲先生講述
-　　　　#1522 安祥之光|耕雲先生講述
-　　　　#1523 「證道歌」淺釋|耕雲先生講述
-　　　　#1524 愛的人生|耕雲先生講述
-　　　　#1525~7 觀潮隨筆|耕雲先生講述
-　　　　#1528 禪的認知與修學|耕雲先生講述
-　　　　#1529 解惑錄一耕雲先生講述
-　　　　#1530 解惑錄二|耕雲先生講述
-　　　　#1531 耕雲書箋|耕雲先生講述
-心經　　#1532 般若波羅密多心經淺說|耕雲先生講述
-　　　　#1533 唱禪歌就是修行|耕雲先生講述
-　　　　#1534 保任此心絕不相賺|耕雲先生講述
-　　　　#1535 佛法與國運|耕雲先生講述
-　　　　#1536 真我與禪定|耕雲先生講述
-　　　　#1537 青少年問題的癥結與治本之道|耕雲先生講述
-　　　　#1538 參學正眼|耕雲先生講述
-　　　　#1539 無漏行──到達生命圓滿的「八正道」|耕雲先生講述
-心經　　#1540 「般若波羅蜜多心經」淺解|耕雲先生講述
-　　　　#1541 臨濟禪與安祥禪|耕雲先生講述
-　　　　#1542 禪、祖師禪與安祥禪|耕雲先生講述
-　　　　#1543 信願行證──修行成佛的四個指針|耕雲先生講述
-　　　　#1544 牛的禮贊|耕雲先生講述
-　　　　#1545 修心訣|耕雲先生講述
-　　　　#1546 學禪的四個基礎|耕雲先生講述
-　　　　#1547 中華禪風的演變|耕雲先生講述
-　　　　#1548 普明禪師牧牛圖頌導師註解|耕雲先生講述
-　　　　#1549 法供養最殊勝|耕雲先生講述
-　　　　#1550 禪者的立德、立功、立言|耕雲先生講述
-　　　　#1551 安祥禪的知與行|耕雲先生講述
-壇經　　#1552 六祖壇經與成佛之道|耕雲先生講述
-　　　　#1553 發掘真我主宰心國|耕雲先生講述
-　　　　#1554 人身難得正法難遇|耕雲先生講述
-心經　　#1555 般若波羅密多心經釋疑|耕雲先生講述
-　　　　#1556 安祥之美|耕雲先生講述
-　　　　#1557 佛法在世間|耕雲先生講述
-　　　　#1558 禪、禪學與學禪|耕雲先生講述
-　　　　#1559 邁向生命的圓滿|耕雲先生講述
-　　　　#1560 安分守己|耕雲先生講述
 理修　　#1561 杜漏|耕雲先生
 理修　　#1562 不二法門|耕雲先生
-　　　　#1563 禪的特質|耕雲先生講述
-　　　　#1564 禪與安祥禪|耕雲先生講述
 金剛經　#1565 持誦金剛經得定要訣|耕雲先生
 理修　　#1566 摩訶般若的要義與入門|耕雲先生
-　　　　#1567 陸軍中將退役出家—律航上人生平|廣元法師著
-淨土　　#1568 淨宗勝義中真勝義性|律航法師著述
-淨土　　#1569 淨土法門構成的三要素和持名念佛的四要領|律航法師著述
-淨土　　#1570 淨土釋疑新論|律航法師著述
-淨土　　#1571 佛說大乘無量壽莊嚴清淨平等覺經講解|律航法師著述
-淨土　　#1572 《無量壽經》要旨|律航法師著述
-淨土　　#1573 《佛說無量壽經》的綱要|律航法師著述
-淨土　　#1574 《佛說無量壽經》五重玄義|律航法師著述
-淨土　　#1575 《無量壽經》與淨土法門關係重要論|律航法師著述
-淨土　　#1576 西方三聖的特徵|律航法師著述
-淨土　　#1577 念佛真諦及特別方便|律航法師著述
-淨土　　#1578 持名念佛法門述要|律航法師著述
-淨土　　#1579 持名念佛要義十則|律航法師著述
-淨土　　#1580 往生極樂的資糧和工具|律航法師著述
-淨土　　#1581 念佛往生須破三疑闖四關|律航法師著述
-淨土　　#1582~5 律航法師文記|律航法師著述
-　　　　#1586 律航法師開示|律航法師講述
-　　　　#1587 律航法師敘說|律航法師著述
-　　　　#1588 律航法師疏偈|律航法師著述
-　　　　#1589 律航法師日記|律航法師著述
 人物　　#1590 律航法師追思文|道源法師等著述
-　　　　#1592 宣化上人略傳|法界佛教印經會編
-楞嚴經　#1593 楞嚴經四種清淨明誨淺釋|宣化上人講述
-　　　　#1594 道源老法師紀念文集|白聖法師等
-　　　　#1595 道源老法師自述年譜|仁光法師紀錄初稿
-　　　　#1596 初機學佛必備基本知見|諾那華藏精舍編輯室著
-　　　　#1597 佛說盂蘭盆經講義|圓瑛大師著
-　　　　#1598~607 圓瑛大師文集|圓瑛大師講述
-佛學基礎#1608~16 佛法概要|明暘法師
-佛學基礎#1617~9 佛法—解脫的原理和行法|淨行法師編著
-　　　　#1620 清心語錄|慧律法師著
-　　　　#1621 佛心慧語|慧律法師著
-楞嚴經　#1622 楞嚴義燈（楞嚴經題要釋）|斌宗法師著
-　　　　#1623 我人生死之由來|斌宗法師講述
-　　　　#1624 新春開示|斌宗法師講述
 人物　　#1625 智者大師對我國佛教的一大貢獻|斌宗法師講述
-佛學基礎#1626 佛法能使人離苦得樂|斌宗法師講述
-佛學基礎#1627 佛法是救世救人的妙法|斌宗法師講述
-　　　　#1628 色身生活與法身生活|斌宗法師講述
-　　　　#1629 顛倒眾生|斌宗法師講述
-　　　　#1630 八苦|斌宗法師講述
-　　　　#1631 涅槃是什麼？|斌宗法師講述
 佛學基礎#1632 認識佛教之常識|斌宗法師講述
-戒律　　#1633 在台中蓮社傳授在家菩薩戒開示|斌宗法師講述
-　　　　#1634 央掘摩羅彌殺彌慈論|斌宗法師著
-　　　　#1635 雪竇遊記|斌宗法師著
-　　　　#1636 雲水詩草|斌宗法師著
-　　　　#1637 茅蓬札記第二輯|圓因法師著
-　　　　#1638 茅蓬札記第三輯|圓因法師著
-　　　　#1639 修行精華|圓因法師著
-　　　　#1640 聽經札記|圓因法師著述
-　　　　#1641 尋寶記|傅麗卿居士著
-　　　　#1642 我們的導師—圓因法師|佛教蓮池功德會著
 楞嚴經　#1643~53 楞嚴經懸鏡、通議|<gdd>憨山</gdd>大師 // ADHOC
-　　　　#1654 印光法師簡譜|信西居士敬編
-　　　　#1655 印光大師的生平與思想|見正法師著
-淨土　　#1656 中興淨宗印光大師行業記|真達妙真了然德森等敬述
-　　　　#1657 虛空之道|慧濬法師講述
-　　　　#1658 德育古鑑|清•史潔珵（玉涵）輯
-　　　　#1659 壽康寶鑑擷錄|<gdd>印光</gdd>大師增訂
-　　　　#1660 求子之道|<gdd>印光</gdd>大師著
-淨土　　#1661 淨空法師說故事（一）|淨空法師講述
-淨土　　#1662 學佛問答（一）|淨空法師講述
-　　　　#1663 圓因老法師|妙音居士著
-　　　　#1664 向受過現代教育的人介紹佛教
-佛學基礎#1665 佛教要義
-　　　　#1666 自殺是災難的開始|王警官講述
-　　　　#1667 六道輪迴的問題|南亭法師著
-　　　　#1668 煙酒與健康|于凌波醫師著
-　　　　#1669 小宣傳集錦|李炳南居士著述
-　　　　#1670 經—中國人的身分證|高大鵬居士撰
-淨土　　#1671 佛說阿彌陀經講要|太虛大師講
-淨土　　#1672 佛說無量壽經要義|太虛大師講
-淨土　　#1673 往生安樂土法門略說|太虛大師講
-淨土　　#1674 念佛往生的原理|太虛大師講
-　　　　#1675 由三種所依顯念佛勝義|太虛大師講
-淨土　　#1676 佛七開示錄|太虛大師講
-　　　　#1677~707 拜佛與醫學|道證法師編述
-　　　　#1708 佛誕節宣言|李炳南居士著述
 維摩經　#1709=! 維摩詰所說經|姚秦 鳩摩羅什譯
-維摩經　#1710 維摩詰所說不可思議解脫經釋會紀聞|太虛大師講述
-維摩經　#1711 維摩詰經別記|太虛大師講述
 佛學基礎#1712 佛學常識課本|李炳南居士
-　　　　#1713 孝經白話註解|關中嚴協和居士著
-維摩經　#1714 維摩詰所說經註疏全集|昆明彌陀寺沙門 冰谷註疏
 佛學基礎#1715 叩鳴集|李炳南居士
-　　　　#1716 觀世音菩薩普門品講記|賢頓和尚講述
-　　　　#1717 不可思議的因果現象第二集—要怎樣收穫就要怎樣栽|雲鶴教授著
-　　　　#1718 如何教育孩子成為超級英才|雲鶴教授著
-　　　　#1719 靜坐須知|蘇芬居士著
-　　　　#1720 重建道德與青少年教育|淨空法師訪談錄
 淨土　　#1721 念佛速證菩提心要|廖榮尉居士
 善書　　#1722 弟子規易解 
-　　　　#1723 如何無憂無懼過生活|達摩難陀法師著
-　　　　#1724 法句經中譯|敬法法師譯
 善書　　#1725 三字經易解|章炳麟
-　　　　#1726 從微塵到寶塔—開創教育無窮的新希望|紮根教育持續會編述
-　　　　#1727 慧律法雨—找回內心的平靜|慧律法師著
-　　　　#1728 佛菩薩探訪錄|慈雲雜誌社集輯
 人物　　#1729~! 佛所行讚 佛本行經|馬鳴菩薩
 道德經　#1730 道德經
 道德經　#1731 老子道德經<gdd>憨山</gdd>註|<gdd>憨山</gdd>大師
-善書　　#1732 改造命運心想事成—了凡四訓講記|淨空法師
 人物　　#1733 2002年參訪韓日專刊|淨空法師
-　　　　#1734 斷除四煩惱|慧律法師講述
-　　　　#1735 生命的重建|露意絲•海著
 金剛經　#1736 金剛般若波羅蜜經分段注解|黃昆山居士
-　　　　#1737 敬悼—已被殘蝕的理性|正義法師編著
-人生　　#1738 如何輔導孩子經營國中生活|張伯琦老師著
-人生　　#1739 正確的讀書方法及考試密技|菩薩戒弟子鄭育能（果甲）謹述
-人生　　#1740 如何使孩子聽話|菩薩戒弟子鄭育能(果甲)居士謹述
 佛學基礎#1741 佛教各宗派源流|太虛大師
-　　　　#1742 慧律法師佛學問答錄|慧律法師主講
 人物　　#1743 黃石公素書註釋彙編|黃石公
-　　　　#1744 白話素書淺釋|譚威居士著
-　　　　#1745 留候世家|西漢司馬遷撰
 人物　　#1746~8 流浪者群歌—聖者的生命故事|明暘法師 // ADHOC
-人生　　#1749 關聖帝君戒淫經
-人生　　#1750 關聖帝君戒淫經註解
-人生　　#1751 冥罰淫律
-人生　　#1752 淫報啟示錄|覺有情居士著
-人生　　#1753 邪淫好色慘報最速
-人生　　#1754 文昌帝君戒淫寶訓
 佛學基礎#1755 學佛淺說|王博謙居士
-人生　　#1756 你相信轉世嗎？|達摩難陀法師作
-　　　　#1757~60 佛乘宗要論|太虛大師講述
-人生　　#1761 凡情與佛心|妙蓮老和尚開示
 楞嚴經　#1762~99 大佛頂首楞嚴經正脈疏|明<gdd>交光</gdd>大師述 // ADHOC
 文殊師利#1800=! 文殊師利般若經|梁扶南國三藏曼陀羅仙譯
 文殊師利#1801=! 聖妙吉祥真實名經|土番譯主聶崖沙門 釋智譯 // 元講經律論習密教
 文殊師利#1802=! 文殊師利發願經|東晉天竺三藏佛陀跋陀羅譯
 　　　　#1803=! 佛說十善業道經|唐于闐三藏法師實叉難陀譯
-　　　　#1804 十善業道經大意|淨空法師講述
-戒律　　#1805 為在家弟子略說三歸五戒十善義|<gdd>印光</gdd>大師著
-金剛經　#1806 金剛經的研究|沈家楨居士著
-金剛經　#1807 金剛經講義|達理法師
-　　　　#1808! 六度集經|吳康居國沙門 康僧會譯
-華嚴經　#1809 華嚴選讀|佛陀教育基金會選錄
-人生　　#1810 如何救贖墮胎罪業
-　　　　#1811 朝聖之旅|郭惠珍醫師（道證法師）述
-　　　　#1812 大乘廣五蘊論講記|于凌波居士著
-　　　　#1813 阿含經菁華節錄|佛陀教育基金會整理
 金剛經　#1814 金剛般若波羅蜜經講義|吳潤江上師講述
-　　　　#1815~7 讀印光大師文鈔記|會性法師敬記
 戒律　　#1818 在家律學概說|果清律師主講
 戒律　　#1819 五戒八戒學處|育因法師主講
 法華經　#1820 妙法蓮華經觀世音菩薩普門品講義|圓瑛法師講述
-淨土　　#1821 佛說阿彌陀經講記|自立法師講述
-　　　　#1822 死亡的藝術|慧律法師講述
-　　　　#1823 法海搜珍|陳旡我居士選材
-　　　　#1824~7 心的方向—活出真實人生|梅原諦愚著
-　　　　#1828 觀世音菩薩普門品淺說|淨心法師講述
-　　　　#1829 至尊宗喀巴大師傳|法王周加巷著
-　　　　#1830 至尊宗喀巴大師傳|法王周加巷著
-　　　　#1831 宗喀巴大師傳|法尊法師譯
-　　　　#1832 阿底峽尊者傳|法尊法師譯
-　　　　#1833 菩提道次第略論譯講|<gdd>宗喀巴</gdd>大師造，大勇法師譯講
-　　　　#1834~! 菩提道次第略論|黃教祖師<gdd>宗喀巴</gdd>大師著
-　　　　#1835 入中論講記月稱論師造論|法尊法師譯講
-　　　　#1836 聖者賢行願王釋義|章嘉遊戲金剛造
-　　　　#1837 勝集密教王五次第教授善顯炬論|<gdd>宗喀巴</gdd>大師著
-　　　　#1838~9 入菩薩行論廣解寂天菩薩造頌|杰操大師廣解
-　　　　#1840~1 菩提道次第廣論|<gdd>宗喀巴</gdd>大師造
-　　　　#1842~50 釋量論略解|法稱論師著
-淨土　　#1851 西方極樂是君家|宣化上人講述
-　　　　#1852 ｅ世紀往生傳|學謙居士選輯
-　　　　#1853~5 大醫生小醫院|川田洋一著
-　　　　#1856 十善業道經講話|南亭法師講述
-　　　　#1857 生從何來死往何處|慧律法師講述
 淨土　　#1858 四大淨土比較研究|聖凱法師著
-　　　　#1859 人間菩提|海濤法師編著
-　　　　#1860 博士界的論辯|安羅支博士著
-　　　　#1861 告佛教青年書|廣義法師講
-　　　　#1862 世界著名學者對於佛教的批評|陳旡我居士譯
-　　　　#1863 佛說素食經—斷肉食素聖典彙編|海濤法師選輯
-　　　　#1864 天天天藍—菜根譚的智慧|聖印法師著
-地藏經　#1865 地藏菩薩本願經講錄|會性法師講述
-　　　　#1866 鐵窗下的醒悟∼浪子心聲∼51位曾經誤入歧途的年輕人現身說法
-　　　　#1867 觀世音菩薩傳|曼陀羅主人著
-　　　　#1868 見賢思齊（一名廣化律師弘法故事集）|廣化法師講述
-　　　　#1869 佛教移民學|妙蓮法師講述
-　　　　#1870 護國護仁|妙蓮法師講述
-　　　　#1871 轉凡心修佛行|妙蓮法師講述
-　　　　#1872 人生哲學與佛學|龜山王恩洋居士著
-　　　　#1873 日日日出—菜根譚的智慧|聖印法師著
-　　　　#1874 救苦救難．絕症不懼的關鍵
 楞嚴經　#1875~84 大佛頂首楞嚴經講記|海仁法師 // (經文引用皆加序號。提取了科判)<br>
-　　　　#1885~8 生命的終極關懷|信願法師著
 金剛經　#1889 金剛般若波羅密經講義|文珠法師講述
-華嚴經　#1890 大方廣佛華嚴經普賢行願品講義|文珠法師講述
-　　　　#1891 佛說八大人覺經講記|文珠法師講述
-淨土　　#1892 佛說阿彌陀經講義|文珠法師講述
-淨土　　#1893 大勢至菩薩念佛圓通章講義|文珠法師講述
-心經　　#1894 般若波羅蜜多心經講義|文珠法師講述
-　　　　#1895 佛說菩薩修行四法經講解|文珠法師講述
-楞嚴經　#1896 楞嚴經七處破妄十番顯見|文珠法師講述
-　　　　#1897~900 四大菩薩|文珠法師講述
 法華經　#1901 妙法蓮華經觀世音菩薩普門品講義|文珠法師講述
?法華經　#1902 妙法蓮華經方便品講義|文珠法師講述
 金光明經#1903 金光明經空品講義|文珠法師講述
 戒律　　#1904 三皈五戒的意義|文珠法師講述
-淨土　　#1905 念佛法門|文珠法師講述
-楞嚴經　#1906 學佛必修的課程——四清淨明誨|文珠法師講述
-　　　　#1907 勸發菩提心文講義|文珠法師講述
-　　　　#1908 二十一世紀的人生|文珠法師講述
-　　　　#1909 福慧雙修|文珠法師講述
-　　　　#1910 佛教與健康|文珠法師講述
-　　　　#1911 佛教與人生|文珠法師講述
-　　　　#1912 佛教與青年|文珠法師講述
-　　　　#1913 心靈的世界|文珠法師講述
-　　　　#1914 不平凡的回憶|文珠法師講述
-　　　　#1915 學佛的人|文珠法師講述
-　　　　#1916 觀音法門|文珠法師講述
-淨土　　#1917 成佛捷徑|文珠法師講述
-淨土　　#1918 修福修慧修淨土|文珠法師講述
-　　　　#1919 宗教佛教與科學|文珠法師講述
-　　　　#1920 生命壽命與慧命|文珠法師講述
-　　　　#1921 理性感性與覺性|文珠法師講述
-　　　　#1922 堅定自己的信仰|文珠法師講述
-　　　　#1923 改善自己的命運|文珠法師講述
-　　　　#1924 正見與邪見|文珠法師講述
-　　　　#1925 出世與入世|文珠法師講述
-　　　　#1926 心靈的自由與解脫|文珠法師講述
-　　　　#1927 我們的責任|文珠法師講述
-　　　　#1928 佛教對中國文化之影響|文珠法師講述
-　　　　#1929 人間佛教與現代青年|文珠法師講述
-　　　　#1930 沙田大會堂佛學演講|文珠法師講述
-　　　　#1931 湛江市佛學演講|文珠法師講述
-　　　　#1932 慈悲|海濤法師選輯
-　　　　#1933 生命手冊|海濤法師編著
-　　　　#1934 慧律法師開示錄|慧律法師述
-佛學基礎#1935 佛學四講|張澄基博士講詞
-佛學基礎#1936 佛學淺釋|蘇行三博士編釋
-　　　　#1937 素食主義|海濤法師選輯
 佛學基礎#1938 超度的理论与事实|淨空法師
-淨土　　#1939 新世代念佛往生錄|學謙居士選輯
-　　　　#1940 無量壽經啟信錄|學謙居士選輯
-　　　　#1941 青年手冊|海濤法師編著
-人生　　#1942 漫談兩性關係|王警官講述
-　　　　#1943 法音集|守成法師著
-淨土　　#1944 禪與淨土|黎振東居士講述
-佛學基礎#1945 佛學問答第六輯|如本法師著
-故事　　#1946 因緣果報|海濤法師選輯
-　　　　#1947 修行語錄|高雄淨宗學會輯錄
-佛學基礎#1948 佛教常用唄器、器物、服裝簡述|祥雲法師著
-　　　　#1949 說僧過惡•犯大重罪|曇影法師著
-　　　　#1950 清涼小品（二）|張有恆教授著
-淨土　　#1951 淨土十疑論白話淺譯|隋天台<gdd>智者</gdd>大師說
-淨土　　#1952 念佛三昧寶王論白話淺譯|法宣法師白話譯
-淨土　　#1953 淨土或問白話淺譯|元師子林天如維則述
-人生　　#1954 生死輪回善惡因果報應決定有|馬里奧博士驚人發現
-　　　　#1955 夜夜夜思—菜根譚的智慧|聖印法師著
-金剛經　#1956 金剛經今疏|知義法師著
-淨土　　#1957 西齋淨土詩白話淺譯|明四明梵琦楚石著
-　　　　#1958 蓮華世界詩白話淺譯|明雲棲會下妙意庵廣貴輯
-　　　　#1959 覺明法師開示|覺明法師講述
-淨土　　#1960 禪淨何爭|虛雲老和尚講述
-　　　　#1961 寶王三昧念佛直指白話淺譯|明四明鄞江沙門 妙什集
-　　　　#1962 幸福婚姻經典輯要|海濤法師選輯
-故事　　#1963~4 菩薩與羅漢的故事|海濤法師編著
 楞伽經　#1965 楞伽經概說|印海法師著
-淨土　　#1966 佛說阿彌陀經講話|南亭老和尚講述
-淨土　　#1967 大勢至菩薩念佛圓通章講錄|會性法師講述
-淨土　　#1968 讚阿彌陀佛偈略說|會性法師講述
-淨土　　#1969 小淨土文略說|會性法師講述
-華嚴經　#1970 華嚴經普賢行願品講錄|會性法師講述
-　　　　#1971 佛要救你（彌陀要解學習之一∼有關助念的問題）|道證法師講述
-佛學基礎#1972 佛教起信與入門|李慶宏居士著
-淨土　　#1973 佛說觀無量壽佛經集解|會性法師敬集
 金剛經　#1974 金剛經靈異錄|張少齊居士
-　　　　#1975 觀音慈林集|粵東鼎湖山沙門 釋
-　　　　#1976 解惑叮嚀語|妙蓮老和尚開示問答
 人生　　#1977 醫學博士為什麼要素食|奧雲伯列博士等
-　　　　#1978~80 畫佛因緣|道證法師 // (utf-8)
-故事　　#1981~94 朝聖之旅|道證法師 // (utf-8)
-　　　　#1995~2015 金蓮盛開水月清西想集|道證法師 // (utf-8)
-　　　　#2016 您不僅能救他的身，更能救他的心！|智敏．慧華金剛上師開示 // (utf-8)
-地藏經　#2017 地藏經略說|聖一老和尚講述
-　　　　#2018 三藏精要|楊秀鶴居士編選
-　　　　#2019 真理手冊|海濤法師編著
-　　　　#2020 多聞修學聖典彙編|海濤法師選輯
-　　　　#2021 戒淫斷欲聖典彙編|海濤法師選輯
-　　　　#2022 護生手冊|海濤法師輯
-　　　　#2023 學生手冊──小學生與國中生|海濤法師編著
-　　　　#2024 甚麼是佛法|沈家楨博士著
-　　　　#2025 觀世音菩薩修持方法及證悟過程|沈家楨博士著
-　　　　#2026 您不僅能救他的身，更能救他的心！|智敏．慧華金剛上師開示
-善書　　#2027 了凡四訓語譯
-　　　　#2028 王鳳儀嘉言錄
-　　　　#2029 醒世詩詞選|于凌波居士選輯
 理修　　#2030 宇宙萬有本體論|金陵白衣定熙集
-人生　　#2031 如何獲得命好又會讀書的小寶寶|菩薩戒弟子鄭育能（果甲）著
-戒律　　#2032 菩薩戒經選輯|海濤法師選輯
-　　　　#2033 經集選輯|海濤法師選輯
-　　　　#2034 放生手冊第二集|海濤法師輯
-人物　　#2035 海濤法師說故事|海濤法師著
-　　　　#2036 安樂集白話|唐．道綽禪師撰
-　　　　#2037 笑著進入七寶池|道證法師講述
-　　　　#2038 節慾主義|丁福保編纂
-　　　　#2039 慈愛手冊∼愛與智慧的心靈小品∼|海濤法師編選
-　　　　#2040 壽康寶鑑白話編譯|隱名氏編譯
-　　　　#2041 等待黎明的時刻|修德法師編述
-　　　　#2042 參加「佛七法會」所獲得的靈異記＆如何淨化．天災．人禍之劫運|林慈超居士輯錄
-　　　　#2043~7 居士學佛|淨空法師講述
-　　　　#2048 真言宗綱要|黃繩曾居士編著
 淨土　　#2049 淨宗法要|<gdd>憨山</gdd>大師
-　　　　#2050 思歸集|釋如岑敬輯
 施食　　#2051 慈悲施食手冊|海濤法師選輯
-　　　　#2052 施食煙供儀軌
-　　　　#2053 各宗教對同性戀的看法
-法華經　#2054 妙法蓮華經持驗記
-華嚴經　#2055 華嚴演義【冊一】|淨空法師演述
-故事　　#2056 業道輪迴經典選輯|海濤法師選輯
-　　　　#2057 準提法門|海濤法師編輯
-　　　　#2058 大悲咒修持法與功德利益|海濤法師編輯
-　　　　#2059 律宗綱要萬治三年刊東大寺藏本|凝然法師著
-　　　　#2060 孝與戒淫—淺談青年應有的美德|鐘茂森博士敬述
-人物　　#2061 能海大師傳|宋大魯居士著
 戒律　　#2062 佛教律學入門|虛雲老和尚講述
-　　　　#2063 孝順經典選輯|海濤法師選輯
-　　　　#2064 菩薩四法經典選輯|海濤法師選輯
-　　　　#2065 佛說功德經典選輯|海濤法師選輯
-故事　　#2066 政治經典選輯|海濤法師選輯
-　　　　#2067 天子所問經|海濤法師選輯
-淨土　　#2068 淨業持名四十八法|鄭韋庵居士著
-故事　　#2069~70 鬼道眾生的故事|海濤法師編著
-故事　　#2071 善女人往生傳|凡夫居士譯
-人物　　#2072 淨空法師說故事（二）|淨空法師講述
-華嚴經　#2073 華嚴演義【冊二】|淨空法師講述
 禪修　　#2074 修習止觀坐禪法要講述|<gdd>智顗</gdd>大師述，寶靜法師講
 　　　　#2075=! 南傳法句經新譯（附北傳法句經）|法增比丘譯
-　　　　#2076 祈願正法重現|慧律法師著
-　　　　#2077 抉擇見|黃念祖居士講述
-　　　　#2078 慈悲的咒語|海濤法師選輯
-淨土　　#2079 淨土生無生論白話淺譯|清閩鼓山沙門 道霈造
-淨土　　#2080 淨土法語白話淺譯|明天台山幽溪沙門 傳燈述
-　　　　#2081 勸發菩提心文白話淺譯|清省庵法師述
-　　　　#2082 圓觀法師等傳白話淺譯|釋德森輯錄
-淨土　　#2083 西方要決釋疑通規白話淺譯|法宣法師白話譯
-淨土　　#2084 印光大師論文集白話淺譯|法宣法師白話譯
?唯識論　#2085~7 唯識名詞白話新解|于凌波居士著
 唯識論　#2088~93 簡明成唯識論白話講記|于凌波居士
-淨土　　#2094 念佛心地功夫|淨空法師講述
-　　　　#2095 傳心法要|淨空法師講述
-　　　　#2096 飲水思源話恩德|淨空法師講述
-淨土　　#2097 淨宗的道風與學風|淨空法師講述
-淨土　　#2098 淨業三福|淨空法師講述
-淨土　　#2099 本願念佛的真實義|淨空法師講述
-　　　　#2100 如何契入佛境界|淨空法師講述
-人生　　#2101 不可思議的因果現象第四集—我為什麼相信因果的現象|雲鶴教授著
-人生　　#2102 不可思議的因果現象第六集—福是種來的不是求來的|雲鶴教授著
-　　　　#2103 雪公師訓集錦|李炳南居士講述
-　　　　#2104 佛學概要十四講李炳南教授編表|吳聰敏（希仁）居士演述
-　　　　#2105 佛學概要十四講表|雪廬老人編表
-戒律　　#2106 菩薩戒本經講記|會性法師主講
-淨土　　#2107 勸修念佛法門|圓瑛法師著
-淨土　　#2108 淨土風光|陳柏達居士著
-　　　　#2109 佛教常識答問|趙朴初居士述
-　　　　#2110 倫理生活化|汪希教授著
-　　　　#2111 哼哈一如說|西行法師著
-　　　　#2112 善用其心集|般若念佛會編輯
-　　　　#2113 百過格創命之學|廖榮尉居士著
-　　　　#2114 如何正確的飲食—讓你遠離癌症的恐懼|梅襄陽醫師講述
-　　　　#2116 藥師琉璃光如來本願功德經淺釋|宣化上人講述
-　　　　#2117 白尊者開示錄|普仁法師講述
-　　　　#2118 智慧之門|如本法師著
-　　　　#2119 一華一葉一世界|如本法師著
-　　　　#2120 壽康寶鑒現代全譯|原著：《不可錄》
-　　　　#2121 壽康寶鑒現代全譯|第二部．【壽康寶鑒】原文
-　　　　#2122 業力不可思議|如本法師講述
-　　　　#2123 萬德莊嚴菩薩道|如本法師著
-　　　　#2124 超越心靈之法寶|如本法師講述
-　　　　#2125 影塵回憶|如本法師著
-　　　　#2126 歸依三寶|如本法師著
-　　　　#2127 臨終遺囑|如本法師著
-　　　　#2128 點燈功德|海濤法師輯
-人物　　#2129 淨土宗祖師法然上人傳|林慈超居士輯錄
-　　　　#2130 高僧大德開示錄|林慈超居士輯錄
-　　　　#2131 正法的代表|宣化上人講述
-　　　　#2132 皈依的真義|宣化上人講述
-　　　　#2133 虛空打破明心地|宣化上人講述
-　　　　#2134 法界唯心|宣化上人講述
-　　　　#2135~8 宣化上人開示錄|宣化上人講述
?法華經　#2139 妙法蓮華經觀世音菩薩普門品講錄|湛山倓虛大師著
-華嚴經　#2140 大方廣佛華嚴經入不思議解脫境界普賢行願品隨聞記|湛山倓虛大師著
-金剛經　#2141 金剛般若波羅密經講義|湛山倓虛大師著
 金剛經　#2142 金剛般若波羅密經親聞記|倓虛大師述
-心經　　#2143 般若波羅密多心經親聞記|湛山倓虛大師著
-心經　　#2144 般若波羅密多心經義疏|湛山倓虛大師述
-心經　　#2145 般若波羅密多心經講義親聞記|湛山倓虛大師述
-心經　　#2146~7 般若波羅密多心經講義|湛山倓虛大師述
-心經　　#2148~9 般若波羅密多心經講錄|湛山倓虛大師述
-心經　　#2150 般若波羅密多心經淺釋|湛山倓虛大師述
-摩訶衍　#2151~2 大乘起信論講義|湛山倓虛大師著
-　　　　#2153 僧璨大師信心銘略解|湛山倓虛大師著
 理修　　#2154 永嘉玄覺禪師証道歌略解|倓虛大師
-　　　　#2155 始終心要義記|湛山倓虛大師著
-　　　　#2156 天台傳法心印記註釋要|元虎溪沙門 懷則述
-　　　　#2157 讀經隨筆|湛山沙門 倓虛著
 楞嚴經　#2158 大佛頂首楞嚴經妙玄要旨|湛山倓虛大師著
-　　　　#2159 湛山文鈔|湛山倓虛大師述
-　　　　#2160 論文集|湛山沙門 倓虛著
-人物　　#2161 倓虛大師追思錄|受法弟子等敬印
-楞嚴經　#2162~72 大佛頂首楞嚴經講記|湛山倓虛大師述 // ADHOC
 淨土　　#9000~! 無量壽經優波提舍願生偈 往生論|婆藪槃豆菩薩
 唯識論　#9001=! 解深密經|大唐三藏法師玄奘奉　詔譯 // (共5卷)
 施食　　#9002=! 佛說救拔焰口餓鬼陀羅尼經|唐三藏沙門 不空譯
 觀世音　#9003=! 千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經|唐西天竺沙門伽梵達摩譯
 觀世音　#9004=! 佛說觀世音三昧經
 觀世音　#9005=! 觀世音菩薩授記經|宋黃龍國沙門曇無竭譯
 楞伽經　#9006=! 楞伽阿跋多羅寶經 楞伽經|宋天竺三藏求那跋陀羅譯 // (共4卷)
 觀世音　#9007=! 佛說大乘莊嚴寶王經|三藏賜紫沙門臣天息災奉制譯 // (共4卷)
 　　　　#9008=! 佛說法滅盡經|僧祐錄中失譯經人名今附宋錄
 　　　　#9009=! 悲華經|北涼天竺三藏曇無讖譯 // (共10卷)
 華嚴經　#9010=! 大方廣佛華嚴經|唐于闐實叉難陀譯 // (共80卷)
 大涅槃經#9011=! 大般涅槃經|宋沙門慧嚴等依泥洹經加之 // (共36卷)
 　　　　#9012=! 佛說首楞嚴三昧經|後秦龜茲國三藏鳩摩羅什譯
 金光明經#9013=! 金光明最勝王經 金光明經|大唐三藏沙門義淨奉制譯 // (共10卷)
 　　　　#9014=! 佛說無常經 三啟經|大唐三藏法師 義淨奉制譯
 　　　　#9015=! 勝鬘師子吼一乘大方便方廣經 勝鬘經|宋中印度三藏求那跋陀羅譯
 禪修　　#9016=! 坐禪三昧經|姚秦三藏鳩摩羅什譯
 戒律　　#9017=! 佛說決定毗尼經|群錄皆云燉煌三藏譯
 　　　　#9018=! 佛藏經|姚秦龜茲三藏鳩摩羅什譯
 　　　　#9019=! 央掘魔羅經|宋天竺三藏求那跋陀羅譯
 　　　　#9020 宗鏡錄|宋 <gdd>延壽</gdd>集 // (共100卷)
 禪修　　#9021 修習止觀坐禪法要 小止觀 童蒙止觀|天台山修禪寺沙門<gdd>智顗</gdd>述
 禪修　　#9022 六妙法門|天台大師於都下瓦官寺
 禪修　　#9023 禪波羅蜜|天台<gdd>智者</gdd>大師說 // (共10卷)
 禪修　　#9024~! 修行道地經|西晉三藏竺法護譯 // (共7卷)
 禪修　　#9025~! 達摩多羅禪經|東晉天竺三藏佛陀跋陀羅譯 // (共2卷)
         #9026=! 大毘盧遮那成佛神變加持經 大日經|大唐天竺三藏善無畏共沙門一行譯
 　　　　#9027=! 菩薩從兜術天降神母胎說廣普經|姚秦涼州沙門竺佛念譯
 金剛頂經#9028=! 金剛頂一切如來真實攝大乘現證大教王經|興善寺三藏沙門不空奉詔譯
 心地觀經#9029=! 大乘本生心地觀經|大唐罽賓國三藏般若奉詔譯
 　　　　#9030=! 大方等大集經 // (共60卷，包含下列六分共34卷)
 　　　　#9031=! 大方等大集經寶幢分|北涼天竺三藏曇無讖譯 // (共3卷13品)
 　　　　#9032=! 大方等大集經虛空目分|北涼天竺三藏曇無讖譯 // (共3卷10品)
 　　　　#9033=! 大方等大集經日密分|北涼天竺三藏曇無讖譯 // (共3卷4品)
 　　　　#9034=! 大方等大集經日藏分|高齊天竺三藏那連提耶舍譯 // (共12卷13品)
 　　　　#9035=! 大方等大集經月藏分|隋天竺三藏那連提耶舍譯 // (共11卷20品)
 　　　　#9036=! 大方等大集經須彌藏分|高齊天竺三藏那連提耶舍譯 // (共2卷4品)
 　　　　#9037=! 大方等大集經菩薩念佛三昧分 菩薩念佛三昧經|隋天竺三藏達磨笈多譯 // (共10卷15品)
 　　　　#9038=! 大方等大集經賢護分 般舟三昧經|後漢月支三藏支婁迦讖譯 // (共3卷16品)
 　　　　#9039=! 大乘大集地藏十輪經 地藏十輪經|三藏法師玄奘奉詔譯 // (共10卷8品)
 華嚴經　#9040=! 大方廣佛華嚴經普賢行願品 四十華嚴 貞元經|罽賓國三藏般若奉詔譯 // (共40卷)
-彌勒    #9041=! 佛說彌勒下生經
-彌勒    #9042=! 佛說觀彌勒菩薩上生兜率天經
-彌勒    #9043=! 佛說彌勒大成佛經
-彌勒    #9044=! 佛說彌勒來時經
-彌勒    #9045=! 彌勒受決經
-彌勒    #9046=! 佛說彌勒下生成佛經
-彌勒    #9047=! 彌勒菩薩所問本願經
-彌勒    #9048=! 聖彌勒發趣大乘經
 　　    #9050=! 大寶積經 // (共120卷)
-　　    #9051=! 佛說胞胎經|西晉月氏國三藏竺法護奉制譯
 戒律　　#9052=! 梵網經|後秦龜茲國三藏鳩摩羅什譯
 戒律    #9053=! 優陂夷墮舍迦經|宋錄
-摩訶衍  #9060~! 大智度論|龍樹菩薩造，龜茲國三藏鳩摩羅什譯 // (共100卷)
 淨土　　#9090 淨宗同學修行守則|淨空法師
 戒律　　#9091 沙彌律儀|悟道法師 講 // (共47講)
 摩訶衍　#9093 覺林菩薩偈講解|夢參老和尚 講
 禪修　　#9094 達摩多羅禪經講座|南懷瑾老師 // (共14講)
 善書　　#9095 袁了凡四訓鑄板流通序|<gdd>印光</gdd>大師
 唯識論　#9096 相宗八要直解|明古吳<gdd>蕅益釋智旭</gdd>述 // (共9卷)
 淨土　　#9097 往生論註|<gdd>釋曇鸞</gdd>
 地藏經　#9098 地藏菩薩本願經科註|<gdd>青蓮</gdd>大師 // (共6卷)
 佛學基礎#9099 佛法非宗教非哲學，而為今時所必需|歐陽竟無，王恩洋
s金剛經　#9868=! 金剛般若波羅密經|信裹居士編輯 // (經文特殊排版)<br>　諸經文鏈接到 0868.htm 與 1227.htm 相應解釋。
 摩訶衍　#9901 大乘起信論要旨|馬鳴菩薩造論，信裹居士作圖
 華嚴經　#9902 大方廣佛華嚴經內容|宋溫陵比丘戒環集，信裹居士作圖
 大涅槃經#9903 大涅槃經內容|信裹居士作圖
 心地觀經#9904 大乘本生心地觀經內容|信裹居士作圖
 摩訶衍　#9905~! 大乘起信論|馬鳴菩薩造，唐三藏法師實叉難陀譯
 摩訶衍　#9910 大乘起信論講記|淨界法師講 // (共34集)
       // 9910~9929 reserved for 淨界法師.
`);

class ChoiceItem {
  constructor(readId, topic, name, otherName) {
    this.readId = readId && readId.trim() || '';
    this.topic = topic && topic.trim() || '';
    this.name = name && name.trim() || '';
    this.otherName = otherName && otherName.trim() || '';
  }
  render(buf, lastTopic) {
    if (this.topic && this.topic != lastTopic)
      buf.w(`<a href="javascript:showList('${this.topic}')" title="${this.topic}">䷀ </a>`);
    else
      buf.w('<span style="opacity:0">䷀ </span>');
    if (this.readId) {
      var id = this.readId, uri = 'book/books';
      switch(id[0]) {
      case '1': uri += '2'; break;
      case '2': uri += '3'; break;
      case '9': uri += '9'; break;
      }
      buf.w(`<a href="${uri}/${id}.htm" title="${this.otherName}">${this.name}</a>`);
    } else
      buf.w(this.name);
  }
}

class ChoiceCollection {
  constructor(title) {
    this.title = title;
    this.items = [];
  }
  addItem(item) { this.items.push(item); }
  render(buf, num) {
    var extra = (num == 0) ? '' : '; margin-top:10px', lastTopic;
    buf.w(`<h4 style="font-size:20px; margin-top:0px; margin-bottom:5px${extra}">${this.title}</h4>`);
    //buf.w(`<h4 style="font-size:20px; margin-top:0px; margin-bottom:-15px${extra}">${this.title}</h4>`);
    //buf.w('<blockquote>');
    for (var i=0; i<this.items.length; ++i) {
      if (i>0) buf.w('<br>');
      var item = this.items[i];
      item.render(buf, lastTopic);
      lastTopic = item.topic;
    }
    //buf.w('</blockquote>');
  }
}

class ChoiceLists {
  constructor() {
    this.collectionLists = [];
    this.curCol = 0;
    this._init();
  }
  collectionCount() { return this.collectionLists.length; }
  renderList(buf, col) {
    var lst = this.collectionLists[col];
    for (var i=0; i<lst.length; ++i) {
      if (i>0) buf.w('<br>');
      lst[i].render(buf, i);
    }
  }
  _init() {
    var a = this._text().split('\n'), curColIdx=-1, curCol, curCols;
    for (var i in a) {
      var ln = a[i].trim();
      if (!ln) continue;
      if (ln.startsWith('----')) {
        curCols = this.collectionLists[++curColIdx] = [];
        continue;
      }
      var isNewCol = ln[0] == '#';
      if (isNewCol || !curCol) {
        var name = (ln[0] == '#') ? ln.substring(1).trim() : '*';
        curCol = new ChoiceCollection(name);
        curCols.push(curCol);
        if (isNewCol) continue;
      }
      var vals = ln.split('|');
      curCol.addItem(new ChoiceItem(vals[0], vals[1], vals[2], vals[3], vals[4]));
    }
  }
  _text() { return `
-------------
#五大部經
9010 |華嚴經  | 華嚴經               | 大方廣佛華嚴經
9040 |華嚴經  | 普賢行願品           | 大方廣佛華嚴經入不思議解脫境界普賢行願品
9011 |大涅槃經| 大般涅槃經
9030 |        | 大方等大集經
9050 |        | 大寶積經
     |        | 大般若經

#淨土法門
0360 |淨土    | 無量壽經             | 佛說大乘無量壽莊嚴清淨平等覺經
0086 |淨土    | 阿彌陀經             | 佛說阿彌陀經
0031 |淨土    | 觀無量壽佛經         | 佛說觀無量壽佛經
0008 |華嚴經  | 普賢行願品           | 大方廣佛華嚴經普賢行願品
1116 |淨土    | 大勢至念佛章         | 大勢至菩薩念佛圓通章
9000 |淨土    | 往生論               | 無量壽經優波提舍願生偈

#菩薩造經論
     |        | 釋迦譜
     |        | 佛本生經
1729 |人物    | 佛本行經             | 佛所行讚
1146 |摩訶衍  | 大乘起信論
     |        | 大智度論
9024 |        | 修行道地經
9025 |        | 達摩多羅禪經

-------------
#大乘佛經

     |心經    | 心經
0040 |金剛經  | 金剛經  　           | 金剛般若波羅蜜經
0082 |楞嚴經  | 楞嚴經               | 大佛頂首楞嚴經
0875 |法華經  | 法華經               | 妙法蓮華經
0016 |地藏經  | 地藏經               | 地藏菩薩本願經
1263 |占察經  | 占察經               | 占察善惡業報經
0011 |壇經    | 六祖壇經
9013 |金光明經| 金光明經             | 金光明最勝王經
0015 |圓覺經  | 圓覺經               | 大方廣圓覺修多羅了義經
9006 |楞伽經  | 楞伽經               | 楞伽阿跋多羅寶經
9009 |        | 悲華經
9001 |        | 解深密經
9015 |        | 勝鬘經               | 勝鬘師子吼一乘大方便方廣經
1709 |維摩經  | 維摩詰經             | 維摩詰所說經
9019 |        | 央掘魔羅經
9029 |心地觀經| 心地觀經             | 大乘本生心地觀經
1803 |        | 十善業道經           | 佛說十善業道經
     |        | 正法念處經
9018 |        | 佛藏經
9012 |        | 首楞嚴三昧經         | 佛說首楞嚴三昧經

-------------
#大乘佛經

9016 |        | 坐禪三昧經
9025 |        | 大日經               | 大毘盧遮那成佛神變加持經
9028 |        | 金剛頂經             | 金剛頂一切如來真實攝大乘現證大教王經
9051 |        | 佛說胞胎經
9027 |        | 菩薩處胎經
0084 |        | 遺教經               | 佛垂般涅槃略說教誡經
9008 |        | 法滅盡經             | 佛說法滅盡經
0057 |        | 四十二章經           | 佛說四十二章經
0085 |        | 八大人覺經           | 佛說八大人覺經
9017 |        | 毗尼經               | 佛說決定毗尼經
9014 |        | 三啟經               | 佛說無常經
0090 |施食    | 盂蘭盆經             | 佛說盂蘭盆經
9002 |施食    | 焰口經               | 佛說救拔焰口餓鬼陀羅尼經
0022 |        | 父母恩重難報經       | 佛說父母恩重難報經
     |        | 一字頂輪王經
     |        | 佛升忉利經
     |        | 八大菩薩曼陀羅經     | 佛說八大菩薩曼陀羅經
     |        | 阿闍世王經
0026 |        | 長壽滅罪陀羅尼經     | 佛說長壽滅罪護諸童子陀羅尼經
0083 |        | 阿難問事佛吉凶經
9060 |        | 優陂夷墮舍迦經

-------------
#觀音·文殊·彌勒
9004 |觀世音  | 佛說觀世音三昧經
9005 |觀世音  | 觀世音菩薩授記經
9003 |觀世音  | 大悲心陀羅尼經       | 千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經
0072 |觀世音  | 觀世音菩薩普門品     | 妙法蓮華經觀世音菩薩普門品
9007 |觀世音  | 大乘莊嚴寶王經       | 佛說大乘莊嚴寶王經
1800 |文殊師利| 文殊師利般若經
1801 |文殊師利| 文殊真實名經         | 聖妙吉祥真實名經
1802 |文殊師利| 文殊師利發願經
0353 |彌勒    | 發起菩薩殊勝志樂經
     |彌勒    | 彌勒菩薩所問本願經
     |彌勒    | 彌勒上生經           | 佛說觀彌勒菩薩上生兜率天經
     |彌勒    | 彌勒下生經           | 佛說彌勒下生經
     |彌勒    | 彌勒下生成佛經       | 佛說彌勒下生成佛經
     |彌勒    | 彌勒大成佛經         | 佛說彌勒大成佛經
     |彌勒    | 彌勒來時經           | 佛說彌勒來時經
     |彌勒    | 彌勒受決經
     |彌勒    | 聖彌勒發趣大乘經

-------------
#小乘佛經
     |        | 長阿含經
     |        | 中阿含經
     |        | 雜阿含經
     |        | 增一阿含經
2075 |        | 法句經
9052 |        | 梵網經
     |        | 百業經
     |        | 賢愚經
     |        | 大念處經
     |        | 轉法輪經
     |        | 沙門果經
`;
  }

} // end of class ChoiceLists.
