// 1146 大乘起信論要旨
// 1067 楞嚴經正宗分
// 0970 大乘本生心地觀經大綱

(() => {
const js = 'lit-digests.js';

createGP('六祖惠能覺悟', CAT_大乘)
.hasRightEdge()
.setTree(`
【惠能大彻大悟】
〇一切萬法不離自性
〇〇何期自性本自清淨
〇〇何期自性本不生滅
〇〇何期自性本自具足
〇〇何期自性本無動搖
〇〇何期自性能生萬法`)
.src = js;

createGP('大論立義分', CAT_經論)
.setStyle(AIL + BOLD)
.setWidth(16)
.setLayout(`
〇〇┌生滅門
心〇┤〇〇〇〇┌體大/ail|（本自清淨；斷惡）/
〇〇└真如門─┤相大/ail|（本自具足；修善）/
〇〇〇〇〇〇〇└用大/ail|（能生萬法；度眾生）/
〇`)
.FO(2,1,3)   // 心
.FO(7,2,4,3) // 真如門
.T(7.25,1,'/ail|（業力薰習變現果報相）/')
.T(3.25,4,'/ail|（本不生滅）/')
.src = js;

createGP('大論修行信心分', CAT_經論)
.setMarkNames('ABC')
.setLayout(`
〇〇〇〇〇〇〇〇〇〇┌〇施門
〇〇〇〇信根本〇〇〇│〇戒門
信門┤A信佛〇〇行門┤B忍門
〇〇〇〇信法〇〇〇〇│〇進門
〇〇〇〇信僧〇〇〇〇└〇止觀門〇┌止
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇└觀`)
.run((gp) => {
  var A = gp.getMark('A'), B = gp.getMark('B'),
      ax = A[0], bx = B[0];
  gp.FO(ax-1,1.5,4.5,4)  // 信門
    .XFT(ax+1,[2,3,4,5],0,-0.5)
    .FO(bx-1,1,5,5)      // 行門
    .FO(bx+4,4.5,5.5)    // 止觀門
    .XFT(bx+6,[5,6],0,-0.5)
    .src = js;
});

createGP('大論解釋分', CAT_經論)
.setMarkNames('ABC')
.setLayout(`
〇A〇〇〇〇〇〇〇如實空
顯〇〇心真如門〇〇如實不空
示〇〇〇〇〇〇〇〇〇〇〇〇〇〇覺〇義
正〇〇〇〇〇〇〇〇阿梨耶識〇〇不覺義
義〇〇心生滅門〇〇〇〇〇〇〇〇依心意識轉
〇〇〇〇〇〇〇〇〇即染還淨
對
治B〇我見〇〇人我見
邪〇〇〇〇〇〇法我見
執〇〇究竟離妄執
〇
分C〇〇〇〇〇〇〇〇〇發心
別〇〇信成就發心者〇〇方便
發〇〇解行發心者
趣〇〇證發心者〇〇〇〇真心
道〇〇菩薩發心相者〇〇方便心
相〇〇〇〇〇〇〇〇〇〇業識心`)
.run((gp) => {
  var A = gp.getMark('A'), B = gp.getMark('B'), C = gp.getMark('C');

  function 顯示正義() {
    var X = A[0], y0 = A[1];
    gp.FO(X,y0+0.5,y0+4)
      .XFT(X-1,[y0+1,y0+2,y0+3,y0+4],0,-0.25) // 顯示正義
      .FO(X+6,y0,y0+1)
      .XFT(X+2,y0+1,0,-0.5) // 心真如門
      .FO(X+6,y0+3,y0+5)    // 心生滅門
      .FO(X+12,y0+2,y0+4);  // 阿梨耶識
  }

  function 對治邪執() {
    var X = B[0], Y = B[1]+1;
    gp.FO(X,Y-1,Y+1) // .XFT(X-1,[Y-2,Y-1,Y,Y+1],0,0.5) // 對治邪執
      .FO(X+4,Y-1.5,Y-0.5).XFT(X+6,[Y-1,Y],0,-0.5)  // 我見
  }

  function 分別發趣道相() {
    var X = C[0], Y = C[1]+2;
    gp.FO(X,Y-1,Y+2,4).XFT(X-6,Y,0,0.5) // 分別發趣道相
      .FO(X+8,Y-1.5,Y-0.5)
      .XFT(X+10,[Y-2,Y-1],0,0.5)        // 信成就發心者
      .FO(X+8,Y+1,Y+3,3);               // 菩薩發心相者
  }

  顯示正義();
  對治邪執();
  分別發趣道相();
  gp.src = js;
});

createGP('大乘起信論五分', CAT_經論)
.setStyle(AIL + BOLD)
.run((gp) => {
  var cx=21, ay=3, by=5, cy=1, dy=11.5, ey=18.5;
  gp.T(1,1,'/b|《大乘起信論》五分/')
    .T(1,ay,'/b1|一、因緣分/')
    .T(1,by, '/b|二、立義分/')    .include(cloneGP('大論立義分'),1,by+1.3)
    .T(cx,cy,'/b|三、解釋分/')    .include(cloneGP('大論解釋分'),cx,cy+1.3)
    .T(1,dy, '/b|四、修行信心分/').include(cloneGP('大論修行信心分'),1,dy+1.3)
    .T(1,ey,'/b1|五、勸修利益分/')
    .src = js;
});

createGP('大乘起信論要旨', CAT_經論) // 1146
.setStyle(AIL + BOLD)
.hasRightEdge()
.setWidth(42)
.setTree(`
/b|《大乘起信論》/
〇/b1|因緣分/
〇〇因緣
〇〇〇因緣總相，所謂為令眾生離一切苦，得究竟樂，非求世間名利恭敬故。
〇〇〇為欲解釋如來根本之義，令諸眾生正解不謬故。
〇〇〇為令善根成熟眾生，於摩訶衍法，堪任不退信故。
〇〇〇為令善根微少眾生，修習信心故。
〇〇〇為示方便，消惡業障，善護其心，遠離癡慢，出邪網故。
〇〇〇為示修習止觀，對治凡夫二乘心過故。
〇〇〇為示專念方便，生於佛前，必定不退信心故。
〇〇〇為示利益，勸修行故。
〇〇修多羅中已具此法，何須重說？
〇〇〇如來在世，不須論者
〇〇〇〇眾生利根
〇〇〇〇能說之人，色心業勝，圓音一演，異類等解
〇〇〇如來滅後，
〇〇〇〇或有眾生，能以自力，廣聞而取解者。
〇〇〇〇或有眾生，亦以自力，少聞而多解者。
〇〇〇〇或有眾生，無自智力，因於廣論而得解者。
〇〇〇〇亦有眾生，復以廣論文多為煩，心樂總持少文，而攝多義，能取解者。
〇〇〇如是此論為欲總攝如來廣大深法無邊義故，應說此論。
〇/b|立義分/
〇〇摩訶衍〇所謂「一心二門三大」
〇〇〇法
〇〇〇〇/b|眾生心/〇〇〇〇〇攝一切世間法出世間法。依之顯示摩訶衍義
〇〇〇〇〇/b|心真如相/〇〇〇示摩訶衍體
〇〇〇〇〇/b|心生滅因緣相/〇示摩訶衍自體相用
〇〇〇義
〇〇〇〇/b|體大/〇一切法真如平等不增減故
〇〇〇〇/b|相大/〇如來藏具足無量性功德故
〇〇〇〇/b|用大/〇能生一切世間出世間善因果故
〇/b|解釋分/
〇〇顯示正義
〇〇〇心真如門〇即一法界大總相法門體
〇〇〇〇真如二種義〇依言說分別
〇〇〇〇〇如實空〇〇一切眾生以妄心念念分別皆不相應，故說為空
〇〇〇〇〇如實不空〇法體空無妄故，即真心；常恆不變，淨法滿足，名不空
〇〇〇心生滅門〇依如來藏故有生滅心。
〇〇〇〇阿梨耶識〇不生不滅與生滅和合，非一非異
〇〇〇〇〇覺義不覺義
〇〇〇〇〇〇覺義〇〇心體離念相者，等虛空界無所不遍，法界一相，即如來平等法身。名本覺
〇〇〇〇〇〇〇始覺〇依本覺故而有不覺，依不覺故說有始覺
〇〇〇〇〇〇〇〇凡夫人，即是不覺
〇〇〇〇〇〇〇〇二乘人，名相似覺
〇〇〇〇〇〇〇〇法身菩薩，名隨分覺
〇〇〇〇〇〇〇〇菩薩地盡，名究竟覺
〇〇〇〇〇〇〇隨染分別生二相
〇〇〇〇〇〇〇〇智淨相〇〇〇依法力熏習，如實修行，滿足方便故
〇〇〇〇〇〇〇〇不思議業相〇依智淨能作一切勝妙境界，所謂無量功德之相，常無斷絕
〇〇〇〇〇〇〇覺體相
〇〇〇〇〇〇〇〇如實空鏡〇〇遠離一切心境界相，無法可現，非覺照義故
〇〇〇〇〇〇〇〇因熏習鏡〇〇如實不空，真實性故。又一切染法所不能染，具足無漏，熏眾生故
〇〇〇〇〇〇〇〇法出離鏡〇〇不空法，出煩惱礙、智礙。離和合相，淳淨明故
〇〇〇〇〇〇〇〇緣熏習鏡〇〇依法出離故，遍照眾生之心，令修善根，隨念示現故
〇〇〇〇〇〇不覺義〇不如實知真如法一故，不覺心起而有其念
〇〇〇〇〇〇〇依不覺故生三相〇（三細）
〇〇〇〇〇〇〇〇無明業相〇〇以依不覺故心動，說名為業；覺則不動，動則有苦，果不離因故
〇〇〇〇〇〇〇〇能見相〇〇〇能見相，以依動故能見，不動則無見
〇〇〇〇〇〇〇〇境界相〇〇〇以依能見故境界妄現，離見則無境界
〇〇〇〇〇〇〇以有境界緣故生六相〇（六粗）
〇〇〇〇〇〇〇〇智相〇〇〇〇依於境界，心起分別，愛與不愛故
〇〇〇〇〇〇〇〇相續相〇〇〇依於智故，生其苦樂，覺心起念，相應不斷故。
〇〇〇〇〇〇〇〇執取相〇〇〇依於相續，緣念境界，住持苦樂，心起著故。
〇〇〇〇〇〇〇〇計名字相〇〇依於妄執，分別假名言相故。
〇〇〇〇〇〇〇〇起業相〇〇〇依於名字，尋名取著，造種種業故。
〇〇〇〇〇〇〇〇業繫苦相〇〇以依業受果，不自在故。無明能生一切染法，皆不覺相
〇〇〇〇〇〇同相〇無漏無明種種業幻，皆同真如性相。於此真如義故，一切眾生本來常住，入於涅槃
〇〇〇〇〇〇異相〇無漏無明，隨染幻差別，性染幻差別故
〇〇〇〇〇眾生依心、意、意識轉
〇〇〇〇〇〇意〇依阿梨耶識，說有無明，不覺而起，能見能現能取境界，起念相續，故說為意
〇〇〇〇〇〇〇有五名
〇〇〇〇〇〇〇〇業識〇謂無明力，不覺心動故
〇〇〇〇〇〇〇〇轉識〇依於動心能見相故
〇〇〇〇〇〇〇〇現識〇能現一切境界，隨其五塵對至即現，任運而起常在前故
〇〇〇〇〇〇〇〇智識〇謂分別染淨法故
〇〇〇〇〇〇〇〇相續識〇住持過去無量世業令不失故；能令現在已經之事忽然而念，未來之事不覺妄慮
〇〇〇〇〇〇〇三界虛偽唯心所作，離心則無六塵境界〇心生則種種法生，心滅則種種法滅故
〇〇〇〇〇〇意識〇即相續識。依諸凡夫取著轉深，計我我所，種種妄執，隨事攀緣，分別六塵。亦名分離識、分別事識
〇〇〇〇即染還淨〇以不達一法界故，心不相應，忽然念起，名為無明
〇〇〇〇〇根本無明業識〇無始來自性清淨而有無明染其心，此明本不染而染，故難可了知。雖有染心而常恆不變
〇〇〇〇〇〇凡夫不能知
〇〇〇〇〇〇二乘智慧無所覺
〇〇〇〇〇〇法身菩薩得少分知
〇〇〇〇〇〇菩薩究竟地不能盡知
〇〇〇〇〇〇唯佛窮了〇雖有染心，常恆不變，是故此義唯佛能知
〇〇〇〇〇染心者
〇〇〇〇〇〇凡六種
〇〇〇〇〇〇〇執相應染〇〇〇〇依二乘解脫，及信相應地遠離故
〇〇〇〇〇〇〇不斷相應染〇〇〇依信相應地修學方便，漸漸能捨，得淨心地究竟離故
〇〇〇〇〇〇〇分別智相應染〇〇依具戒地漸離，乃至無相方便地究竟離故
〇〇〇〇〇〇〇現色不相應染〇〇依色自在地能離故
〇〇〇〇〇〇〇能見心不相應染〇依心自在地能離故
〇〇〇〇〇〇〇根本業不相應染〇依菩薩盡地，得入如來地能離故
〇〇〇〇〇〇相應不相應義
〇〇〇〇〇〇〇相應義〇〇謂心念法異，依染淨差別而知相緣相同故
〇〇〇〇〇〇〇不相應義〇即心不覺，常無別異，不同知相緣相故
〇〇〇〇〇〇障礙
〇〇〇〇〇〇〇煩惱礙〇能障真如根本智。依染心，能見能現，妄取境界，違平等性故
〇〇〇〇〇〇〇智礙〇〇能障世見自然業智。一切法常靜無有起相，無明不覺妄與法違，故不能隨順世間種種知故
〇〇〇〇〇分別生滅相者
〇〇〇〇〇〇麤〇與心相應故
〇〇〇〇〇〇〇麤中之麤〇凡夫境界
〇〇〇〇〇〇〇麤中之細〇菩薩境界
〇〇〇〇〇〇細〇與心不相應故
〇〇〇〇〇〇〇細中之麤〇菩薩境界
〇〇〇〇〇〇〇細中之細〇佛境界
〇〇〇〇〇熏習
〇〇〇〇〇〇凡四種
〇〇〇〇〇〇〇淨法〇〇〇〇名為真如
〇〇〇〇〇〇〇一切染因〇〇名為無明
〇〇〇〇〇〇〇妄心〇〇〇〇名為業識
〇〇〇〇〇〇〇妄境界〇〇〇所謂六塵
〇〇〇〇〇〇熏習起染法不斷
〇〇〇〇〇〇〇妄境界熏習義者
〇〇〇〇〇〇〇〇增長念熏習
〇〇〇〇〇〇〇〇增長取熏習
〇〇〇〇〇〇〇妄心熏習義者
〇〇〇〇〇〇〇〇業識根本熏習〇能受阿羅漢、辟支佛、一切菩薩生滅苦故。
〇〇〇〇〇〇〇〇增長分別事識熏習〇能受凡夫業繫苦故
〇〇〇〇〇〇〇無明熏習義者
〇〇〇〇〇〇〇〇根本熏習〇以能成就業識義故
〇〇〇〇〇〇〇〇所起見愛熏習〇以能成就分別事識義故
〇〇〇〇〇〇熏習起淨法不斷
〇〇〇〇〇〇〇妄心熏習義者
〇〇〇〇〇〇〇〇分別事識熏習〇依諸凡夫二乘人等，厭生死苦隨力所能，以漸趣向無上道故
〇〇〇〇〇〇〇〇意熏習〇〇〇〇諸菩薩發心勇猛，速趣涅槃故
〇〇〇〇〇〇〇真如熏習義者
〇〇〇〇〇〇〇〇自體相熏習〇〇從無始世來，具無漏法，備有不思議業，作境界之性
〇〇〇〇〇〇〇〇用熏習者〇〇〇眾生外緣之力
〇〇〇〇〇〇〇〇〇差別緣
〇〇〇〇〇〇〇〇〇〇近緣
〇〇〇〇〇〇〇〇〇〇〇增長行緣
〇〇〇〇〇〇〇〇〇〇〇受道緣
〇〇〇〇〇〇〇〇〇〇遠緣
〇〇〇〇〇〇〇〇〇〇〇增長行緣
〇〇〇〇〇〇〇〇〇〇〇受道緣
〇〇〇〇〇〇〇〇〇平等緣
〇〇〇〇〇〇〇〇〇〇未相應
〇〇〇〇〇〇〇〇〇〇已相應
〇〇〇〇〇〇〇真如自體相者
〇〇對治邪執〇一切邪執皆依我見，若離於我則無邪執
〇〇〇我見
〇〇〇〇人我見
〇〇〇〇〇「如來法身，畢竟寂寞，猶如虛空。」
〇〇〇〇〇「世間諸法畢竟體空，乃至涅槃真如之法亦畢竟空。從本已來自空，離一切相。」
〇〇〇〇〇「如來之藏無有增減，體備一切功德之法。」
〇〇〇〇〇「一切世間生死染法，皆依如來藏而有，一切諸法不離真如。」
〇〇〇〇〇「依如來藏故有生死，依如來藏故得涅槃。」
〇〇〇〇法我見〇以五陰法自性不生，則無有滅，本來涅槃故對治
〇〇〇究竟離妄執者
〇〇分別發趣道相
〇〇〇信成就發心者
〇〇〇〇發心
〇〇〇〇〇直心〇〇正念真如法故
〇〇〇〇〇深心〇〇樂集一切諸善行故
〇〇〇〇〇大悲心〇欲拔一切眾生苦故
〇〇〇〇方便
〇〇〇〇〇行根本方便
〇〇〇〇〇能止方便
〇〇〇〇〇發起善根增長方便
〇〇〇〇〇大願平等方便
〇〇〇解行發心者
〇〇〇證發心者
〇〇〇菩薩發心相者
〇〇〇〇真心
〇〇〇〇方便心
〇〇〇〇業識心
〇/b|修行信心分/ 〇依未入正定眾生說修行信心
〇〇信心
〇〇〇根本〇〇〇〇〇〇〇〇〇所謂樂念真如法故
〇〇〇信佛有無量功德〇〇〇〇常念親近供養恭敬，發起善根，願求一切智故
〇〇〇信法有大利益〇〇〇〇〇常念修行諸波羅蜜故
〇〇〇信僧能正修行自利利他〇常樂親近諸菩薩眾求學如實行故
〇〇行門
〇〇〇施門
〇〇〇戒門
〇〇〇忍門
〇〇〇進門
〇〇〇止觀門
〇〇〇〇止者〇止一切境界相，隨順奢摩他觀義故
〇〇〇〇〇住於靜處，端坐正意
〇〇〇〇〇不依氣息，不依形色，不依於空，不依地水火風，不依見聞覺知
〇〇〇〇〇一切諸想隨念皆除，亦遣除想
〇〇〇〇〇亦不得隨心外念境界，後以心除心
〇〇〇〇〇心若馳散，即當攝來住於正念〇是正念者，當知唯心無外境界，此心亦無自相念念不可得
〇〇〇〇〇若從坐起，去來進止，有所施作，於一切時，常念方便，隨順觀察
〇〇〇〇〇久習淳熟，其心得住
〇〇〇〇〇以心住故，漸漸猛利，隨順得入真如三昧
〇〇〇〇〇〇依是三昧故，則知法界一相〇一切諸佛法身與眾生身，平等無二，即名一行三昧
〇〇〇〇〇〇真如是三昧根本，若人修行，漸漸能生無量三昧
〇〇〇〇〇深伏煩惱，信心增長，速成不退
〇〇〇〇〇唯除疑惑、不信、誹謗、重罪業障、我慢、懈怠、如是等人所不能入
〇〇〇〇〇或有眾生無善根力，則為諸魔外道鬼神之所惑亂
〇〇〇〇〇〇若於坐中現形恐怖，或現端正男女等相，當念唯心，境界則滅，終不為惱
〇〇〇〇〇〇或現天像，菩薩像，亦作如來像，相好具足
〇〇〇〇〇〇或說陀羅尼；或說布施、持戒、忍辱、精進、禪定、智慧
〇〇〇〇〇〇或說平等，空、無相、無願；無怨、無親，無因、無果，畢竟空寂，是真涅槃
〇〇〇〇〇〇或令人知宿命過去未來之事，得他心智，辯才無礙，能令眾生貪著世間名利之事
〇〇〇〇〇〇又令使人數瞋數喜，性無常準
〇〇〇〇〇〇或多慈愛，多睡多病，其心懈怠
〇〇〇〇〇〇或卒起精進，後便休廢，生於不信，多疑多慮
〇〇〇〇〇〇或捨本勝行，更修雜業，若著世事種種牽纏
〇〇〇〇〇〇亦能使人得諸三昧少分相似，皆是外道所得，非真三昧
〇〇〇〇〇〇或復令人，若乃至七日住於定中，得自然香美飲食，身心適悅不飢不渴使人愛著
〇〇〇〇〇〇或亦令人食無分齊，乍多乍少，顏色變異
〇〇〇〇〇〇以是義故，行者常應智慧觀察，勿令此心，墮於邪網
〇〇〇〇〇〇當勤正念，不取不著，則能遠離是諸業障
〇〇〇〇〇〇應知外道所有三昧，皆不離見愛我慢之心，貪著世間名利恭敬故
〇〇〇〇〇真如三昧者
〇〇〇〇〇〇不住見相，不住得相，乃至出定，亦無懈慢，所有煩惱，漸漸微薄
〇〇〇〇〇〇若諸凡夫，不習此三昧法，得入如來種性，無有是處
〇〇〇〇〇〇以修世間諸禪三昧，多起昧著，依於我見，繫屬三界，與外道共
〇〇〇〇〇〇若離善知識所護，則起外道見故
〇〇〇〇〇〇精勤專心修學此三昧者，現世當得十種利益
〇〇〇〇〇〇〇常為十方諸佛菩薩之所護念
〇〇〇〇〇〇〇不為諸魔惡鬼所能恐怖
〇〇〇〇〇〇〇不為九十五種外道鬼神之所惑亂
〇〇〇〇〇〇〇遠離誹謗甚深之法，重罪業障漸漸微薄
〇〇〇〇〇〇〇滅一切疑，諸惡覺觀
〇〇〇〇〇〇〇於如來境界，信得增長
〇〇〇〇〇〇〇遠離憂悔，於生死中勇猛不怯
〇〇〇〇〇〇〇其心柔和，捨於憍慢，不為他人所惱
〇〇〇〇〇〇〇雖未得定，於一切時一切境界處，則能減損煩惱，不樂世間
〇〇〇〇〇〇〇若得三昧，不為外緣一切音聲之所驚動
〇〇〇〇觀者〇分別因緣生滅相，隨順毗缽舍那觀義故
〇/b1|勸修利益分/
〇〇若有眾生欲於如來甚深境界得生正信入大乘道，當持此論思量修習，究竟能至無上之道。
〇〇若人受持此論觀察修行，若一日一夜，所有功德無量無邊不可得說。`)
.src = js;


createGP('楞嚴經正宗分', CAT_經論) // 1067
.setStyle(AIL + BOLD)
.setLayout(`
/b|《楞嚴經》/〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇┌迷悟緣起
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇┌正為內凡發心〇┤〇〇〇〇〇┌初悟空妄
〇〇〇〇〇〇〇〇〇〇〇〇┌開佛知見令悟〇┤〇〇〇〇〇〇〇└悟心方便〇┤進悟幻有
〇〇〇〇〇〇〇〇〇〇〇〇│〇〇〇〇〇〇〇└兼為小聖發心〇〇〇〇〇〇〇└徹悟實性
〇〇〇〇〇〇〇〇┌開示〇┤〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇┌悟修緣起
〇〇〇〇〇〇〇〇│〇〇〇│〇〇〇〇〇〇〇┌正明因地修證〇┤〇〇〇〇〇┌入門正行
〇〇〇┌正說分〇┤〇〇〇└示佛知見令入〇┤〇〇〇〇〇〇〇└修入方便〇┤入門前行
〇〇〇│〇〇〇〇└結持〇〇〇〇〇〇〇〇〇└兼明果地修證〇〇〇〇〇〇〇└入門助行
正宗〇┤〇〇〇〇┌七趣業妄
〇〇〇└兼說分〇┤
〇〇〇〇〇〇〇〇└五陰禪魔`)
 .FO(3,6.5,10)
 .XFT(1,9,0,-0.75)          // 正宗
 .FO(8,5,8).XFT(5,7,0,-0.5) //   正說分
 .FO(12,3,7)                //     開示
 .FO(20,2,4)                //       開佛知見令悟	
 .FO(28,1,3)                //         正為內凡發心
 .FO(34,2,4,3)              //           悟心方便
 .FO(20,6,8)                //       示佛知見令入
 .FO(28,5,7)                //         正明因地修證
 .FO(34,6,8,3)              //           修入方便
 .FO(8,9,11)                //   兼說分
 .src = js;

})();
