createGP('摩西十誡', CAT_外道)
.setWidth(30)
.setStyle(AIL + BOLD)
.hasRightEdge()
.setTree(`
/b|摩西十誡/
〇不可有別的神〇〇除了我以外，你不可有別的神
〇不可製造偶像〇〇不可為自己雕刻偶像，也不可製造任何形象，不可跪拜事奉
〇不可妄稱神的名〇不可妄稱耶和華你的神的名
〇守安息日〇〇〇〇當記念安息日，守為聖日
〇孝敬父母〇〇〇〇當孝敬父母，使你的日子在神所賜的地上得以長久
〇不可殺人
〇不可姦淫
〇不可偷盜
〇不可作假見證〇〇不可作假見證陷害人
〇不可貪戀〇〇〇〇不可貪戀人的房屋、妻子、僕婢、牛驢，並他一切所有的`)
.T(20,1,'《出埃及記》20:2～17')
.src = 'lit-misc.js';

class My中華傳統文化典籍分類Content extends MyContent {
  constructor(gp) { super(gp); }
  setTexts() { // override
    this.先秦兩漢();
    this.漢代之後();
  }
  _OL(type, val) { this.setDialogOL(type, type, val); return this; }
  先秦兩漢() {
    this._OL('墨家', '墨子|魯勝墨辯注敘')
        ._OL('道家', '莊子|道德經|列子|鶡冠子|文子|文始真經|列仙傳|鬻子|老子河上公章句')
        ._OL('法家', '韓非子|商君書|申不害|慎子|諫逐客書|管子')
        ._OL('名家', '公孫龍子')
        ._OL('兵家', '孫子兵法|吳子|六韜|司馬法|尉繚子|三略')
        ._OL('算書', '海島算經|九章算術|孫子算經|周髀算經')
        ._OL('雜家', '淮南子|呂氏春秋|鬼谷子|尹文子|鄧析子')
        ._OL('經典文獻', '詩經|尚書|周易|周禮|楚辭|儀禮|山海經|焦氏易林|京氏易傳|詩說')
        ._OL('字書', '說文解字|爾雅|釋名|方言|急就篇')
        ._OL('醫學', '黃帝內經|難經|傷寒論|金匱要略')
        ._OL('出土文獻', '郭店|馬王堆')
        ._OL('儒家', '論語|孟子|禮記|荀子|孝經|說苑|春秋繁露|韓詩外傳|大戴禮記|白虎通德論|新書|新序|揚子法言|中論|孔子家語|潛夫論|論衡|太玄經|風俗通義|孔叢子|申鑒|忠經|素書|新語|獨斷|蔡中郎')
        ._OL('史書', '史記|春秋左傳|逸周書|國語|晏子春秋|吳越春秋|越絕書|戰國策|鹽鐵論|列女傳|春秋穀梁傳|春秋公羊傳|漢書|前漢紀|東觀漢記|後漢書|竹書紀年|穆天子傳|古三墳|燕丹子|西京雜記');
  }
  漢代之後() {
    this._OL('魏晉南北朝', '道德真經註|世說新語|顏氏家訓|文心雕龍|抱朴子|人物志|金樓子|水經注|神仙傳|三國志|高士傳|神異經|洞冥記')
        ._OL('隋唐', '群書治要|藝文類聚|通典|意林|黃帝陰符經')
        ._OL('宋明', '四書章句集注|三字經|論語注疏|西遊記|三國演義|金瓶梅|封神演義|廣韻|孝經注疏|太平御覽|太平廣記|朱子語類|宋景文公筆記|棋經|郁離子')
        ._OL('清代', '墨子閒詁|紅樓夢|全唐詩|康熙字典|儒林外史');
  }
}

createGP('中華傳統文化典籍類別', CAT_中華)
.setWidth(20)
.setStyle(AIL + BOLD)
.hasRightEdge()
.setTree( // In-line with ZhongGuo-ZheXueShu-DianZiHua-JiHua's
`/b2|中華傳統文化典籍類別//ail|（先秦至清）/
〇/b|先秦兩漢/
〇〇/b1|儒家/〰/see:儒家|26/
〇〇/b1|墨家/〰/see:墨家|2/
〇〇/b1|道家/〰/see:道家|9/
〇〇/b1|法家/〰/see:法家|6/
〇〇/b1|名家/〰/see:名家|1/
〇〇/b1|兵家/〰/see:兵家|6/
〇〇/b1|算書/〰/see:算書|4/
〇〇/b1|雜家/〰/see:雜家|5/
〇〇/b1|史書/〰/see:史書|21/
〇〇/b1|經典文獻/〰/see:經典文獻|10/
〇〇/b1|字書/〰/see:字書|5/
〇〇/b1|醫學/〰/see:醫學|4/
〇/b|魏晉南北朝/〰/see:魏晉南北朝|13/
〇/b|隋唐/〰/see:隋唐|5/
〇/b|宋明/〰/see:宋明|15/
〇/b|清代/〰/see:清代|5/`)
.run((gp) => {
  gp.src = 'lit-misc.js';
  new My中華傳統文化典籍分類Content(gp);
});

createGP('中華傳統文化典籍', CAT_中華)
.setWidth(26)
.setStyle(AIL + BOLD)
.hasRightEdge()
.setTree( // In-line with ZhongGuo-ZheXueShu-DianZiHua-JiHua's
`/b2|中華傳統文化典籍//ail|（先秦至清，《中國哲學書電子化計劃》已驗證者）/
〇/b|先秦兩漢/
〇〇/b1|儒家/
〇〇〇論語
〇〇〇孟子
〇〇〇禮記
〇〇〇荀子
〇〇〇孝經
〇〇〇說苑
〇〇〇春秋繁露
〇〇〇韓詩外傳
〇〇〇大戴禮記
〇〇〇白虎通德論
〇〇〇新書
〇〇〇新序
〇〇〇揚子法言
〇〇〇中論
〇〇〇孔子家語
〇〇〇潛夫論
〇〇〇論衡
〇〇〇太玄經
〇〇〇風俗通義
〇〇〇孔叢子
〇〇〇申鑒
〇〇〇忠經
〇〇〇素書
〇〇〇新語
〇〇〇獨斷
〇〇〇蔡中郎集
〇〇/b1|墨家/
〇〇〇墨子
〇〇〇魯勝墨辯注敘
〇〇/b1|道家/
〇〇〇莊子
〇〇〇道德經
〇〇〇列子
〇〇〇鶡冠子
〇〇〇文子
〇〇〇文始真經
〇〇〇列仙傳
〇〇〇鬻子
〇〇〇老子河上公章句
〇〇/b1|法家/
〇〇〇韓非子
〇〇〇商君書
〇〇〇申不害
〇〇〇慎子
〇〇〇諫逐客書
〇〇〇管子
〇〇/b1|名家/
〇〇〇公孫龍子
〇〇/b1|兵家/
〇〇〇孫子兵法
〇〇〇吳子
〇〇〇六韜
〇〇〇司馬法
〇〇〇尉繚子
〇〇〇三略
〇〇/b1|算書/
〇〇〇海島算經
〇〇〇九章算術
〇〇〇孫子算經
〇〇〇周髀算經
〇〇/b1|雜家/
〇〇〇淮南子
〇〇〇呂氏春秋
〇〇〇鬼谷子
〇〇〇尹文子
〇〇〇鄧析子
〇〇/b1|史書/
〇〇〇史記
〇〇〇春秋左傳
〇〇〇逸周書
〇〇〇國語
〇〇〇晏子春秋
〇〇〇吳越春秋
〇〇〇越絕書
〇〇〇戰國策
〇〇〇鹽鐵論
〇〇〇列女傳
〇〇〇春秋穀梁傳
〇〇〇春秋公羊傳
〇〇〇漢書
〇〇〇前漢紀
〇〇〇東觀漢記
〇〇〇後漢書
〇〇〇竹書紀年
〇〇〇穆天子傳
〇〇〇古三墳
〇〇〇燕丹子
〇〇〇西京雜記
〇〇/b1|經典文獻/
〇〇〇詩經
〇〇〇尚書
〇〇〇周易
〇〇〇周禮
〇〇〇楚辭
〇〇〇儀禮
〇〇〇山海經
〇〇〇焦氏易林
〇〇〇京氏易傳
〇〇〇詩說
〇〇/b1|字書/
〇〇〇說文解字
〇〇〇爾雅
〇〇〇釋名
〇〇〇方言
〇〇〇急就篇
〇〇/b1|醫學/
〇〇〇黃帝內經
〇〇〇難經
〇〇〇傷寒論
〇〇〇金匱要略
〇〇出土文獻
〇〇〇郭店
〇〇〇馬王堆
〇/b|魏晉南北朝/
〇〇道德真經註
〇〇世說新語
〇〇顏氏家訓
〇〇文心雕龍
〇〇抱朴子
〇〇人物志
〇〇金樓子
〇〇水經注
〇〇神仙傳
〇〇三國志
〇〇高士傳
〇〇神異經
〇〇洞冥記
〇/b|隋唐/
〇〇群書治要
〇〇藝文類聚
〇〇通典
〇〇意林
〇〇黃帝陰符經
〇/b|宋明/
〇〇四書章句集注
〇〇三字經
〇〇論語注疏
〇〇西遊記
〇〇三國演義
〇〇金瓶梅
〇〇封神演義
〇〇廣韻
〇〇孝經注疏
〇〇太平御覽
〇〇太平廣記
〇〇朱子語類
〇〇宋景文公筆記
〇〇棋經
〇〇郁離子
〇/b|清代/
〇〇墨子閒詁
〇〇紅樓夢
〇〇全唐詩
〇〇康熙字典
〇〇儒林外史`)
.src = 'lit-misc.js';
