class My心地觀經Content extends MyContent {
  constructor(gp) { super(gp); }
  setTexts() {
    this.第一品();
    this.第二品();
    this.第四品();
    this.第五品();
    this.第六品();
    this.第八品();
    this.第十品();
    this.第十二品();
    this.第十三品();
  }
  第一品() {
    this.setDialogOL('與會大眾', '與會大眾',
'阿羅漢大比丘眾三萬二千人|菩薩摩訶薩八萬四千人|億萬六欲天子|恒河沙色界天子|四萬八千諸大龍王|五萬八千諸藥叉神|八萬九千乾闥婆王|千億阿修羅王|五億迦樓羅王|九億緊那羅王|九萬八千摩睺羅伽王|他方萬億國土轉輪聖王|十六諸大國王|十六大國王夫人|百千無央數人|無數諸外道|無量無數非人餓鬼|無量無數禽獸諸王|百千琰魔羅王及其眷屬');
    this.setNamedText('光明普照',
`<h3>世尊放大光明</h3>
影現菩薩修行佛道種種相貌，釋迦菩薩於往昔時作光明王，最初發於阿耨多羅三藐三菩提心，<br>
乃至菩提樹下得成佛道，娑羅林中入於涅槃，所有一切慈悲喜捨，八萬四千波羅蜜門，<br>
乃於過去作金輪王王四天下，人民熾盛國土豐樂，正法化世經無量劫，一切珍寶充滿國界。<br>
捨輪王位出家學道。或於大國為王愛子，棄捨身命投於餓虎；或作尸毘王割身救鴿；<br>
或救孕鹿捨鹿王身；或於雪山為求半偈而捨全身；或現受生於淨飯王家，棄捨後宮六萬婇女，<br>
及捨種種上妙伎樂，踰城出家，六年苦行，日食麻麥，降諸外道，坐菩提樹下破魔軍已，<br>
得阿耨多羅三藐三菩提。有如是等百千恒沙難思行願一切相貌，悉皆頓現於此金色大光明中。<br>
十方界三世諸佛，及大菩薩道場眾會，神通變化希有之事，及諸如來所說妙法，皆如響應，<br>
於此金色大光明中無不見聞。一切眾生遇此光明、見彼瑞相，皆發無等等阿耨多羅三藐三菩提心。`);
  }
  第二品() {
    this.setDialogOL('三寶十義', '三寶十義',
'堅牢，如摩尼寶無人能破，佛法僧寶亦復如是，外道天魔不能破故|無垢，世間勝寶清淨光潔不雜塵穢，佛法僧寶亦復如是，悉能遠離煩惱塵垢|與樂，如天德瓶能與安樂，佛法僧寶亦復如是，能與眾生世出世樂|難遇，如吉祥寶希有難得，佛法僧寶亦復如是，業障有情億劫難遇|能破，如如意寶能破貧窮，佛法僧寶亦復如是，能破世間諸貧苦故|威德，如轉輪王所有輪寶能伏諸怨，佛法僧寶亦復如是，具六神通降伏四魔|滿願，如摩尼珠隨心所求能雨眾寶，佛法僧寶亦復如是，能滿眾生所修善願|莊嚴，如世珍寶莊嚴王宮，佛法僧寶亦復如是，莊嚴法王菩提寶宮|最妙，如天妙寶最為微妙，佛法僧寶亦復如是，超諸世間最勝妙寶|不變，譬如真金入火不變，佛法僧寶亦復如是，世間八風不能傾動');
    this.setNamedText('十地滿心',
`出三界，淨妙國土坐無量大寶蓮，不可說海會菩薩前後圍遶，無垢繒繫於頂上，<br>供養恭敬尊重讚歎，名為後報利益。<br>
菩薩入金剛定，斷除一切微細所知諸煩惱障，證得阿耨多羅三藐三菩提，如是妙果名現報利益。`);
    this.setDialogOL('四智圓滿', '佛陀四智圓滿',
'大圓鏡智，轉異熟識得此智慧，如大圓鏡現諸色像|平等性智，轉我見識得此智慧，是以能證自佗平等二無我性，如是名為平等性智|妙觀察智，轉分別識得此智慧，能觀諸法自相共相，於眾會前說諸妙法，能令眾生得不退轉，以是名為妙觀察智|成所作智，轉五種識得此智慧，能現一切種種化身，令諸眾生成熟善業，以是因緣，名為成所作智');
    this.setDialogOL('六種微妙功德', '佛陀六種微妙功德',
'無上大功德田|無上有大恩德|無足二足及以多足眾生中尊|極難值遇如優曇華|獨一出現三千大千世界|世出世間功德圓滿一切義依');
  }
  第四品() {
    this.setDialogOL('出家菩薩應常作是觀', '出家菩薩應常作是觀',
'我得人身諸根具足，從何處沒來生此間？|我於三界中當生何界？|於四大洲復生何處？|六道之中受生何道？|以何因緣得離父母妻子眷屬，出家修道免八難身？|莊嚴劫中過去千佛皆已涅槃，星宿劫中未來千佛未出於世，賢劫之中現在千佛，<br>幾佛如來出現於世，化緣將盡入般涅槃？|幾佛世尊未出於世？|是諸眾生根緣未熟未聞正法，復於何時當來彌勒，從兜率天下生人間現成佛道？|於我身中有何善業？|戒定慧學當有何德？|過去諸佛皆已不遇，當來世尊得見不邪？|我今現在諸凡夫地，三業煩惱何最為重？|一生已來造何罪業？|於何佛所曾種善根？|我此身命能得幾時？|是日已過命隨減少，猶如牽羊詣彼屠所，漸漸近死無所逃避，身壞命終生於何處？|三惡道苦如何脫免？|然我此身愛樂長養，念念衰老無時暫停，誰有智者愛樂此身？');
    this.setDialogOL('袈裟十勝利', '出家菩薩袈裟十勝利',
'能覆其身遠離羞恥，具足慚愧修行善法|遠離寒熱及以蚊虻惡獸毒蟲，安隱修道|示現沙門出家相貌，見者歡喜遠離邪心|袈裟即是人天寶幢之相，尊重敬禮得生梵天|著袈裟時生寶塔想，能滅眾罪生諸福德|本制袈裟染令壞色，離五欲想不生貪愛|袈裟是佛淨衣，永斷煩惱作良田故|身著袈裟罪業消除，十善業道念念增長|袈裟猶如良田，能善增長菩薩道故|袈裟猶如甲冑，煩惱毒箭不能害故');
    this.setDialogOL('乞食十勝利', '出家菩薩乞食十勝利',
'常行乞食以自活命，出入自由不屬佗故|行乞食時，先說妙法令起善心，然後自食|為不施人發大悲心，為說正法令起捨心而生勝福|依佛教行增長戒品，福德圓滿智慧無窮|常行乞食，於七九慢自然消滅，眾所恭敬是良福田|於乞食時，當得如來無見頂相，應受世間廣大供養|汝等佛子隨學此法，住持三寶饒益有情|於乞食時，不得為求食故，起希望心讚歎一切男子女人|行乞食時須依次第，不應分別貧富之家|常行乞食諸佛歡喜，得一切智最為良緣');
    this.setDialogOL('服棄藥十勝利', '出家菩薩服棄藥十勝利',
'為求藥草不近佗人，永息貪求安住正念|不淨觀門易得成就，出世之心能得堅固|於諸珍味恒不貪著，速證正智餐禪悅食|於諸世間一切財物，常能知足早得解脫|不近世間一切凡夫，親近出世清淨善友|由不嫌惡諸棄藥等，於麤飲食亦得解脫|於所重藥永不希望，一切世間無不尊故|速能調伏諸煩惱病，證得如來常住法身|永斷三界一切煩惱，能療眾生身心重病|能順佛教修菩薩行，福智圓滿得大菩提');
    this.setDialogOL('住阿蘭若十德勝', '出家菩薩住阿蘭若十德勝',
'為得自在住阿蘭若，四威儀中不屬佗故|離我我所名阿蘭若，於樹下時無執著故|於臥具等無所愛著，由斯當臥四無畏床|阿蘭若處三毒微薄，離貪瞋癡所緣境故|樂阿蘭若修遠離行，不求人天五欲樂故|能捨喧鬧住閑寂處，修習佛道不惜軀命|愛樂寂靜離世言詞，弃捨凡愚無散亂故|世出世間一切事業易得成就，無障礙故|阿蘭若處是三昧室，能得百千大三昧故|清淨如空以為舍宅，心無障礙得大智故');
  }
  第五品() {
    this.setDialogOL('阿蘭若行', '菩薩阿蘭若行',
'或有菩薩，未得圓滿四無量心，終不捨離阿蘭若處|或有菩薩，未得圓滿五通神力，終不捨離阿蘭若處|或有菩薩，未得圓滿六波羅蜜，終不捨離阿蘭若處|或有菩薩，未得圓滿善巧方便，終不捨離阿蘭若處|或有菩薩，未能調伏一切有情，終不捨離阿蘭若處|或有菩薩，未得圓滿四種攝法，終不捨離阿蘭若處|或有菩薩，未能修習六念之法，終不捨離阿蘭若處|或有菩薩，未能成就多聞智慧，終不捨離阿蘭若處|或有菩薩，未能成就堅固信力，終不捨離阿蘭若處|或有菩薩，未能斷除六十二見，終不捨離阿蘭若處|或有菩薩，未能修習八種正道，終不捨離阿蘭若處|或有菩薩，未能永斷二障習氣，終不捨離阿蘭若處|或有菩薩，未能圓滿隨病與藥微妙智慧，終不捨離阿蘭若處|或有菩薩，未能圓滿大菩提心，終不捨離阿蘭若處|或有菩薩，未能圓滿恒沙三昧，終不捨離阿蘭若處|或有菩薩，未能成就無量神通，終不捨離阿蘭若處|或有菩薩，以定通力見十八空而心不驚，如是大事若未成就，終不捨離阿蘭若處|或有菩薩，未能圓滿一切智智，終不捨離阿蘭若處|或有菩薩，未得圓滿一切種智，終不捨離阿蘭若處|或有菩薩，未得修習三十七種菩提分法，終不捨離阿蘭若處|或有菩薩，未得圓滿十地萬行，終不捨離阿蘭若處|或有菩薩，於百劫中未能修行相好之業，終不捨離阿蘭若處|或有菩薩，未得圓滿如來四智，終不捨離阿蘭若處|或有菩薩，未能圓滿證大涅槃，終不捨離阿蘭若處|或有菩薩，坐金剛座未能證得阿耨多羅三藐三菩提，常坐不起');
  }
  第六品() {
    this.setDialogOL('世間多諸恐怖', '一切世間多諸恐怖',
'或有菩薩，以貪多財而為恐怖。|或有菩薩，以渴愛心而為恐怖，於諸未得一切財寶，日夜追求生渴愛故。|或有菩薩，我我所見而為恐怖，為諸煩惱作依止故。|或有菩薩，以諸法見而為恐怖，與所知障作依止故。|或有菩薩，六十二見而為恐怖，入邪見林難出離故。|或有菩薩，疑為恐怖，於真正法生疑惑故。|或有菩薩，以彼斷見而為恐怖，執無後世撥無因果，生大邪見入地獄故。|或有菩薩，以彼常見而為恐怖，執五趣身恒常決定，隨善惡業無變易故。|或有菩薩，以彼嫉妬而為恐怖，不耐佗榮懷惡心故。|或有菩薩，常以掉舉而為恐怖，心不寂靜生散亂故。|或有菩薩，以不信心而為恐怖，如人無手雖至寶山終無所得，<br>無信手者雖遇三寶無所得故。|或有菩薩，以彼無慚而為恐怖，內無羞恥常造諸惡，業障無明難見佛故。|或有菩薩，以無愧心而為恐怖，外無羞恥棄恩背德，生死輪迴墮三塗故。|或有菩薩，以忿恨等而為恐怖，能損自佗互為怨結，於多劫中障佛道故。|或有菩薩，以彼忘失而為恐怖，於所聞法不能憶持，忘失文義增愚癡故。|或有菩薩，乃至一切不善黑業而為恐怖。何以故？一切不善是生死因，<br>輪轉三界不得出離，於是無量無邊恐怖，皆能障礙出世勝法。|或有菩薩，以五種蓋而為恐怖，五種煩惱覆蓋菩薩菩提心故。|或有菩薩，以憎惡心而為恐怖，於諸眾生無憐愍心，修菩提行多退轉故。|或有菩薩，以破戒垢而為恐怖，污穢聖法難得果故。|或有菩薩，以彼憂惱而為恐怖，妄想熾然失善業故。|或有菩薩，以惡作心而為恐怖，於所修善生追悔故。|或有菩薩，而說狂醉是為恐怖，不識善惡無尊卑故。|或有菩薩，以非時死而為恐怖，不住正念歸無常故。|或有菩薩，以妄語業而為恐怖，生生世世所有言說，一切眾生不信受故。|或有菩薩，以四顛倒而為恐怖，由四顛倒輪迴生死，起煩惱業不求佛故。|或有菩薩，而說惡友是為恐怖，隨不善友造惡業故。|或有菩薩，以五蘊魔而為恐怖，是五蘊身從煩惱生，生已即起無量煩惱，<br>因諸煩惱造不善業，由諸惑業墮大深坑，以是因緣而生恐怖。|或有菩薩，以煩惱魔而為恐怖，大小煩惱能續生死，退菩提心墮惡道故。|或有菩薩，厭患死魔而為恐怖，發菩提心未得不退，身壞命終生退轉故。|或有菩薩，以諸天魔而為恐怖，天魔眷屬充滿欲界，障修道人退菩提故。|或有菩薩，以無記心而為恐怖，於諸善法不能進修，空過長時退善業故。|或有菩薩，以彼八難而為恐怖，墮八難者從冥入冥，生死長夜難遇明故。|或有菩薩，觀彼地獄而為恐怖，一墮地獄經無量劫，受大苦惱，難解脫故。|或有菩薩，觀畜生道而為恐怖，傍生界中受愚癡報，經無量劫難出離故。|或有菩薩，觀餓鬼道而為恐怖，於恒沙劫受飢渴苦，難可值遇佛法僧故。|或有菩薩，想欲界生而為恐怖，煩惱雜起造諸惡業墮三塗故。|或有菩薩，以彼色界而為恐怖，有覆煩惱能障定故。|或有菩薩，以無色界而為恐怖，三界之中最為寂靜猶如涅槃，有情妄執而為究竟，<br>劫盡命終墮地獄故。|或有菩薩，數數生死而為恐怖，生邪見家難出離故。|或有菩薩，厭離生死而為恐怖，死此生彼常受苦惱，障菩薩行求涅槃故。|或有菩薩，以世間語是為恐怖，心常散亂妨善業故。|或有菩薩，以心意識而為恐怖，所緣行相不可知故。');
    this.setDialogOL('恐怖皆我自生', '一切恐怖皆我自生',
'一切恐怖皆從我生|一切恐怖著我生故|一切恐怖我為根本故|一切恐怖我愛生故|一切恐怖我想生故|一切恐怖我見生故|一切恐怖我為住處|一切恐怖因我生故|一切恐怖分別生故|一切恐怖煩惱生故|一切煩惱我愛生故');
    this.setDialogOL('如是人等應住阿蘭若處', '如是人等應住阿蘭若處',
'於諸煩惱得解脫者，應當安住阿蘭若處|若得成就涅槃因者，應當安住阿蘭若處|能善修行四無垢性，應當安住阿蘭若處|若有少欲能知足者，應當安住阿蘭若處|具足多聞有智慧者，應當安住阿蘭若處|若能修行三解脫者，應當安住阿蘭若處|永斷能縛煩惱結者，應當安住阿蘭若處|能審觀察十二因緣，應當安住阿蘭若處|所作已辦者，應當安住阿蘭若處|捨諸重擔者，應當安住阿蘭若處|證悟真如深妙理者，應當安住阿蘭若處');
    this.setDialogOL('住阿蘭若者如是觀', '住阿蘭若者如是觀',
'是阿蘭若，善能修習四無垢性安樂之處|是阿蘭若，善能修習知足之處|是阿蘭若，於諸煩惱得解脫處|是阿蘭若，具足多聞智慧之處|是阿蘭若，伏斷煩惱所知障處|是阿蘭若，能入三種解脫門處|是阿蘭若，善能證得八解脫處|是阿蘭若，善能觀察十二緣處|是阿蘭若，善能斷除業障之處|是阿蘭若，能得初果預流之處|是阿蘭若，能得第二一來果處|是阿蘭若，能得第三不還果處|是阿蘭若，得第四果阿羅漢處|是阿蘭若，證得辟支佛果之處|是阿蘭若，已辦所作得自在處|是阿蘭若，捨諸重擔得輕安處|是阿蘭若，證得二空真如之處|是阿蘭若，能修證無量大慈心處|是阿蘭若，修證無量大悲心處|是阿蘭若，能善修習喜無量處|是阿蘭若，善能修習捨無量處|是阿蘭若，能發菩提心處|是阿蘭若，菩薩修持到十信處|是阿蘭若，復次進修到十住處|是阿蘭若，展轉增修到十行處|是阿蘭若，展轉修行十迴向處|是阿蘭若，善能修習四善根處|是阿蘭若，修行六度波羅蜜處|是阿蘭若，修行初地至十地處|是阿蘭若，證得六根清淨之處|是阿蘭若，善能證得天眼通處|是阿蘭若，得天耳通及宿住智、生死智明、神境、他心如是通處|是阿蘭若，有慚愧處|是阿蘭若，不放逸處|是阿蘭若，修五根處|是阿蘭若，證得無量無邊三昧之處|是阿蘭若，能得恒沙陀羅尼門證自在處|是阿蘭若，悟無生忍|是阿蘭若，永出三界斷生死處|是阿蘭若，得不退轉|是阿蘭若，降伏一切眾魔怨敵，銷除業障見佛聞法，如是之處|是阿蘭若，得佛不共最上法門|是阿蘭若，修習戒蘊清淨之處|是阿蘭若，出生無漏三摩地處|是阿蘭若，能生般若證解脫處|是阿蘭若，能生解脫知見之處|是阿蘭若，得三十七菩提分法|是阿蘭若，善能修攝十二頭陀|是阿蘭若，智能分別諦理住處|是阿蘭若，永離有漏五蘊生處|是阿蘭若，能得解脫十二入處|是阿蘭若，永離有漏十八界處|是阿蘭若，微妙觀察十八空處|是阿蘭若，容受一切諸法空處|是阿蘭若，增長十善法生之處|是阿蘭若，增長堅固菩提心處|是阿蘭若，三世諸佛讚歎之處|是阿蘭若，一切菩薩恭敬讚歎如是之處|是阿蘭若，毘婆尸佛於尼俱陀樹下成道|是阿蘭若，尸棄如來於尸利沙樹下成道|是阿蘭若，毘舍如來阿尸婆多樹下成道|是阿蘭若，俱留孫佛無憂樹下成等正覺|是阿蘭若，俱那含牟尼如來優曇樹下成等正覺|是阿蘭若，迦葉如來婆陀樹下成等正覺|是阿蘭若，釋迦如來於畢鉢羅樹下成道之處');
    this.setDialogOL('第一不淨觀相', '第一不淨觀相',
'出家菩薩於日夜中又觀自身，臭穢不淨猶如死狗。彼身亦是父母不淨為生緣故。|出家菩薩又觀自身，五蘊之身如蟻子臺安住眾蟻。<br>時，有白象來至臺邊，以身觸臺臺即崩碎。|出家菩薩又觀自身，而作是念：『我今此身從頂至足，皮肉骨髓共相和合以成其身，<br>猶如芭蕉中無實故。』|出家菩薩又觀自身，無有強力，皮肉薄覆如塗附牆，億萬毛髮如草生地，<br>微細風大出入毛孔，誰有智者當樂此身？剎那剎那衰敗轉故。|出家菩薩又觀自身，如養毒蛇而取其害。我今雖以飲食衣服資長是身，而不識恩，<br>畢竟還令墮於惡道。|出家菩薩又觀自身，譬如怨家詐作親友伺求其便，而將毒藥斷彼命根。<br>我身如是本非真實，終致無常非聖愛故。|出家菩薩又觀自身，如水上泡，雖復妙好瑠璃珠色，剎那因緣起滅無恒，<br>有為念念不久住故。|出家菩薩又觀自身，如乾闥婆城雖現相狀而不實有，今者我身亦復如是。|出家菩薩又觀自身，猶如影像，我身亦爾雖有非真。|出家菩薩又觀自身，譬如外國強盛怨敵，今者我身亦復如是，煩惱怨敵侵掠善根。|出家菩薩又觀自身，如朽舍宅雖加修葺當必崩壞，我身亦爾，雖加愛念當必無常。|出家菩薩又觀自身，如近怨國城邑人民常懷恐怖，今者我身亦復如是，<br>於念念中畏無常怨。|出家菩薩又觀自身，如無量薪為火燒爇，然是猛火曾無厭足，我身亦爾，<br>以貪愛火燒五欲薪，其心增長亦復如是。|出家菩薩又觀自身，如新生子慈母憐愍恒加守護，我身亦爾，若不守護病之身心，<br>即便不能有所修證。|出家菩薩又觀自身，本性不淨，譬如有人厭患炭色，設諸方便以水洗之，<br>經無量時黑色仍舊，乃至炭盡終無所益，我身亦爾，有漏不淨，<br>假使海水盡未來際洗之無益，亦復如是。|出家菩薩又觀自身，如油沃薪以火焚燒，又遇大風勢不可止，是身亦爾，名五蘊薪，<br>沃貪愛油縱瞋恚火，愚癡風力無有休息。|出家菩薩觀於自身猶如惡疾，四百四病所住處故。|亦如大腸，八萬四千蟲所住故。|是無常處，出息不還即無常故。|亦如非情，神識易脫同瓦石故。|亦如河水，剎那前後不暫住故。|亦如壓油，於一切事受勞苦故。|無所依者，猶如嬰兒失父母故。|無救護者，猶如蝦蟆蛇所吞故。|如穴無底，心心所法不可知故。|恒不知足，於五欲樂心無厭故。|恒不自在，斷常二見所繫縛故。|不生慚愧，雖蒙養育棄捨主故。|亦如死屍，於日夜分近滅壞故。|唯受諸苦，於一切處無真樂故。|為苦所依，一切眾苦依身住故。|如空聚落，於是身中無主宰故。|畢竟空寂，遍計所執妄搆畫故。|如谷中響，皆是虛妄所顯現故。|亦如船舶，若無船師即漂沒故。|亦如大車運載財寶。何以故？乘於大乘到菩提故。|出家菩薩日夜觀察，非不愛惜如是之身，欲令眾生出生死海到彼岸故。');
  }
  第八品() {
    this.setNamedText('三種十波羅蜜多',
`<h3>出家菩薩成就三種十波羅蜜多</h3>
<ol>
<li>成就<u>布施波羅蜜多</u><br>
　入於聚落所乞之食，先以少分施於眾生，又以餘分施他，得<u>檀波羅蜜</u><br>
　以自身命供養三寶，頭目髓腦施來求者，得<u>親近波羅蜜</u><br>
　為求法者說出世法，令發無上菩提心故，得<u>真實波羅蜜</u></li>
<li>成就<u>持戒波羅蜜多</u><br>
　修十二頭陀之行，若行步時看二肘地不損眾生，得<u>持戒波羅蜜</u><br>
　堅持禁戒不惜軀命，得<u>親近波羅蜜</u><br>
　為求出世說法教化，令發無上菩提之心，得<u>真實波羅蜜</u></li>
<li>成就<u>忍辱波羅蜜多</u><br>
　能滅瞋恚得慈心三昧，亦無毀辱一切眾生，得<u>忍辱波羅蜜</u><br>
　若為一人說一句法，令發阿耨多羅三藐三菩提心，得<u>真實波羅蜜</u></li>
<li>成就<u>精進波羅蜜多</u><br>
　不貪安樂不造眾罪，歡喜苦行，翹敬宗仰常無休息，得<u>精進波羅蜜</u><br>
　棄捨身命如捐涕唾，一切時中未嘗懈怠，得<u>親近波羅蜜</u><br>
　遇有緣者說最上道，令趣無上正等菩提，得<u>真實波羅蜜</u></li>
<li>成就<u>禪定波羅蜜多</u><br>
　為攝善法令不散失，入諸解脫永斷邊見，現於神通化彼眾生令得正智，斷煩惱本入真法界，<br>
　　悟如實道當趣菩提，得<u>禪定波羅蜜</u><br>
　欲令眾生如我無異悉得滿足，調伏有情不捨三昧，不惜身命修此三昧，得<u>親近波羅蜜</u><br>
　為諸眾生說深妙法，皆令趣向無上菩提，得<u>真實波羅蜜</u></li>
<li>成就<u>般若波羅蜜多</u><br>
　於空閑時，親近供養諸佛菩薩一切智者，常樂聽聞甚深妙法，心生渴仰恒無厭足，<br>
　　善能分別二諦真理，斷除二障、通達五明，說諸法要能決眾疑，得<u>般若波羅蜜</u><br>
　為求半偈棄捨身命，不憚眾苦志求菩提，得<u>親近波羅蜜</u><br>
　於大會中為人說法，於深妙義無所祕惜，能令發起大菩提心，於菩薩行得不退轉，<br>
　　常能觀察我身、蘭若，及菩提心、真實法身，如是四種無有差別，如是如是觀妙理故，<br>
　　得<u>真實波羅蜜</u></li>
<li>成就方便<u>善巧波羅蜜多</u><br>
　於大會中為人說法，於深妙義無所祕惜，能令發起大菩提心，於菩薩行得不退轉，<br>
　　常能觀察我身、蘭若，及菩提心、真實法身，如是四種無有差別，如是觀妙理故，<br>
　　得<u>真實波羅蜜</u></li>
<li>成就方便<u>善巧波羅蜜多</u><br>
　住空閑處，以佗心智能了有情意樂煩惱心行差別，應病與藥悉令除差，自在遊戲神通三昧，<br>
　　發大悲願成熟眾生，諸佛之法無不通達，得<u>方便善巧波羅蜜多</u><br>
　為欲饒益諸眾生故，於身命財都不固惜，得<u>親近波羅蜜多</u><br>
　為諸眾生怨親平等，說微妙法令入佛智，得<u>真實波羅蜜多</u></li>
<li>成<u>就願波羅蜜多</u><br>
　入於山林，心恒觀察諸法真性，非有非空中道妙理，於世俗事悉能辨了，為化有情恒修慈悲，<br>
　　得<u>願波羅蜜</u><br>
　以四弘願攝受眾生，乃至捨身不壞悲願，得<u>親近波羅蜜</u><br>
　說微妙法辯才無礙，若有聽聞畢竟不退，得<u>真實波羅蜜</u></li>
<li>成<u>就力波羅蜜多</u><br>
　以正智力善了有情心行黑白，能為眾生說相應法，令入大乘甚深妙義，即能安住究竟涅槃，<br>
　　得<u>力波羅蜜</u><br>
　以正智眼照見五蘊空寂之理，能捨身命利眾生故，得<u>親近波羅蜜</u><br>
　以妙智力化邪見眾，令斷輪迴生死惡業，趣向常樂究竟涅槃，得<u>真實波羅蜜</u></li>
<li>成<u>就智波羅蜜多</u><br>
　於一切法了知善惡，遠離邪見攝受正法，不厭生死不樂涅槃，得<u>智波羅蜜</u><br>
　不愛自身憐愍眾生，於身命財恒修大捨，得<u>親近波羅蜜</u><br>
　以微妙智為諸眾生說一乘法，令入阿耨多羅三藐三菩提，得<u>真實波羅蜜</u></li>
</ol>
由精進心，如是十行，過去不退、現在堅固、未來速滿。`);
  }
  第十品() {
    this.setDialogOL('薄伽梵', '薄伽梵之德',
'妙善成就一切如來最勝住持平等性智種種希有微妙功德|已能善獲一切諸佛決定勝法大乘智印|已善圓證一切如來金剛祕密殊勝妙智|已能安住無礙大悲，自然救攝十方有情|已善圓滿妙觀察智，不觀而觀、不說而說|已能善獲一切如來灌頂寶冠超過三界|已得圓滿陀羅尼自在|已善圓證三摩地自在|妙善成就一切智智、一切種智|能作有情種種差別');
    this.setDialogOL('心地法之德', '心地法之德',
'名為一切凡十方如來最勝祕密心地法門|名為一切凡夫入如來地頓悟法門|名為一切菩薩趣大菩提真實正路|名為三世諸佛自受法樂微妙寶宮|名為一切饒益有情無盡寶藏|能引諸菩薩眾到色究竟自在智處|能引詣菩提樹後身菩薩真實導師|能雨世出世財，如摩尼寶滿眾生願|能生十方三世一切諸佛功德本源|能銷一切眾生諸惡業果|能與一切眾生所求願印|能度一切眾生生死險難|能息一切眾生苦海波浪|能救苦惱眾生而作急難|能竭一切眾生老病死海|善能出生諸佛因緣種子|能與生死長夜為大智炬|能破四魔兵眾而作甲冑|即是正勇猛軍戰勝旌旗|即是一切諸佛無上法輪|即是最勝法幢、擊大法鼓、吹大法螺、大師子王、大師子吼|猶如國大聖王善能正治，若順王化獲大安樂，若違王化尋被誅滅');
    this.setDialogOL('心心所法本性空寂', '心、心所法本性空寂',
'心如幻法，由遍計生，種種心想，受苦樂故|心如流水，念念生滅，於前後世不暫住故|心如大風，一剎那間歷方所故|心如燈焰，眾緣和合而得生故|心如電光，須臾之頃不久住故|心如虛空，客塵煩惱所覆障故|心如猿猴，遊五欲樹不暫住故|心如畫師，能畫世間種種色故|心如僮僕，為諸煩惱所策役故|心如獨行，無第二故|心如國王，起種種事得自在故|心如怨家，能令自身受大苦故|心如埃塵，坌污自身生雜穢故|心如影像，於無常法執為常故|心如幻夢，於無我法執為我故|心如夜叉，能噉種種功德法故|心如青蠅，好穢惡故|心如殺者，能害身故|心如敵對，常伺過故|心如盜賊，竊功德故|心如大鼓，起鬪戰故|心如飛蛾，愛燈色故|心如野鹿，逐假聲故|心如群豬，樂雜穢故|心如眾蜂，集蜜味故|心如醉象，耽牝觸故');
  }
  第十二品() {
    this.setDialogOL('三十二大金剛甲', '菩薩三十二種大金剛甲',
'於無量劫為眾生故不厭生死受苦大甲|誓度無量有情乃至螻蟻不捨大甲|覺悟眾生生死長夢安置三種祕密大甲|擁護佛法於一切時猶如響應護法大甲|永滅能起有無二見一切煩惱金剛大甲|頭目髓腦妻子珍寶有來求者能捨大甲|家中所受一切樂具永不貪著能施大甲|能持菩薩三聚淨戒終不捨離頭陀大甲|著忍辱衣遇諸違緣毀罵鞭打不報大甲|教化所有一切緣覺聲聞令趣一乘迴心大甲|譬如大風晝夜不歇度諸有情精進大甲|身心寂靜口無過犯修行解脫三昧大甲|生死涅槃無有二見饒益眾生平等大甲|無緣大慈利益群品恒無厭捨與樂大甲|無礙大悲救攝一切無有限量拔苦大甲|於諸眾生無有怨結恒作饒益大喜大甲|雖行苦行不憚劬勞恒無退轉大捨大甲|有苦眾生來菩薩所代彼受苦不厭大甲|如觀掌中阿摩勒果如是能見解脫大甲|見五蘊身如旃陀羅損害善事無著大甲|見十二入如空聚落常懷恐怖厭捨大甲|見十八界猶如幻化無有真實大智大甲|見一切法同於法界不見眾相證真大甲|掩佗人惡不藏己過厭離三界出世大甲|如大醫王應病與藥菩薩隨宜演化大甲|見彼三乘體本不異究竟迴心歸一大甲|紹三寶種使不斷絕轉妙法輪度人大甲|佛於眾生有大恩德為報佛恩修道大甲|觀一切法本性空寂不生不滅無垢大甲|悟無生忍得陀羅尼樂說辯才無礙大甲|廣化有情坐菩提樹令證佛果一味大甲|一剎那心般若相應悟三世法無餘大甲');
  }
  第十三品() {
    this.setDialogOL('十種身語意業清淨', '具足受持讀習廣為人說，得十種身業、語業、意業清淨',
'身不受苦　　出微妙語　　不生瞋恚|目睛不露　　出柔軟語　　不懷結恨|手不掉動　　出吉祥語　　不生慳心|足無伸縮　　出樂聞語　　不生妬心|便溺不遺　　出隨順語　　不說過惡|體不汗流　　出利益語　　不生怨心|不外捫摸　　出威德語　　無顛倒心|手拳舒展　　不背眷屬　　不貪眾物|顏容不故　　人天敬愛　　遠離七慢|轉側自如　　讚佛所說　　樂欲證得一切佛法圓滿三昧');
  }

} // end of My心地觀經Content.

createGP('本生心地觀經要旨', CAT_經論) // 9029
.setStyle(AIL + BOLD)
.set('width', 50)
.hasRightEdge()
.run((gp) => { new My心地觀經Content(gp); })
.setTree(`
/b|《大乘本生心地觀經》/
〇/b|序品第一/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第一/
〇〇佛住王舍城耆闍崛山
〇〇〇/see:與會大眾|無量眾生與會/
〇〇〇世尊坐寶蓮華師子座
〇〇〇〇入有頂天極善三昧名心瓔珞寶莊嚴王；出而復入師子奮迅三昧，現大神通，三千大千世界六種震動，
!!〇〇〇〇/ail|令三千界無有地獄、餓鬼、畜生，及餘無暇惡趣眾生皆得離苦，捨此身已，得生人天/
〇〇〇〇於胸臆間及諸毛孔放大光明，/see:光明普照|普照三千大千世界及餘他界/
〇〇〇師子吼菩薩摩訶薩，欲重宣此義，而說偈言，啟請世尊為諸眾生轉大法輪
〇/b|報恩品第二/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二/
〇〇佛陀欲轉大法輪，傳授菩提正道心地法門，令成阿耨多羅三藐三菩提
〇〇四種世出世恩
〇〇〇父母恩
〇〇〇眾生恩
〇〇〇國王恩
〇〇〇三寶恩
〇〇〇〇一佛寶
〇〇〇〇〇具三種身
〇〇〇〇〇〇自性身：有大斷德，二空所顯，一切諸佛悉皆平等〇/ail|無始無終，離一切相絕諸戲論，周圓無際凝然常住/
〇〇〇〇〇〇受用身：有大智德，真常無漏，一切諸佛悉皆同意
〇〇〇〇〇〇〇自受用相
〇〇〇〇〇〇〇〇/see:十地滿心|十地滿心/
〇〇〇〇〇〇〇〇有始無終，壽命無量，初成正覺窮未來際，諸根相好徧周法界，/see:四智圓滿|四智圓滿/
〇〇〇〇〇〇〇〇〇如是四智而為上首，具足八萬四千智門
〇〇〇〇〇〇〇〇如是一切諸功德法，名為如來自受用身
〇〇〇〇〇〇〇佗受用相：無量化身，教化、利益、安樂無量眾生，上達十地菩薩、下至二乘、人天
〇〇〇〇〇〇變化身：有大恩德，定通變現，一切諸佛悉皆同事
〇〇〇〇〇具足/see:六種微妙功德|六種微妙功德/，常能利樂一切眾生，是名佛寶不思議恩
〇〇〇〇一法寶中有無量義
〇〇〇〇〇教法：聲、名、句、文名為教法
〇〇〇〇〇理法：有無諸法名為理法
〇〇〇〇〇行法：戒、定、慧行名為行法
〇〇〇〇〇果法：為無為果名為果法
〇〇〇〇世出世間
〇〇〇〇〇有三種僧
〇〇〇〇〇〇菩薩僧
〇〇〇〇〇〇聲聞僧
〇〇〇〇〇〇凡夫僧：若有成就別解脫戒真善凡夫，乃至具足一切正見，能為他演說開示聖道法者
〇〇〇〇〇復有一類名福田僧：雖毀禁戒不壞正見者
〇〇〇〇佛法僧所以得名為寶者，/see:三寶十義|具足十義/
〇〇〇〇如何修行以報四恩
〇〇〇〇〇為求菩提，有其三種十波羅蜜〇（見《波羅蜜多品》）
〇〇〇〇〇〇十種布施波羅蜜多
〇〇〇〇〇〇十種親近波羅蜜多
〇〇〇〇〇〇十種真實波羅蜜多
〇〇（佛為智光長者以偈復說）〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三/
〇/b|厭捨品第三/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四/
〇〇出家之德
〇/b|無垢性品第四/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五/
〇〇新出家智光諸比丘求法：心應如何住？如何修行無垢之業？如何調伏有漏之心？
〇〇住如是心，/see:出家菩薩應常作是觀|常作是觀/
〇〇〇勿貪世間受五欲樂，精勤修習未嘗暫捨/ail|，如去頂石、如救頭燃/
〇〇〇心常懺悔過去先罪
〇〇〇安住如是四無垢性/ail|（見下）/
〇〇〇一心修行十二頭陀
〇〇〇調伏其心如旃陀羅
〇〇〇〇旃陀羅者
〇〇〇〇〇每遊行時，手執錫杖不敢當路，若人逼近振錫令聞
〇〇〇〇〇於大眾中心行謙下不敢輕慢，被呵責時，心無怨恨未嘗加報，罵辱鞭撻默然受之
〇〇〇〇〇以自知下性不階眾流，以是因緣無瞋無報
〇〇〇〇出家菩薩亦復如是
〇〇〇〇〇修行如是，一切三毒利箭，不入真實沙門之身
〇〇〇〇〇〇剃除鬚髮形同嬰兒
〇〇〇〇〇〇執持應器依佗活命
〇〇〇〇〇〇身著袈裟如被甲冑
〇〇〇〇〇〇杖錫而行如持鉾矟
〇〇〇〇〇〇執智慧劍破煩惱賊
〇〇〇〇〇〇修嬰兒行饒益一切
〇〇〇〇〇出家菩薩以三觀門修忍辱行，名真出家
〇〇〇〇〇〇觀諸眾生是佛化身，觀於自身為實愚夫
〇〇〇〇〇〇觀諸有情作尊貴想，觀於自身為僮僕想
〇〇〇〇〇〇觀諸眾生作父母想，觀自己身如男女想
〇〇〇〇〇出家菩薩常作是觀，或被打罵終不加報，善巧方便調伏其心
〇〇四無垢性者
〇〇〇衣服、臥具、飲食、湯藥
〇〇〇〇隨有所得，麤細稱心遠離貪求，是無垢性
〇〇〇〇諸佛如來三十七品菩提分法，皆從此生，佛法僧寶常不斷絕，是故得名為四無垢性
〇〇〇衣服：出家菩薩於施者為生福田，隨其所得不嫌麤惡，但懷慚愧以充法衣，得/see:袈裟十勝利|十勝利/
〇〇〇飲食：出家菩薩常行乞食，應捨身命不斷是心。常行乞食有/see:乞食十勝利|十勝利/
〇〇〇湯藥：於諸醫藥不應貪著，病時取已棄藥服之，乃至一生服所棄藥。恒服棄藥得/see:服棄藥十勝利|十勝利/
〇〇〇居處：遠離喧鬧，住阿蘭若修攝其心，寂然閑居。其阿蘭若有/see:住阿蘭若十德勝|十種德勝/，能令證得三菩提果
〇/b|阿蘭若品第五/
〇〇長坐不臥
〇〇〇上根菩薩發是願言：未得成佛，常於露地長坐不臥
〇〇〇中根菩薩發是願言：未得成佛，於樹葉地長坐不臥
〇〇〇下根菩薩發是願言：未得成佛，於石室地長坐不臥
〇〇出家菩薩發菩提心入於山林，坐三種座鍊磨身心，經三大劫而修萬行，證得無上正等菩提
〇〇〇如是三根出家菩薩坐三種座鍊磨身心，必當成就陀羅尼而得自在；若不，終不捨離阿蘭若處
〇〇〇如是/see:阿蘭若行|菩薩阿蘭若行/
〇/b|離世間第六/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六/
〇〇遠離世間，修阿蘭若清淨妙行之因緣
〇〇〇一切世間多諸恐怖/see:世間多諸恐怖|一切世間多諸恐怖/
〇〇〇當如此思維：/see:恐怖皆我自生|一切恐怖皆我自生/
〇〇如是人等，不應住止阿蘭若處：有我想；有補特伽羅相；有我我所執；有法見
〇〇如是人等，/see:如是人等應住阿蘭若處|應住阿蘭若處/
〇〇出家菩薩住阿蘭若者，/see:住阿蘭若者如是觀|晝夜相續應如是觀/，得如是等無量無邊功德勝利
〇/b|厭身品第七/
〇〇入聖智觀妙行法門
〇〇〇出家菩薩住阿蘭若，四威儀中微細觀察
!!〇〇〇是有漏身三十七種不淨穢惡，是不可愛、是不堅牢
!!〇〇〇當觀此身猶如坏器，內以糞穢種種不淨填塞充滿
!!〇〇〇有六黑蛇常在此器，一蛇隨動，器即破壞，毒害臭惡，竟無所堪
!!〇〇〇貪瞋癡三名為心病，風黃痰癊名為身病/ail|，內外六病能害身心，如六蛇居器內，一一蛇動，器即破壞，一一病發，身即無常/
〇〇〇出家菩薩處於空閑觀察是身，名為/see:第一不淨觀相|第一不淨觀相/三十七觀
〇/b|波羅蜜多品第八/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七/
〇〇發阿耨多羅三藐三菩提心求菩提道，有在家菩薩、出家菩薩。各有九品
〇〇〇上根三品皆住蘭若，無間精進利益有情
〇〇〇中下二根諸菩薩等，隨宜所住方處不定，或住蘭若，或居聚落，隨緣利益安隱眾生
〇〇住阿蘭若出家菩薩
〇〇〇省用功力得圓八萬四千波羅蜜行，速證阿耨多羅三藐三菩提〇於身命財必無悋惜永無繫屬，自然易滿三種波羅蜜多
〇〇〇出家菩薩成就/see:三種十波羅蜜多|三種十波羅蜜多/
〇/b|功德莊嚴品第九/
〇〇但有此德，堪能住止阿蘭若處
!!〇〇觀一切煩惱根源即是自心
〇〇如下諸法繫縛行者，不堪任住阿蘭若
!!〇〇一者愛樂斷見邪法；二者愛樂財寶樂具
!!〇〇一者具足憍慢；〰〰二者惡大乘法
!!〇〇一者邪見不信佛語；二者身自破戒策役持戒
〇〇具如是德，當住阿蘭若處
!!〇〇一者多聞總持不忘；二者分明能解妙義；三者正念常不放逸；四者隨順如來教行
!!〇〇一者大慈；二者大悲；三者大喜；四者大捨
〇〇具如是德，持戒清淨能至菩提
!!〇〇一者恒住四無垢性；二者常行十二頭陀；三者遠離在家出家；四者永離諂誑嫉妬
〇〇具如是德，於菩薩行得不退轉
!!〇〇一者布施；二者愛語；三者利行；四者同事
〇〇具如是德，住於蘭若持戒清淨莊嚴自身
!!〇〇一者觀察自無本性，伏斷二執證無我故；二者他身亦無本性，於怨親所離憎愛故；
!!〇〇三者身心快樂，心心所法無分別故；〰〰四者得平等智，生死涅槃無差別故
〇〇具如是德，成熟有情住持三寶，經大劫海終不退轉
!!〇〇一者誓度一切眾生；二者誓斷一切煩惱；三者誓學一切法門；四者誓證一切佛果
〇〇具如是德，住阿蘭若持戒清淨
!!〇〇一者愛樂空性，空所顯故；二者得無恐怖，證三昧故；三者於諸眾生起大悲願；四者於二無我無厭背心
〇〇具如是德，住阿蘭若善持禁戒莊嚴其身
!!〇〇一者永捨我見；二者捨我所見；三者離斷常見；四者深能悟解十二因緣
〇〇觀四法，能護禁戒妙行增修趣求佛智
!!〇〇一者觀察五蘊生滅；二者觀十二處如空聚落；三者觀十八界性同法界；四者於俗諦法無捨無著
〇〇出家菩薩住阿蘭若
〇〇〇具足四種持戒清淨莊嚴自身
!!〇〇〇一者成就不見身觀；二者成就不見語觀；三者成就不見意觀；四者遠離六十二見善能成就一切智觀
〇〇〇具足八種三昧清淨莊嚴自身
!!〇〇〇一者獨坐蘭若三昧清淨；〰〰二者遠離綺語三昧清淨；
!!〇〇〇三者遠離五欲三昧清淨；〰〰四者調伏身心三昧清淨；
!!〇〇〇五者飲食知足三昧清淨；〰〰六者遠離惡求三昧清淨；
!!〇〇〇七者遠離因聲起愛三昧清淨；八者為眾說法不求利養三昧清淨
〇〇〇復有八種智慧清淨
!!〇〇〇一者五蘊善巧智慧清淨；〰〰〰〰〰二者十二處善巧智慧清淨；
!!〇〇〇三者十八界善巧智慧清淨；〰〰〰〰四者二十二根善巧方便智慧清淨；
!!〇〇〇五者三解脫門善巧方便智慧清淨；〰六者能滅一切煩惱善巧方便智慧清淨；
!!〇〇〇七者能滅隨煩惱善巧方便智慧清淨；八者能滅六十二見善巧方便智慧清淨
〇〇〇復有八種神通清淨莊嚴自身
!!〇〇〇一者於諸色法，得無障礙天眼善巧方便神通清淨
!!〇〇〇二者於諸聲境，得無障礙天耳善巧方便神通清淨
!!〇〇〇三者於諸眾生心心所法，得無障礙他心智善巧方便神通清淨
!!〇〇〇四者憶念過去生處死處，得無障礙宿住智善巧方便神通清淨
!!〇〇〇五者能往十方無數佛剎，得無障礙神境智善巧方便神通清淨
!!〇〇〇六者能知眾生漏盡未盡，得無障礙漏盡智善巧方便神通清淨
!!〇〇〇七者能滅一切煩惱，得無障礙無漏智善巧方便神通清淨
!!〇〇〇八者現見自身一切善根迴向眾生善巧方便神通清淨
〇〇〇現身獲得八種清淨
!!〇〇〇一者身業清淨；二者語業清淨；三者意業清淨；四者正性清淨；
!!〇〇〇五者正命清淨；六者頭陀清淨；七者離諂清淨；八者一念不忘菩提心清淨
〇〇〇復有八種多聞清淨莊嚴自身
!!〇〇〇一者尊敬和上阿闍梨多聞清淨；〰二者遠離憍慢生謙下心多聞清淨；
!!〇〇〇三者精進勇猛多聞清淨；〰〰〰〰四者安住正念多聞清淨；
!!〇〇〇五者為求法者說甚深義多聞清淨；六者不愛自讚毀他多聞清淨；
!!〇〇〇七者常能觀察一切善法多聞清淨；八者聽聞正法如說修行多聞清淨
〇/b|觀心品第十/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第八/
〇〇文殊師利菩薩摩訶薩代眾求法：云何為心？云何為地？
〇〇〇/see:薄伽梵|薄伽梵/說/see:心地法之德|心地法之德/
〇〇〇三界之中以心為主，能觀心者究竟解脫，不能觀者究竟沈淪
〇〇〇〇眾生之心猶如大地，五穀五果從大地生
〇〇〇〇三界唯心，心名為地
〇〇〇〇聞心地法，如理觀察如說修行，自作教佗讚勵慶慰；能斷三障速圓眾行，疾得阿耨菩提
〇〇心、心所法本性空寂
〇〇〇/see:心心所法本性空寂|說喻明義/
〇〇〇無內無外亦無中間，於諸法中求不可得，去來現在亦不可得，超越三世非有非無，常懷染著從妄緣現，
!!〇〇緣無自性心性空故。如是空性，不生不滅，無來無去，不一不異，非斷非常，本無生處，亦無滅處，
!!〇〇亦非遠離非不遠離，如是心等不異無為，無為之體不異心等。
!!〇〇心法之體本不可說，非心法者亦不可說。何以故？若無為是心即名斷見，若離心法即名常見。
!!〇〇永離二相不著二邊，如是悟者名見真諦，悟真諦者名為賢聖。
!!〇〇一切賢聖性本空寂，無為法中戒無持犯，亦無大小，無有心王及心所法，無苦無樂。
!!〇〇如是法界自性無垢，無上中下差別之相。何以故？是無為法性平等故。如河水入海，盡同一味無別相故。
!!〇〇此無垢性，是無等等，遠離於我及離我所。此無垢性非實非虛，此無垢性是第一義，無盡滅相體本不生。
!!〇〇此無垢性常住不變最勝涅槃，我樂淨故。此無垢性遠離一切平不平等，體無異故。
〇〇〇若有善男子、善女人，欲求阿耨多羅三藐三菩提者，應當一心修習如是心地觀法
〇〇/b|觀心陀羅尼/：〰/mantra|oṃ citta prati-vedhaṃ karomi/
〇〇〇結/b|金剛縛印/〰/ail|舉清淨手，左右十指更互相叉，以右押左，更相堅握，如縛著形/
〇〇〇具大威力；結印誦咒，勝於讀習十二部經，所獲功德無有限量，乃至菩提不復退轉
〇/b|發菩提心品第十一/
〇〇說心地已，亦復當說發菩提心大陀羅尼，令諸有情發阿耨多羅三藐三菩提心，速圓妙果
〇〇〇心、心所法我說為空；空性亦空
〇〇〇自覺悟心
〇〇〇〇能發菩提，此覺悟心即菩提心，無有二相
〇〇〇〇有四種義：凡夫有二，諸佛菩薩有二
!!〇〇〇〇凡夫心之一者眼識乃至意識，同緣自境名自悟心
!!〇〇〇〇〇〇〇〇二者離於五根心、心所法，和合緣境名自悟心
!!〇〇〇〇賢聖心之一者觀真實理智
!!〇〇〇〇〇〇〇〇二者觀一切境智
〇〇心無形相亦無住處，凡夫行者最初發心，依何等處？觀何等相？
!!〇〇凡夫所觀菩提心相，猶如清淨圓滿月輪，於胸臆上明朗而住。
!!〇〇若欲速得不退轉者，在阿蘭若及空寂室，端身正念結前如來/b1|金剛縛印/，冥目觀察臆中明月，
!!〇〇作是思惟：是滿月輪五十由旬無垢明淨，內外澄澈最極清涼，月即是心，心即是月。
!!〇〇塵翳無染妄想不生，能令眾生身心清淨，大菩提心堅固不退。結此手印持念觀察。
〇〇/b|一切菩薩最初發心清淨真言/：〰/mantra|oṃ bodhi-cittam ut-pādayāmi/
〇〇〇此陀羅尼具大威德/ail|，能令行者不復退轉，去來現在一切菩薩，在於因地初發心時，悉皆專念持此真言，入不退地速圓正覺/
〇〇〇菩薩行者，端身正念，都不動搖，繫心月輪成熟觀察，是名菩薩觀菩提心成佛三昧
〇〇〇凡夫修此觀，所起五逆、四重、十惡及一闡提，如是等罪盡皆消滅，即獲五種三摩地門：
〇〇〇〇一者剎那三昧/ail|：暫想念滿月而住，如獼猴身有所繫，遠不得去、近不得停，唯困飢渴須臾住止。凡夫觀心亦然，暫得三昧名為剎那/
〇〇〇〇二者微塵三昧/ail|：於三昧少分相應。譬如有人常自食苦未曾食甜，今得與甘甜三昧少分相應，名為微塵/
〇〇〇〇三者白縷三昧/ail|：凡夫人始得此定，如染皂，多黑色中見一白縷，今方得白淨三昧，名之為縷/
〇〇〇〇四者起伏三昧/ail|：行者觀心未熟，或善成立、未善成立，如是三昧猶稱低昂，名為起伏/
〇〇〇〇五者安住三昧/ail|：修前四定心得安住，善能守護不染諸塵。如人夏中遠涉沙磧備受炎毒，忽得甘水頓除熱惱身意泰然，故名為安住/
〇〇〇〇〇入此定已，遠離惑障，發生無上菩提之芽，速登菩薩功德十地
〇/b|成佛品第十二/
〇〇瑜伽行者觀月輪已，應觀三種大祕密法
〇〇〇心祕密：觀滿月中出生金色五鈷金剛，光明煥然猶如鎔金，放於無數大白光明，以是觀察名心祕密
〇〇〇語祕密：此陀羅尼具大威力，一切菩薩成佛真跡〰/mantra|oṃ tiṣṭha vajra/
〇〇〇身祕密：手結/b|引導無上菩提最第一印/，安置胸臆心月輪中。亦名，亦名/b|能滅無明黑闇大光明印/
!!〇〇〇〇/ail|先以左右二大拇指，各入左右手掌之內，各以左右頭指中指及第四指，堅握拇指作於手拳，即是堅牢金剛拳印。/
!!〇〇〇〇/ail|次不改拳舒左頭指，直竪虛空，以其左拳著於心上，右拳小指堅握左拳頭指一節。次以右拳頭指之頭，即指右拳拇指一節，亦著心前/
〇〇〇〇以結此印加持力故，十方諸佛摩行者頂，受大菩提勝決定記，是大毘盧遮那如來無量福聚大妙智印
〇〇〇〇行者結此印已，即作此觀：
!!〇〇〇〇「一切有情共結此印，持念真言，十方世界無三惡道、八難苦果，同受第一清淨法樂。
!!〇〇〇〇〇我今首上有大寶冠，其天冠中五佛如來結跏趺坐，我是毘盧遮那如來，
!!〇〇〇〇〇圓滿具足三十二相、八十種好，放大光明照十方界，利益安樂一切眾生。」
!!〇〇〇〇如是觀察，名入毘盧遮那如來最勝三昧
〇〇〇〇欲得修習三種祕密成佛妙門，早獲如來功德身者，當著/see:三十二大金剛甲|菩薩三十二種大金剛甲/，修此妙觀
〇/b|囑累品第十三/
〇〇如是經寶最極微妙，能為有情一切利樂
〇〇如是經力福德難思，能令所在國土豐樂無諸怨敵
〇〇若能具足受持讀習廣為人說，所得福利不可限量
〇〇〇臨命終時，現前得見十方諸佛
〇〇〇獲/see:十種身語意業清淨|十種身、語、意業清淨/

`)
;
