createGP('三藏十二分教', CAT_基本)
.setStyle(AIL + BOLD)
.setNotGPSP('─')
.set('width', 58)
.hasRightEdge()
.setTree(`
/b|三藏/、/b|十二分教/
〇/b|三藏/〰tri-piṭaka
〇〇經藏〰sūtra-piṭaka
〇〇律藏〰vinaya-piṭaka
〇〇論藏〰abhidharma-piṭaka
〇/b|十二分教/ dvādaśāṅga-buddha-vacana，又稱/b|十二部經/、/b|十二分聖教/ dvādaśāṅga-dharma-pravacana
〇〇契經、長行〰〰〰〰〰〰〰〰〰修多羅〰〰/cil|（謂諸經中散說文句，如說諸行無常、諸法無我、涅槃寂靜等）/
〇〇應頌、重頌〰〰〰〰〰〰〰〰〰祇夜〰〰〰/cil|（謂諸經中依前散說契經文句，後結為頌，而諷誦之，即結集文結集品（雜阿含·八眾誦）等）/
〇〇記說、授記〰〰〰〰〰〰〰〰〰和伽羅那〰/cil|（謂諸經中諸弟子問如來記說，或如來問弟子記說，或弟子問弟子記說，化諸天等問記亦然）/
〇〇諷頌、偈頌〰〰〰〰〰〰〰〰〰伽他〰〰〰/cil|（謂諸經中結句諷頌彼彼所說，即麟頌（犀牛角經）等）/
〇〇自說〰〰〰〰〰〰〰〰〰〰〰〰優陀那〰〰/cil|（謂諸經中因憂喜事世尊自說）/
〇〇因緣〰〰〰〰〰〰〰〰〰〰〰〰尼陀那〰〰/cil|（謂諸經中遇諸因緣而有所說，如義品（義足經）等種種因緣）/（九分教無）
〇〇本起、譬喻〰〰〰〰〰〰〰〰〰阿波陀那〰/cil|（謂諸經中所說種種眾多譬喻）/（九分教無）
〇〇本事、如是語〰〰〰〰〰〰〰〰伊帝曰多伽/cil|（謂諸經中宣說前際所見聞事）/
〇〇本生〰〰〰〰〰〰〰〰〰〰〰〰闍多伽〰〰/cil|（謂諸經中宣說過去所經生事）/
〇〇方廣、方等〰〰〰〰〰〰〰〰〰毘佛略〰〰/cil|（謂諸經中廣說種種甚深法義）/
〇〇稀法、未曾有〰〰〰〰〰〰〰〰阿浮達磨〰/cil|（謂諸經中說三寶等甚希有事）/
〇〇論議、廣演〰〰〰〰〰〰〰〰〰優婆提舍〰/cil|（謂諸經中決判黑說、大說等教）/（九分教無）`)
.run((gp) => {
  var catStart = 7;
  gp.XFT(9, [catStart,'-',catStart+11], 0.25)
    .T(9, catStart,    'sūtra')
    .T(9, catStart+1,  'geya')
    .T(9, catStart+2,  'vyākaraṇa')
    .T(9, catStart+3,  'gāthā')
    .T(9, catStart+4,  'udāna')
    .T(9, catStart+5,  'nidāna')
    .T(9, catStart+6,  'avadāna')
    .T(9, catStart+7,  'itivṛttaka, ityuktaka')
    .T(9, catStart+8,  'jātaka')
    .T(9, catStart+9,  'vaipulya')
    .T(9, catStart+10, 'adbhutadharma')
    .T(9, catStart+11, 'upadeśa')
  ;
});

class My大正新脩大藏經Content extends MyContent {
  constructor(gp) { super(gp); }
  setTexts() {
    this.intro();
    this.阿含部();
    this.本緣部_般若部();
    this.法華部_華嚴部();
    this.寶積部_涅槃部();
    this.大集部_經集部();
    this.密教部();
    this.律部_論集部_史傳部();
    this.釋經論部_毘曇部();
    this.中觀部_瑜伽部();
    this.事彙部_外教部_目錄部();
  }
  _list(name, lst) {
    lst = lst.split('\|');
    if (lst.length <= 20) this.setDialogOL(name, name, lst);
    else this.setDialogOLSplit(name, name, lst, null, lst.length >= 50 ? 3 : 2);
  }

  intro() {
    this.setNamedText('wikipedia_page',
`<h3>《大正新脩大藏經》</h3>
<p>《大正新脩大藏經》（簡稱大正藏）是大藏經的一個版本。日本大正13年（1924年），高楠順次郎和渡邊海旭組織大正一切經刊行會，小野玄妙等人負責編輯校勘，於1934年印行完成。大正藏是目前學術界應用最廣和比較完備的版本。</p>
<h3>簡介</h3>
<p>《大正藏》以再雕《高麗藏》為底本，工作底本是頻伽藏，頻伽藏的底本是弘教藏，弘教藏依宋元明藏校對，大正藏於宋（思溪藏）、元（普寧藏）、明（嘉興藏）外，更參校宮本（宮內省圖書寮藏本，崇寧藏、毗盧藏）及聖語藏（正倉院聖語藏，寫本藏經）和其他古本。</p>
<p>《大正藏》全部100冊，共收集13,520卷，80,634頁，總字數超過1.2億字。分為正藏55冊、續藏30冊與別卷15冊(圖像部12冊、昭和法寶總目錄3冊)，是當時收錄佛教資料最多的一部大叢書。雖然內容非常完整，但是校訂不全錯漏之處也相當多，因而受到批評，但不減其學術地位，為各佛教寺院與圖書館必備之大藏經版本。1960年，日本「大正新修大藏經刊行會」發起重印，對初印本的若干錯誤作了校正修訂。中華電子佛典協會網站提供了卷1-55及85的電子版日本大正藏網站提供卷1-卷85電子版，圖像部亦已經完成了。</p>
<p>（<u>https://zh.wikipedia.org/zh-hant/大正新脩大藏經</u>　2025年11月）</p>`);
  }
  阿含部() {
    this._list('長阿含',
'長阿含經|佛說七佛經|毘婆尸佛經|般泥洹經（大般涅槃經）|佛說大堅固婆羅門緣起經|佛說人仙經|佛說白衣金幢二婆羅門緣起經|佛說大正句王經|佛說尼拘陀梵志經|佛說大集法門經|長阿含十報法經|佛說人本欲生經|佛說帝釋所問經|尸迦羅越六方禮經|佛說信佛功德經|佛說大三摩惹經|佛開解梵志阿颰經|佛說梵網六十二見經|佛說寂志果經|起世經');
    this._list('中阿含',
'中阿含經|佛說七知經|佛說園生樹經|佛說鹹水喻經|佛說薩缽多酥哩踰捺野經|佛說一切流攝守因經|佛說四諦經|佛說恆水經|法海經|佛說海八德經|佛說本相猗致經|佛說緣本致經|佛說輪王七寶經|佛說頂生王故事經|佛說文陀竭王經|佛說頻婆娑羅王經|佛說鐵城泥犁經|佛說閻羅王五天使者經|佛說古來世時經|佛說阿那律八念經|佛說離睡經|佛說是法非法經|佛說求欲經|佛說受歲經|佛說梵志計水淨經|佛說苦陰經|佛說釋摩男本四子經|佛說苦陰因事經|佛說樂想經|佛說漏分布經|佛說阿耨風經|佛說諸法本經|佛說瞿曇彌記果經|佛說受新歲經|佛說新歲經|佛說解夏經|佛說瞻婆比丘經|佛說伏淫經|佛說魔嬈亂經|弊魔試目連經|佛說賴吒和羅經|佛說護國經|佛說數經|梵志頞波羅延問種尊經|佛說三歸五戒慈心厭離功德經|佛說須達經|佛說長者施報經|佛為黃竹園老婆羅門說學經|梵摩渝經|佛說尊上經|佛說兜調經|佛說鸚鵡經|佛為首迦長者說業報差別經|分別善惡報應經|佛說意經|佛說應法經|佛說分別布施經|佛說息諍因緣經|佛說泥犁經|佛說齋經|優陂夷墮舍迦經|佛說八關齋經|佛說鞞摩肅經|佛說婆羅門子命終愛念不離經|佛說十支居士八城人經|佛說邪見經|佛說箭喻經|佛說蟻喻經|佛說治意經|廣義法門經|佛說普法義經');
    this._list('雜阿含',
'雜阿含經|別譯雜阿含經|佛說五蘊皆空經|佛說聖法印經|佛說法印經|五陰譬喻經|佛說水沫所漂經|佛說不自守意經|佛說滿願子經|佛說轉法輪經|佛說三轉法輪經|佛說相應相可經|佛說八正道經|佛說難提釋經|佛說馬有三相經|佛說馬有八態譬人經|佛說戒德香經|佛說戒香經|央掘魔羅經|佛說月喻經|佛說波斯匿王太后崩塵土坌身經|佛說放牛經|緣起經');
    this._list('增一阿含',
'增一阿含經|佛說阿羅漢具德經|佛說四人出現世間經|須摩提女經|佛說三摩竭經|佛說給孤長者女得度因緣經|佛說婆羅門避死經|佛說食施獲五福報經|頻毗娑羅王詣佛供養經|佛說長者子六過出家經|佛說力士移山經|佛說四未曾有法經|舍利弗摩訶目連游四衢經|佛說十一想思念如來經|佛說四泥犁經|阿那邠邸化七子經|佛說阿速達經|佛說玉耶女經|佛說大愛道般泥洹經|佛母般泥洹經|佛說舍衛國王十夢經|佛說阿難同學經|佛說七處三觀經|佛說九橫經|佛說阿含正行經');
  }
  本緣部_般若部() {
    this._list('本緣部',
'菩薩本緣經|本生經|佛說菩薩本行經|大方便佛報恩經|悲華經|大乘悲分陀利經|大乘本生心地觀經|菩薩本生鬘論|長壽王經|金色王經|佛說妙色王因緣經|佛說師子素馱娑王斷肉經|佛說頂生王因緣經|佛說月光菩薩經|佛說太子慕魄經|佛說太子墓魄經|佛說月明菩薩經|佛說德光太子經|太子須大拏經|佛說菩薩投身飴餓虎起塔因緣經|佛說福力太子因緣經|睒子經|佛說師子月佛本生經|佛說大意經|前世三轉經|銀色女經|佛說過去世佛分衛經|佛說九色鹿經|佛說鹿母經|一切智光明仙人慈心因緣不食肉經|修行本起經|佛說太子瑞應本起經|佛說普曜經|方廣大莊嚴經|異出菩薩本起經|過去現在因果經|佛本行集經|佛說眾許摩訶帝經|佛所行贊|佛本行經|僧伽羅剎所集經|佛說十二游經|中本起經|佛說興起行經|佛說義足經|佛五百弟子自說本起經|撰集百緣經|大莊嚴論經|賢愚經|雜寶藏經|雜譬喻經|百喻經|法句經|出曜經|法集要頌經|佛說猘狗經|佛說群牛譬經|佛說大魚事經|佛說譬喻經|佛說灌頂王喻經|佛說醫喻經');
    this._list('般若部',
'大般若波羅蜜多經|放光般若經|光贊經|摩訶般若波羅蜜經（大品般若經，小品般若經）|道行般若經|大明度經|摩訶般若鈔經|佛說佛母出生三法藏般若波羅蜜多經|佛說佛母寶德藏般若波羅蜜經|聖八千頌般若波羅蜜多一百八名真實圓義陀羅尼經|勝天王般若波羅蜜經|文殊師利所說摩訶般若波羅蜜經|佛說濡首菩薩無上清淨分衛經|金剛般若波羅蜜經|佛說遍照般若波羅蜜經|大樂金剛不空真實三麼耶經|佛說最上根本大樂金剛不空三昧大教王經|仁王般若經|佛說了義般若波羅蜜多經|佛說帝釋般若波羅蜜多心經|摩訶般若波羅蜜大明咒經|摩訶般若波羅蜜多心經|佛說聖佛母般若波羅蜜多經|佛說開覺自性般若波羅蜜多經|大乘理趣六波羅蜜多經');
  }
  法華部_華嚴部() {
    this._list('法華部',
'法華三部經（無量義經，妙法蓮華經，<br>觀普賢菩薩行法經）|正法華經|添品妙法蓮華經|薩曇分陀利經|佛說阿惟越致遮經|不退轉法輪經|佛說廣博嚴淨不退轉輪經|佛說法華三昧經|大法鼓經|佛說菩薩行方便境界神通變化經|大薩遮尼乾子所說經|金剛三昧經|佛說濟諸方等學經|大乘方廣總持經');
    this._list('華嚴部',
'大方廣佛華嚴經|佛說兜沙經|佛說菩薩本業經|諸菩薩求佛本業經|菩薩十住行道品|佛說菩薩十住經|漸備一切智德經|十住經|佛說十地經|等目菩薩所問三昧經|顯無邊佛土功德經|佛說較量一切佛剎功德經|佛說如來興顯經|度世品經|佛說羅摩伽經|大方廣佛華嚴經入法界品|文殊師利發願經|普賢菩薩行願贊|大方廣普賢所說經|大方廣總持寶光明經|大方廣佛華嚴經不思議佛境界分|大方廣如來不思議境界經|度諸佛境界智光嚴經|佛華嚴入如來德智不思議境界經|大方廣入如來智德不思議經|信力入印法門經|大方廣佛花嚴經修慈分|佛說莊嚴菩提心經|佛說大方廣菩薩十地經|最勝問菩薩十住除垢斷結經');
  }
  寶積部_涅槃部() {
    this._list('寶積部',
'大寶積經|大方廣三戒經|佛說如來不思議秘密大乘經|阿閦佛國經|佛說大乘十法經|佛說普門品經|佛說大乘菩薩藏正法經|佛說胞胎經|文殊師利佛土嚴淨經|大聖文殊師利菩薩佛剎功德莊嚴經|父子合集經|佛說護國尊者所問大乘經|法鏡經|郁迦羅越問菩薩行經|佛說幻士仁賢經|佛說決定毗尼經|佛說三十五佛名禮懺文|發覺淨心經|佛說須賴經|佛說菩薩修行經|佛說無畏授所問大乘經|佛說優填王經|佛說大乘日子王所問經|佛說須摩提菩薩經|須摩提經|佛說阿闍貰王女阿術達菩薩經|佛說離垢施女經|得無垢女經|文殊師利所說不思議佛境界經|聖善住意天子所問經|佛說如幻三昧經|佛說太子刷護經|佛說太子和休經|慧上菩薩問大善權經|佛說大方廣善巧方便經|大乘顯識經|佛說大乘方等要慧經|彌勒菩薩所問本願經|佛說遺日摩尼寶經|佛說摩訶衍寶嚴經|佛說大迦葉問大寶積正法經|勝鬘師子吼一乘大方便方廣經|毗耶娑問經|入法界體性經|佛說寶積三昧文殊師利菩薩問法身經|如來莊嚴智慧光明入一切佛境界經|度一切諸佛境界智嚴經|佛說大乘入諸佛境界智光明莊嚴經|佛說無量壽經|佛說無量清淨平等覺經|佛說阿彌陀三耶三佛薩樓佛檀過度人道經|佛說大乘無量壽莊嚴經|大阿彌陀經|佛說觀無量壽佛經|佛說阿彌陀經|稱讚淨土佛攝受經|拔一切業障根本得生淨土神咒|阿彌陀佛說咒|阿彌陀鼓音聲王陀羅尼經|觀世音菩薩授記經|佛說如幻三摩地無量印法門經|後出阿彌陀佛偈');
    this._list('涅槃部',
'大般涅槃經|佛說大般泥洹經|大般涅槃經後分|佛說方等般泥洹經|四童子三昧經|大悲經|等集眾德三昧經|集一切福德三昧經|摩訶摩耶經|菩薩從兜術天降神母胎說廣普經|中陰經|蓮華面經|大方等無想經|大雲無想經卷第九|佛垂般涅槃略說教誡經|佛臨涅槃記法住經|般泥洹後灌臘經|佛滅度後棺斂葬送經|迦葉赴佛般涅槃經|佛入涅槃密跡金剛力士哀戀經|佛說當來變經|佛說法滅盡經');
  }
  大集部_經集部() {
    this._list('大集部',
'大方等大集經|大哀經|寶女所問經|海意菩薩所問淨印法門經|無言童子經|寶星陀羅尼經|阿差末菩薩經|大集大虛空藏菩薩所問經|虛空藏菩薩經|虛空藏菩薩神咒經|虛空藏菩薩神咒經|虛空孕菩薩經|觀虛空藏菩薩經|大方廣十輪經|地藏菩薩本願經|地藏十輪經|百千頌大集經地藏菩薩請問法身贊|菩薩念佛三昧經|般舟三昧經|拔陂菩薩經|自在王菩薩經|奮迅王問經|大集譬喻王經|僧伽吒經|大集會正法經');
    this._list('經集部',
'四十二章經|十善業道經|賢劫經|佛名經|藥師經|彌勒下生經|寶篋經|楞伽經|盂蘭盆經|維摩詰經|圓覺經|稻稈經|大樹緊那羅王所問經|首楞嚴三昧經|月燈三昧經|解深密經|陰持入經|占察善惡業報經|安般守意經|達摩多羅禪經|修行道地經|密嚴經|八吉祥經|金光明經|地獄經|十善業道經|本事經|如來藏經|菩薩瓔珞經');
  }
  密教部() {
    this._list('雜密',
'陀羅尼集經|大方廣佛華嚴經（華嚴咒，普庵咒）|大方廣菩薩藏文殊師利根本儀軌經|大佛頂首楞嚴經（楞嚴咒）|大悲心陀羅尼經（大悲咒）|大法炬陀羅尼經|大乘無量壽經|四大菩薩曼荼羅經|八大菩薩曼荼羅經（甘露陀羅尼咒）|不空羂索神變真言經|不空羂索神咒心經|不空罥索陀羅尼經|佛說十一面觀世音神咒經|消災吉祥經|佛頂尊勝陀羅尼經（尊勝咒）|無量門微密持經');
    this._list('純密',
'大日經|金剛頂經|蘇悉地經|一切秘密最上名義大教王儀軌|金剛頂經瑜伽文殊師利菩薩法|千臂千鉢曼殊室利經');
    this._list('無上密',
'一切如來金剛三業最上祕密大教王經（密集金剛密續）|聖妙吉祥真實名經|瑜伽大教王經（毘盧遮那幻化網續）|妙吉祥瑜伽大教金剛陪囉嚩輪觀想成就儀軌經（大威德金剛密續）|大悲空智金剛大教王儀軌經（喜金剛密續）|妙吉祥最勝根本大教經|祕密相經|無二平等最上瑜伽大教王經');
  }
  律部_論集部_史傳部() {
    this._list('律部',
'彌沙塞部和醯五分律|彌沙塞五分戒本|五分戒本|五分比丘尼戒本|彌沙塞羯磨本|摩訶僧祇律|摩訶僧祇律大比丘戒本|摩訶僧祇比丘尼戒本|四分律|四分律比丘戒本|四分僧戒本|四分比丘尼戒本|曇無德律部雜羯磨|羯磨|四分比丘尼羯磨法|十誦律|十誦比丘波羅提木叉戒本|大沙門百一羯磨法|十誦羯磨比丘要用|薩婆多毗尼毗婆沙|薩婆多部毗尼摩得勒伽|根本說一切有部毗奈耶|根本說一切有部苾芻尼毗奈耶|根本說一切有部毗奈耶出家事|根本說一切有部毗奈耶安居事|根本說一切有部毗奈耶隨意事|根本說一切有部毗奈耶皮革事|根本說一切有部毗奈耶藥事|根本說一切有部毗奈耶羯恥那衣事|根本說一切有部毗奈耶破僧事|根本說一切有部毗奈耶雜事|根本說一切有部尼陀那目得迦|根本說一切有部百一羯磨|根本說一切有部戒經|根本說一切有部苾芻尼戒經|根本說一切有部毗奈耶尼陀那目得迦攝頌|根本說一切有部略毗奈耶雜事攝頌|根本薩婆多部律攝|根本說一切有部毗奈耶頌|解脫戒經|律二十二明了論|善見律毗婆沙|毗尼母經|鼻奈耶|舍利弗問經|優波離問佛經|佛說犯戒罪報輕重經|佛說目連所問經|佛說迦葉禁戒經|大比丘三千威儀|沙彌十戒法並威儀|沙彌威儀|佛說沙彌十戒儀則經|沙彌尼戒經|沙彌尼離戒文|佛說優婆塞五戒相經|佛說戒消災經|大愛道比丘尼經|佛說苾芻五法經|佛說苾芻迦屍迦十法經|佛說五恐怖世經|佛阿毗曇經出家相品|佛說目連問戒律中五百輕重事|佛說目連問戒律中五百輕重事經|梵網經|菩薩瓔珞本業經|受十善戒經|佛說菩薩內戒經|優婆塞戒經|清淨毗尼方廣經|寂調音所問經|菩薩藏經|佛說舍利弗悔過經|大乘三聚懺悔經|佛說淨業障經|善恭敬經|佛說正恭敬經|佛說大乘戒經|佛說八種長養功德經|菩薩戒羯磨文|菩薩戒本|菩薩受齋經|優婆塞五戒威儀經|菩薩五法懺悔文');
    this._list('論集部',
'因明正理門論本|因明正理門論|因明入正理論|迴諍論|方便心論|如實論反質難品|入大乘論|大乘寶要義論|大乘集菩薩學論|集大乘相論|集諸法寶最上義論|提婆菩薩破楞伽經中外道<br>小乘四宗論|提婆菩薩釋楞伽經中外道<br>小乘涅槃論|隨相論|金剛針論|尼乾子問無我義經|佛說立世阿毗曇論|彰所知論|成實論|四諦論|解脫道論|三彌底部論|辟支佛因緣論|十二因緣論|緣生論|大乘緣生論|因緣心論頌|止觀門論頌|寶行王正論|手杖論|諸教決定名義論|發菩提心經論|菩提資糧論|菩提心離相論|菩提行經|菩提心觀釋|廣釋菩提心論|金剛頂瑜伽中發<br>阿耨多羅三藐三菩提心論|大乘起信論|釋摩訶衍論|大宗地玄文本論|那先比丘經|福蓋正行所集經|龍樹菩薩為禪陀迦王說法要偈|勸發諸王要偈|龍樹菩薩勸誡王頌|贊法界頌|廣大發願頌|三身梵贊|佛三身贊|佛一百八名贊|一百五十贊佛頌|佛吉祥德贊|七佛讚唄伽他|揵稚梵贊|八大靈塔梵贊|佛說八大靈塔名號經|賢聖集伽陀一百頌|事師法五十頌|密跡力士大權神王經偈頌|請賓頭盧法|賓頭盧突羅闍為優陀延王說法經|迦葉仙人說醫女人經|勝軍化世百瑜伽他經');
    this._list('史傳部',
'異部宗輪論|歷代三寶紀|佛祖統紀|佛祖歷代通載|阿育王經|高僧傳|續高僧傳|宋高僧傳|大明高僧傳|景德傳燈錄|續傳燈錄|法顯傳|大唐西域記|弘明集|廣弘明集|破邪論|辯正論|十門辯惑論|洛陽伽藍記|五燈會元|大唐西域求法高僧傳|遊方記抄|大慈恩寺三藏法師傳');
  }
  釋經論部_毘曇部() {
    this._list('釋經論部',
'四阿鋡暮抄解|三法度論|分別功德論|阿含口解十二因緣經|大智度論|金剛般若論|金剛般若波羅蜜經論|金剛仙論|能斷金剛般若波羅蜜多經論釋|能斷金剛般若波羅蜜多經論頌|金剛般若波羅蜜經破取着不壞假名論|聖佛母般若波羅蜜多九頌精義論|佛母般若波羅蜜多圓集要義釋論|佛母般若波羅蜜多圓集要義論|妙法蓮華經憂波提舍|十住毗婆沙論|十地經論|大寶積經論|無量壽經優波提舍|彌勒菩薩所問經論|寶髻經四法憂波提舍|涅槃論|涅槃經本有今無偈論|遺教經論|佛地經論|文殊師利菩薩問菩提經論|勝思惟梵天所問經論|轉法輪經憂波提舍|三具足經憂波提舍|大乘四法經釋');
    this._list('毗曇部',
'阿毗達磨集異門足論|阿毗達磨法蘊足論|施設論|阿毗達磨識身足論|阿毗達磨界身足論|眾事分阿毗曇論|阿毗達磨品類足論|阿毗曇八犍度論|阿毗達磨發智論|阿毗達磨大毗婆沙論|阿毗曇毗婆沙論|鞞婆沙論|舍利弗阿毗曇論|尊婆須蜜菩薩所集論|阿毗曇心論|阿毗曇心論經|雜阿毗曇心論|阿毗曇甘露味論|入阿毗達磨論|五事毗婆沙論|薩婆多宗五事論|阿毗曇五法行經|阿毗達磨俱舍論|阿毗達磨俱舍釋論|阿毗達磨俱舍論本頌|俱舍論實義疏|阿毗達磨順正理論|阿毗達磨藏顯宗論');
  }
  中觀部_瑜伽部() {
    this._list('中觀部',
'中論|順中論義入大般若波羅蜜經初品法門|般若燈論釋|大乘中觀釋論|十二門論|百論|廣百論本|大乘廣百論釋論|百字論|壹輸盧迦論|大乘破有論|六十頌如理論|大乘二十頌論|大丈夫論|大乘掌珍論');
    this._list('瑜伽部',
'瑜伽師地論|瑜伽師地論釋|菩薩地持經|菩薩善戒經|決定藏論|成唯識論|唯識三十論頌|轉識論|唯識論|大乘唯識論|唯識二十論|成唯識寶生論|攝大乘論|攝大乘論本|攝大乘論釋|攝大乘論釋論|中邊分別論|辯中邊論|辯中邊論頌|顯揚聖教論|顯揚聖教論頌|大乘莊嚴經論|大乘阿毗達磨集論|大乘阿毗達磨雜集論|六門教授習定論|業成就論|大乘成業論|佛性論|究竟一乘寶性論|大乘五蘊論|大乘廣五蘊論|大乘百法明門論|王法正理論|十八空論|三無性論|顯識論|無相思塵論|解卷論|掌中論|取因假設論|觀總相論頌|觀所緣緣論|觀所緣論釋|大乘法界無差別論');
  }
  事彙部_外教部_目錄部() {
    this._list('事彙部',
'經律異相|法苑珠林|諸經要集|法門名義集|南海寄歸內法傳|大宋僧史略|釋氏要覽|一切經音義|續一切經音義|翻梵語|翻譯名義集|悉曇字記|梵語千字文|唐梵文字|梵語雜名|唐梵兩語雙對集');
    this._list('外教部',
'金七十論|勝宗十句義論|老子化胡經|摩尼教下部讚|摩尼光佛教法儀略|波斯教殘經|序聽迷詩所經|景教三威蒙度讚|大秦景教流行中國碑頌');
    this._list('目錄部',
'出三藏記集|眾經目錄|大唐內典錄|續大唐內典錄|古今譯經圖紀|續古今譯經圖紀|大周刊定眾經目錄|開元釋教錄|開元釋教錄略出|大唐貞元續開元釋教錄|貞元新定釋教目錄|續貞元釋教錄|傳教大師將來台州錄|傳教大師將來越州錄|御請來目錄|根本大和尚真跡策子等目錄|常曉和尚請來目錄|靈岩寺和尚請來法門道具等目錄|日本國承和五年入唐求法目錄|慈覺大師在唐送進錄|入唐新求聖教目錄|惠運禪師將來教法目錄|惠運律師書目錄|開元寺求得經疏記等目錄|福州溫州台州求得經律論疏記外書等目錄|青龍寺求法目錄|日本比丘圓珍入唐求法目錄|智證大師請來目錄|新書寫請來法門等目錄|禪林寺宗睿僧正目錄|錄外經等目錄|諸阿闍梨真言密教部類總錄|華嚴宗章疏並因明錄|天台宗章疏|三論宗章疏|法相宗章疏|注進法相宗章疏|律宗章疏|東域傳燈目錄|新編諸宗教藏總錄');
  }

} // end of My大正新脩大藏經Content.


createGP('大正新脩大藏經', CAT_基本)
.setStyle(AIL + BOLD)
.setNotGPSP('─')
.set('width', 34)
.hasRightEdge()
.run((gp) => { new My大正新脩大藏經Content(gp); })
.setTree(`
《/b|大正新脩大藏經/》，簡稱《大正藏》。（/see:wikipedia_page|維基百科/）
〇譯典
〇〇阿含部：/see:長阿含|長/，/see:中阿含|中/，/see:雜阿含|雜/，/see:增一阿含|增一/〰/cil|第1、2部，共151部經，460卷/
〇〇/see:|本緣部/〰〰〰〰〰〰〰〰〰〰/cil|第3、4部，共68部經，共184卷/
〇〇/see:|般若部/〰〰〰〰〰〰〰〰〰〰/cil|第5、6、7、8部，共42部經，共806卷/
〇〇/see:|法華部/·/see:|華嚴部/〰〰〰〰〰〰/cil|第9、10部，共48部經，共188卷/
〇〇/see:|寶積部/·/see:|涅槃部/〰〰〰〰〰〰/cil|第11、12部，共87部經，共303卷/
〇〇/see:|大集部/〰〰〰〰〰〰〰〰〰〰/cil|第13部，共28部經，共71卷/
〇〇/see:|經集部/〰〰〰〰〰〰〰〰〰〰/cil|第14、15、16、17部，共423部經/
〇〇密教部：/see:雜密|雜/，/see:純密|純/，/see:無上密|無上/〰〰〰/cil|第18、19、20、21部，共573部經/
〇〇/see:|律部/〰〰〰〰〰〰〰〰〰〰〰/cil|第22、23、24部，共84部經/
〇〇/see:|釋經論部/·/see:|毗曇部/〰〰〰〰〰/cil|第25、26、27、28、29部，共59部經/
〇〇/see:|中觀部/·/see:|瑜伽部/〰〰〰〰〰〰/cil|第30、31部，共64經/
〇〇/see:|論集部/〰〰〰〰〰〰〰〰〰〰/cil|第32部，共65部經，共194卷/
〇中國撰述
〇〇經疏部〰〰〰〰〰〰〰〰〰〰/cil|第33、34、35、36、37、38、39部，共111部經/
〇〇律疏部·論疏部〰〰〰〰〰〰/cil|第40、41、42、43、44部，共47部經/
〇〇諸宗部〰〰〰〰〰〰〰〰〰〰/cil|第44、45、46、47、48部，共175部經/
〇〇/see:|史傳部/〰〰〰〰〰〰〰〰〰〰/cil|第49、50、51、52部，共95部經/
〇〇/see:|事彙部/·/see:|外教部/·/see:|目錄部/〰〰/cil|第53、54、55部，共64部經/
〇古逸部·疑似部〰〰〰〰〰〰〰/cil|第85部，共189部經/
`);
