class My華嚴經Content extends MyContent {
  constructor(gp) { super(gp); }
  setTexts() { // override
    this.第四品();     // 世界成就品
    this.第十八品();   // 明法品
    this.第二十六品(); // 十地品，卷三十四至三十九
    this.第三十三品(); // 佛不思議法品
    this.第三十六品(); // 普賢行品
    this.第三十八品(); // 離世間品，卷五十三至五十九
    this.五十三參();   // 入法界品（卷第六十始）之卷六十二至八十
  }
  第二十六品() {
    this.setDialogOL('初地:十願門', '初地十願門',
'生廣大清淨決定解，以一切供養之具，恭敬供養一切諸佛，令無有餘；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願受一切佛法輪，願攝一切佛菩提，願護一切諸佛教，願持一切諸佛法；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願一切世界佛興於世，從兜率天宮沒、入胎、住胎、初生、出家、成道說法、示現涅槃，皆悉往詣，親近供養，為眾上首，<br>受行正法，於一切處一時而轉；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願一切菩薩行廣大無量，不壞不雜，攝諸波羅蜜，淨治諸地，總相、別相、同相、異相、成相、壞相，所有菩薩行皆如實說，<br>教化一切，令其受行，心得增長；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願一切眾生界有色、無色、有想、無想、非有想、非無想、卵生、胎生、濕生、化生，三界所繫，入於六趣一切生處，名色所攝，<br>如是等類我皆教化，令入佛法，令永斷一切世間趣，令安住一切智智道；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願一切世界廣大無量，粗細亂住、倒住、正住，若入、若行、若去，如帝網差別，十方無量種種不同，智皆明瞭，現前知見；<br>廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願一切國土入一國土，一國土入一切國土，無量佛土普皆清淨，光明眾具以為莊嚴，離一切煩惱，成就清淨道，無量智慧眾生<br>充滿其中，普入廣大諸佛境界，隨眾生心而為示現，皆令歡喜；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願與一切菩薩同一志行，無有怨嫉，集諸善根，一切菩薩平等一緣，常共集會，不相捨離，隨意能現種種佛身，任其自心能知<br>一切如來境界威力智慧，得不退如意神通，遊行一切世界，現形一切眾會，普入一切生處，成就不思議大乘，修菩薩行；<br>廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願乘不退輪行菩薩行，身、語、意業悉不唐捐，若暫見者則必定佛法，暫聞音聲則得實智慧，纔生淨信則永斷煩惱，<br>得如大藥王樹身，得如如意寶身，修行一切菩薩行；廣大如法界，究竟如虛空，盡未來際一切劫數無有休息|願於一切世界成阿耨多羅三藐三菩提不離一毛端處，於一切毛端處皆悉示現初生、出家、詣道場、成正覺、轉法輪、入涅槃，<br>得佛境界大智慧力，於唸唸中隨一切眾生心示現成佛令得寂滅，以一三菩提知一切法界即涅槃相，以一音說法令一切眾生心皆歡喜，<br>示入大涅槃而不斷菩薩行，示大智慧地安立一切法，以法智通、神足通、幻通自在變化充滿一切法界；廣大如法界，究竟如虛空，<br>盡未來際一切劫數無有休息');
    this.setDialogOL('二地:為眾生', '二地為眾生',
'眾生可愍，墮於邪見、惡慧、惡欲、惡道稠林。我應令彼住於正見，行真實道|一切眾生分別彼我，互相破壞，鬥諍瞋恨，熾然不息。我當令彼住於無上大慈之中|一切眾生貪取無厭，唯求財利，邪命自活。我當令彼住於清淨身、語、意業正命法中|一切眾生常隨三毒，種種煩惱因之熾然，不解志求出要方便。<br>我當令彼除滅一切煩惱大火，安置清涼涅槃之處|一切眾生為愚癡重闇，妄見厚膜之所覆故，入陰翳稠林，失智慧光明，行曠野險道，起諸惡見。<br>我當令彼得無障礙清淨智眼，知一切法如實相，不隨他教|一切眾生在於生死險道之中，將墮地獄、畜生、餓鬼，入惡見網中，為愚癡稠林所迷，<br>隨逐邪道，行顛倒行。譬如盲人無有導師，非出要道謂為出要，入魔境界，惡賊所攝，<br>隨順魔心，遠離佛意。我當拔出如是險難，令住無畏一切智城|一切眾生為大瀑水波浪所沒，入欲流、有流、無明流、見流，生死洄澓，愛河漂轉，<br>湍馳奔激，不暇觀察；為欲覺、恚覺、害覺隨逐不捨，身見羅剎於中執取，<br>將其永入愛慾稠林；於所貪愛深生染著，住我慢原阜，安六處聚落；無善救者，無能度者。<br>我當於彼起大悲心，以諸善根而為救濟，令無災患，離染寂靜，住於一切智慧寶洲|一切眾生處世牢獄，多諸苦惱，常懷愛憎，自生憂怖，貪慾重械之所繫縛，無明稠林以為覆障，<br>於三界內莫能自出。我當令彼永離三有，住無障礙大涅槃中|一切眾生執著於我，於諸蘊窟宅不求出離，依六處空聚，起四顛倒行，為四大毒蛇之所侵惱，<br>五蘊怨賊之所殺害，受無量苦。我當令彼住於最勝無所著處，所謂：滅一切障礙無上涅槃|一切眾生其心狹劣，不行最上一切智道，雖欲出離，但樂聲聞、辟支佛乘。<br>我當令住廣大佛法、廣大智慧');
    this.setDialogOL('三地:哀愍眾生心', '三地哀愍眾生心',
'見諸眾生孤獨無依，生哀愍心|見諸眾生貧窮困乏，生哀愍心|見諸眾生三毒火然，生哀愍心|見諸眾生諸有牢獄之所禁閉，生哀愍心|見諸眾生煩惱稠林恆所覆障，生哀愍心|見諸眾生不善觀察，生哀愍心|見諸眾生無善法欲，生哀愍心|見諸眾生失諸佛法，生哀愍心|見諸眾生隨生死流，生哀愍心|見諸眾生失解脫方便，生哀愍心');
    this.setDialogOL('三地:神通力', '三地無量神通力',
'能動大地|以一身為多身，多身為一身，或隱或顯|石壁山障，所往無礙，猶如虛空|於虛空中跏趺而去，同於飛鳥|入地如水，履水如地|身出煙焰，如大火聚|復雨於水，猶如大雲|日月在空，有大威力，而能以手捫摸摩觸|其身自在，乃至梵世|天耳清淨過於人耳，悉聞人、天若近若遠所有音聲，乃至蚊蚋、虻蠅等聲亦悉能聞。|他心智，如實而知他眾生心，所謂：有貪心，如實知有貪心，離貪心，離貪心，有瞋心、離瞋心，<br>有癡心、離癡心，有煩惱心、無煩惱心，小心、廣心，大心、無量心，略心、非略心，<br>散心、非散心，定心、非定心，解脫心、非解脫心，有上心、無上心，雜染心、非雜染心，<br>廣心、非廣心，皆如實知。|念知無量宿命差別，所謂：念知一生，念知二生、三生、四生，乃至十生、二十、三十，<br>乃至百生、無量百生、無量千生、無量百千生，成劫、壞劫、成壞劫、無量成壞劫，我曾在某處，<br>如是名，如是姓，如是種族，如是飲食，如是壽命，如是久住，如是苦樂。我於彼死，生於某處，<br>從某處死，生於此處，如是形狀，如是相貌，如是言音。如是過去無量差別，皆能憶念。|天眼清淨過於人眼，見諸眾生生時、死時、好色、惡色，善趣、惡趣，隨業而去。<br>若彼眾生成就身惡行，成就語惡行，成就意惡行，誹謗賢聖，具足邪見及邪見業因緣，身壞命終，<br>必墮惡趣，生地獄中。若彼眾生成就身善行，成就語善行，成就意善行，不謗賢聖，具足正見，<br>正見業因緣，身壞命終，必生善趣諸天之中。菩薩天眼皆如實知。|於諸禪三昧、三摩缽底能入能出，然不隨其力受生，但隨能滿菩提分處，以意願力而生其中。');
    this.setDialogOL('四地:十法明門', '四地十法明門',
'觀察眾生界|觀察法界|觀察世界|觀察虛空界|觀察識界|觀察欲界|觀察色界|觀察無色界|觀察廣心信解界|觀察大心信解界');
    this.setDialogOL('四地:智成熟法', '四地智成熟法',
'深心不退故|於三寶中生淨信，畢竟不壞故|觀諸行生滅故|觀諸法自性無生故|觀世間成壞故|觀因業有生故|觀生死涅槃故|觀眾生國土業故|觀前際後際故|觀無所有盡故');
    this.setDialogOL('五地:十種平等清淨心', '五地十種平等清淨心',
'於過去佛法平等清淨心|未來佛法平等清淨心|現在佛法平等清淨心|戒平等清淨心|心平等清淨心|除見疑悔平等清淨心|道非道智平等清淨心|修行智見平等清淨心|於一切菩提分法上上觀察平等清淨心|教化一切眾生平等清淨心');
    this.setDialogOL('五地:種種名', '五地菩薩種種名',
'念者，不忘諸法故|智者，能善決了故|有趣者，知經意趣，次第連合故|慚愧者，自護、護他故|堅固者，不捨戒行故|覺者，能觀是處、非處故|隨智者，不隨於他故|隨慧者，善知義、非義句差別故|神通者，善修禪定故|方便善巧者，能隨世行故|無厭足者，善集福德故|不休息者，常求智慧故|不疲倦者，集大慈悲故|為他勤修者，欲令一切眾生入涅槃故|勤求不懈者，求如來力、無畏、不共法故|發意能行者，成就莊嚴佛土故|勤修種種善業者，能具足相好故|常勤修習者，求莊嚴佛身、語、意故|大尊重恭敬法者，於一切菩薩法師處如教而行故|心無障礙者，以大方便常行世間故|日夜遠離餘心者，常樂教化一切眾生故');
    this.setDialogOL('六地:十平等法', '六地十平等法',
'一切法無相故平等|無體故平等|無生故平等|無成故平等|本來清淨故平等| 無戲論故平等|無取捨故平等|寂靜故平等|如幻如夢、如影、如響、如水中月、如鏡中像、如焰、如化故平等|有無不二故平等');
    this.setDialogOL('六地:十空三昧門', '六地十空三昧門',
'入空三昧|自性空三昧|第一義空三昧|第一空三昧|大空三昧|合空三昧|起空三昧|如實不分別空三昧|不捨離空三昧|離不離空三昧');
    this.setDialogOL('七地:十種方便慧起殊勝道', '七地十種方便慧起殊勝道',
'雖善修空、無相、無願三昧，而慈悲不捨眾生，雖得諸佛平等法，而樂常供養佛|雖入觀空智門，而勤集福德|雖遠離三界，而莊嚴三界|雖畢竟寂滅諸煩惱焰，而能為一切眾生起滅貪、瞋、癡煩惱焰|雖知諸法如幻、如夢、如影、如響、如焰、如化、如水中月、如鏡中像、自性無二，而隨心作業無量差別|雖知一切國土猶如虛空，而能以清淨妙行莊嚴佛土|雖知諸佛法身本性無身，而以相好莊嚴其身|雖知諸佛音聲性空寂滅不可言說，而能隨一切眾生出種種差別清淨音聲|雖隨諸佛了知三世唯是一念，而隨眾生意解分別，以種種相、種種時、種種劫數而修諸行');
    this.setDialogOL('七地:具足大智神通門百萬三昧', '七地具足大智神通門百萬三昧',
'善觀擇三昧|善擇義三昧|最勝慧三昧|分別義藏三昧|如實分別義三昧|善住堅固根三昧|智慧神通門三昧|法界業三昧|如來勝利三昧|種種義藏生死涅槃門三昧');
    this.setDialogOL('七地:無量如來境界', '七地無量如來境界',
'無量眾生界|無量諸佛教化眾生業|無量世界網|無量諸佛清淨國土|無量種種差別法|無量諸佛現覺智|無量劫數|無量諸佛覺了三世智|無量眾生差別信解|無量諸佛示現種種名色身|無量眾生欲樂諸根差別|無量諸佛語言音聲令眾生歡喜|無量眾生種種心行|無量諸佛了知廣大智|無量聲聞乘信解|無量諸佛說智道令信解|無量辟支佛所成就|無量諸佛說甚深智慧門令趣入|無量諸菩薩方便行|無量諸佛所說大乘集成事令菩薩得入');
    this.setDialogOL('八地:身智', '八地身智',
'知眾生身、國土身、業報身、聲聞身、獨覺身、菩薩身、如來身、智身、法身、虛空身。|知諸眾生心之所樂，能以眾生身作自身，亦作國土身、業報身，乃至虛空身。|知眾生心之所樂，能以國土身作自身，亦作眾生身、業報身，乃至虛空身。|知諸眾生心之所樂，能以業報身作自身，亦作眾生身、國土身，乃至虛空身。|知眾生心之所樂，能以自身作眾生身、國土身，乃至虛空身。隨諸眾生所樂不同，則於此身現如是形。|知眾生集業身、報身、煩惱身、色身、無色身，|又知國土身小相、大相、無量相、染相、淨相、廣相、倒住相、正住相、普入相、方網差別相，<br>知業報身假名差別，知聲聞身、獨覺身、菩薩身假名差別，|知如來身有菩提身、願身、化身、力持身、相好莊嚴身、威勢身、意生身、福德身、法身、智身，|知智身善思量相、如實抉擇相、果行所攝相、世間出世間差別相、三乘差別相、共相、不共相、<br>出離相、非出離相、學相、無學相，|知法身平等相、不壞相、隨時隨俗假名差別相、眾生非眾生法差別相、佛法聖僧法差別相，|知虛空身無量相、周遍相、無形相、無異相、無邊相、顯現色身相。');
    this.setDialogOL('八地:十自在故', '八地十自在故',
'命自在|心自在|財自在|業自在|生自在|願自在|解自在|如意自在|智自在|法自在');
    this.setDialogOL('八地:智力', '八地智力',
'得善住深心力|一切煩惱不行故|得善住勝心力|不離於道故|得善住大悲力|不捨利益眾生故|得善住大慈力|救護一切世間故|得善住陀羅尼力|不忘於法故：得善住辯才力|善觀察分別一切法故|得善住神通力|普往無邊世界故：得善住大願力|不捨一切菩薩所作故|得善住波羅蜜力|成就一切佛法故|得如來護念力|一切種、一切智智現前故');
    this.setDialogOL('八地:別名', '八地別名',
'不動地，無能沮壞故|不轉地，智慧無退故|難得地，一切世間無能測故|童真地，離一切過失故|生地，隨樂自在故|成地，更無所作故|究竟地，智慧決定故|變化地，隨願成就故|力持地，他不能動故|無功用地，先已成就故');
    this.setDialogOL('菩薩十地:如十山王', '菩薩十地如十山王',
'如雪山王，一切藥草咸在其中，取不可盡；<br>菩薩所住歡喜地亦復如是，一切世間經書、技藝、文頌、咒術咸在其中，說不可盡|如香山王，一切諸香咸集其中，取不可盡；<br>菩薩所住離垢地亦復如是，一切菩薩戒行、威儀咸在其中，說不可盡|如鞞陀梨山王，純寶所成，一切眾寶咸在其中，取不可盡；<br>菩薩所住發光地亦復如是，一切世間禪定神通、解脫三昧、三摩缽底咸在其中，說不可盡|如神仙山王，純寶所成，五通神仙咸住其中，無有窮盡；<br>菩薩所住焰慧地亦復如是，一切道中殊勝智慧咸在其中，說不可盡|如由乾陀羅山王，純寶所成，夜叉大神咸住其中，無有窮盡；<br>菩薩所住難勝地亦復如是，一切自在如意神通咸在其中，說不可盡|如馬耳山王，純寶所成，一切諸果咸在其中，取不可盡；<br>菩薩所住現前地亦復如是，入緣起理聲聞果證咸在其中，說不可盡|如尼民陀羅山王，純寶所成，大力龍神咸住其中，無有窮盡；<br>菩薩所住遠行地亦復如是，方便智慧獨覺果證咸在其中，說不可盡|如斫羯羅山王，純寶所成，諸自在眾咸住其中，無有窮盡；<br>菩薩所住不動地亦復如是，一切菩薩自在行差別世界咸在其中，說不可盡|如計都山王，純寶所成，大威德阿脩羅王咸住其中，無有窮盡；<br>菩薩所住善慧地亦復如是，一切世間生滅智行咸在其中，說不可盡|如須彌盧山王，純寶所成，大威德諸天咸住其中，無有窮盡；<br>菩薩所住法雲地亦復如是，如來力、無畏、不共法、一切佛事咸在其中，問答宣說不可窮盡');

  var buf = new Buffer(), a =
`歡喜地#出生大願漸次深故|次第漸深#發一切智心|從大海出
離垢地#不受一切破戒屍故|不受死屍#持戒頭陀，正行明淨|巧匠治理
發光地#捨離世間假名字故|餘水入中<br>皆失本名#諸禪三昧，圓滿無缺|圓滿無缺
焰慧地#與佛功德同一味故|普同一味#道行清白，離諸垢穢|清淨離垢
難勝地#出生無量方便神通、<br>世間所作眾珍寶故|無量珍寶#方便神通，內外明徹|內外明徹
現前地#觀察緣生甚深理故|無能至底#緣起智慧，善能鑽穿|善巧鑽穿
遠行地#廣大覺慧善觀察故|廣大無量#貫以種種方便智縷|貫以寶縷
不動地#示現廣大莊嚴事故|大身所居#置於自在高幢之上|置在琉璃高幢之上
善慧地#得深解脫行於世間，<br>如實而知不過限故|潮不過限#觀眾生行，放聞持光|普放一切種種光明
法雲地#能受一切諸佛如來<br>大法明雨無厭足故|普受大雨，<br>無有盈溢#受佛智職，墮在佛數，<br>能為眾生廣作佛事|能隨王意雨眾寶物，<br>如眾生心充滿其願`.split('\n');
    buf.w('<h3>菩薩十地與海喻、大摩尼珠喻</h3>',
          '<table><tr><th>', '十地|菩薩行|海喻|菩薩事|大摩尼珠喻'.replaceAll('|', '</th><th>'), '</th></tr>');
    for (var i in a)
      buf.w('<tr><td style="color:brown">',
            a[i].replaceAll('|', '</td><td>').replaceAll('#', '</td><td style="color:#333399">'),
            '</td></tr>');
    this.setNamedText('菩薩十地:海喻珠喻', buf.render());
  }
  五十三參() {
    this.setNamedText('二十一念佛門',
`<h3>德雲比丘的二十一念佛門</h3>
<blockquote>　智光普照念佛門，常見一切諸佛國土種種宮殿悉嚴淨故<br>
令一切眾生念佛門，隨諸眾生心之所樂，皆令見佛得清淨故<br>
　令安住力念佛門，令入如來十力中故<br>
　令安住法念佛門，見無量佛，聽聞法故<br>
　照耀諸方念佛門，悉見一切諸世界中等無差別諸佛海故<br>
入不可見處念佛門，悉見一切微細境中諸佛自在神通事故<br>
　住於諸劫念佛門，一切劫中常見如來諸所施為無暫捨故<br>
　住一切時念佛門，於一切時常見如來，親近同住不捨離故<br>
　住一切剎念佛門，一切國土咸見佛身超過一切無與等故<br>
　住一切世念佛門，隨於自心之所欲樂普見三世諸如來故<br>
　住一切境念佛門，普於一切諸境界中見諸如來次第現故<br>
　　住寂滅念佛門，於一念中見一切剎一切諸佛示涅槃故<br>
　　住遠離念佛門，於一日中見一切佛從其所住而出去故<br>
　　住廣大念佛門，心常觀察一一佛身充遍一切諸法界故<br>
　　住微細念佛門，於一毛端有不可說如來出現，悉至其所而承事故<br>
　　住莊嚴念佛門，於一念中見一切剎皆有諸佛成等正覺現神變故<br>
　　住能事念佛門，見一切佛出現世間放智慧光轉法輪故<br>
　住自在心念佛門，知隨自心所有欲樂，一切諸佛現其像故<br>
　　住自業念佛門，知隨眾生所積集業，現其影像令覺悟故<br>
　　住神變念佛門，見佛所坐廣大蓮華周遍法界而開敷故<br>
　　住虛空念佛門，觀察如來所有身雲莊嚴法界、虛空界故</blockquote>`);
  }
  第十八品() {
    this.setDialogOL('第十八品:昇進之行', '菩薩昇進十行',
'菩薩摩訶薩已發一切智心，應離癡暗，精勤守護，無令放逸。應住十種法|菩薩摩訶薩復有十法，能令一切諸佛歡喜|復有十法，能令一切諸佛歡喜|有十種法，令諸菩薩速入諸地|諸菩薩初住地時，應善觀察；成就廣大功德，漸入佛地；能作無邊廣大佛事|有十種法，令諸菩薩所行清淨|菩薩既得行清淨已，復獲十種增勝法|菩薩有十種清淨願|菩薩住十種法，令諸大願皆得圓滿|菩薩滿足如是願時，即得十種無盡藏');
  }
  第三十三品() {
    this.setDialogOL('第三十三品:不思議法之一', '不思議法之一',
'諸佛世尊有無量住|諸佛世尊有十種法，普遍無量無邊法界|諸佛世尊有十種唸唸出生智|諸佛世尊有十種不失時|諸佛世尊有十種無比不思議境界|諸佛世尊能出生十種智|諸佛世尊有十種普入法|諸佛世尊有十種難信受廣大法|諸佛世尊有十種大功德，離過清淨|諸佛世尊有十種究竟清淨|諸佛世尊於一切世界、一切時，有十種佛事|諸佛世尊有十種無盡智海法|諸佛世尊有十種常法|諸佛世尊有十種演說無量諸佛法門|諸佛世尊有十種為眾生作佛事|諸佛世尊有十種最勝法|諸佛世尊有十種無障礙住|諸佛世尊有十種最勝無上莊嚴|諸佛世尊有十種自在法|諸佛世尊有十種無量不思議圓滿佛法|諸佛世尊有十種善巧方便');
    this.setDialogOL('第三十三品:不思議法之二', '不思議法之二',
'諸佛世尊有十種廣大佛事，無量無邊，不可思議|諸佛世尊有十種無二行自在法|諸佛世尊有十種住，住一切法|諸佛世尊有十種知一切法盡無有餘|諸佛世尊有十種力|諸佛世尊有十種大那羅延幢勇健法|諸佛世尊有十種決定法|諸佛世尊有十種速疾法|諸佛世尊有十種應常憶念清淨法|諸佛世尊有十種一切智住|諸佛世尊有十種無量不可思議佛三昧|諸佛世尊有十種無礙解脫');
  }
  第三十六品() {
    this.setDialogOL('第三十六品:菩薩摩訶薩修行', '菩薩摩訶薩修行',
'若諸菩薩於餘菩薩起瞋恚心，即成就百萬障門|諸菩薩摩訶薩欲疾滿足諸菩薩行，應勤修十種法|菩薩摩訶薩安住此十法已，則能具足十種清淨|菩薩摩訶薩住此十法已，則具足十種廣大智|菩薩摩訶薩住此十智已，則得入十種普入|菩薩摩訶薩如是觀察已，則住十種勝妙心|菩薩摩訶薩住此十種勝妙心已，則得十種佛法善巧智|菩薩摩訶薩聞此法已，咸應發心，恭敬受持');

    this.setDialogOL('第三十八品:二百問', '普慧菩薩二百問',
'何等為菩薩摩訶薩依？|何等為奇特想？|何等為行？|何等為善知識？|何等為勤精進？|何等為心得安隱？|何等為成就眾生？|何等為戒？|何等為自知受記？|何等為入菩薩？|何等為入如來？|何等為入眾生心行？|何等為入世界？|何等為入劫？|何等為說三世？|何等為入三世？|何等為發無疲厭心？|何等為差別智？|何等為陀羅尼？|何等為演說佛？|何等為發普賢心？|何等為普賢行法？|以何等故而起大悲？|何等為發菩提心因緣？|何等為於善知識起尊重心？|何等為清淨？|何等為諸波羅蜜？|何等為智隨覺？|何等為證知？|何等為力？|何等為平等？|何等為佛法實義句？|何等為說法？|何等為持？|何等為辯才？|何等為自在？|何等為無著性？|何等為平等心？|何等為出生智慧？|何等為變化？|何等為力持？|何等為得大欣慰？|何等為深入佛法？|何等為依止？|何等為發無畏心？|何等為發無疑惑心？|何等為不思議？|何等為巧密語？|何等為巧分別智？|何等為入三昧？|何等為遍入？|何等為解脫門？|何等為神通？|何等為明？|何等為解脫？|何等為園林？|何等為宮殿？|何等為所樂？|何等為莊嚴？|何等為發不動心？|何等為不捨深大心？|何等為觀察？|何等為說法？|何等為清淨？|何等為印？|何等為智光照？|何等為無等住？|何等為無下劣心？|何等為如山增上心？|何等為入無上菩提如海智？|何等為如寶住？|何等為發如金剛大乘誓願心？|何等為大發起？|何等為究竟大事？|何等為不壞信？|何等為授記？|何等為善根迴向？|何等為得智慧？|何等為發無邊廣大心？|何等為伏藏？|何等為律儀？|何等為自在？|何等為無礙用？|何等為眾生無礙用？|何等為剎無礙用？|何等為法無礙用？|何等為身無礙用？|何等為願無礙用？|何等為境界無礙用？|何等為智無礙用？|何等為神通無礙用？|何等為神力無礙用？|何等為力無礙用？|何等為遊戲？|何等為境界？|何等為力？|何等為無畏？|何等為不共法？|何等為業？|何等為身？|何等為身業？|何等為身？|何等為語？|何等為淨修語業？|何等為得守護？|何等為成辦大事？|何等為心？|何等為發心？|何等為周遍心？|何等為諸根？|何等為深心？|何等為增上深心？|何等為勤修？|何等為決定解？|何等為決定解入世界？|何等為決定解入眾生界？|何等為習氣？|何等為取？|何等為修？|何等為成就佛法？|何等為退失佛法道？|何等為離生道？|何等為決定法？|何等為出生佛法道？|何等為大丈夫名號？|何等為道？|何等為無量道？|何等為助道？|何等為修道？|何等為莊嚴道？|何等為足？|何等為手？|何等為腹？|何等為藏？|何等為心？|何等為被甲？|何等為器仗？|何等為首？|何等為眼？|何等為耳？|何等為鼻？|何等為舌？|何等為身？|何等為意？|何等為行？|何等為住？|何等為坐？|何等為臥？|何等為所住處？|何等為所行處？|何等為觀察？|何等為普觀察？|何等為奮迅？|何等為師子吼？|何等為清淨施？|何等為清淨戒？|何等為清淨忍？|何等為清淨精進？|何等為清淨定？|何等為清淨慧？|何等為清淨慈？|何等為清淨悲？|何等為清淨喜？|何等為清淨捨？|何等為義？|何等為法？|何等為福德助道具？|何等為智慧助道具？|何等為明足？|何等為求法？|何等為明了法？|何等為修行法？|何等為魔？|何等為魔業？|何等為捨離魔業？|何等為見佛？|何等為佛業？|何等為慢業？|何等為智業？|何等為魔所攝持？|何等為佛所攝持？|何等為法所攝持？|何等為住兜率天所作業？|何故於兜率天宮歿？|何故現處胎？|何等為現微細趣？|何故現初生？|何故現微笑？|何故示行七步？|何故現童子地？|何故現處內宮？|何故現出家？|何故示苦行？|云何往詣道場？|云何坐道場？|何等為坐道場時奇特相？|何故示降魔？|何等為成如來力？|云何轉法輪？|何故因轉法輪得白淨法？|何故如來、應、正等覺示般涅槃？');
  }
  第三十八品() {
    this.parseOLLists('第三十八品:', `
離世間法之一=菩薩摩訶薩有十種依|菩薩摩訶薩有十種奇特想|菩薩摩訶薩有十種行|菩薩摩訶薩有十種善知識|菩薩摩訶薩有十種勤精進|菩薩摩訶薩有十種心得安隱|菩薩摩訶薩有十種成就眾生|菩薩摩訶薩有十種戒|菩薩摩訶薩有十種受記法|菩薩摩訶薩有十種入|菩薩摩訶薩有十種入|菩薩摩訶薩有十種入眾生行|菩薩摩訶薩有十種入世界|菩薩摩訶薩有十種入劫|菩薩摩訶薩有十種說三世|菩薩摩訶薩有十種知三世|菩薩摩訶薩發十種無疲厭心|菩薩摩訶薩有十種差別智|菩薩摩訶薩有十種陀羅尼|菩薩摩訶薩說十種佛|菩薩摩訶薩發十種普賢心|菩薩摩訶薩有十種普賢行法|菩薩摩訶薩以十種觀眾生而起大悲|菩薩摩訶薩有十種發菩提心因緣|若菩薩發無上菩提心，為悟入一切智智故，親近供養善知識時，應起十種心|若菩薩摩訶薩起如是心，則得十種清淨|菩薩摩訶薩有十種波羅蜜|菩薩摩訶薩有十種智隨覺|菩薩摩訶薩有十種證知|菩薩摩訶薩有十種力|菩薩摩訶薩有十種平等|菩薩摩訶薩有十種佛法實義句|菩薩摩訶薩說十種法|菩薩摩訶薩有十種持|菩薩摩訶薩有十種辯才|菩薩摩訶薩有十種自在|菩薩摩訶薩有十種無著|菩薩摩訶薩有十種平等心|菩薩摩訶薩有十種出生智慧|菩薩摩訶薩有十種變化|菩薩摩訶薩有十種力持

離世間法之二=菩薩摩訶薩有十種大欣慰|菩薩摩訶薩有十種深入佛法|菩薩摩訶薩有十種依止，菩薩依此行菩薩行|菩薩摩訶薩有十種發無畏心|菩薩摩訶薩發十種無疑心|菩薩摩訶薩有十種不可思議|菩薩摩訶薩有十種巧密語|菩薩摩訶薩有十種巧分別智|菩薩摩訶薩有十種入三昧|菩薩摩訶薩有十種遍入|菩薩摩訶薩有十種解脫門|菩薩摩訶薩有十種神通|菩薩摩訶薩有十種明|菩薩摩訶薩有十種解脫|菩薩摩訶薩有十種園林|菩薩摩訶薩有十種宮殿|菩薩摩訶薩有十種所樂|菩薩摩訶薩有十種莊嚴|菩薩摩訶薩發十種不動心|菩薩摩訶薩有十種不捨深大心|菩薩摩訶薩有十種智慧觀察|菩薩摩訶薩有十種說法|菩薩摩訶薩有十種清淨|菩薩摩訶薩有十種印|菩薩摩訶薩有十種智光照|菩薩摩訶薩有十種無等住

離世間法之三=菩薩摩訶薩發十種無下劣心|菩薩摩訶薩於阿耨多羅三藐三菩提，有十種如山增上心|菩薩摩訶薩有十種入阿耨多羅三藐三菩提如海智|菩薩摩訶薩於阿耨多羅三藐三菩提，有十種如寶住|菩薩摩訶薩發十種如金剛大乘誓願心|菩薩摩訶薩有十種大發起|菩薩摩訶薩有十種究竟大事|菩薩摩訶薩有十種不壞信|菩薩摩訶薩有十種得授記|菩薩摩訶薩有十種善根迴向，菩薩由此能以一切善根悉皆迴向|菩薩摩訶薩有十種得智慧|菩薩摩訶薩有十種發無量無邊廣大心|菩薩摩訶薩有十種伏藏|菩薩摩訶薩有十種律儀|菩薩摩訶薩有十種自在

離世間法之四=菩薩摩訶薩有十種無礙用|菩薩摩訶薩有十種眾生無礙用|菩薩摩訶薩有十種國土無礙用|菩薩摩訶薩有十種法無礙用|菩薩摩訶薩有十種身無礙用|菩薩摩訶薩有十種願無礙用|菩薩摩訶薩有十種境界無礙用|菩薩摩訶薩有十種智無礙用|菩薩摩訶薩有十種神通無礙用|菩薩摩訶薩有十種神力無礙用|菩薩摩訶薩有十種力無礙用|菩薩摩訶薩有十種遊戲|菩薩摩訶薩有十種境界|菩薩摩訶薩有十種力|菩薩摩訶薩有十種無畏|菩薩摩訶薩有十種不共法|菩薩摩訶薩有十種業|菩薩摩訶薩有十種身|菩薩摩訶薩有十種身業|菩薩摩訶薩復有十種身|菩薩摩訶薩有十種語|菩薩摩訶薩有十種淨修語業|若菩薩摩訶薩以此十事淨修語業，則得十種守護|菩薩摩訶薩得此守護已，則能成辦十種大事|菩薩摩訶薩有十種心|菩薩摩訶薩有十種發心|菩薩摩訶薩有十種周遍心|菩薩摩訶薩有十種根|菩薩摩訶薩有十種深心|菩薩摩訶薩有十種增上深心|菩薩摩訶薩有十種勤修|菩薩摩訶薩有十種決定解|菩薩摩訶薩有十種決定解知諸世界|菩薩摩訶薩有十種決定解知眾生界

離世間法之五=菩薩摩訶薩有十種習氣|菩薩摩訶薩有十種取，以此不斷諸菩薩行|菩薩摩訶薩有十種修|菩薩摩訶薩有十種成就佛法|菩薩摩訶薩有十種退失佛法，應當遠離|菩薩摩訶薩有十種離生道|菩薩摩訶薩有十種決定法|菩薩摩訶薩有十種出生佛法道|菩薩摩訶薩有十種大丈夫名號|菩薩摩訶薩有十種道|菩薩摩訶薩有無量道、無量助道、無量修道、無量莊嚴道|菩薩摩訶薩有十種無量道|菩薩摩訶薩有十種無量助道|菩薩摩訶薩有十種無量修道|菩薩摩訶薩有十種莊嚴道|菩薩摩訶薩有十種足|菩薩摩訶薩有十種手|菩薩摩訶薩有十種腹|菩薩摩訶薩有十種藏|菩薩摩訶薩有十種心|菩薩摩訶薩有十種被甲|菩薩摩訶薩有十種器仗|菩薩摩訶薩有十種首|菩薩摩訶薩有十種眼|菩薩摩訶薩有十種耳|菩薩摩訶薩有十種鼻|菩薩摩訶薩有十種舌|菩薩摩訶薩有十種身|菩薩摩訶薩有十種意|菩薩摩訶薩有十種行|菩薩摩訶薩有十種住|菩薩摩訶薩有十種坐|菩薩摩訶薩有十種臥|菩薩摩訶薩有十種所住處|菩薩摩訶薩有十種所行處|菩薩摩訶薩有十種觀察|菩薩摩訶薩有十種普觀察|菩薩摩訶薩有十種奮迅|菩薩摩訶薩有十種師子吼

離世間法之六=菩薩摩訶薩有十種清淨施|菩薩摩訶薩有十種清淨戒|菩薩摩訶薩有十種清淨忍|菩薩摩訶薩有十種清淨精進|菩薩摩訶薩有十種清淨禪|菩薩摩訶薩有十種清淨慧|菩薩摩訶薩有十種清淨慈|菩薩摩訶薩有十種清淨悲|菩薩摩訶薩有十種清淨喜|菩薩摩訶薩有十種清淨捨|菩薩摩訶薩有十種義|菩薩摩訶薩有十種法|菩薩摩訶薩有十種福德助道具|菩薩摩訶薩有十種智慧助道具|菩薩摩訶薩有十種明足|菩薩摩訶薩有十種求法|菩薩摩訶薩有十種明了法|菩薩摩訶薩有十種修行法|菩薩摩訶薩有十種魔|菩薩摩訶薩有十種魔業|菩薩摩訶薩有十種捨離魔業|菩薩摩訶薩有十種見佛|菩薩摩訶薩有十種佛業|菩薩摩訶薩有十種慢業|若諸菩薩離此慢業，則得十種智業|菩薩摩訶薩有十種魔所攝持|若諸菩薩能棄捨此魔所攝持，則得十種佛所攝持|菩薩摩訶薩有十種法所攝持|菩薩摩訶薩住兜率天，有十種所作業|菩薩摩訶薩於兜率天將下生時，現十種事

離世間法之七=菩薩摩訶薩示現處胎，有十種事|菩薩摩訶薩有十種甚微細趣|菩薩摩訶薩有十種生|菩薩摩訶薩以十事故，示現微笑心自誓|菩薩摩訶薩以十事故，示行七步|菩薩摩訶薩以十事故，現處童子地|菩薩摩訶薩現童子地已，以十事故現處王宮|菩薩摩訶薩以十事故，示現出家|菩薩摩訶薩為十種事故，示行苦行|菩薩摩訶薩往詣道場有十種事|菩薩摩訶薩坐道場有十種事|菩薩摩訶薩坐道場時，有十種奇特未曾有事|菩薩摩訶薩坐道場時，觀十種義故，示現降魔|菩薩摩訶薩有十種成如來力|如來、應、正等覺轉大法輪有十種事|如來、應、正等覺轉法輪時，以十事故，於眾生心中種白淨法，無空過者|如來、應、正等覺作佛事已，觀十種義故，示般涅槃
`);
  }
  第四品() {
    this.parseOLLists('第四品:', `
世界海有十種事|十種事=起具因緣|所依住|形狀|體性|莊嚴|清淨|佛出興|劫住|劫轉變差別|無差別門

世界海已成現成當成之十種因緣|十種因緣=如來神力|法應如是|一切眾生行業|一切菩薩成一切智所得|一切眾生及諸菩薩同集善根|一切菩薩嚴淨國土願力|一切菩薩成就不退行願|一切菩薩清淨勝解自在|一切如來善根所流及一切諸佛成道時自在勢力|普賢菩薩自在願力

一一世界海有世界海微塵數所依住|所依住=依一切莊嚴住|依虛空住|依一切寶光明住|依一切佛光明住|依一切寶色光明住|依一切佛音聲住|依如幻業生大力阿脩羅形金剛手住|依一切世主身住|依一切菩薩身住|依普賢菩薩願所生一切差別莊嚴海住

世界海有種種差別形相|差別形相=圓|方|非圓方|無量差別|如水漩形|如山焰形|如樹形|如華形|如宮殿形|如眾生形|如佛形|……

世界海有種種體|種種體=以一切寶莊嚴為體|以一寶種種莊嚴為體|以一切寶光明為體|以種種色光明為體|以一切莊嚴光明為體|以不可壞金剛為體|以佛力持為體|以妙寶相為體|以佛變化為體|以日摩尼輪為體|以極微細寶為體|以一切寶焰為體|以種種香為體|以一切寶華冠為體|以一切寶影像為體|以一切莊嚴所示現為體|以一念心普示現境界為體|以菩薩形寶為體|以寶華蕊為體|以佛言音為體

世界海有種種莊嚴|種種莊嚴=以一切莊嚴具中出上妙雲莊嚴|以說一切菩薩功德莊嚴|以說一切眾生業報莊嚴|以示現一切菩薩願海莊嚴|以表示一切三世佛影像莊嚴|以一念頃示現無邊劫神通境界莊嚴|以出現一切佛身莊嚴|以出現一切寶香雲莊嚴|以示現一切道場中諸珍妙物光明照耀莊嚴|以示現一切普賢行願莊嚴|……

世界海有世界海微塵數清淨方便海|清淨方便海=諸菩薩親近一切善知識同善根故|增長廣大功德雲遍法界故|淨修廣大諸勝解故|觀察一切菩薩境界而安住故|修治一切諸波羅蜜悉圓滿故|觀察一切菩薩諸地而入住故|出生一切淨願海故|修習一切出要行故|入於一切莊嚴海故|成就清淨方便力故|……

世界海有世界海微塵數佛出現差別|佛出現差別=現小身|現大身|現短壽|現長壽|唯嚴淨一佛國土|有嚴淨無量佛土|唯顯示一乘法輪|有顯示不可思議諸乘法輪|現調伏少分眾生|示調伏無邊眾生|……

世界海有世界海微塵數劫住|劫住=有阿僧祇劫住|有無量劫住|有無邊劫住|有無等劫住|有不可數劫住|有不可稱劫住|有不可思劫住|有不可量劫住|有不可說劫住|……

世界海有世界海微塵數劫轉變差別|劫轉變差別=法如是故，世界海無量成壞劫轉變|染污眾生住故，世界海成染污劫轉變|修廣大福眾生住故，世界海成染淨劫轉變|信解菩薩住故，世界海成染淨劫轉變|無量眾生發菩提心故，世界海純清淨劫轉變|諸菩薩各各遊諸世界故，世界海無邊莊嚴劫轉變|十方一切世界海諸菩薩雲集故，世界海無量大莊嚴劫轉變|諸佛世尊入涅槃故，世界海莊嚴滅劫轉變|諸佛出現於世故，一切世界海廣博嚴淨劫轉變|如來神通變化故，世界海普清淨劫轉變|……

一一世界海中有世界海微塵數無差別|無差別=有世界海微塵數世界無差別|諸佛出現所有威力無差別|一切道場遍十方法界無差別|一切如來道場眾會無差別|一切佛光明遍法界無差別|一切佛變化名號無差別|一切佛音聲普遍世界海無邊劫住無差別|法輪方便無差別|一切世界海普入一塵無差別|一一微塵，一切三世諸佛世尊廣大境界皆於中現無差別`);
  }

} // end of My華嚴經Content.

createGP('華嚴經要解', CAT_經論) // 9010
.setStyle(AIL + BOLD)
.setMarkNames('ABC')
.setWidth(50)
.hasRightEdge()
.setTree(`
/b|《大方廣佛華嚴經》/
〇懸敘：毗盧法身為體。文殊妙智為用。普賢妙行為因。補處彌勒為果。依智斷習。習盡智圓
〇釋題：大方廣佛。平等佛性。標本智也。華嚴經者。本真德用。詮妙行也
〇科解
〇〇總論三科分具五位法門
〇〇〇因果周一：初會六品。〰〰乃佛自分五位因果。為舉果勸修見道分
〇〇〇因果周二：次三十二品。〰乃進修者五位因果。為設法治習修證分
〇〇〇因果周三：善財南遊始終。圓彰重諭五位因果。為去言依行圓彰法界分
〇〇〇利生常道：離世間品。〰〰同塵不染
〇〇〇佛果常道：入法界品。〰〰忘修絕證
〇/b3|序分/
〇〇/b|世主妙嚴品第一/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰【初會菩提場】〰/c339|▸卷第一/
〇〇〇菩提場成正覺地。佛處寶座。成最正覺
〇〇〇法會雲集。列四十類眾。表佛自身五位因果　/ail|（一切會衆，莫非菩薩化身）/
〇〇〇〇十聖衆表十信法　　/ail|普賢等十大普字菩薩為首/
〇〇〇〇十神衆表十住法　　/ail|異名菩薩。執金剛。身眾。足行。道場。主城。主地。主山。主林。主藥神/
〇〇〇〇十神衆表十行法　　/ail|主稼。主河。主海。主水。主火。主風。主空。主方。主夜。主晝神/
〇〇〇〇十聖衆表十回向法　/ail|脩羅。迦樓羅。緊那羅。摩侯羅伽。夜叉。天龍。鳩槃茶。乾闥婆。月天子。日天子衆/
〇〇〇〇十天主表十地法　　/ail|三十三。夜摩。兜率。化樂。他化。初禪大梵。二禪光音。三禪遍淨。四禪廣果。大自在天/
〇〇〇百二十天子頌讚十二部〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二/
〇〇〇百三十天龍八部王頌讚十三部〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三/
〇〇〇百四十神頌讚十四部〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四/
〇/b3|正宗分/
〇〇啟
〇〇〇/b|如來現相品第二/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六/
〇〇〇〇諸菩薩及一切世間主請法三十九問
〇〇〇〇〇十八種佛法〰/ail|佛之地？境界？加持？所行？力？無所畏？三昧？神通？自在？無能攝取？眼耳鼻舌身意？身光？光明？聲？智？/
〇〇〇〇〇十一種佛海〰/ail|世界、眾生、法、安立、佛、佛波羅蜜、佛解脫、佛變化、佛演說、佛名號、佛壽量海/
〇〇〇〇〇十種菩薩海〰/ail|誓願、發趣、助道、乘、行、出離、神通、波羅蜜、地、智海/
〇〇〇〇總答
〇〇〇〇〇現智境
〇〇〇〇〇〇如來於面門眾齒間放十種光，偈頌
〇〇〇〇〇〇華藏世界海外十方世界海，各有國土，共遣使者來禮佛供佛讚佛。佛放眉間毫相
〇〇〇〇〇〇十一摩訶薩偈頌
〇〇〇〇〇現行境。即後品是。
〇〇〇〇別答〰餘經是！
〇〇/b|普賢三昧品第三/〰〰〰〰〰/b3|現行境總答前問/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七/
〇〇〇普賢菩薩入一切諸佛毘盧遮那如來藏身菩薩三昧
〇〇〇普賢菩薩出此三昧。一切佛、一切菩薩讚歎
〇如來依正法門
〇〇/b|世界成就品第四/〰〰〰〰〰/b3|別答世界海眾生海之問/
〇〇〇普賢菩薩承一切如來威神力，具足宣說一切佛法
〇〇〇〇世界海有/see:第四品:十種事|十種事/
〇〇〇〇世界海已成現成當成之/see:第四品:十種因緣|十種因緣/
〇〇〇〇一一世界海有世界海微塵數/see:第四品:所依住|所依住/
〇〇〇〇世界海有種種/see:第四品:差別形相|差別形相/
〇〇〇〇世界海有/see:第四品:種種體|種種體/
〇〇〇〇世界海有/see:第四品:種種莊嚴|種種莊嚴/
〇〇〇〇世界海有世界海微塵數/see:第四品:清淨方便海|清淨方便海/
〇〇〇〇世界海有世界海微塵數/see:第四品:佛出現差別|佛出現差別/
〇〇〇〇世界海有世界海微塵數/see:第四品:劫住|劫住/
〇〇〇〇世界海有世界海微塵數/see:第四品:劫轉變差別|劫轉變差別/
〇〇〇〇一一世界海中有世界海微塵數/see:第四品:無差別|無差別/
〇〇/b|華藏世界品第五/〰〰〰〰〰/b3|別答佛海波羅蜜海之問/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第八/
〇〇/b|毘盧遮那品第六/〰〰〰〰〰/b3|明古先毗盧如來亦居華藏世界/〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第十一/
〇十信位
〇〇/b|如來名號品第七/〰〰〰〰〰/b3|示佛名跡隨法應機/〰〰〰〰〰〰〰〰〰〰【二會普光明殿】〰/c339|▸卷第十二/
〇〇/b|四聖諦品第八/〰〰〰〰〰〰/b3|示佛說法稱性應機/
〇〇/b|光明覺品第九/〰〰〰〰〰〰/b3|足放果光。表依果行因互相資發/〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第十三/
〇〇/b|菩薩問明品第十/〰〰〰〰〰/b3|文殊與九首菩薩互問答/
〇〇/b|淨行品第十一/〰〰〰〰〰〰/b3|廣發大願。為十信之行也/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第十四/
〇〇/b|賢首品第十二/〰〰〰〰〰〰/b3|示十信之證。明修進功德難量/
〇十住位
〇〇/b|昇須彌山頂品第十三/〰〰〰/b3|以處表法。於說十住/〰〰〰〰〰〰〰〰〰【三會忉利天宮】〰/c339|▸卷第十六/
〇〇/b|須彌頂上偈讚品第十四/〰〰/b3|法慧等十菩薩讚法。勸示昇進/
〇〇/b|十住品第十五/〰〰〰〰〰〰/b3|正說十住名義。發菩提心/
〇〇〇十住名義：
〇〇〇〇初發心住：〰此菩薩緣十種難得法而發於心；應勸學十法
〇〇〇〇治地住：〰〰此菩薩於諸眾生發十種心；應勸學十法
〇〇〇〇修行住：〰〰此菩薩以十種行觀一切法；應勸學十法
〇〇〇〇生貴住：〰〰此菩薩從聖教中生，成就十法；應勸學十法
〇〇〇〇具足方便住：此菩薩所修善根，皆為十種利益一切眾生；應勸學十法
〇〇〇〇正心住：〰〰此菩薩聞十種法，心定不動；應勸學十法
〇〇〇〇不退住：〰〰此菩薩聞十種法，堅固不退；應勸學十種廣大法
〇〇〇〇童真住：〰〰此菩薩住十種業；應勸學十法
〇〇〇〇王子住：〰〰此菩薩善知十種法；應勸學十法
〇〇〇〇灌頂住：〰〰此菩薩得成就十種智；應勸學諸佛十種智
〇〇/b|梵行品第十六/〰〰〰〰〰〰/b3|明十住中觀察十法。何梵何非/〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第十七/
〇〇〇應以十法為所緣作意觀察：身、身業、語、語業、意、意業、佛、法、僧、戒
〇〇〇應如是觀察〇〇/ail|何法名為梵行？梵行從何處來？誰之所有？體為是誰？由誰而作？為是有，為是無？為是色，為非色？/
!!〇〇〇〇〇〇〇〇〇/ail|為是受，為非受？為是想，為非想？為是行，為非行？為是識，為非識？/
〇〇〇得明清淨梵行〰/ail|如是觀察，梵行法不可得故，三世法皆空寂故，意無取著故，心無障礙故，所行無二故，/
!!〇〇〇〇〇〇〇〇〇/ail|方便自在故，受無相法故，觀無相法故，知佛法平等故，具一切佛法故，如是名為清淨梵行，得明清淨梵行/
〇〇/b|初發心功德品第十七/〰〰〰/b3|明修十住法所得功德不可稱量/
〇〇〇此人功德，唯佛能知，其餘一切無能量者
〇〇/b|明法品第十八/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第十八/
〇〇〇/see:第十八品:昇進之行|菩薩昇進十行/
〇十行位
〇〇/b|昇夜摩天宮品第十九/〰〰〰/b3|須夜摩說十行。表行依法空/〰〰〰〰〰〰【四會夜摩天宮】〰/c339|▸卷第十九/
〇〇/b|夜摩宮中偈讚品第二十/〰〰/b3|功德林等十菩薩讚顯當位之法/
〇〇〇功德林菩薩偈
〇〇〇慧〰林菩薩偈
〇〇〇勝〰林菩薩偈
〇〇〇無畏林菩薩偈
〇〇〇慚愧林菩薩偈
〇〇〇精進林菩薩偈
〇〇〇力〰林菩薩偈
〇〇〇行〰林菩薩偈
〇〇〇覺〰林菩薩偈
〇〇〇智〰林菩薩偈
〇〇/b|十行品第二十一/〰〰〰〰〰/b3|正說十行名義/
〇〇〇十行名義：
〇〇〇〇歡喜行
〇〇〇〇饒益行
〇〇〇〇無違逆行
〇〇〇〇無屈橈行
〇〇〇〇無癡亂行
〇〇〇〇善現行
〇〇〇〇無著行〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十/
〇〇〇〇難得行
〇〇〇〇善法行
〇〇〇〇真實行
〇〇/b|十無盡藏品第二十二/〰〰〰/b3|說信戒慚愧聞施慧念持辯十藏/〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十一/
〇〇〇十無盡藏：〰〰〰〰〰〰另，十種無盡法，令諸菩薩究竟成就無上菩提：
〇〇〇〇信藏〰〰〰〰〰〰〰〰〰〰饒益一切眾生故
〇〇〇〇戒藏〰〰〰〰〰〰〰〰〰〰以本願善迴向故
〇〇〇〇慚藏〰〰〰〰〰〰〰〰〰〰一切劫無斷絕故
〇〇〇〇愧藏〰〰〰〰〰〰〰〰〰〰盡虛空界悉開悟心無限故
〇〇〇〇聞藏〰〰〰〰〰〰〰〰〰〰迴向有為而不著故
〇〇〇〇施藏〰〰〰〰〰〰〰〰〰〰一念境界一切法無盡故
〇〇〇〇慧藏〰〰〰〰〰〰〰〰〰〰大願心無變異故
〇〇〇〇念藏〰〰〰〰〰〰〰〰〰〰善攝取諸陀羅尼故
〇〇〇〇持藏〰〰〰〰〰〰〰〰〰〰一切諸佛所護念故
〇〇〇〇辯藏〰〰〰〰〰〰〰〰〰〰了一切法皆如幻故
〇十向位
〇〇/b|昇兜率天宮品第二十三/〰〰/b3|於兜率說十回向。回真向俗回智向悲/〰〰【五會兜率天宮】〰/c339|▸卷第二十二/
〇〇/b|兜率宮中偈讚品第二十四/〰/b3|金剛幢等十菩薩讚顯當位之法/〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十三/
〇〇/b|十迴向品第二十五/〰〰〰〰/b3|正說十向名義/
〇〇〇菩薩摩訶薩十迴向：
〇〇〇〇救護一切眾生離眾生相迴向
〇〇〇〇不壞迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十四/
〇〇〇〇等一切諸佛迴向
〇〇〇〇至一切處迴向
〇〇〇〇無盡功德藏迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十五/
〇〇〇〇入一切平等善根迴向
〇〇〇〇等隨順一切眾生迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第二十九/
〇〇〇〇真如相迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十/
〇〇〇〇無縛無著解脫迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十一/
〇〇〇〇入法界無量迴向〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十二/
〇十地位
〇〇/b|十地品第二十六/〰〰〰〰〰/b3|一切佛法依此發生。故謂之地/〰〰〰〰【六會他化自在天】〰/c339|▸卷第三十四/
〇〇〇菩薩摩訶薩十智地：應衆復請，金剛藏菩薩具說
〇〇〇〇/b|第一歡喜地/
〇〇〇〇〇起心〰/ail|大悲為首，智慧增上，善巧方便所攝，最上深心所持；能受一切佛法，以智慧教化廣大如法界，究竟如虛空，盡未來際/
〇〇〇〇〇發/see:初地:十願門|十大願/
〇〇〇〇〇成就十種淨諸地法〰/ail|信、悲、慈、捨、無有疲厭、知諸經論、善解世法、慚愧堅固力、供養諸佛、依教修行/
〇〇〇〇〇住此歡喜地已
〇〇〇〇〇〇以大願力得見多佛。/ail|悉以大心、深心，恭敬尊重，承事供養，皆悉迴向無上菩提/
〇〇〇〇〇〇十波羅蜜中/b1|檀波羅蜜/增上/ail|；餘波羅蜜非不修行，但隨力隨分/
〇〇〇〇〇〇應從諸佛菩薩善知識所推求請問〰/ail|於此地中相及得果，乃至第十地中相及得果/
〇〇〇〇〇〇多作/b1|閻浮提王/〰/ail|豪貴自在，常護正法，能以大施攝取眾生，善除眾生慳貪之垢，常行大施無有窮盡/
〇〇〇〇〇〇依教出家學道精進〰/ail|於一念頃，得百三昧，得見百佛，知百佛神力，能動百佛世界、過百佛世界、照百佛世界、/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|教化百世界眾生、住壽百劫、知前後各百劫事、入百法門、示現百身、於一一身示百菩薩以為眷屬；/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|若以菩薩殊勝願力自在示現，過於是數，百劫、千劫、百千劫，乃至百千億那由他劫不能數知/
〇〇〇〇/b|第二離垢地/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十五/
〇〇〇〇〇當起十深心，得入離垢地〰/ail|正直心、柔軟心、堪能心、調伏心、寂靜心、純善心、不雜心、無顧戀心、廣心、大心/
〇〇〇〇〇性自護持十善業道；離邪見住正道，於佛法僧起決定信
〇〇〇〇〇護持上品十善業道成就。遠離十不善道
〇〇〇〇〇〇成/b1|聲聞乘/〰〰〰/ail|以智慧修習，心狹劣故，怖三界故，闕大悲故，從他聞聲而解了故/
〇〇〇〇〇〇成/b1|獨覺乘/〰〰〰/ail|不從他教，自覺悟故，大悲方便不具足故，悟解甚深因緣法故/
〇〇〇〇〇〇成/b1|菩薩廣大行/〰/ail|心廣無量故，具足悲愍故，希求諸佛大智故，淨治菩薩諸地故，淨修一切諸度故/
〇〇〇〇〇〇成就/b1|一切佛法/〰/ail|一切種清淨故，乃至證十力、四無畏故/
〇〇〇〇〇護持於戒，於/see:二地:為眾生|一切眾生增長慈悲心/〰/ail|生利益心、安樂心、慈心、悲心、憐愍心、攝受心、守護心、自己心、師心、大師心/
〇〇〇〇〇住此離垢地已
〇〇〇〇〇〇以願力故得見多佛。/ail|以廣大心、深心，恭敬尊重，承事供養，迴向阿耨菩提。更受行十善道法，乃至菩提，終不忘失/
〇〇〇〇〇〇/b1|於無量百千億那由他劫/，遠離慳嫉破戒垢故，佈施、持戒清淨滿足
〇〇〇〇〇〇四攝法中/b1|愛語/偏多；十波羅蜜中/b1|持戒/偏多/ail|；餘非不修行，但隨力隨分/
〇〇〇〇〇〇多作/b1|轉輪聖王/〰/ail|為大法主，具足七寶，有自在力，能除一切眾生慳貪破戒垢，以善方便令其安住十善道中；/
!!〇〇〇〇〇〇/ail|為大施主，周給無盡。佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛、法、僧，乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇依教出家學道精進〰/ail|於一念頃，得千三昧，得見千佛，知千佛神力，能動千世界，乃至能示現千身，/
!!〇〇〇〇〇〇/ail|於一一身能示現千菩薩以為眷屬；若以菩薩殊勝願力自在示現，過於是數，百劫、千劫乃至百千億那由他劫不能數知/
〇〇〇〇/b|第三發光地/
〇〇〇〇〇欲入第三地，當起十深心〰/ail|清淨心、安住心、厭捨心、離貪心、不退心、堅固心、明盛心、勇猛心、廣心、大心/
〇〇〇〇〇觀一切有為法如實相〰/ail|無常、苦、不淨、不安隱，敗壞、不久住，剎那生滅，非從前際生，非向後際去，非於現在住/
!!〇〇〇〇又觀此法/ail|無救無依，與憂與悲，苦惱同住，愛憎所繫，愁慼轉多，無有停積，貪恚癡火熾然不息，眾患所纏，日夜增長，如幻不實/
〇〇〇〇〇見眾生界無量苦惱，於一切眾生生/see:三地:哀愍眾生心|十種哀愍心/。發大精進，倍於正法勤求修習
〇〇〇〇〇住此發光地時
〇〇〇〇〇〇離欲惡不善法，有覺有觀，離生喜樂，/b1|住初禪/
〇〇〇〇〇〇滅覺觀，內淨一心，無覺無觀，定生喜樂，/b1|住第二禪/
〇〇〇〇〇〇離喜住捨，有念正知，身受樂，諸聖所說能捨有念受樂，/b1|住第三禪/
〇〇〇〇〇〇斷樂先除，苦喜憂滅，不苦不樂，捨念清淨，/b1|住第四禪/
〇〇〇〇〇〇超一切色想，滅有對想，不念種種想，入無邊虛空，/b1|住虛空無邊處/
〇〇〇〇〇〇超一切虛空無邊處，入無邊識，/b1|住識無邊處/
〇〇〇〇〇〇超一切識無邊處，入無少所有，/b1|住無所有處/
〇〇〇〇〇〇超一切無所有處，/b1|住非有想非無想處/
〇〇〇〇〇〇得/see:三地:神通力|無量神通力/
〇〇〇〇〇住此發光地已
〇〇〇〇〇〇以願力故得見多佛。/ail|悉以廣大心、深心，恭敬尊重，承事供養，迴向阿耨菩提。於其佛所，恭敬聽法，聞已受持，隨力修行/
〇〇〇〇〇〇/b1|於無量百千億那由他劫/不積集故，邪貪、邪瞋及以邪癡，悉得除斷，所有善根轉更明淨
〇〇〇〇〇〇於四攝中，/b1|利行/偏多；十波羅蜜中，/b1|忍波羅蜜/偏多/ail|；餘非不修，但隨力隨分/
〇〇〇〇〇〇多作/b1|三十三天王/〰/ail|能以方便，令諸眾生捨離貪慾。佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛、法、僧，/
!!〇〇〇〇〇〇/ail|乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇若勤行精進，/ail|於一念頃，得百千三昧，得見百千佛，知百千佛神力，能動百千佛世界，乃至示現百千身，/
!!〇〇〇〇〇〇/ail|一一身百千菩薩以為眷屬；若以菩薩殊勝願力自在示現，過於此數，百劫、千劫乃至百千億那由他劫不能數知/
〇〇〇〇/b|第四焰慧地/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十六/
〇〇〇〇〇欲入第四地，當修行/see:四地:智成熟法|十法明門/
〇〇〇〇〇能以十種/see:四地:智成熟法|智成熟法/故，得彼內法，生如來家
〇〇〇〇〇精行修習三十七道品〰/ail|為不捨一切眾生故，本願所持故，大悲為首故，大慈成就故，思念一切智智故，成就莊嚴佛土故，/
!!〇〇〇〇〇/ail|成就如來力、無所畏、不共佛法、相好音聲悉具足故，求於上上殊勝道故，隨順所聞甚深佛解脫故，思惟大智善巧方便故/
〇〇〇〇〇住此焰慧地
〇〇〇〇〇〇以願力故，得見多佛。/ail|皆恭敬尊重，承事供養，迴向阿耨菩提。於彼佛所，恭敬聽法，聞已受持，具足修行/
〇〇〇〇〇〇復於彼出家，又更修治深心信解，/b1|經於百、千劫，無量百千億那由他劫/，令諸善根轉復明淨
〇〇〇〇〇〇於四攝中，/b1|同事/偏多；十波羅蜜中，/b1|精進/偏多/ail|；餘非不修，但隨力隨分/
〇〇〇〇〇〇多作/b1|須夜摩天王/〰/ail|以善方便能除眾生身見等惑，令住正見。佈施、愛語、利行、同事——如是一切諸所作業，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|皆不離念佛、法、僧，乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇若發勤精進〰/ail|於一念頃，得入億數三昧，得見億數佛，得知億數佛神力，能動億數世界，乃至能示現億數身，/
!!〇〇〇〇〇〇〇〇〇〇〇/ail|一一身億數菩薩以為眷屬；若以菩薩殊勝願力自在示現，過於此數，百劫、千劫乃至百千億那由他劫不能數知/
〇〇〇〇/b|第五難勝地/
〇〇〇〇〇欲入第五地，當以/see:五地:十種平等清淨心|十種平等清淨心/趣入
〇〇〇〇〇得諸諦智，/ail|如實知四聖諦、俗諦，第一義諦，相諦，差別諦，成立諦，事諦，生諦，盡無生諦，入道智諦，/
!!〇〇〇〇〇〇〇〇〇/ail|一切菩薩地次第成就諦，乃至如來智成就諦/
〇〇〇〇〇〇如實知一切有為法虛妄、詐偽、誑惑愚夫已，則於諸眾生轉增大悲，生大慈光明
〇〇〇〇〇菩薩摩訶薩住此第五難勝地，得/see:五地:種種名|種種名/
〇〇〇〇〇住此難勝地
〇〇〇〇〇〇以願力故，得見多佛。/ail|悉恭敬尊重，承事供養，迴向阿耨菩提。於諸佛所，恭敬聽法，聞已受持，隨力修行/
〇〇〇〇〇〇復於彼出家，更聞法得陀羅尼。/b1|經於百、千劫，乃至無量百千億那由他劫/，所有善根轉更明淨
〇〇〇〇〇〇十波羅蜜中，/b1|禪波羅蜜/偏多/ail|；餘非不修，但隨力隨分/
〇〇〇〇〇〇多作/b1|兜率陀天王/〰/ail|於諸眾生所作自在，摧伏一切外道邪見，能令眾生住實諦中。佈施、愛語、利行、同事——/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|如是一切諸所作業，皆不離念佛、法、僧，乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇若發勤精進，/ail|於一念頃，得千億三昧，見千億佛，知千億佛神力，能動千億佛世界，乃至示現千億身，一一身示/
!!〇〇〇〇〇〇〇〇〇〇〇/ail|千億菩薩以為眷屬；若以菩薩殊勝願力自在示現，過於此數，百劫、千劫乃至百千億那由他劫不能數知/
〇〇〇〇/b|第六現前地/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十七/
〇〇〇〇〇欲入第六地，當觀察/see:六地:十平等法|十平等法/
〇〇〇〇〇〇如是觀一切法自性清淨，隨順無違，得入第六現前地，得明利隨順忍，未得無生法忍
〇〇〇〇〇〇以十種相觀諸緣起
〇〇〇〇〇〇〇知無我、無人、無壽命、自性空、無作者、無受者，即得/b1|空解脫門/現在前
〇〇〇〇〇〇〇觀諸有支皆自性滅，畢竟解脫，無有少法相生，即時得/b1|無相解脫門/現在前
〇〇〇〇〇〇〇如是入空、無相已，無有願求，唯除大悲為首，教化眾生，即時得/b1|無願解脫門/現在前
〇〇〇〇〇〇〇如是修三解脫門，離彼、我想，離作者、受者想，離有、無想
〇〇〇〇〇〇如是觀察有為多諸過患，無有自性，恆起大悲，即得/b1|般若波羅蜜/現前，名/b1|無障礙智光明/
〇〇〇〇〇〇住此現前地
〇〇〇〇〇〇〇得/see:六地:十空三昧門|十空三昧門/
〇〇〇〇〇〇〇得如是十空三昧門為首，百千空三昧皆悉現前
〇〇〇〇〇〇〇如是十無相、十無願三昧門為首，百千無相、無願三昧門皆悉現前
〇〇〇〇〇〇〇更修習/ail|滿足不可壞心、決定心、純善心、甚深心、不退轉心、不休息心、廣大心、無邊心、求智心、方便慧相應心，皆悉圓滿/
〇〇〇〇〇〇以願力故，得見多佛。/ail|悉以廣大心、深心，供養恭敬，尊重讚歎，迴向阿耨菩提。於諸佛所，恭敬聽法，聞已受持，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|得如實三昧智慧光明，隨順修行，憶持不捨/
〇〇〇〇〇〇又得諸佛甚深法藏，/b1|經於百、千劫，乃至無量百千億那由他劫/，所有善根轉更明淨
〇〇〇〇〇〇多作/b1|善化天王/所〰/ail|作自在，一切聲聞所有問難無能退屈，能令眾生除滅我慢、深入緣起。/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇若勤行精進，/ail|於一念頃，得百千億三昧，乃至示現百千億菩薩以為眷屬；/
!!〇〇〇〇〇〇〇〇〇〇〇/ail|若以願力自在示現，過於此數，乃至百千億那由他劫不能數知/
〇〇〇〇/b|第七遠行地/
〇〇〇〇〇欲入第七地，當修/see:七地:十種方便慧起殊勝道|十種方便慧起殊勝道/
〇〇〇〇〇住此第七地已，入/see:七地:無量如來境界|無量如來境界/
〇〇〇〇〇〇菩薩以深智慧如是觀察，常勤修習方便慧起殊勝道，安住不動，無一念休息廢捨，乃至睡夢
〇〇〇〇〇〇於唸唸中，常能具足十波羅蜜
〇〇〇〇〇菩薩於十地中皆能滿足菩提分法，然第七地最為殊勝
〇〇〇〇〇〇菩薩從初地乃至第七地，成就智功用分。以此力故
〇〇〇〇〇〇從第八地乃至第十地，無功用行皆悉成就
〇〇〇〇〇菩薩諸地，有雜染行，有清淨行
〇〇〇〇〇〇初地至於七地，/ail|乘波羅蜜乘遊行世間，知諸世間煩惱過患，以乘正道故，不為煩惱過失所染，然未名為超煩惱行/
〇〇〇〇〇〇從第七地入第八地，/ail|若捨一切有功用行，乘菩薩清淨乘遊行世間，知煩惱過失不為所染，乃名超煩惱行，以得一切盡超過故/
〇〇〇〇〇〇第七地菩薩，/ail|不名有、不名無煩惱者，盡超過多貪等諸煩惱眾住此地。一切煩惱不現行故不名有；求如來智心未滿故不名無/
〇〇〇〇〇住此第七地已
〇〇〇〇〇〇以深淨心，成就身業、語業、意業。所有一切不善業道皆已捨離，一切善業常善修行
〇〇〇〇〇〇世間所有經書、技術，如五地中說，皆自然而行，不假功用
〇〇〇〇〇〇於三千大千世界中為大明師，唯除如來及八地已上其餘菩薩深心妙行無與等者
〇〇〇〇〇〇諸禪三昧、三摩缽底、神通解脫皆得現前（然是修成，非如八地報得成就）
〇〇〇〇〇〇於唸唸中具足修習方便智力及一切菩提分法，轉勝圓滿
〇〇〇〇〇〇入種種/see:七地:具足大智神通門百萬三昧|具足大智神通門百萬三昧/，淨治此地
〇〇〇〇〇〇此三昧，善治淨方便慧故，大悲力故，超過二乘地，得/b1|觀察智慧地/
〇〇〇〇〇〇善淨無量身、語、意業無相行，得/b1|無生法忍/光明
〇〇〇〇〇〇〇菩薩從第六地來，能入滅定
〇〇〇〇〇〇〇今住此地，能唸唸入，亦唸唸起，而不作證
〇〇〇〇〇〇〇故此菩薩名為：成就不可思議身、語、意業，行於實際而不作證
〇〇〇〇〇〇此菩薩得如是三昧智力，以大方便，雖示現生死，而恆住涅槃
〇〇〇〇〇〇〇雖眷屬圍遶，而常樂遠離
〇〇〇〇〇〇〇雖以願力三界受生，而不為世法所染
〇〇〇〇〇〇〇雖常寂滅，以方便力而還熾然，雖然不燒
〇〇〇〇〇〇〇雖隨順佛智，而示入聲聞、辟支佛地
〇〇〇〇〇〇〇雖得佛境界藏，而示住魔境界
〇〇〇〇〇〇〇雖超魔道，而現行魔法
〇〇〇〇〇〇〇雖示同外道行，而不捨佛法
〇〇〇〇〇〇〇雖示隨順一切世間，而常行一切出世間法
〇〇〇〇〇〇〇所有一切莊嚴之事，出過一切天龍八部、天王等之所有者，而不捨離樂法之心
〇〇〇〇〇菩薩成就如是智慧，住遠行地，以願力故，得見多佛。/ail|以廣大心、增勝心，供養恭敬，尊重讚歎，迴向阿耨菩提。/
!!〇〇〇〇〇〇/ali|復於佛所恭敬聽法，聞已受持，獲如實三昧智慧光明，隨順修行/
〇〇〇〇〇〇/b1|如是經無量百千億那由他劫/，所有善根轉更增勝
〇〇〇〇〇〇十波羅蜜中，/b1|方便波羅蜜/偏多/ail|；餘非不行，但隨力隨分/
〇〇〇〇〇〇多作/b1|自在天王/〰/ail|善為眾生說證智法，令其證入。佈施、愛語、利行、同事——如是一切諸所作業，/
!!〇〇〇〇〇〇〇〇〇〇〇〇/ail|皆不離念佛，乃至不離念具足一切種、一切智智/
〇〇〇〇〇〇若發勤精進，/ail|得百千億那由他三昧，乃至示現百千億那由他菩薩以為眷屬；/
!!〇〇〇〇〇〇〇〇〇〇〇/ail|若以菩薩殊勝願力自在示現，過於此數，乃至百千億那由他劫不能數知/
〇〇〇〇/b|第八不動地/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十八/
〇〇〇〇〇菩薩成就無生法忍，即時得入第八不動地/ail|，為深行菩薩難可知無差別/
!!〇〇〇〇〇/ail|離一切相、一切想、一切執著，無量無邊，一切聲聞、辟支佛所不能及，離諸諠諍，寂滅現前/
〇〇〇〇〇諸佛世尊與此菩薩無量起智門，令其能起無量無邊差別智業
!!〇〇〇〇〇/ail|若諸佛不與此菩薩起智門者，彼時即入究竟涅槃，棄捨一切利眾生業/
〇〇〇〇〇〇以是故，於一念頃所生智業，從初發心乃至七地所修諸行，無可為比
〇〇〇〇〇住此地已
〇〇〇〇〇〇以大方便善巧智所起無功用覺慧，觀一切智智所行境，皆如實知
〇〇〇〇〇〇隨諸眾生身心信解種種差別，於彼佛國眾會之中而現其身施以教化
〇〇〇〇〇〇遠離一切身想分別，住於平等
〇〇〇〇〇〇菩薩成就/see:八地:身智|如是身智/已，得/see:八地:十自在故|十自在/，則為不思議智者、無量智者、廣大智者、無能壞智者
〇〇〇〇〇〇身、語、意業諸有所作，皆能積集一切佛法
〇〇〇〇〇〇得/see:八地:智力|如是智力/，能現一切諸所作事，於諸事中無有過咎
〇〇〇〇〇此地又有/see:八地:別名|別名/
〇〇〇〇〇住此不動地已，以三昧力，常得現見無量諸佛，恆不捨離承事供養，恭敬尊重，承事供養
〇〇〇〇〇〇於諸佛所得於如來甚深法藏，受世界差別等無量法明；若有問難世界差別如是等事，無能屈者
〇〇〇〇〇〇如是經於/b1|無量百劫、千劫，乃至無量百千億那由他劫/，所有善根轉增明淨
〇〇〇〇〇〇十波羅蜜中，/b1|願波羅蜜/增上/ail|；餘波羅蜜非不修行，但隨力隨分/
〇〇〇〇〇〇多作/b1|大梵天王，主千世界//ail|，最勝自在，善說諸義，能與聲聞、辟支佛、諸菩薩波羅蜜道/
!!〇〇〇〇〇〇/ail|若有問難世界差別，無能退屈。佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念一切種、一切智智/
〇〇〇〇/b|第九善慧地/
〇〇〇〇〇菩薩摩訶薩/ail|以如是無量智思量觀察，欲更求轉勝寂滅解脫，復修習如來智慧，入如來祕密法，觀察不思議大智性，淨諸陀羅尼/
!!〇〇〇〇〇/ail|三昧門，具廣大神通，入差別世界，修力、無畏、不共法，隨諸佛轉法輪，不捨大悲本願力，/得入菩薩第九善慧地
〇〇〇〇〇住此地已
〇〇〇〇〇〇了知眾生諸行差別，教化調伏，令得解脫
〇〇〇〇〇〇善能演說聲聞乘法、獨覺乘法、菩薩乘法、如來地法；令生信解，增益智慧，各於其乘而得解脫
〇〇〇〇〇〇常隨四無礙（法、義、辭、樂說）智轉，無暫捨離
〇〇〇〇〇〇晝夜專勤更無餘念，唯入佛境界親近如來，入諸菩薩甚深解脫，常在三昧
〇〇〇〇〇〇恆見諸佛，未曾捨離/ail|，恭敬尊重，承事供養，於諸佛所種種問難，得說法陀羅尼，所有善根轉更明淨/
〇〇〇〇〇〇十波羅蜜中，/b1|力波羅蜜/最勝/ail|；餘波羅蜜非不修行，但隨力隨分/
〇〇〇〇〇〇多作/b1|二千世界主大梵天王/〰/ail|善能統理，自在饒益，能為一切聲聞、緣覺及諸菩薩分別演說波羅蜜行；/
!!〇〇〇〇〇〇/ail|隨眾生心，所有問難無能屈者。佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念一切種、一切智智/
〇〇〇〇/b|第十法雲地/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第三十九/
〇〇〇〇〇菩薩摩訶薩從初地乃至第九地，增長大福德智慧，得/b1|一切種、一切智智受職位/
〇〇〇〇〇〇即得百萬阿僧祇三昧皆現在前
〇〇〇〇〇〇其最後三昧，名/b1|受一切智勝職位/
〇〇〇〇〇〇〇此三昧現在前時，有大寶蓮華忽然出生。菩薩坐此華座，身相大小正相稱可
〇〇〇〇〇〇〇無量菩薩以為眷屬，各坐其餘蓮華之上，周匝圍遶，一一各得百萬三昧，向大菩薩一心瞻仰
〇〇〇〇〇〇〇菩薩摩訶薩放大光明，向十方世界顯示大神通。
〇〇〇〇〇〇〇十方一切諸佛從眉間出清淨光明，名增益一切智神通，
〇〇〇〇〇〇〇〇種種莊嚴事現已，從大菩薩頂上入，名為/b1|受職/，是名/b1|菩薩受大智職/
〇〇〇〇〇〇〇菩薩以此大智職故，能行無量百千萬億那由他難行之行，增長無量智慧功德，名為/b2|安住法雲地/
〇〇〇〇〇住此法雲地
〇〇〇〇〇〇一切諸佛所有智慧廣大無量，此地菩薩皆能得入
〇〇〇〇〇〇無量百千阿僧祇三昧門、無量百千阿僧祇陀羅尼門、無量百千阿僧祇神通門，皆悉成就
〇〇〇〇〇〇十方無量諸佛所有無量大法明、大法照、大法雨，於一念頃皆能安、能受、能攝、能持
〇〇〇〇〇〇智慧明達，神通自在
〇〇〇〇〇金剛藏菩薩即入/b1|一切佛國土體性三昧/，以作示現
〇〇〇〇〇此菩薩住如是智慧，不異如來身、語、意業，不捨菩薩諸三昧力，
〇〇〇〇〇〇於無數劫承事供養一切諸佛，一一劫中以一切種供養之具而為供養
〇〇〇〇〇〇一切諸佛神力所加，智慧光明轉更增勝，於法界中所有問難善為解釋，百千億劫無能屈者
〇〇〇〇〇十波羅蜜中，/b1|智波羅蜜/最為增上/ail|；餘波羅蜜非不修行/
〇〇〇〇〇多作/b1|摩醯首羅天王/〰/ail|，於法自在，能授眾生、聲聞、獨覺、一切菩薩波羅蜜行，於法界中所有問難無能屈者。/
!!〇〇〇〇〇/ail|佈施、愛語、利行、同事——如是一切諸所作業，皆不離念佛，乃至不離念具足一切種、一切智智/
〇〇〇菩薩十地，因佛智故而有差別，如因大地有/see:菩薩十地:如十山王|十山王/。又有/see:菩薩十地:海喻珠喻|海喻和大摩尼珠喻/
〇〇〇聞此法門所得福德：/b1|如一切智所集福德/
〇〇〇金剛藏菩薩言畢，佛神力故，法如是故
〇〇〇〇十方各有十億佛剎微塵數世界
〇〇〇〇〇/see:十八相動|六種十八相動/
〇〇〇〇〇雨眾天華、天鬘、天衣，及諸天寶莊嚴之具、幢幡、繒蓋
〇〇〇〇〇奏天妓樂，其音和雅，同時發聲，讚/b1|一切智地所有功德/
〇〇〇〇〇十方所有一切世界他化自在天王宮俱演說此法
〇〇〇〇十方各十億佛剎微塵數世界之外
〇〇〇〇〇十億佛剎微塵數菩薩而來此會，向金剛藏菩薩求法
〇十一地〰〰〰〰〰〰〰〰〰〰/b3|菩薩出離海。等覺位也/〰〰〰〰〰〰〰〰〰〰〰【三禪天】〰 （梵文未來）
〇佛果位
〇〇/b|十定品第二十七/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰【七再會重普光殿】〰/c339|▸卷第四十/
〇〇〇菩薩摩訶薩所住普賢行十大三昧：
〇〇〇〇普光大三昧
〇〇〇〇妙光大三昧
〇〇〇〇次第遍往諸佛國土大三昧〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十一/
〇〇〇〇清淨深心行大三昧
〇〇〇〇知過去莊嚴藏大三昧
〇〇〇〇智光明藏大三昧
〇〇〇〇了知一切世界佛莊嚴大三昧
〇〇〇〇眾生差別身大三昧〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十二/
〇〇〇〇法界自在大三昧
〇〇〇〇無礙輪大三昧〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十三/
〇〇/b|十通品第二十八/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十四/
〇〇〇菩薩摩訶薩十通：
〇〇〇〇他心智通
〇〇〇〇無礙清淨天眼智通
〇〇〇〇宿住隨念智通
〇〇〇〇知盡未來際劫智通
〇〇〇〇無礙清淨天耳
〇〇〇〇住無體性無動作往一切佛剎智神通
〇〇〇〇善分別一切言辭智神通
〇〇〇〇無數色身智神通
〇〇〇〇一切法智神通
〇〇〇〇入一切法滅盡三昧智神通
〇〇〇若菩薩摩訶薩住此神通，悉得一切三世無礙智神通
〇〇/b|十忍品第二十九/
〇〇〇菩薩摩訶薩十忍：
〇〇〇〇音聲忍
〇〇〇〇順忍
〇〇〇〇無生法忍
〇〇〇〇如幻忍
〇〇〇〇如焰忍
〇〇〇〇如夢忍
〇〇〇〇如響忍
〇〇〇〇如影忍
〇〇〇〇如化忍
〇〇〇〇如空忍
〇〇/b|阿僧祇品第三十/〰〰〰〰〰/b3|佛說數量之義/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十五/
〇〇/b|壽量品第三十一/〰〰〰〰〰/b3|心王菩薩摩訶薩吿不同世界的時間尺度不同/
〇〇/b|諸菩薩住處品第三十二/〰〰/b3|菩薩不捨世間，舉八方，若山若海，皆有聖居，無所不遍/
〇〇/b|佛不思議法品第三十三/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十六/
〇〇〇/see:第三十三品:不思議法之一|不思議法之一/〰C
〇〇〇/see:第三十三品:不思議法之二|不思議法之二/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十七/
〇〇/b|如來十身相海品第三十四/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十八/
〇〇〇如來有九十七大人相
〇〇/b|如來隨好光明功德品第三十五/
〇〇/b|普賢行品第三十六/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第四十九/
〇〇〇/see:第三十六品:菩薩摩訶薩修行|菩薩摩訶薩修行/
〇〇/b|如來出現品第三十七/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十/
〇〇〇如來以十無量百千阿僧祇事而出現得成就
〇〇〇如來、應、正等覺出現十相
〇〇〇如來身十相
〇〇〇如來音聲十相〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十一/
〇〇〇如來心十相
〇〇〇菩薩摩訶薩應云何知如來、應、正等覺境界？〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十二/
〇〇〇菩薩摩訶薩應云何知如來、應、正等覺行？
〇〇〇菩薩摩訶薩應云何知如來、應、正等覺成正覺？
〇〇〇菩薩摩訶薩應云何知如來、應、正等覺轉法輪？
〇〇〇菩薩摩訶薩欲知如來所轉法輪，何等為如來法輪所出生處？
〇〇〇菩薩摩訶薩應云何知於如來、應、正等覺見聞親近所種善根？
〇〇〇如來以一切譬諭說種種事，無有譬諭能說此法。何以故？
〇/b3|利生常道/〰〰〰〰〰〰〰〰同塵不染
〇〇/b|離世間品第三十八/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰【八三會普光明殿】〰/c339|▸卷第五十三/
〇〇〇普慧菩薩/see:第三十八品:二百問|二百問/
〇〇〇普賢菩薩/see:第三十八品:離世間法之一|答之一/〰B
〇〇〇普賢菩薩/see:第三十八品:離世間法之二|答之二/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十四/
〇〇〇普賢菩薩/see:第三十八品:離世間法之三|答之三/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十五/
〇〇〇普賢菩薩/see:第三十八品:離世間法之四|答之四/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十六/
〇〇〇普賢菩薩/see:第三十八品:離世間法之五|答之五/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十七/
〇〇〇普賢菩薩/see:第三十八品:離世間法之六|答之六/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十八/
〇〇〇普賢菩薩/see:第三十八品:離世間法之七|答之七/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第五十九/
〇/b3|佛果常道/
〇〇/b|入法界品第三十九/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰【九會逝多林】〰/c339|▸卷第六十/
〇〇〇世尊在室羅筏國逝多林給孤獨園大莊嚴重閣
〇〇〇〇會眾
〇〇〇〇〇菩薩摩訶薩五百人俱〰/ail|普賢菩薩、文殊師利菩薩為上首/
〇〇〇〇〇虛空之中，十方世界海外世界不可說大衆
〇〇〇〇〇諸大聲聞〰/ail|捨利弗、大目揵連、摩訶迦葉、離婆多、須菩提、阿㝹樓馱、難陀、劫賓那、迦旃延、富樓那等/
〇〇〇〇十菩薩說頌
〇〇〇〇一切菩薩諸神變事〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十一/
〇〇〇文殊師利童子從善住樓閣出南行，往於人間。尊者舍利弗與衆隨之
〇〇〇〇住福城東莊嚴幢娑羅林中往昔諸佛曾所止住教化眾生大塔廟處〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十二/
〇〇〇〇〇福城無量大眾出城來詣；善財童子居內
〇〇〇〇〇菩薩觀察善財童子，為演說一切佛法。吿欲成就一切智智，應決定求真善知識
〇〇〇/b3|善財童子五十三參/A
〇〇〇〇勝樂國妙峰山，/b|德雲比丘/。得憶念一切諸佛境界智慧光明普見法門。/see:|二十一念佛門/
〇〇〇〇海門國，/b1|海雲比丘/。隨佛學千二百歲，受持普眼法門
〇〇〇〇楞伽道邊海岸城，/b1|善住比丘/。已成就菩薩無礙解脫門，名究竟無礙
〇〇〇〇達裡鼻荼國自在城，/b1|彌伽/。於市肆中說法。獲菩薩妙音陀羅尼光明法門〰〰〰〰〰〰/c339|▸卷第六十三/
〇〇〇〇遊十二年至住林城，/b1|解脫長者/。入出如來無礙莊嚴解脫門，隨意即見十方如來，如阿彌陀佛
〇〇〇〇閻浮提畔摩利伽羅國，/b1|海幢比丘/。結跏趺入不思議般若波羅蜜境界清淨光明三昧
〇〇〇〇海潮之普莊嚴園林，/b1|休捨優婆夷/。無量佛來為說法。離憂安隱幢解脫法門〰〰〰〰〰/c339|▸卷第六十四/
〇〇〇〇海潮那羅素國土，/b1|毘目瞿沙仙人/，領徒萬人。得菩薩無勝幢解脫
〇〇〇〇聚落名伊沙那，/b1|勝熱婆羅門/。修諸苦行得金剛焰三昧光明。天龍鬼神勸告，善財入火得諸三昧
〇〇〇〇師子奮迅城，/b1|慈行童女/。得般若波羅蜜普莊嚴門〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十五/
〇〇〇〇三眼國，/b1|善見比丘/。得菩薩隨順燈解脫門
〇〇〇〇聞國河渚中，/b1|自在主童子/。得一切工巧大神通智光明法門
〇〇〇〇海住大城，/b1|具足優婆夷/。得菩薩無盡福德藏解脫門
〇〇〇〇大興城，/b1|明智居士/。得隨意出生福德藏解脫門
〇〇〇〇師子宮大城，/b1|法寶髻長者/。得菩薩無量福德寶藏解脫門〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十六/
〇〇〇〇籐根國普門城，/b1|普眼長者/。得令一切眾生普見諸佛歡喜法門
〇〇〇〇多羅幢大城，/b1|無厭足王/（阿那羅王）。得菩薩如幻解脫法門
〇〇〇〇妙光城，/b1|大光王/。得菩薩大慈為首隨順世間三昧門
〇〇〇〇安住王都，/b1|不動優婆夷/。得求一切法無厭足三昧光明門
〇〇〇〇無量都薩羅大城，/b1|遍行出家外道/。得至一切處菩薩行門〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十七/
〇〇〇〇廣大國，/b1|優缽羅華鬻香長者/。得調和香法
〇〇〇〇樓閣城，/b1|婆施羅船師/。得大悲幢行門
〇〇〇〇可樂城，/b1|上勝長者/。得至一切處修菩薩行清淨法門
〇〇〇〇輸那國迦陵迦林城，/b1|師子頻申比丘尼/。得成就一切智解脫
〇〇〇〇險難國寶莊嚴城，/b1|婆須蜜多女/。得菩薩離貪際解脫。〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第六十八/
〇〇〇〇善度城，/b1|鞞瑟胝羅居士/。得菩薩所得不般涅槃際解脫門
〇〇〇〇南方補怛洛迦山，/b|觀自在菩薩/。成就菩薩大悲行解脫門
〇〇〇〇南方補怛洛迦山，/b1|正趣菩薩/。得菩薩普疾行解脫門
〇〇〇〇墮羅缽底城，/b1|大天神雲網/。得解脫門
〇〇〇〇摩竭提國菩提場，/b1|安住主地神/。得不可壞智慧藏法門
〇〇〇〇摩竭提國迦毘羅城，/b|婆珊婆演底主夜神/菩薩破一切眾生暗法光明解脫門
〇〇〇〇摩竭提國菩提場，/b|普德淨光主夜神/。得菩薩寂靜禪定樂普遊步解脫門〰〰〰〰〰〰〰/c339|▸卷第六十九/
〇〇〇〇菩提場右，/b|喜目觀察眾生夜神/。得大勢力普喜幢解脫門
〇〇〇〇菩提場，/b|普救眾生妙德夜神/。得菩薩普現一切世間調伏眾生解脫門〰〰〰〰〰〰〰〰/c339|▸卷第七十/
〇〇〇〇菩提場不遠，/b|寂靜音海主夜神/。得唸唸生廣大喜莊嚴解脫門〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七十一/
〇〇〇〇菩提場，/b|守護一切城增長威力主夜神/。得甚深自在妙音解脫門
〇〇〇〇菩提場，/b|開敷一切樹華主夜神/。得菩薩出生廣大喜光明解脫門〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七十二/
〇〇〇〇菩提場，/b|大願精進力救護一切眾生夜神/。得教化眾生令生善根解脫門〰〰〰〰〰〰〰/c339|▸卷第七十三/
〇〇〇〇嵐毘尼園林，/b|妙德圓滿神/。得菩薩於無量劫遍一切處示現受生自在解脫門〰〰〰〰〰/c339|▸卷第七十四/
〇〇〇〇迦毘羅城，/b|瞿波釋種女/。得觀察菩薩三昧海解脫門〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七十五/
〇〇〇〇地出寶蓮，樓觀寶蓮座，/b|佛母摩耶/。永為佛母。得菩薩大願智幻解脫門〰〰〰〰〰〰/c339|▸卷第七十六/
〇〇〇〇三十三天，/b1|正念王之女天主光/。得無礙念清淨解脫門
〇〇〇〇迦毘羅城，遍友童子師
〇〇〇〇三十三天，/b1|善知眾藝童子/。得善知眾藝菩薩解脫門
〇〇〇〇摩竭提國婆呾那城，/b1|賢勝優婆夷/。得無依處道場解脫門
〇〇〇〇沃田城，/b1|堅固解脫長者/。得無著念淨莊嚴解脫門
〇〇〇〇沃田城，/b1|妙月長者/。得智光解脫門
〇〇〇〇出生城，/b1|無勝軍長者/。得無盡相解脫門
〇〇〇〇法聚落，/b1|最寂靜婆羅門/。得誠語解脫門
〇〇〇〇妙意華門城，/b1|德生童子、有德童女/。得幻住解脫門〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第七十七/
〇〇〇〇海岸國大莊嚴園毘盧遮那莊嚴藏，/b|彌勒菩薩摩訶薩/
〇〇〇〇/b|文殊師利童子/〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰/c339|▸卷第八十/
〇〇〇〇入如來境住普賢地，/b|普賢菩薩/
`)
.run((gp) => {
  new My華嚴經Content(gp);

  // 五十三參
  var xy = gp.getMark('A'), start = xy && xy[1];
  for (var i=1; i<=53; ++i) gp.T(3,start+i-0.03,`/ail|${i}/`);

  // 佛不思議法品第三十三
  xy = gp.getMark('C');
  start = xy && xy[1];
  gp.T(12, start,   '/ail|二十一條/')
    .T(12, start+1, '/ail|十二條/');

  // 離世間品第三十八
  xy = gp.getMark('B');
  start = xy && xy[1];
  gp.T(12, start,   '/ail|四十一條/')
    .T(12, start+1, '/ail|二十六條/')
    .T(12, start+2, '/ail|十五條/')
    .T(12, start+3, '/ail|三十四條/')
    .T(12, start+4, '/ail|三十九條/')
    .T(12, start+5, '/ail|三十條/')
    .T(12, start+6, '/ail|十七條　（共二百二答）/')
    .src = 'lit-HYJ-華嚴經.js';
});
