// 正體字化轉換

class Buffer {
  constructor() { this.bufList = Array.from(arguments); }

  w() {
    var ret = '';
    for (var i in arguments) {
      var x = arguments[i];
      if (x || (typeof x == 'number')) ret += x;
    }
    if (ret.length) this.bufList.push(ret);
    return (this.bufList.length < 1024) ? this : this.condense();
  }

  wIf() {
    if (arguments[0]) { arguments[0] = ''; this.w.apply(this, arguments); }
    return this;
  }

  wIfElse(cond, a, b) { return this.w(cond ? a : b); }

  append(s) { this.bufList.push(s); } // for performance

  prepend() {
    var ret = '';
    for (var i in arguments) {
      var x = arguments[i];
      x && (ret += x);
    }
    if (ret) this.bufList.unshift(ret);
    return this;
  }

  wrap(before, after) { return this.prepend(before).w(after); }

  // renders to one or more elements,
  // or an object with a write() function.
  // returns the text, and clears internally.
  render() {
    var ret = this.text();
    for (var i in arguments) {
      var k = arguments[i];
      if (!k) continue;
      if (typeof k == 'function')
        k(ret);
      else if (k.write)
        k.write(ret);
      else {
        var el = k.hasOwnProperty('innerHTML') ? k : e(k);
        el && (el.innerHTML = ret);
      }
    }
    this.bufList = [];
    return ret;
  }

  text() {
    var s = this.bufList.join('');
    this.bufList = [ s ];
    return s;
  }

  condense() {
    if (this.bufList.length > 100)
      this.text();
    return this;
  }

} // end of Buffer.

class Astral {
  constructor(str) {
    this.isAstral = true;
    this.original = str.isAstral ? str.getAll() : str;
    this.indices = [];
    var idx = 0;
    for (var i=0; i<this.original.length; ++i, ++idx) {
      this.indices.push(idx);
      var code = this.original.charCodeAt(i);
      if (code >= 0xd800 && code <= 0xdbff) { // skip the 2nd
        ++i;
        ++idx;
      }
    }
    this.length = this.indices.length;
  }
  append(s) {
    var ast = (s.original && s.indices) ? s : new Astral(s),
        olen = this.original.length;
    this.original += ast.original;
    for (var i=0; i<ast.length; ++i)
      this.indices.push(olen + ast.indices[i]);
    this.length = this.indices.length;
    return this;
  }
  getLength() { return this.indices.length; } // safer than this.length
  toString() { return this.original; }
  charAt(idx) {
    var idcs = this.indices, len = idcs.length;
    if (idx < 0 || idx >= len) return '';
    return (idx == len-1)
           ? this.original.substring(idcs[len-1])
           : this.original.substring(idcs[idx], idcs[idx+1]);
  }
  substring(startIdx, endIdx) {
    var idcs = this.indices, orig = this.original, ret = '';
    if (idcs.length == 0) return '';
    if (startIdx < 0) startIdx = 0;
    if (endIdx == null || endIdx < 0 || endIdx > idcs.length) endIdx = idcs.length;
    for (var i=startIdx; i<endIdx; i++)
      ret += orig.substring(idcs[i], idcs[i+1]);
    return ret;
  }
  substr(startIdx, endIdx) { return this.substring(startIdx, endIdx); }
  forEach (fn) { for (var i=0; i<this.length; i++) fn(this.charAt(i), i); }
}

const zpuncs = '，、；：。？！‧○';
const zpuncs1L = '「『《（';
const zpuncs1R = '」』》）—─…'; // '　' is punc?
const zpuncs1 = zpuncs1L + zpuncs1R;
const zpuncsAll = zpuncs + zpuncs1;
const REGEX_ZH = /[\u3300-\u4dbf]|[\u4e00-\u9fff]|[\uf900-\ufaff]|[\ufe30-\ufe4f]|[\u20000-\u2a6df]|[\u2a700-\u2ceaf]|[\u2f800-\u2fa1f]/;
function isPunc(z)  { return zpuncs.indexOf(z) >= 0; }
function isPunc1L(z) { return zpuncs1L.indexOf(z) >= 0; }
function isPunc1R(z) { return zpuncs1R.indexOf(z) >= 0; }
function isPunc1(z) { return zpuncs1.indexOf(z) >= 0; }
function isHanZi(x) { return !isASCII(x) && REGEX_ZH.test(x) && (zpuncsAll.indexOf(x) < 0); }
function isHanZiOrQuot(x) { return !isASCII(x) && REGEX_ZH.test(x) && (zpuncs.indexOf(x) < 0); }
function isASCII(str) { return /^[\x00-\xFF]*$/.test(str) }
function isWhite(c) { return c && c.length && !c.trim().length; }

function readTextFile(fn) { return require('fs').readFileSync(fn) + ''; }

function isAny(a, sample) {
  if (sample) {
    for (var i=sample.length-1; i>=0; i--)
      if (sample.charAt(i) == a) return true;
  }
  return false;
}

class Jian2ZhengRuleSet {
  constructor(verbose, isSpecial) {
    this.rules = {};
    this.verbose = verbose;
    this.isSpecial = isSpecial;
  }
  setRule(r) {
    this.rules[r.jianti] = r;
    if (this.isSpecial) r.errAsNull = true;
    return this;
  }
  setSimple(jt, zt) { return this.setRule(new OneOnOneRule(jt, zt)); }
  getRule(jt) { return this.rules[jt]; }
  convert(input, specialRules) {
    if (!input) return;
    if (typeof input == 'string') input = new Astral(input);
    var report = [], buf = new Buffer(), unknown = {};
    for (var i=0; i<input.getLength(); ++i) {
      var c = input.charAt(i);
      if (!isHanZi(c)) { buf.w(c); continue; }
      var r = specialRules && specialRules.getRule(c),
          tmp = r && r.result(input, i, report, this.verbose, true);
      if (tmp) {
        buf.w(tmp);
      } else {
        r = this.rules[c];
        if (r) {
          buf.w(r.result(input, i, report, this.verbose));
        } else {
          buf.w(c);
          unknown[c] = true;
        }
      }
    }
    unknown = Object.keys(unknown).join('');
    if (unknown) throw `Rules for ${unknown} not found.`;
    return { result:buf.render(), report };
  }
  parseRules(txt) {
    var a = txt.trim().split('\n');
    for (var i in a) this.parseRule(a[i]);
    return this;
  }
  parseRule(s) {
    function toAffix(s) { return (s.indexOf(',') > 0) ? s.split(',') : s; }
    if (s[0] != '[' || s[2] != ']') return;
    var r = new AffixRule(s[1]), a = s.substring(3).trim().split(' ');
    for (var i in a) {
      var part = a[i].trim();
      if (part[0] == '=') // e.g. "=&" or "=鐘"
        r.setAsis(part[1] == '&' ? null : part[1]);
      else if (part[1] == '<')
        r.prefix(part[0], toAffix(part.substring(2)));
      else if (part[1] == '>')
        r.suffix(part[0], toAffix(part.substring(2)));
    }
    this.setRule(r);
    return this;
  }
}

class Jian2ZhengRule {
  constructor(jt) { this.jianti = jt; }
  result(input, idx, msgObj, verbose, custom) { throw `Jian2ZhengRule.result() must be implemented.`; }
  addError(msgObj, input, idx) {
    if (!msgObj) return this;
    var zi = input.charAt(idx), target = '';
    for (var i in this) {
      if (i.startsWith('rule-'))
        target += i.substring(5);
    }
    msgObj.push(`??? [${idx+1}] ${zi} ${target||'　'} "${input.substring(idx-2, idx+2)}"`);
    return this;
  }
  addInfo(msgObj, input, idx, target, comment) { // usually when verbose
    if (!msgObj) return this;
    var zi = input.charAt(idx);
    if (target) target = '>' + target;
    else        target = '=' + zi;
    msgObj.push(`>>> [${idx+1}] (${zi}${target}) "${input.substring(idx-2, idx+3)}" {${comment||''}}`);
    return this;
  }
}

class OneOnOneRule extends Jian2ZhengRule {
  constructor(jt, zt) { super(jt); this.zhengti = zt || jt; }
  result(input, idx, msgObj, verbose) { return this.zhengti.charAt(0); }
}

const NUMBERS = '一二三四五六七八九十两百千万几数各多少每某';

class AffixRule extends Jian2ZhengRule {
  constructor(jt, errAsNull) { super(jt); this.asis = jt; this.errAsNull = errAsNull; }
  prefix(resultZi, prefix) {
    var rn = `rule-${resultZi}`, r = this[rn];
    if (!r) this[rn] = { prefix };
    else if (r.prefix) throw `${rn} prefix rule conflict.`;
    else r.prefix = prefix;
    return this;
  }
  suffix(resultZi, suffix) {
    var rn = `rule-${resultZi}`, r = this[rn];
    if (!r) this[rn] = { suffix };
    else if (r.suffix) throw `${rn} suffix rule conflict.`;
    else r.suffix = suffix;
    return this;
  }
  setAsis(asis) { this.asisOk = true; this.asis = asis || this.jianti; return this; }
  result(input, idx, msgObj, verbose, custom) {
    var sub, zi, type;
lp: for (var i in this) {
      if (i.startsWith('rule-')) {
        var r = this[i];
        zi = i.substring(5);
        if (typeof r.prefix == 'string') {
          type = `${zi}<${r.prefix}`;
          if (isAny(input.charAt(idx-1), r.prefix))
            break lp;
          type = zi = null;
        }
        else if (Array.isArray(r.prefix)) {
          type = `${zi}<${r.prefix.join(',')}`;
          sub = input.substring(idx-5, idx);
          for (var j in r.prefix)
            if (sub.endsWith(r.prefix[j])) break lp;
          type = zi = null;
        }
        if (typeof r.suffix == 'string') {
          zi = i.substring(5);
          type = `${zi}>${r.suffix}`;
          if (isAny(input.charAt(idx+1), r.suffix))
            break lp;
          type = zi = null;
        }
        else if (Array.isArray(r.suffix)) {
          zi = i.substring(5);
          type = `${zi}>${r.suffix.join(',')}`;
          sub = input.substring(idx+1, idx+5);
          for (var j in r.suffix)
            if (sub.startsWith(r.suffix[j])) break lp;
          type = zi = null;
        }
      }
    }
    if (!zi) {
      if (this.errAsNull) return null;
      if (!this.asisOk) this.addError(msgObj, input, idx);
    }
    zi = zi || this.asis;
    if (custom) custom = '*'; else custom = '';
    if (verbose) this.addInfo(msgObj, input, idx, zi, `${custom}${type||''}`);
    return zi;
  }
}

function getRuleSet(verbose) {
  var ruleSet = new Jian2ZhengRuleSet(verbose);
  var mapping = '厂:廠厰;卜:蔔;儿:兒;几:几幾;干:乾幹榦;于:於;亏:虧;与:與;万:萬;亿:億;个:個;么:麼;广:廣;门:門;义:義;尸:屍;卫:衛;飞:飛;习:習;马:馬;乡:鄉;丰:豐;开:開;无:無;云:雲;专:專;扎:紮;艺:藝;厅:廳;区:區;历:歷歴曆;车:車;贝:貝;内:內;冈:岡;见:見;气:氣;升:陞;长:長;什:甚;仆:僕;币:幣;仅:僅;从:從;凶:兇;仓:倉;风:風;匀:勻;乌:烏;凤:鳳;为:為;斗:鬥鬦鬭;忆:憶;计:計;订:訂;户:戶;认:認;丑:丑醜;队:隊;办:辦;劝:勸;双:雙;书:書;刊:栞;击:擊;扑:撲;节:節;术:術;厉:厲;龙:龍;灭:滅;轧:軋;东:東;业:業;旧:舊;帅:帥;归:歸帰;叶:葉枼;号:號;电:電;只:隻衹祇秪;叹:嘆歎;们:們;仪:儀;丛:叢樷;乐:樂;册:冊;处:處処䖏;鸟:鳥;务:務;饥:饑飢;闪:閃;兰:蘭;汇:匯;头:頭;汉:漢;宁:寧;讨:討;写:寫冩;让:讓;礼:禮;训:訓;议:議;讯:訊;记:記;出:出齣;辽:遼;边:邊;发:發髮髪;圣:聖;对:對;台:臺;纠:糾;丝:絲;动:動;托:託;巩:鞏;执:執;扩:擴;扫:掃;扬:揚;场:場塲;亚:亞;朴:樸;机:機;权:權;过:過;协:協;压:壓;厌:厭;页:頁;夸:誇;夺:奪;达:達;夹:夾;轨:軌;划:劃畫;迈:邁;毕:畢;贞:貞;师:師;尘:塵;当:當;吓:嚇;虫:蟲;团:團;同:衕;吊:弔;吃:喫;吗:嗎;屿:嶼;岁:歲;岂:豈;则:則;刚:剛;网:網;朱:硃;丢:丟;迁:遷;乔:喬;伟:偉;传:傳;优:優;伤:傷;价:價;华:華;伙:夥;伪:偽;向:曏;后:後;会:會;杀:殺;众:眾;爷:爺;伞:傘;创:創剏剙;朵:朶;杂:雜;负:負;争:爭;壮:壯;冲:沖衝;庄:莊;庆:慶;刘:劉;齐:齊;产:產;决:決;闭:閉;问:問;闯:闖;并:並併竝;关:關関;灯:燈;汤:湯;兴:興;讲:講;军:軍;许:許;论:論;农:農;讽:諷;设:設;访:訪;寻:尋;尽:盡儘藎;导:導;异:異;孙:孫;阵:陣;阳:陽;阶:階堦;阴:陰;奸:姦;妇:婦;妈:媽;戏:戲戯;观:觀;欢:歡;买:買;红:紅;纤:纖;约:約;级:級;纪:紀;驰:馳;寿:壽夀;麦:麥;进:進;远:遠逺;违:違;运:運;抚:撫;坛:壇罈;坏:壞;扰:擾;坝:壩;贡:貢;抢:搶;坟:墳;护:護;壳:殼殻;志:誌;块:塊;声:聲;报:報;却:卻;苍:蒼;严:嚴;芦:蘆;劳:勞;克:剋;苏:蘇;杆:桿;杠:槓;极:極;杨:楊;两:兩;丽:麗;医:醫毉;励:勵;还:還;歼:殲;来:來;连:連;坚:堅;时:時;吴:吳;县:縣;里:裏裡;园:園;旷:曠;围:圍;吨:噸;邮:郵;困:睏;员:員;听:聽;呜:嗚;别:別彆;岗:崗;帐:帳;财:財;钉:釘;针:針;乱:亂;秃:禿;体:體;佣:傭;彻:徹;余:餘;谷:谷穀;邻:鄰;肠:腸;龟:龜;犹:猶;删:刪;条:條;岛:島;饭:飯;饮:飲;系:係繫;冻:凍;状:狀;亩:畝;况:況;库:庫;疗:療;应:應;这:這;弃:棄;闲:閑;间:間閒;闷:悶;灶:竈;灿:燦;沟:溝;没:沒;沈:瀋;怀:懷;忧:憂;穷:窮;灾:災;证:證;启:啓啟;评:評;补:補;识:識;诉:訴;诊:診;词:詞;译:譯;灵:靈;层:層;迟:遲;张:張;际:際;陆:陸;陈:陳;劲:勁;鸡:雞鷄;驱:驅;纯:純;纱:紗;纲:綱;纳:納;纵:縱;驳:駁駮;纷:紛;纸:紙;纹:紋;纺:紡;驴:驢;纽:紐;环:環;责:責;现:現;表:錶;规:規;拢:攏;拣:揀;担:擔;顶:頂;拥:擁;势:勢;拦:攔;拨:撥;择:擇;苹:蘋;范:範;茎:莖;杯:盃;柜:櫃;板:板闆;松:鬆;枪:槍;构:構;杰:傑;丧:喪;画:畫;卧:臥;枣:棗;卖:賣;矿:礦鑛;码:碼;厕:廁;奋:奮;态:態;欧:歐;垄:壟;轰:轟;顷:頃;转:轉;斩:斬;轮:輪;软:軟輭;齿:齒;虏:虜;肾:腎;贤:賢;昆:崑;国:國;畅:暢;鸣:鳴;咏:詠;罗:羅;帜:幟;岭:嶺;凯:凱;败:敗;贩:販;购:購;图:圖;钓:釣;制:製;刮:颳;秆:稈;侄:姪;侦:偵;侧:側;凭:憑;侨:僑;货:貨;质:質;征:徵;径:徑逕;舍:捨;采:採采埰;贪:貪;贫:貧;肤:膚;肿:腫;胀:脹;胁:脅;鱼:魚;备:備;饰:飾;饱:飽;饲:飼;变:變;庙:廟;剂:劑;废:廢;净:淨凈;闸:閘;闹:鬧;郑:鄭;卷:捲;单:單;炉:爐;浅:淺;泪:淚;注:註;泻:瀉;泼:潑;泽:澤;怜:憐;学:學;宝:寶寳;审:審;帘:簾;实:實;试:試;诗:詩;诚:誠;衬:襯;视:視;话:話;诞:誕;询:詢;该:該;详:詳;肃:肅;隶:隸;录:錄録;届:屆;陕:陝;驾:駕;参:參;艰:艱;线:綫線;练:練;组:組;细:細;驶:駛;织:織;终:終;驻:駐;驼:駝;绍:紹;经:經;贯:貫;帮:幫;挂:掛;项:項;挠:撓;赵:趙;挡:擋攩;垫:墊;挣:掙;挤:擠;挥:揮;荐:薦;带:帶;茧:繭;荡:蕩盪;荣:榮;胡:鬍衚;药:葯藥;标:標;栋:棟;栏:欄;树:樹;咸:鹹;砖:磚;厘:釐;面:麵麫;牵:牽;残:殘;轻:輕;鸦:鴉;战:戰;点:點;临:臨;览:覽;竖:豎;尝:嘗;哄:鬨;哑:啞;显:顯;贵:貴;虾:蝦;蚁:蟻;蚂:螞;虽:雖;咽:嚥;骂:罵;哗:嘩;响:響嚮;峡:峽;罚:罰;贱:賤;贴:貼;钞:鈔;钟:鐘;钢:鋼;钥:鑰;钩:鉤;选:選;适:適;种:種;复:復複;俩:倆;贷:貸;顺:順;俭:儉;须:須鬚;叙:敘;剑:劍;胆:膽;胜:勝;脉:脈;狭:狹;狮:獅;独:獨;狱:獄;贸:貿;饶:饒;蚀:蝕;饺:餃;饼:餅;弯:彎;将:將;奖:奬獎;迹:跡蹟;疮:瘡;疯:瘋;亲:親;闻:聞;阀:閥;阁:閣;养:養;姜:薑;类:類;总:總;炼:煉;烂:爛;洁:潔;洒:灑;浇:澆;浊:濁;测:測;济:濟;浑:渾;浓:濃;恒:恆;恼:惱;举:舉擧;觉:覺;宫:宮;宪:憲;窃:竊;语:語;袄:襖;误:誤;诱:誘;说:說説;诵:誦;垦:墾;昼:晝;费:費;险:險;娇:嬌;贺:賀;垒:壘;绑:綁;绒:絨;结:結;绕:繞遶;骄:驕;绘:繪;给:給;络:絡;骆:駱;绝:絕;绞:絞;统:統;艳:艷;蚕:蠶;顽:頑;盏:盞;捞:撈;载:載;赶:趕;盐:鹽;损:損;捡:撿;换:換;挽:輓;热:熱;壶:壺;耻:恥;莲:蓮;获:獲穫;晋:晉;恶:惡;档:檔;桥:橋;样:樣;栗:慄;础:礎;顾:顧;轿:轎;较:較;顿:頓;毙:斃;致:緻;虑:慮;监:監;紧:緊;党:黨;晒:曬;晓:曉;鸭:鴨;晕:暈;唤:喚;罢:罷;圆:圓;贼:賊;贿:賄;钱:錢;钳:鉗;钻:鑽;铁:鐵;铃:鈴;铅:鉛;牺:犧;敌:敵;积:積;称:稱;笔:筆;笋:筍;债:債;倾:傾;舰:艦;舱:艙;爱:愛;颂:頌;脏:臟髒;胶:膠;脑:腦;皱:皺;饿:餓;恋:戀;桨:槳;浆:漿;准:準;症:癥;效:傚;离:離;资:資;凉:涼;竞:競;阅:閱閲;烦:煩;烧:燒;烛:燭;烟:煙;递:遞;涛:濤;涝:澇;涂:塗;润:潤;涨:漲;烫:燙;悦:悅;宽:寬;宾:賓;请:請;诸:諸;读:讀;袜:襪;课:課;谁:誰;调:調;谅:諒;谈:談;谊:誼;剥:剝;恳:懇;剧:劇;娱:娛;难:難;预:預;绢:絹;绣:繡;验:驗;继:繼;教:敎;据:據;职:職;黄:黃;萝:蘿;营:營;梦:夢;检:檢;救:捄;聋:聾;袭:襲;辅:輔;辆:輛;虚:虛;睁:睜;悬:懸;跃:躍;累:纍;崭:嶄;铜:銅;铲:鏟;银:銀;笼:籠;偿:償;衔:銜;盘:盤;鸽:鴿;欲:慾;领:領;脚:腳;脸:臉;脱:脫;够:夠;猪:豬;猎:獵;猫:貓;馅:餡;馆:館舘;凑:湊;减:減;痒:癢;盗:盜;着:著;盖:蓋;断:斷;兽:獸;渐:漸;渔:漁;渗:滲;惭:慚慙;惧:懼;惊:驚;惨:慘;惯:慣;窑:窯;谋:謀;谎:謊;祸:禍;谜:謎;弹:彈;随:隨;隐:隱;婶:嬸;颈:頸;绩:績;绪:緒;续:續;骑:騎;绳:繩;维:維;绵:綿;绸:綢紬;绿:綠緑;趋:趨;搁:擱;搂:摟;搅:攪;联:聯;葱:蔥;厨:廚㕑;厦:廈;确:確;暂:暫;辈:輩;辉:輝;赏:賞;喷:噴;践:踐;遗:遺;赌:賭;赔:賠;铸:鑄;铺:鋪;链:鏈;销:銷;锁:鎖;锄:鋤耡;锅:鍋;锈:銹鏽;锋:鋒;锐:銳鋭;鹅:鵝鵞䳘;税:稅;筑:築;筛:篩;筋:觔;筝:箏;储:儲;奥:奧;惩:懲;御:禦;释:釋;腊:臘;鲁:魯;馋:饞;装:裝;蛮:蠻;阔:闊;羡:羨;粪:糞;湿:濕;温:溫;湾:灣;愤:憤;慨:嘅;窜:竄;窝:窩;裤:褲;谢:謝;谣:謠謡;谦:謙;属:屬;屡:屢;缎:緞;缓:緩;骗:騙;编:編;缘:緣;摄:攝;摆:擺;携:攜;摇:搖;摊:攤;鹊:鵲;蓝:藍;蒙:矇;献:獻;楼:樓;赖:賴;碍:礙;雾:霧;输:輸;龄:齡;鉴:鑒鑑;错:錯;锡:錫;锣:鑼;锤:錘鎚;锦:錦;键:鍵;锯:鋸;辞:辭辤;筹:籌;签:籤簽;简:簡;毁:毀;遥:遙;腾:騰;触:觸;酱:醬;韵:韻;粮:糧;数:數;满:滿;滤:濾;滥:濫;滚:滾;滨:濱;滩:灘;誉:譽;谨:謹;辟:闢;叠:疊;缝:縫;缠:纏;静:靜;墙:牆墻;酿:釀;愿:願;颗:顆;蜡:蠟;蝇:蠅;赚:賺;锹:鍬;锻:鍛;稳:穩;箩:籮;鲜:鮮;馒:饅;赛:賽;谱:譜;骡:騾;缩:縮;撑:撐;聪:聰;横:橫;樱:櫻;飘:飄;瞒:瞞;题:題;踪:蹤;嘱:囑;镇:鎮;颜:顏;潜:潛;额:額;劈:噼;颠:顛;赠:贈;镜:鏡;赞:贊;篮:籃;雕:鵰彫琱;辩:辯;懒:懶;缴:繳;辫:辮;赢:贏;骤:驟;镰:鐮;鹰:鷹;颤:顫;仑:崙;讥:譏;邓:鄧;卢:盧;叽:嘰;尔:爾;冯:馮;吕:呂;伦:倫;凫:鳧鳬;妆:妝;讳:諱;讶:訝;讹:訛;讼:訟;诀:訣;驮:馱;驯:馴;纫:紉;玛:瑪;韧:韌;抠:摳;抡:掄;坎:坎埳;坞:塢;拟:擬;芜:蕪;苇:葦;轩:軒;卤:滷鹵;呕:嘔;呐:吶;呛:嗆;岖:嶇;囱:囪;狈:狽;鸠:鳩;庐:廬;闰:閏;兑:兌;沥:瀝;沦:淪;汹:洶;沧:滄;沪:滬;诅:詛;诈:詐;坠:墜;纬:緯;拧:擰;枢:樞;枫:楓;郁:鬱;矾:礬;殴:毆;昙:曇;咙:嚨;账:賬;贬:貶;贮:貯;岳:嶽;侠:俠;侥:僥;侣:侶;刽:劊;刹:剎;肴:餚;觅:覓;瓮:甕;肮:骯;狞:獰;庞:龐;疟:瘧;泞:濘;宠:寵;诡:詭;屉:屜;弥:彌;叁:參;绅:紳;驹:駒;绊:絆;绎:繹;贰:貳;挟:挾;荆:荊;荚:莢;荞:蕎;荠:薺;荤:葷;荧:熒;栈:棧;栅:柵;柠:檸;砚:硯;鸥:鷗;轴:軸;韭:韮;昵:暱;勋:勛;哟:喲;钙:鈣;钝:鈍;钠:鈉;钦:欽;钧:鈞;钮:鈕;毡:氈;氢:氫;胧:朧;狰:猙;饵:餌;峦:巒;飒:颯;闺:閨;闽:閩;娄:婁;烁:爍;洼:窪;诫:誡;诬:誣;诲:誨;逊:遜;陨:隕;骇:駭;挚:摯;捣:搗擣;聂:聶;莱:萊;莹:瑩;莺:鶯;栖:棲;桦:樺;桩:樁;贾:賈;砾:礫;唠:嘮;哺:餔;鸯:鴦;赂:賂;赃:贓贜;钾:鉀;铆:鉚;赁:賃;耸:聳;颁:頒;脐:臍;脓:膿;鸵:鴕;鸳:鴛;馁:餒;凄:淒;斋:齋;瓷:甆;涡:渦;涣:渙;涤:滌;涧:澗;涩:澀;悯:憫;窍:竅;诺:諾;诽:誹;谆:諄;骏:駿;琐:瑣;麸:麩䴸;琅:瑯;捶:搥;掷:擲;掸:撣撢;掺:摻;萤:螢;萧:蕭;萨:薩;酝:醖醞;厢:廂;硕:碩;颅:顱;啰:囉;啸:嘯;逻:邏;婴:嬰;赊:賒;铐:銬;铛:鐺;铝:鋁;铡:鍘;铣:銑;铭:銘;矫:矯;秸:稭;秽:穢;躯:軀;衅:釁;敛:斂;阎:閻;阐:闡;焕:煥;鸿:鴻;渊:淵;淀:澱;谍:諜;谐:諧;裆:襠;祷:禱;谒:謁;谓:謂;谚:諺;堕:墮;颇:頗;绰:綽;绷:綳繃;综:綜;绽:綻;缀:綴;琼:瓊;揽:攬;搀:攙;蒋:蔣;韩:韓;棱:稜;椭:橢;颊:頰;雳:靂;翘:翹;凿:鑿;畴:疇;鹃:鵑;赋:賦;赎:贖;赐:賜;锉:銼;锌:鋅;牍:牘;粤:粵;腌:醃;猬:蝟;惫:憊;痪:瘓;滞:滯;溃:潰;溅:濺;谤:謗;缅:緬;缆:纜;缔:締;缕:縷;骚:騷;鹉:鵡;榄:欖;辐:輻;辑:輯;频:頻;跷:蹺;跺:跥;蜗:蝸;蜕:蛻;锚:錨;锥:錐;锨:鍁;锭:錠;锰:錳;颓:頹;腻:膩;鹏:鵬;颖:穎;雏:雛;馍:饃;馏:餾;禀:稟;痴:癡;誊:謄;漓:灕;窥:窺;寝:寢;谬:謬;缚:縛;缤:繽;赘:贅;蔼:藹;碱:鹼;辕:轅;辖:轄;踊:踴;蝉:蟬;镀:鍍;箫:簫;舆:輿;谭:譚;缨:纓;撵:攆;蕴:藴蘊;镊:鑷;镐:鎬;篓:簍;膘:臕;鲤:鯉;鲫:鯽;瘪:癟;瘫:癱;凛:凜;澜:瀾;谴:譴;鹤:鶴;缭:繚;橱:櫥;辙:轍;鹦:鸚;篱:籬;鲸:鯨;瘾:癮;濒:瀕;缰:韁;檩:檁;赡:贍;镣:鐐;鳄:鱷;嚣:囂;鳍:鰭;癞:癩;攒:攢;鳖:鱉鼈;癣:癬;鬓:鬢髩;鳞:鱗;躏:躪;镶:鑲;韦:韋;闩:閂;讣:訃;刍:芻;讪:訕;驭:馭;扪:捫;亘:亙;尧:堯;伥:倀;伫:佇;忏:懺;讷:訥;纣:紂;纨:紈;坂:阪;芸:蕓;矶:磯;呓:囈;呗:唄;吣:唚;岚:嵐;囵:圇;奂:奐;邹:鄒;饨:飩;饪:飪;疖:癤;忾:愾;怅:悵;怆:愴;诋:詆;诏:詔;陇:隴;妩:嫵;妪:嫗;纭:紜;纶:綸;垅:壠;枥:櫪;鸢:鳶;咛:嚀;岿:巋;钎:釺;牦:氂;侩:儈;侬:儂;怂:慫;迩:邇;枭:梟;饯:餞;疡:瘍;炖:燉;泾:涇;诙:詼;诛:誅;诟:詬;诠:詮;诣:詣;诧:詫;诩:詡;姗:姍;驷:駟;驸:駙;绉:縐;绌:絀;驿:驛;珐:琺;珑:瓏;挝:撾;挞:撻;荜:蓽;荟:薈;荫:蔭;栉:櫛;轱:軲;轲:軻;轶:軼;剐:剮;咤:吒;哝:噥;峥:崢;贻:貽;钚:鈈;笃:篤;俨:儼;俪:儷;胫:脛;鸨:鴇;狲:猻;饷:餉;饹:餎;孪:孿;兹:茲;炽:熾;浃:浹;浏:瀏;恸:慟;恻:惻;诳:誑;鸩:鴆;娅:婭;娆:嬈;姹:奼;绔:絝;骁:驍;绚:絢;桧:檜;砺:礪;唢:嗩;觊:覬;赅:賅;钵:缽;皋:臯;脍:膾;玺:璽;袅:裊;饽:餑;挛:攣;疱:皰;痉:痙;郸:鄲;烩:燴;烬:燼;涟:漣;诿:諉;谀:諛;谄:諂;娴:嫻;骋:騁;掳:擄;萦:縈;棂:欞;匮:匱;厩:廐廄;殒:殞;殓:殮;辄:輒;堑:塹;啧:嘖;跄:蹌;蛎:蠣;蛊:蠱;帼:幗;铠:鎧;铢:銖;铤:鋌;铳:銃;笺:箋;偬:傯;偻:僂;皑:皚;龛:龕;馄:餛;阉:閹;渍:漬;渎:瀆;惬:愜㥦;惮:憚;谏:諫;谑:謔;谙:諳;谛:諦;婵:嬋;绮:綺;绯:緋;绻:綣;靓:靚;蛰:蟄;辍:輟;辎:輜;睐:睞;嵘:嶸;铿:鏗;犊:犢;鹄:鵠;傥:儻;傧:儐;弑:弒;颌:頜;鱿:魷;飓:颶;觞:觴;馈:饋;馊:餿;亵:褻;痨:癆;痫:癇;颏:頦;愠:慍;裢:褳;禄:祿;幂:冪;谧:謐;缄:緘;缈:緲;缉:緝;骜:驁;摈:擯;颐:頤;榈:櫚;碜:磣;鹌:鵪;尴:尷;龃:齟;韪:韙;嗫:囁;跻:躋;锢:錮;锱:錙;觎:覦;颔:頷;腼:靦;腭:齶;稣:穌;鲍:鮑;飕:颼;鹑:鶉;滦:灤;慑:懾;窦:竇;谩:謾;缜:縝;缛:縟;瑶:瑤;韬:韜;蔷:薔;槛:檻;槟:檳;厮:廝;殡:殯;辗:輾;龇:齜;龈:齦;暧:曖;踌:躊;蝈:蟈;嘘:噓;锲:鍥;锵:鏘;镁:鎂;镂:鏤;膑:臏;褛:褸;谲:譎;缥:縹;缪:繆;撺:攛;聩:聵;鞑:韃;魇:魘;辘:轆;龉:齬;龊:齪;觑:覷覻覰;踯:躑;颚:顎;噜:嚕;幡:旛;镌:鐫鎸;镍:鎳;镑:鎊;篑:簣;馔:饌;鲨:鯊;褴:襤;缮:繕;擞:擻;橹:櫓;飙:飆飈飇;镖:鏢;獭:獺;斓:斕;缱:繾;藓:蘚;龌:齷;瞩:矚;蹑:躡;蹒:蹣;羁:羈;鳅:鰍;懑:懣;鹬:鷸;鳌:鰲;髅:髏;镯:鐲;鳏:鰥;霭:靄;蹰:躕;蹿:躥;巅:巔;髋:髖;籁:籟;鳗:鰻;骥:驥;缵:纘;黩:黷;镳:鑣;镴:鑞;鳝:鱔;颦:顰;癫:癲;赣:贛;颧:顴;戋:戔;劢:勱;邝:鄺;讦:訐;讧:訌;讫:訖;玑:璣;圹:壙;芗:薌;厍:厙;钆:釓;钇:釔;伛:傴;伧:傖;犷:獷;犸:獁;邬:鄔;饧:餳;讴:謳;讵:詎;纡:紆;纥:紇;纩:纊;玚:瑒;抟:摶;坜:壢;苈:藶;苋:莧;苌:萇;苁:蓯;苎:苧;奁:奩匳匲;欤:歟;轪:軑;轫:軔;芈:羋;邺:鄴;呖:嚦;旸:暘;虬:虯;呙:咼;帏:幃;岘:峴;钊:釗;钋:釙;钌:釕;岙:嶴;佥:僉;饩:餼;饫:飫;饬:飭;庑:廡;闱:闈;闳:閎;闵:閔;闶:閌;炀:煬;沣:灃;沤:漚;沩:溈潙;怃:憮;怄:慪;诂:詁;诃:訶;祃:禡;诌:謅;诎:詘;诐:詖;诒:詒;屃:屭;陉:陘;妫:媯;刭:剄;纰:紕;纴:紝;纻:紵;纾:紓;玮:瑋;玡:琊;匦:匭;垆:壚;茏:蘢;茑:蔦;茔:塋;茕:煢惸;枧:梘;枨:棖;枞:樅;砀:碭;瓯:甌;殁:歿;郏:郟;轭:軛;虮:蟣;黾:黽;咝:噝;刿:劌;剀:剴;峄:嶧;钍:釷;钏:釧;钐:釤;钒:釩;钔:鍆;钕:釹;钗:釵;侪:儕;郐:鄶;籴:糴;戗:戧;狝:獮;饳:飿;饴:飴;疠:癘;兖:兗;炜:煒;炝:熗;泷:瀧;泸:瀘;泺:濼;怿:懌;诓:誆;诔:誄;诖:詿;诘:詰;郓:鄆;祎:禕;诜:詵;诤:諍;诨:諢;鸤:鳲;驽:駑;绀:紺;绁:紲;绂:紱;驵:駔;驺:騶;绋:紼;骀:駘;顸:頇;韨:韍;垭:埡;贲:賁;垱:壋;垲:塏;挢:撟;挦:撏;荙:薘;贳:貰;荛:蕘;垩:堊;荥:滎;荦:犖;荨:蕁;荩:藎;荪:蓀;荬:蕒;荭:葒;栊:櫳;栌:櫨;栀:梔;栎:櫟;柽:檉;郦:酈;砗:硨;砜:碸;殇:殤;轳:轤;轵:軹;轷:軤;轸:軫;轹:轢;轺:軺;虿:蠆;觇:覘;眍:瞘;昽:曨;哓:嘵;哔:嗶;哕:噦;郧:鄖;哙:噲;峣:嶢;帧:幀;峤:嶠;贶:貺;钘:鈃;钛:鈦;钡:鋇;钣:鈑;钤:鈐;钨:鎢;钪:鈧;钫:鈁;钬:鈥;钭:鈄;钯:鈀;俦:儔;俣:俁;舣:艤;胨:腖;胪:臚;狯:獪;飐:颭;飑:颮;饸:餄;饻:餏;娈:孌;疬:癧;疭:瘲;彦:彥;闼:闥;闾:閭;闿:闓;阂:閡;籼:秈;烃:烴;浈:湞;浍:澮;浐:滻;浒:滸;浔:潯;恹:懨;恺:愷;恽:惲;袆:褘;诮:誚;祢:禰;诰:誥;陧:隉;怼:懟;骅:驊;绗:絎;绛:絳;骈:駢;顼:頊;珰:璫;珲:琿;埘:塒;埚:堝;埙:塤;贽:贄;捃:攈;莳:蒔;莴:萵;莅:蒞;莶:薟;莸:蕕;鸪:鴣;莼:蒓蓴;桡:橈;桢:楨;桤:榿;逦:邐;硁:硜䃘;砻:礱;轼:軾;轾:輊;辀:輈;辁:輇;辂:輅;鸫:鶇;趸:躉;龀:齔;鸬:鸕;眬:矓;唛:嘜;唝:嗊;晔:曄;晖:暉;鸮:鴞;蚬:蜆;帱:幬;崂:嶗;崃:崍;赆:贐;钰:鈺;钲:鉦;钴:鈷;钷:鉕;钹:鈸;钺:鉞;钼:鉬;钽:鉭;钿:鈿;铀:鈾;铂:鉑;铄:鑠;铈:鈰;铉:鉉;铊:鉈;铋:鉍;铌:鈮;铍:鈹;铎:鐸;氩:氬;笕:筧;隽:雋;颀:頎;徕:徠;鸰:鴒;鸱:鴟;鱽:魛;鸲:鴝;猃:獫;馀:餘;栾:欒;疴:痾;痈:癰;衮:袞;颃:頏;阃:閫;阄:鬮;阆:閬;烨:燁;涞:淶;涠:潿;悭:慳;诹:諏;诼:諑;袯:襏;祯:禎;谂:諗;谇:誶;娲:媧;绠:綆;骊:驪;绡:綃;绤:綌;绥:綏;绦:絛;骍:騂;绨:綈;骎:駸;鸶:鷥;焘:燾;琏:璉;埯:垵;掴:摑;鸷:鷙;悫:愨慤;掼:摜;聍:聹;梾:棶;觋:覡;棁:梲;啬:嗇;厣:厴;硖:硤;硗:磽;硚:礄;鸸:鴯;龚:龔;赉:賚;龁:齕;眦:眥;啭:囀;趼:繭;啮:嚙;蛏:蟶;啴:嘽;帻:幘;赇:賕;赈:賑;铑:銠;铒:鉺;铕:銪;铗:鋏;铘:鋣;铙:鐃;铚:銍;铞:銱;铟:銦;铥:銩;铧:鏵;铨:銓;铩:鎩;铪:鉿;铫:銚;铬:鉻;铮:錚;铯:銫;铰:鉸;铱:銥;铴:鐋;铵:銨;铷:銣;鸹:鴰;稆:穭;秾:穠;笾:籩;偾:僨;鸺:鵂;鸻:鴴;舻:艫;鸼:鵃;脶:腡;鱾:魢;猡:玀;猕:獼;馃:餜;鸾:鸞;阇:闍;阈:閾;阊:閶;阋:鬩;阌:閿;阍:閽;阏:閼;羟:羥;粝:糲;焖:燜;渑:澠;渌:淥;谌:諶;皲:皸;裈:褌;谔:諤;谕:諭;谖:諼;谗:讒;谝:諞;粜:糶;婳:嫿;绫:綾;骐:騏;骒:騍;绲:緄;骓:騅;绶:綬;绹:綯;绺:綹;绾:綰;骖:驂;缁:緇;辇:輦;鼋:黿;揾:搵;颉:頡;揿:撳;絷:縶;蒇:蕆;蒉:蕢;蒌:蔞;椟:櫝;棹:櫂;椤:欏;鹀:鵐;赍:賫齎;椁:槨;鹁:鵓;酦:醱;鹂:鸝;觌:覿;硷:礆鹼;殚:殫;辊:輥;辋:輞;椠:槧;辌:輬;睑:瞼;跞:躒;蛱:蛺;蛲:蟯;蛳:螄;蛴:蠐;喽:嘍;嵚:嶔;嵝:嶁;赑:贔;铹:鐒;铻:鋙;铼:錸;铽:鋱;锃:鋥;锂:鋰;锆:鋯;锇:鋨;锊:鋝;锎:鐦;锏:鐧;锑:銻;锒:鋃;锓:鋟;锔:鋦;锕:錒;颋:頲;筚:篳;筜:簹;傩:儺;鹆:鵒;鲀:魨;鲂:魴;鲃:䰾;颍:潁;馇:餷;馉:餶;脔:臠;赓:賡;鹇:鷴;阑:闌;阒:闃;阕:闋;鹈:鵜;溆:漵;愦:憒;喾:嚳;谟:謨;裣:襝;裥:襇;谠:讜;禅:禪;谡:謖;谥:諡;骘:騭;媪:媼;巯:巰;毵:毿;骛:騖;缂:緙;缃:緗;缇:緹;缌:緦;缏:緶;缑:緱;缒:縋;缗:緡;骙:騤;飨:饗;耢:耮;韫:韞;摅:攄;赪:赬;毂:轂;蓦:驀;鹋:鶓;蓟:薊;蓠:蘺;蓥:鎣;蓣:蕷;榇:櫬;榉:櫸;碛:磧;辏:輳;辒:轀;龅:齙;龆:齠;跶:躂;跸:蹕;跹:躚;嗳:噯;锖:錆;锗:鍺;锘:鍩;锛:錛;锜:錡;锝:鍀;锞:錁;锟:錕;锧:鑕;锪:鍃;锫:錇;锩:錈;锬:錟;氲:氳;筼:篔;鹎:鵯;腽:膃;鲅:鮁;鲆:鮃;鲇:鮎鯰;鲈:鱸;鲉:鮋;鲊:鮓;鲋:鮒;鲌:鮊;鲏:鮍;鲐:鮐;鹐:鵮;飔:颸;馌:饁;馐:饈;瘅:癉;瘆:瘮;阖:闔;阗:闐;阘:闒;阙:闕;滟:灧;滠:灄;滢:瀅;滗:潷;滪:澦;鲎:鱟;骞:騫;谪:謫;谫:謭譾;嫒:嬡;嫔:嬪;缙:縉;辔:轡;骝:騮;缟:縞;缡:縭;缢:縊;缣:縑;骟:騸;觏:覯;撄:攖;蔹:蘞;蔺:藺;戬:戩;鹕:鶘;槚:檟;槠:櫧;酽:釅;酾:釃;霁:霽;鹗:鶚;嘤:嚶;罴:羆;赙:賻;罂:罌;鹘:鶻;锴:鍇;锶:鍶;锷:鍔;锸:鍤;锽:鍠;锾:鍰;锿:鎄;镃:鎡;镄:鐨;镅:鎇;箦:簀;箧:篋;箨:籜;箪:簞;箓:籙;鲑:鮭;鲔:鮪;鲙:鱠;鲚:鱭;鲛:鮫;鲟:鱘;飗:飀;馑:饉;銮:鑾;瘗:瘞;瘘:瘻瘺;阚:闞;鲞:鮝鯗;糁:糝;鹚:鷀;潆:瀠;潇:瀟;漤:灠;潋:瀲;潴:瀦;潍:濰;窭:窶;谮:譖;谯:譙;谰:讕;鹛:鶥;嫱:嬙;鹜:鶩;骠:驃;缦:縵;缧:縲;骢:驄;缫:繅;耧:耬;璎:瓔;撷:擷;撸:擼;觐:覲;鞒:鞽;蕲:蘄;蕰:薀;赜:賾;樯:檣艢;鹝:鷊;靥:靨;餍:饜;颙:顒;踬:躓;蝾:蠑;蝼:螻;颛:顓;镆:鏌;镈:鎛;镉:鎘;镋:鎲;镎:鎿;镏:鎦;镒:鎰;镓:鎵;镔:鑌;鹞:鷂;鹟:鶲;鲠:鯁;鲡:鱺;鲢:鰱;鲣:鰹;鲥:鰣;鲦:鰷;鲧:鯀;鲩:鯇;鲪:鮶;鲬:鯒;橥:櫫;觯:觶;鹠:鶹;馓:饊;鹡:鶺;齑:齏;糇:餱;鹣:鶼;谳:讞;谵:譫;屦:屨;缬:纈;缯:繒;骣:驏;颞:顳;颟:顢;薮:藪;橛:橜;橼:櫞;赝:贋贗;錾:鏨;辚:轔;螨:蟎;镗:鏜;镘:鏝;镚:鏰;镛:鏞;镝:鏑;镞:鏃;镠:鏐;氇:氌;穑:穡;魉:魎;鲭:鯖;鲮:鯪;鲯:鯕;鲰:鯫;鲱:鯡;鲲:鯤;鲳:鯧;鲴:鯝;鲵:鯢;鲷:鯛;鲺:鯴;鲹:鰺;鲻:鯔;亸:嚲;鹧:鷓;赟:贇;廪:廩;瘿:癭;麇:麕;濑:瀨;黉:黌;鹨:鷚;颡:顙;缲:繰;缳:繯;鹩:鷯;龋:齲;镡:鐔;镢:钁;镤:鏷;镥:鑥;镦:鐓;镧:鑭;镨:鐠;镩:鑹;镪:鏹;镫:鐙;簖:籪;鹪:鷦;鲼:鱝;鲽:鰈;鲾:鰏;鳀:鯷;鳁:鰮;鳂:鰃;鳃:鰓;鳆:鰒;鳇:鰉;鳈:鰁;鳉:鱂;鳊:鯿鯾;鹫:鷲;嬷:嬤;鞯:韉;鹲:鸏;颢:顥;鹭:鷺;镬:鑊;镭:鐳;镱:鐿;雠:讎;鳎:鰨;鳐:鰩;鳑:鰟;鹱:鸌;冁:囅;彝:彞;髌:髕;镲:鑔;鳘:鰵;鼗:鞀鞉;鳓:鰳;鳔:鰾;鳕:鱈;鳙:鱅;鳚:䲁;谶:讖;瓒:瓚;蘖:櫱;颥:顬;鼍:鼉;臜:臢;鳜:鱖;鳟:鱒;骧:驤;鳡:鱤;鳢:鱧;灏:灝;鹳:鸛;镵:鑱;趱:趲;躜:躦;鼹:鼴;馕:饢;戆:戇;梼:檮;𪨊:㞞;飏:颺';
  var noChange = '一乙二十丁廠厰七蔔八人入兒九几幾了乃刀力又三乾幹榦於虧士土工才下寸丈大與萬上小口山巾千乞川億個麼久勺丸夕凡及廣亡門義之屍已弓己衛子也女飛刃習叉馬鄉豐王井開夫天元無雲專紮藝木五支廳不太犬區歷歴曆友尤匹車巨牙屯比互切瓦止少日中貝內水岡見手午牛毛氣陞長仁甚片僕化仇幣仍僅斤爪反介父從今兇分乏公倉月氏勿風欠丹勻烏勾鳳六文方火為鬥鬦鬭憶計訂戶認心尺引丑醜巴孔隊辦以允予勸雙書幻玉栞末未示擊打巧正撲扒功扔去甘世古節本術可丙左厲石右布龍平滅軋東卡北占業舊帥歸帰目旦且叮葉枼甲申號電田由隻衹祇秪央史兄叼叫叨另嘆歎四生失禾丘付仗代仙們儀白仔他斥瓜乎叢樷令用甩印樂句匆冊犯外處処䖏冬鳥務包饑飢主市立閃蘭半汁匯頭漢寧穴它討寫冩讓禮訓必議訊記永司尼民出齣遼奶奴加召皮邊孕發髮髪聖對臺矛糾母幼絲式刑動扛寺吉扣考託老圾鞏執擴掃地揚場塲耳共芒亞芝朽樸機權過臣再協西壓厭在百有存而頁匠誇奪灰達列死成夾軌邪劃畫邁畢至此貞師塵尖劣光當早吐嚇蟲曲團衕弔喫因吸嗎嶼帆歲回豈則剛網肉年硃先丟舌竹遷喬偉傳乒乓休伍伏優伐延件任傷價份華仰仿夥偽自血曏似後行舟全會殺合兆企眾爺傘創剏剙肌朶雜危旬旨負各名多爭色壯沖衝冰莊慶亦劉齊交次衣產決充妄閉問闖羊並併竝關関米燈州汗污江池湯忙興宇守宅字安講軍許論農諷設訪尋那迅盡儘藎導異孫陣陽收階堦陰防姦如婦好她媽戲戯羽觀歡買紅纖約級紀馳巡壽夀弄麥形進戒吞遠逺違運扶撫壇罈技壞擾拒找批扯址走抄壩貢攻赤折抓扮搶孝均抛投墳坑抗坊抖護殼殻誌扭塊聲把報卻劫芽花芹芬蒼芳嚴蘆勞剋蘇桿杜槓材村杏極李楊求更束豆兩麗醫毉辰勵否還殲來連步堅旱盯呈時吳助縣裏裡呆園曠圍呀噸足郵男睏吵串員聽吩吹嗚吼吧別彆崗帳財釘針告我亂利禿秀私每兵估體何但伸作伯伶傭低你住位伴身皂佛近徹役返餘希坐谷穀妥含鄰岔肝肚腸龜免狂猶角刪條卵島迎飯飲係繫言凍狀畝況床庫療應冷這序辛棄冶忘閑間閒悶判竈燦弟汪沙汽沃泛溝沒瀋沉懷憂快完宋宏牢究窮災良證啓啟評補初社識訴診詞譯君靈即層尿尾遲局改張忌際陸阿陳阻附妙妖妨努忍勁雞鷄驅純紗綱納縱駁駮紛紙紋紡驢紐奉玩環武青責現錶規抹攏拔揀坦擔押抽拐拖者拍頂拆擁抵拘勢抱垃拉攔幸拌招坡披撥擇抬其取苦若茂蘋苗英範直茄莖茅林枝盃櫃析板闆鬆槍構傑述枕喪或畫臥事刺棗雨賣礦鑛碼廁奔奇奮態歐壟妻轟頃轉斬輪軟輭到非叔肯齒些虎虜腎賢尚旺具果味崑國昌暢明易昂典固忠咐呼鳴詠呢岸岩帖羅幟嶺凱敗販購圖釣製知垂牧物乖颳稈和季委佳侍供使例版姪偵側憑僑佩貨依的迫質欣徵往爬彼徑逕所捨金命斧爸採采埰受乳貪念貧膚肺肢腫脹朋股肥服脅周昏魚兔狐忽狗備飾飽飼變京享店夜廟府底劑郊廢淨凈盲放刻育閘鬧鄭券捲單炒炊炕炎爐沫淺法泄河沾淚油泊沿泡註瀉泳泥沸波潑澤治怖性怕憐怪學寶寳宗定宜審宙官空簾實試郎詩肩房誠襯衫視話誕詢該詳建肅隸錄録居屆刷屈弦承孟孤陝降限妹姑姐姓始駕參艱綫線練組細駛織終駐駝紹經貫奏春幫珍玻毒型掛封持項垮挎城撓政赴趙擋攩挺括拴拾挑指墊掙擠拼挖按揮挪某甚革薦巷帶草繭茶荒茫蕩盪榮故鬍衚南葯藥標枯柄棟相查柏柳柱柿欄樹要鹹威歪研磚釐厚砌砍麵麫耐耍牽殘殃輕鴉皆背戰點臨覽豎省削嘗是盼眨鬨啞顯冒映星昨畏趴胃貴界虹蝦蟻思螞雖品嚥罵嘩咱響嚮哈咬咳哪炭峽罰賤貼骨鈔鐘鋼鑰鉤卸缸拜看矩怎牲選適秒香種秋科重復複竿段便倆貸順修保促侮儉俗俘信皇泉鬼侵追俊盾待律很須鬚敘劍逃食盆膽勝胞胖脈勉狹獅獨狡獄狠貿怨急饒蝕餃餅彎將奬獎哀亭亮度跡蹟庭瘡瘋疫疤姿親音帝施聞閥閣差養美薑叛送類迷前首逆總煉炸炮爛剃潔洪灑澆濁洞測洗活派洽染濟洋洲渾濃津恆恢恰惱恨舉擧覺宣室宮憲突穿竊客冠語扁襖祖神祝誤誘說説誦墾退既屋晝費陡眉孩除險院娃姥姨姻嬌怒架賀盈勇怠柔壘綁絨結繞遶驕繪給絡駱絕絞統耕耗艷泰珠班素蠶頑盞匪撈栽捕振載趕起鹽捎捏埋捉捆捐損都哲逝撿換輓熱恐壺挨恥耽恭蓮莫荷獲穫晉惡真框桂檔桐株橋桃格校核樣根索哥速逗慄配翅辱唇夏礎破原套逐烈殊顧轎較頓斃緻柴桌慮監緊黨曬眠曉鴨晃晌暈蚊哨哭恩喚啊唉罷峰圓賊賄錢鉗鑽鐵鈴鉛缺氧特犧造乘敵秤租秧積秩稱秘透筆笑筍債借值倚傾倒倘俱倡候俯倍倦健臭射躬息徒徐艦艙般航途拿爹愛頌翁脆脂胸胳臟髒膠腦狸狼逢留皺餓戀槳漿衰高席準座脊癥病疾疼疲傚離唐資涼站剖競部旁旅畜閱閲羞瓶拳粉料益兼烤烘煩燒燭煙遞濤浙澇酒涉消浩海塗浴浮流潤浪浸漲燙涌悟悄悔悅害寬家宵宴賓窄容宰案請朗諸讀扇襪袖袍被祥課誰調冤諒談誼剝懇展劇屑弱陵陶陷陪娛娘通能難預桑絹繡驗繼球理捧堵描域掩捷排掉推堆掀授敎掏掠培接控探據掘職基著勒黃萌蘿菌菜萄菊萍菠營械夢梢梅檢梳梯桶捄副票戚爽聾襲盛雪輔輛虛雀堂常匙晨睜眯眼懸野啦晚啄距躍略蛇纍唱患唯崖嶄崇圈銅鏟銀甜梨犁移笨籠笛符第敏做袋悠償偶偷您售停偏假得銜盤船斜盒鴿悉慾彩領腳脖臉脫象夠猜豬獵貓猛餡館舘湊減毫麻癢痕廊康庸鹿盜章竟商族旋望率著蓋粘粗粒斷剪獸清添淋淹渠漸混漁淘液淡深婆梁滲情惜慚慙悼懼惕驚慘慣寇寄宿窯密謀謊禍謎逮敢屠彈隨蛋隆隱婚嬸頸績緒續騎繩維綿綢紬綠緑琴斑替款堪塔搭越趁趨超提堤博揭喜插揪搜煮援裁擱摟攪握揉斯期欺聯散惹葬葛董葡敬蔥落朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑逼廚㕑廈硬確雁殖裂雄暫雅輩悲紫輝敞賞掌晴暑最量噴晶喇遇喊景踐跌跑遺蛙蛛蜓喝喂喘喉幅帽賭賠黑鑄鋪鏈銷鎖鋤耡鍋銹鏽鋒銳鋭短智毯鵝鵞䳘剩稍程稀稅筐等築策篩筒答觔箏傲傅牌堡集焦傍儲奧街懲禦循艇舒番釋禽臘脾腔魯猾猴然饞裝蠻就痛童闊善羨普糞尊道曾焰港湖渣濕溫渴滑灣渡游滋溉憤慌惰愧愉嘅割寒富竄窩窗遍裕褲裙謝謠謡謙屬屢强粥疏隔隙絮嫂登緞緩騙編緣瑞魂肆攝摸填搏塌鼓擺攜搬搖搞塘攤蒜勤鵲藍墓幕蓬蓄矇蒸獻禁楚想槐榆樓概賴酬感礙碑碎碰碗碌雷零霧雹輸督齡鑒鑑睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩錯錫鑼錘鎚錦鍵鋸矮辭辤稠愁籌籤簽簡毀舅鼠催傻像躲微愈遙腰腥腹騰腿觸解醬痰廉新韻意糧數煎塑慈煤煌滿漠源濾濫滔溪溜滾濱粱灘慎譽塞謹福群殿闢障嫌嫁疊縫纏靜碧璃牆墻撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷釀酸磁願需弊裳顆嗽蜻蠟蠅蜘賺鍬鍛舞穩算籮管僚鼻魄貌膜膊膀鮮疑饅裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢寨賽察蜜譜嫩翠熊凳騾縮慧撕撒趣趟撐播撞撤增聰鞋蕉蔬橫槽櫻橡飄醋醉震霉瞞題暴瞎影踢踏踩蹤蝶蝴囑墨鎮靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩顏毅糊遵潛潮懂額慰噼操燕薯薪薄顛橘整融醒餐嘴蹄器贈默鏡贊籃邀衡膨鵰彫琱磨凝辨辯糖糕燃澡激懶壁避繳戴擦鞠藏霜霞瞧蹈螺穗繁辮贏糟糠燥臂翼驟鞭覆蹦鐮翻鷹警攀蹲顫瓣爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐匕刁丐歹戈夭崙譏冗鄧艾夯凸盧叭嘰皿凹囚矢乍爾馮玄邦迂邢芋芍吏夷吁呂吆屹廷迄臼仲倫伊肋旭匈鳧鳬妝亥汛諱訝訛訟訣弛阱馱馴紉玖瑪韌摳扼汞扳掄坎埳塢抑擬抒芙蕪葦芥芯芭杖杉巫杈甫匣軒滷鹵肖吱吠嘔吶吟嗆吻吭邑囤吮嶇牡佑佃伺囪肛肘甸狽鳩彤灸刨庇吝廬閏兌灼沐沛汰瀝淪洶滄滬忱詛詐罕屁墜妓姊妒緯玫卦坷坯拓坪坤拄擰拂拙拇拗茉昔苛苫苟苞茁苔枉樞枚楓杭鬱礬奈奄毆歧卓曇哎咕呵嚨呻咒咆咖帕賬貶貯氛秉嶽俠僥侶侈卑劊剎餚覓忿甕骯肪獰龐瘧疙疚卒氓炬沽沮泣濘泌沼怔怯寵宛衩祈詭帚屜弧彌陋陌函姆虱參紳駒絆繹契貳玷玲珊拭拷拱挾垢垛拯荊茸茬莢茵茴蕎薺葷熒荔棧柑柵檸枷勃柬砂泵硯鷗軸韮虐昧盹咧暱昭盅勛哆咪喲幽鈣鈍鈉欽鈞鈕氈氫秕俏俄俐侯徊衍胚朧胎猙餌巒奕咨颯閨閩籽婁爍炫窪柒涎洛恃恍恬恤宦誡誣祠誨屏屎遜隕姚娜蚤駭耘耙秦匿埂捂捍袁捌挫摯搗擣捅埃耿聶荸莽萊莉瑩鶯梆棲樺栓桅樁賈酌砸砰礫殉逞哮嘮餔剔蚌蚜畔蚣蚪蚓哩圃鴦唁哼唆峭唧峻賂贓贜鉀鉚氨秫笆俺賃倔殷聳舀豺豹頒胯胰臍膿逛卿鴕鴛餒凌淒衷郭齋疹紊甆羔烙浦渦渙滌澗涕澀悍憫竅諾誹袒諄祟恕娩駿瑣麩䴸琉瑯措捺搥赦埠捻掐掂掖擲撣撢摻勘聊娶菱菲萎菩螢乾蕭薩菇彬梗梧梭曹醖醞酗廂硅碩奢盔匾顱彪眶晤曼晦冕啡畦趾啃蛆蚯蛉蛀唬囉唾啤啥嘯崎邏崔崩嬰賒銬鐺鋁鍘銑銘矯稭穢笙笤偎傀軀兜釁徘徙舶舷舵斂翎脯逸凰猖祭烹庶庵痊閻闡眷焊煥鴻涯淑淌淮淆淵淫淳淤澱涮涵惦悴惋寂窒諜諧襠袱禱謁謂諺尉墮隅婉頗綽綳繃綜綻綴巢琳琢瓊揍堰揩攬揖彭揣攙搓壹搔葫募蔣蒂韓稜椰焚椎棺榔橢粟棘酣酥硝硫頰靂翹鑿棠晰鼎喳遏晾疇跋跛蛔蜒蛤鵑喻啼喧嵌賦贖賜銼鋅甥掰氮氯黍筏牘粵逾醃腋腕猩蝟憊敦痘痢瘓竣翔奠遂焙滯湘渤渺潰濺湃愕惶寓窖窘雇謗犀隘媒媚婿緬纜締縷騷瑟鵡瑰搪聘斟靴靶蓖蒿蒲蓉楔椿楷欖楞楣酪碘硼碉輻輯頻睹睦瞄嗜嗦暇畸蹺跥蜈蝸蛻蛹嗅嗡嗤署蜀幌錨錐鍁錠錳稚頹筷魁衙膩腮腺鵬肄猿穎煞雛饃餾稟痹廓癡靖謄灕溢溯溶滓溺寞窺窟寢褂裸謬媳嫉縛繽剿贅熬赫蔫摹蔓蔗藹熙蔚兢榛榕酵碟碴鹼碳轅轄雌墅嘁踴蟬嘀幔鍍舔熏箍箕簫輿僧孵瘩瘟彰粹漱漩漾慷寡寥譚褐褪隧嫡纓攆撩撮撬擒墩撰鞍蕊藴蘊樊樟橄敷豌醇磕磅碾憋嘶嘲嘹蝠蝎蝌蝗蝙嘿幢鑷鎬稽簍臕鯉鯽褒癟瘤癱凜澎潭潦澳潘澈瀾澄憔懊憎翩褥譴鶴憨履嬉豫繚撼擂擅蕾薛薇擎翰噩櫥橙瓢蟥霍霎轍冀踱蹂蟆螃螟噪鸚黔穆篡篷篙籬儒膳鯨癮瘸糙燎瀕憾懈窿韁壕藐檬檐檁檀礁磷瞭瞬瞳瞪曙蹋蟋蟀嚎贍鐐魏簇儡徽爵朦臊鱷糜癌懦豁臀藕藤瞻囂鰭癩瀑襟璧戳攢孽蘑藻鱉鼈蹭蹬簸簿蟹靡癬羹鬢髩攘蠕巍鱗糯譬霹躪髓蘸鑲瓤矗兀弋丫巳孑幺韋卅仄厄曰壬仃兮亢閂訃尹毋卉艿札叵戊叱叩冉仨仕卯芻汀訕弗弘阡馭匡戎圳捫亙戌戍堯旯曳岌囡氖伎伢倀伉佇夙旮刎汲汐汝忖懺祁訥阪丞妃牟紂紈阪坍抉邯蕓杞忑吾酉磯尬忒忐囈呃町唄唚岑嵐圇囫邱佐攸佝伽彷孚坌邸奐狄鄒飩飪亨癤肓沌沂汾汶沆沁忡忤愾悵忪愴忸祀詆詔孜隴陀妍嫵嫗妣妊妞邵甬矣紜綸盂壠抨拈拎坨拚坳耶苯苜苓苑苕櫪枇杳杷鳶咂呸咔迪咀呷咋呱咚嚀咄巋岬沓囹罔釺迭氂迤佬臾岱侃侏儈佻佼佯儂帛阜慫剁邇狙狒咎炙梟餞冽庖瘍庚妾劾燉泔泱泅沱泯涇怙怵怦怏怩怡宕穹戾詼祉誅詬詮詣詫詡亟妯姍妮弩迦迢駟駙縐絀驛琺瓏珀珈拮撾垣撻赳拽哉郝垠蓽茯荏薈茨蔭茹櫛柯柩柚枸剌酊甭砒奎耷殆軲軻軼毖哐眈哇咦毗虻咣剮咿咯吒噥峙峋崢貽鈈氟竽篤儼儷叟皈禹俑逅徇徉舢俞俎瓴脛鴇匍狩猻訇餉餎孿弈疣疥迸酋茲炳熾炯浹瀏慟恫惻恪祛誑鴆郡咫陛婭嬈奼矜絝驍絢挈敖埔捋莠莓荼莩莎莞桔桓桎檜栩孬砝礪砧砣虔逍眩哧哽蚍蚝嗩圄哦唏盎峨覬賅缽氦舐秣俸倩偌倏倭倪俾倜倥臯釜奚胱胴胭膾朕璽桀裊餑攣皰痙凋恣恙粑朔鄲燴燼漣娑涅涓悖悚悛宸窈剜冢冥諉諛諂屐屙奘陲姬娠娌娟娥嫻娣娓婀騁彗揶焉擄掬掮掇聆萁萃菅縈梵婪梏欞匱酚戛廐廄殞殮輒塹嘖眺眸啪喏蹌蠣蠱蚱鄂啕唷啷唳啜幗帷崛鎧銖鋌銃逶箋笠偃偕傯僂皚徜龕豚匐猝餛孰痔痍疵旌旎袤閹羚粕烯烽烷漬淅淞瀆挲涸愜㥦悻悱惘悸惟惆惚憚寅窕諫扈謔諳諦敝隍婊娼婢嬋袈翌恿綺緋綣琵琶琥靚搽揠趄揄蟄摒揆聒萱戟厥輟輜睞喋嗒喃跚跎蛭蛟嗖喑嗟喀喔喙嶸崽幄鏗掣氰犢犄鵠筵傣儻儐皓皖遁徨弒頜舜貂腓腆腴腑腚腱魷猢猥颶觴饋餿褻斌痣癆痞痤癇痧頦湮渭湍渝渲慍惺惴愣愎寐扉褳祿冪謐遐孱弼婷緘緲緝瑚瑜瑕驁瑙趔趑蜇擯頤楠楂槌櫚裘剽甄酮酯酩蜃磣鵪尷齟虞睫韙嗷睨睥嘟嗑囁嗔嗝煦遢躋跤蜊蜍蜉嗣嗯嗥嗲嗨骰錮錙歃牒煲艄覦貉頷靦齶詹穌鮑颼觥遛鶉痱痿瘁裔雍豢猷溥裟灤滂懾竇謾媾媲縝縟瑤韜髦墟撂薔蔡蔻蓿斡檻榻檳酶廝磋殯霆輾蜚翡齜齦睿瞅睽嘈嘎曖躊踉蜥蟈蜴蜷蜿螂蜢噓嘛嶂骷鍥鏘鎂鏤犒箔儆魅睾膈臏獐塾瘙廖韶旖粼粽煽潢漪慵肇褡褓褸譎暨屣嫣嫖嫦縹繆璀璋撅攛聵韃蕃魘磊霄轆齬齪覷覻覰瞌瞑嘻噎噶踝踟踮躑踞噗顎噢嚕噔旛嶙骼骸鐫鎸鎳鎊稷箴簣篆磐滕獗饌麾瘠糍熠潸鯊潺憬憧襤熨戮繕璞擻鞘橇樵櫓醐醍磺飆飈飇霖霓氅瞥瞟瞠瞰噤踹踵蹉噱噬噻噼罹鏢憩篝盥翱獺邂瘴斕寰窸褶禧繾璨罄藉蘚齷壑矚嚏嚅躡蹣蹊螳蟑嚓羈黜黝髁簧簌篾鼾臆臃鰍襄膺麋懣濡蹇邃襁孺鷸鰲鬃藩蹩瞿躇蟠黠髏鐲馥鰥癖懵邋麓靄曝躕蹶蹴躥蟾巔髖籟鰻麒鏖瀚瀣驥纘馨曦躅黷鑣鑞鱔孀礴顰黯癲贛霾攫顴麟蠹鑫囔乂乜亍彳孓亓廿仉仂刈爻殳卞夬爿邗戔邛艽匝丕匜勱卟叻氕仟仡仫伋仞卮氐犰庀鄺邙汈忉宄訐訌訖尻阢尕弁耒玎璣圩圬圭扦圪壙圯圮芏芊芨芄芎芑薌厙夼尥乩屺凼囝釓釔缶氘牝傴仳佤仵傖囟甪汆氽刖犴獷獁舛鄔餳冱邡汕汔汜汊謳詎聿艮厾阮妁紆紇纊玕玙瑒摶抔壢圻扺抃毐芫芾芰藶苊苣芷芮莧芼萇蓯芩芪芴芡芟苄苧苡杌杓杧孛邴邳奩匳匲豕歟軑軔迓邶羋卣鄴旰呋呔嚦暘吡虯咼吲岍幃岐岈峴兕釗釙釕迕氙氚嶴佞伾佚佟佗佘僉豸肟劬狃狁餼飫飭廡庋疔闈閎閔閌羌煬灃沅沄沔漚沘沏沚汩汨汭沨汴溈潙泐憮忮慪忻忭詁訶禡謅詘詖詒屭阽阼陂陘妗媯姒妤劭剄邰紕紝紵紓瑋琊玠玢玥玦甙忝匭邽坩拤坫壚抻拃拊坼坻坭抿耵苷苤蘢苴苒苘茌苻茚茆蔦茓塋煢惸苠茀杪枘梘杵棖樅枋杻杼矸矻矽碭刳甌歿郟軛郅盱昊杲昃昕昀旻昉炅畀蟣黽呤呶呦噝岵岢岫帙岣峁劌峂迥岷剴帔嶧釷釧釤釩鍆釹釵邾迮竺佶佴侑佰侉侗佾儕侔郈徂鄶郄糴戧肼朊肽肱肫肭肷郇狉狎獮狍飿飴冼癘疝兗於煒熗炔沭瀧瀘泗泠泜濼泃泖泫泮泓怛怍怫怊懌穸宓誆誄詿詰戽鄆祆禕詵諍諢鳲戕孢陔卺妲帑孥駑迨紺紲紱駔騶紼駘甾砉耔珏珂玳頇珉韍埡垯垤賁壋垌塏撟埏垍垧垓垟垞撏拶茜薘荑貰蕘茈茼莒茱莛荇荃荀茗茭堊茳滎犖蕁茛藎蓀蕒葒柰柘櫳枰櫨柙枵枳柞柝梔柃柢櫟柈柁檉郚剅酈硨砑砘斫砭碸虺殂殤殄轤軹軤軫轢軺蠆覘尜眄瞘郢眇眊曨咭禺哂咴曷昴昱嘵嗶畎呲胄畋畈虼噦鄖咻囿哌噲哚咩哏哞嶢罘幀峒嶠峧帡貺鈃鈦鋇鈑鈐鎢鈧鈁鈥鈄鈀矧氡牯郜秭笈儔俅垡牮俁俚俜俟艤弇郗卻爰郛腖胩臚胛胂胙胍胗胝朐狨獪颭颮訄逄昝餄餏胤孌庤庥癧瘲疢庠竑彥闥閭闓閡羑秈炻炟烀炷烴洱洹洧洌泚湞浉洇洄洙洑洎洫澮洮洵洚洺洨滻洴洣滸潯浕洳懨愷恂惲宥宬窀扃褘衲衽衿袂祜祓祚誚祗禰誥昶弭牁胥陟隉姞姝姽姣姘懟羿炱癸驊絎彖絳駢耖恝珥珙頊璫珽珩珧珣珞琤琿恚埕塒堝塤挹耆耄埒贄垸攈盍莰茝莆蒔萵莪莜蒞薟荽蕕荻莘莨莙鴣蒓蓴栲栳郴橈楨桄榿梃栝桕桁栒栟桉逑逋彧鬲豇酐酎酏邐厝砹砷砟砼砥硜䃘恧剞礱軾輊輈輇輅鶇躉剕齔鸕矓嘜晟眙嗊哳唔曄晁晏暉鴞趵趿畛蚨蚋蜆蚧唣唑幬嶗崍罡罟峪贐鈺鉦鈷鉕鈸鉞鉬鉭鈿鈾鉑鑠鈰鉉鉈鉍鈮鈹鐸眚氬氤毪盉笄筧笊笫笏俵倻俳俶倬恁隼雋倞倓倌臬郫倨衄頎徠舨舫瓞鬯衾鴒脎胲胼脒胺鴟魛鴝狴狷猁狳獫狺逖狻眢餘凇欒勍亳疳痾疽疸痄癰疰痃痂袞頏旆旄旃閫鬮閬桊敉烜燁烊剡郯浡涑浯淶潿浞涢浥涔浜浠浼浣涘浚慳悝悃悒悌悢窅諏扅諑袪袗袢襏禎祧諗誶陬勐疍牂蚩陴烝娉媧砮哿畚逡剟綆驪綃綌綏絛騂綈駸邕鷥耜燾舂琎璉琇掭埴掎埼垵捯摑埸堌赧捭晢逵埝堋堍鷙掊堉捩愨慤埭埽摜聃聹菁菝菥菘堇萘萋勩菽菖萜萸萑菂棻菔菟萏菼菏菹菪菀菰菡梽棶覡桴桷梓梲桫嗇郾敕豉鄄酞厴硎硭硒硤磽硐礄硇硌鴯瓠匏龔殍賚雩齕眭唪眥晡眵圊喵啉勖晞晗囀繭趺嚙蚶蛄蚰蚺圉蟶蚴啁唿啐唼嘽啖啵啶幘崦崮崟崤崞崆賕賑銠鉺銪鋏鋣鐃銍銱銦銩鏵銓鎩鉿銚鉻錚銫鉸銥鐋銨銣氪牾鴰穭穠筇笸笪笮笱笥笳籩笞僨鵂偈偲皎鴴舸艫舳舴鵃瓻腡脞脬脘脲脧魢猗玀猊猞猄斛觖獼馗餜鸞庹庼庾庳翊闍閾閶鬩閿閽閼羝羥糲焐焓燜烺焌渚淇涿淖淏淠澠淦淝淬涪淙涫淥淄惝惇逭諶皸袼褌裉祲諤諭諼讒諞逯艴隋郿隈糶隗婧婞嫿婕胬欸綾騏騍緄騅綬綯綹綰驂緇耠琫琪瑛琦琨琰琮琯琬琛琚輦黿揳堞塃揸堙搵頡塄撳堠耋蛩縶塆揞揎掾葜葑葚靰靸葳蕆蒈葺蕢葸萼蓇萩葆葩葶蔞葓蒎葖葭楮棼櫝櫂欏棰椑鵐賫齎椋槨棬楗棣椐鵓覃酤酢酡醱鸝覿硪礆鹼殫殛雯輥輞槧輬斐黹牚瞼睇睃戢喱喹晷喈跖跗躒跏跆蛺蟯螄蛐蛞蠐蛘蛑畯喁喟斝啾喤嘍嗞嵖崴遄詈嵎嶔嵬嵛翙嵯嶁嵫嵋贔鐒鋙錸鋱鋥鋰鋯鋨鋝鐦鐧銻鋃鋟鋦錒矬毳毽犋犍頲嵇稃稂筘篳簹筅筌傈舄遑儺舾畲翕釉鵒腈腙腒魨魴䰾潁猹觚猸猱飧餷餶臠裒廋痦鄌賡竦瓿啻鷴闌闃闋粞遒孳焯焜焱鵜湛渫湎湝湨湜湫溲湟漵湲溠溇湔湉渥湄滁憒愀愔嚳謨棨扊裎襝襇祾祺祼讜禪謖諡塈巽騭媼媛巰毿翚皴婺騖緙緗彘緹緦緶緱縋緡騤饗耮瑁瑀瑗瑄遨遘韞髡塥塬鄢攄摁赬塮搋搒搐搛搠彀轂搌搦搡蓁戡蓍鄞靳蓐驀鶓蒽蓓蓊蒯薊蓑蒺蘺蒟蒡蒹蒴蒗蓂鎣蕷楝楫榀楸椴楯櫬槎櫸楦楹椽酰磧碓碚碇輳轀齙齠觜訾粲睚嗪嗉睢雎嗬戥嗄暅暄暌跬躂蹕跐跣躚蛸蜎蜣畹噯嗌嗍嗵罨嵊嵩嵴錆鍺鍩錛錡鍀錁錕鑕鍃錇錈錟雉氳犏稞稗稔筠筢筮筻筲篔筱鵯敫僇徭愆毹貊貅腠腩膃腧塍媵鮁鮃鮎鯰鱸鮋鮓鮒鮊鮍鮐鵮颸饁饈亶廒瘃痼瘐癉瘮鄘麂鄣歆旒闔闐闒闕羧粳煳煜煨煅煊煸煺灧溱溘灄漭瀅滇溧溽溻溷溦潷滫溴滏滃溏溟滘滍澦愫慥慊鱟騫窠窣裱褚裼裨裾裰禊謫謭譾嫫嬡嬪媸縉轡騮縞縭縊縑騸耥璈瑭瑢獒覯慝嫠墈摽墁摞攖翥踅銎摭墉墒榖撖摺綦靺靼鞅靽鞁靿蔌甍蔸蓰蘞蔟藺戩蕖鶘嘏蓼榧檟榫槜榭槔槁櫧榷榍僰釅釃酲酴酹碶碡碣碲碹碥劂臧豨霽裴夥瞍嘞嘌暝跽蜞蜮蜾蜱蜩嘡鶚嘣嚶嘚嗾嘧羆罱幛賻罌骶鶻鍇鍶鍔鍤鍠鍰鎄鎡鐨鎇箐簀篋箸籜箬箅簞箜箢籙毓僖僳僭僬劁僦僮魃魆艋鄱鮭鮪鱠鱭鮫鱘獍飀觫雒夤饉鑾麽廙瘌瘞瘊瘥瘻瘺膂闞鄯鮝鯗糝槊鷀熘熥瀠瀟灠漕滹漯漶瀲瀦漉漳澉濰搴窬窨窶寤綮譖褙褊禚譙讕鶥嬙嫚嫘嫜嫪鼐翟瞀鶩驃縵縲驄繅耦耬瑾璜瓔璁璇璆奭髯髫擷赭墦擼鋆撙墀覲蕙鞽蕈蕨蕤蕞蕺瞢劐蘄薀賾鼒槿檣艢槭樗樘槲鷊醌醅靨饜磔磙磉殣慭霈嘭顒暹踔躓踣踺蝽蠑蝻蝰蝮螋蝓蝣螻蝤嘬噍噙噌噀顓幞嶓嶝骺鏌鎛鎘鎲鎿鎦鎰鎵鑌篁篌牖儇儋徵虢鷂鶲鯁鱺鰱鰹鰣鰷鯀鯇鮶鯒櫫獠觶鶹饊廛鶺瘛瘼瘢齏羯羰餱遴糌糈糅翦鶼熜熵澍澌潵潲鋈潟潼潽潏寮窳讞褫禤譫屨勰蝥纈繒驏畿耩耨耪璟靛璠璘聱螯髻髭髹擀熹甏擐磬鄹顳蕻黇顢薤薨檠薏蕹藪薜薅樾橜檎橦樽樨櫞墼橐翮醛醚醑觱磲贋贗殪霏鏨轔臻遽嚄嚆暾曈蹀蹅踶踽蹁蟎蟒螈螅螭螗螠噫幪圜鏜鏝鏰鏞鏑鏃鏐氌氆穡穄篚篥簉篦篪劓魎魈徼歙盦膪螣膦膙鯖鯪鯕鯫鯡鯤鯧鯝鯢鯛鯴鰺鯔獴獬憝嚲鷓廨贇癀瘭瘰廩癭瘵癃瘳麕麈嬴壅羲糗甑燠燔燧燊燏瀨濉潞澧澴澹澥澶濂澼憷黌褰嬖犟隰嬗鷚翯顙繰繯璩璐璪螫擤觳擢薹鞡薷薰藁檑檄懋醢翳繄礅磴鷯齲豳黻瞵蹓蹐螬螵疃罽罾嶷髀鐔钁鏷鑥鐓鑭鐠鑹鏹鐙罅黏簃篼簏籪簋鼢黛鷦皤魍艚龠繇貘邈貔臌膻臁鱝鰈鰏鯷鰮鰃鰓鰒鰉鰁鱂鯿鯾獯螽燮鷲縻癍馘濮濞濠濯謇襕檗甓擘隳嬤蟊鍪鏊鬹鬈瞽韉鞨鞫鞧鞣藜藠鸏檫檵醪蹙礞礓礌燹餮曛顥曜鷺蹢蹜蟛蟪蟮嚚鹮黟髂鑊鐳鐿簠簟簪簦鼫鼬鼩讎艟臑鰨鰩鰟鸌癔癜糨囅瀍瀌鎏彞鬏攉鞲鞴藿蘧蘅醭醮醯礤酃霪黼嚯蹽蹼蹯蹾蠖蠓蠋蠊黢髕鑔籀鰵齁魑艨鞀鞉鰳鰾鱈鱅䲁蠃羸瀛襦讖襞瓚蘩櫱蘘醵醴霰顬酆矍鼉巉黥黧纂鼯犨臢鱖鱒獾瀹瀵驤耰瓘鼙醺礳曩鼱鱤鱧麝夔爝灝禳鐾羼蠡耲耱懿韂鸛糵蘼氍饕躔躐髑鑱穰鳤饔鬻鬟趲攥躦鼴鼷癯蠲醾躞灞襻纛鬣攮饢戇衢蠼爨齉掯腲檮㒲躧㞞磞嚛槅搊麄姤漰颺裩甃軃毴硶漒扱鮹捽肏榪趫蚫姮靉叇㩟舡鞮傞俹鬅鬠毬膫膋爇蝍嗏襆欹賨曌';
  var additional =
    '愍澂儱憍呬瞋鬘棸踰跢鞞佉頞罥羂' +
    '𭉨𡆗𡀔𭊃𠲿𭉨𠲜𠻬𫪛𭇔𭊗𭌆㗚𠸎𠵫𭉜𭍊𠷖𭈠𭊃𭌂𠼶𠻲𢛡𢤱𡺸㙛𤬪𮟨𭕷𭒂𧄼𦶇𧂐𤧕𤑫𭦉' +
    '𣰆𣩠𦙱𣍦曀𪾼𥢶𥝟𤴨𦂅𥿞𥿫𧎴𦪑𨄈𨄔𨅊𧯞𧰃𨋶𩋵𪒠𪗦㝹𤚥𢍶隷𡖐𩭤𤙖𮩚';

  // Note that for a 简体字, later rules will override previous ones.
  // To extend rules for particular contexts, use the customRules mechanism.

  // 1. For no-changes:
  var a = noChange + additional;
  for (var i in a) ruleSet.setSimple(a[i]);

  // 2. For simple mapping:
  a = mapping.split(';');
  for (var i in a) { var b = a[i].split(':'); ruleSet.setSimple(b[0], b[1]); }

  // 3. For particular cases:
  ruleSet.parseRules(`
[摆] =擺 襬<下衣裙
[板] =& 闆<老
[表] =& 錶<怀,手,钟,挂,金,水,电,温度,电子,原子,石英 錶>链带壳
[别] =& 彆>扭,不过
[卜] =& 蔔>萝
[布] =& 佈<公发宣分 佈>告置防
[才] =纔 才<奇英德多全口辩雄鬼 才>能学智华德
[冲] =衝 沖<脉 沖>茶水开洗喜塌服倒
[种] =& 種<种耕播套人物变黄黑白麦稻树草配品军工剧${NUMBERS} 種>种植田地树草菜花类族姓
[丑] =& 醜<出家献遮其之 醜>陋态闻类鬼八
[出] =& 齣<${NUMBERS} 齣>戏
[当] =當 噹<咣当 噹>的地响敲撞
[淀] =& 澱<沉 澱>粉
[斗] =& 鬥<相角格械搏虎 鬥>乱争殴嘴牛鸡智法
[恶] =惡 噁>心
[发] =發 髮<染,头,长,短,毛,白,黑,灰,黄,红,鬓,鹤,令人,千钧一 髮>髻际
[范] =& 範<钱铁模典规示师就 範>围畴例文
[分] =& 份<股部充身成年月${NUMBERS} 份>额子量
[丰] =豐 丰>姿采韵
[复] =復 複<重繁 複>杂写制述数本姓合句 覆<答反遍 覆>没盖
[干] =乾 干<何若天 干>戈涉支 幹<树骨主支提转审实单苦蛮巧能强不非硬 幹>才练将群部
[谷] =穀 谷<河山峡深维 谷>地
[刮] =& 颳>起了风台飓大倒掉
[合] =& 闔>家村
[后] =後 后<皇王 后>妃
[胡] =& 鬍<络腮,白,灰,长,短] 鬍>子须 衚>同
[回] =& 迴<巡峰返 迴>旋转声路向
[汇] 匯<电 匯>款报合成聚 彙<词总 彙>集编总印
[伙] =夥 伙<包搭 伙>食夫房头
[获] =獲 穫<收
[几] =幾 几<茶条书 几>案净
[家] =& 傢>具什
[姜] =& 薑<生老葱 薑>粉糖汤
[借] =& 藉<凭 藉>口助重题端故
[尽] =盡 儘>管先早快后上里前下
[卷] =& 捲<胶,烟,花,龙,铺盖 捲>袖,行李,款,起,纸,铺盖
[克] =& 剋<攻 剋>复敌期日
[困] =& 睏<人 睏>倦
[适] =& 適<合不所舒 適>宜意用从逢
[累] =& 纍<累 纍>赘累
[里] =裏 裡<被鞋衬垫 里<公华英海邻故乡市𪲟 里>弄程
[历] =歷 曆<阴年月日公挂台校文 曆>法
[了] =& 瞭<深彻明了 瞭>望然了
[蒙] =懞 蒙<承愚童启发 蒙>蔽哄难冤受昧混头 矇>骗人下 濛<蒙 濛>蒙
[弥] =彌 瀰>漫天
[面] =& 麵<白,黑,豆,挂,汤,方便,玉米,粗粮,胡椒,药 麵>条糊饼粉
[蔑] =& 衊<诬
[万] =萬 万>俟
[念] =& 唸>书诗词经咒
[辟] =闢 辟<大
[朴] =& 樸<简诚古淳浑 樸>素实
[仆] =僕 仆<前
[千] =& 韆<秋
[签] =籤 簽>名字署发到
[纤] =纖 縴<拉 縴>绳夫
[秋] =& 鞦>千
[曲] =& 麯<大
[舍] =& 捨<割取四 捨>近小大弃财
[沈] =& 瀋>大
[什] =甚 什>家
[松] =鬆 松<马尾, 松>树,针,木,香,花江
[苏] =蘇 囌<噜
[台] =臺 台<天电兄甫道 台>湾启 檯<柜,写字,供 颱<风
[坛] =壇 罈<酒,醋,泡菜,坛 罈>坛子
[团] =團 糰<饭汤米
[系] =& 係<关,维,成败 繫<联,成败 繫>铃,鞋带,围裙,恋,念,马,缚
[咸] =& 鹹<很,太,不,非常,有些,有一些,有点,有一点 鹹>鱼肉菜水的
[向] =& 嚮>阳,暮,壁虚构,隅而泣,背,有研究,无来往
[凶] =兇 凶>兆吉年
[吁] =& 籲<呼 籲>求請
[须] =& 鬚<胡,白,触,花,根,玉米 鬚>眉
[旋] =& 鏇>子,車軸,果皮
[叶] =葉 叶>声韵
[游] =遊 游>泳
[余] =& 餘<多剩结节业无其冗 餘>量钱威尽暇力下
[郁] =鬱 郁<浓
[御] =& 禦<抵抗防 禦>寒敌侮防
[云] =& 雲<彩白乌入风菇堆条 雲>彩霞烟雾贵消散雨气
[芸] =蕓 芸>香
[赞] =讚 赞>成助许
[脏] =髒 臟<內五心肝胰脾肾 臟>器腑
[占] =佔 占>卜察相
[折] =& 摺<存奏对 摺>扇纸尺迭
[征] =徵 征<南亲出长 征>讨剿伐战程途
[症] =& 癥>结
[只] =祗 隻<影单双${NUMBERS} 隻>身手言眼 只>有,是,不过
[志] =& 誌<永杂标日县海
[致] =& 緻<细精工 緻>密
[制] =& 製<炮试仿研配炼缝修绘 製>造作图革药版成
[钟] =鐘 鍾<所 鍾>爱情
[朱] =& 硃>砂
[术] =術 术<苍白
[筑] =& 築<修浇构加建 築>路堤坝墙栏
[准] =準 准<批核获 准>许予
[同] =& 衕<胡
[欲] =& 慾<纵淫邪贪 慾>望
`);
  return ruleSet;
}

function getSpecialRuleSet() { return new Jian2ZhengRuleSet(false, true); }

var customRules = {
  bfnn9055: getSpecialRuleSet().parseRules('[台] 台>家')
};

function convertFile(fname) {
  if (!fname) return;
  var input = readTextFile(fname),
      v = arguments[arguments.length-1] == 'verbose',
      c = arguments[1],
      x = getRuleSet(v).convert(input, customRules[c=='verbose' ? null : c]),
      len = x.report.length;
  if (len == 0) {
    console.log(x.result);
  } else {
    console.log('===============[正體結果]===============');
    console.log(x.result);
    console.log('========================================');
    for (var i=0; i<len; ++i)
      console.log(' ', x.report[i]);
  }
}

function testRZ(input, verbose) {
  var rs = getRuleSet(verbose), x = rs.convert(input, customRules['bfnn9055']);

  console.log();
  console.log('=========================================');
  console.log('[简入]', input);
  console.log('-----------------------------------------');
  console.log('[正出]', x.result);
  console.log('=========================================');
  if (x.report.length) {
    for (var i in x.report)
      console.log(' ', x.report[i]);
  }
}

var fn = process.argv[2];

if (fn == 'test') {
  testRZ('那本天台三观书摆在讲台上。', true);
  testRZ('她戴了一只手表，正举手了望，只是不知看见了什么。', true);
  testRZ('台家引以说止观', true);
  testRZ('不空罥索神变真言经。', true);
} else {
  var args = [], len = process.argv.length;
  for (var i=2; i<len; ++i)
    args.push(process.argv[i]);
  convertFile.apply(null, args);
}
