//
// 圖形名字有影響，比如《佛學常用辭彙》的對應關係等。
//
/* Recommended practice:
 * 1. It is possible to create diagrams via APIs only, but layout helps a lot.
 * 2. Uses variables to denote positions: horizontally a-z, vertically A-Z.
 * 3. In fact, vertical positions' names are grouped into sections:
 *    A-D, E-H, I-N, O-T, U-Z, generally for horizontal groups.
 * 4. Use the gp.run(fxn) API to keep global namespace clean.
 * 5. Use sub-functions for sub-diagram groups, easy to disable, test and migrate.
 * 6. Code for a self-contained part is commented with discernable textual hint.
 * 7. Use the gp.include() API to reduce code duplication.
 */

const AIL    = '.ail { font-size:12px; opacity:0.8 }\n';
const HILITE = '.hl { fill:red }\n';
const BOLD   = '.b { font-weight:bold; stroke:black }\n';
const CAT_基本 = '基本';
const CAT_唯識 = '唯識';
const CAT_大乘 = '大乘';
const CAT_小乘 = '小乘';
const CAT_戒律 = '戒律';

createGP('十八界', CAT_基本).setLayout(
/* -- variables for key positions
a       b       c   d             e     */ `
〇〇〇〇〇〇〇〇〇〇眼根                ## A - 六根
〇〇〇〇〇〇〇〇〇〇耳根
〇〇〇〇〇〇〇〇六〇鼻根
〇〇〇〇〇〇〇〇根〇舌根
〇〇〇〇十〇〇〇〇〇身根
〇〇〇〇二〇〇〇〇〇意根
十〇〇〇處〇〇〇〇〇〇〇〇〇〇〇〇眼識  ## B - 六識
八〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇耳識
界〇〇〇〇〇〇〇六〇〇〇〇〇〇〇〇鼻識
〇〇〇〇〇〇〇〇識〇〇〇〇〇〇〇〇舌識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇身識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇意識
〇〇〇〇〇〇〇〇〇〇眼塵                ## C - 六塵
〇〇〇〇〇〇〇〇〇〇耳塵
〇〇〇〇〇〇〇〇六〇鼻塵
〇〇〇〇〇〇〇〇塵〇舌塵
〇〇〇〇〇〇〇〇〇〇身塵
〇〇〇〇〇〇〇〇〇〇意塵`)
.run((gp) => {
  var a=1, b=a+4, c=b+4, d=c+2, e=d+7, A=1, B=A+6, C=B+6;
  function 十八界十二處() {
    gp.L([a+1,B+1],[b-1,B-1])                 // 十八界 <- 十二處
      .XFT(c-1,[B+3,A+3,C+3],0,-0.5)          //        <- 六識
      .XFT(b-1,B+3,0,-0.5).L([b-1,B+3],[c-1,B+3])
      .L([a+1,B+1],[b-1,B+3])
      .L([b+1,B-1],[c-1,A+3]).L([b+1,B-1],[c-1,C+3]) // 十二處 <- 六根、六塵
      .L([c,A],"%d1.25").L([c,A+5],"%u1.25")  // 六根 enclosure
      .L([c,A],"%r1").L([c,B-1],"%r1")
      .L([c,B],"%d1.25").L([c,B+5],"%u1.25")  // 六識 enclosure
      .L([c,B],"%r3").L([c,B+5],"%r3")
      .L([c,C],"%d1.25").L([c,C+5],"%u1.25")  // 六塵 enclosure
      .L([c,C],"%r1").L([c,C+5],"%r1");
  }
  function 六根六塵to六識() {
    gp.L([d+2,A  ],[e-1,B  ]).L([d+2,C  ],[e-1,B  ])
      .L([d+2,A+1],[e-1,B+1]).L([d+2,C+1],[e-1,B+1])
      .L([d+2,A+2],[e-1,B+2]).L([d+2,C+2],[e-1,B+2])
      .L([d+2,A+3],[e-1,B+3]).L([d+2,C+3],[e-1,B+3])
      .L([d+2,A+4],[e-1,B+4]).L([d+2,C+4],[e-1,B+4])
      .L([d+2,A+5],[e-1,B+5]).L([d+2,C+5],[e-1,B+5]);
  }

  十八界十二處();
  六根六塵to六識();
});

createGP('五蘊四大', CAT_基本)
// -- variables for key positions (start with f=1):
//  g i           k     j     l     m
.setLayout(`
〇〇〇〇〇地：以堅為性                 ## W - 四大
〇〇〇〇〇水：以濕為性〇四〇〇〇〇〇五
〇〇〇〇〇火：以暖為性〇大〇〇〇〇〇大
〇〇〇〇〇風：以動為性
〇〇〇〇〇空
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇我
〇〇色：質礙義。物質。〇〇〇〇所       ## U - 五蘊

〇〇受：領納。苦樂感受。
〇〇〇〇攝取表像。〇〇〇五〇〇〇〇〇識
〇〇想：〇〇〇〇〇〇〇〇〇〇〇〇〇〇大
心〇〇〇形成概念。〇〇〇蘊             ## V - 心
〇〇行：造作。意志行為。
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇根
〇〇識：了別。認識作用。〇〇〇我〇〇大
〇
〇
〇〇〇〇〇〇〇〇〇〇〇〇〇楞嚴七大`)
.run((gp) => {
  var f=1, g=f+2, h=e+3, i=g+1, j=g+10, k=j-3, l=j+3, m=l+3,
      A=1, B=A+6, C=B+6, U=7, V=U+5, W=1,
      五根匯聚點 = [h,A+2], 五塵匯聚點 = [h,C+2], 心匯聚點 = [f-1,V];
  function 楞嚴七大() {
    gp.XFT(m,[2,3,10,11,14,15],0,0.5)     // move all 3 texts
      .L([m,1],"%l2").L([m,1],"%d0.75")   // 五大
      .L([m,5],"%l2").L([m,5],"%u0.75")
      .L([m,9],"%l2").L([m,9],"%d0.75")   // 識大
      .L([m,13],"%l2").L([m,13],"%u0.75")
      .L([m-2,15],"%r1")                  // 根大
      .L([m,18],"%u1.5").L([m,18],"%l1")  // 楞嚴七大
  }
  function 地水火風() {    // 色 -> 地水火風
    gp.XFT(i,W+2,0,-0.5).XFT(g,W+1,0,-0.5)
      .XFT(g,W+2,0,-0.5)
      .L([i,W],"%r1").L([i,W+3],"%r1").L([i,W],[i,W+3])
      .L([g,W+2],"%d3.75").L([g,W+2],[i,W+2]);
  }
  function 四大五蘊() {   // 四大 五蘊 我、我所
    gp.L([g-2,U+2],"%d2.25").L([g-2,U+8],"%u2.25")  // 心 enclosure
      .L([g-2,U+2],"%r1").L([g-2,U+8],"%r1")
      .XFT(j,U+3,0,0.5).XFT(j,U+5,0,-0.5)  // 五蘊
      .L([j,U],"%l1.5").L([j,U],"%d2.75")
      .L([j,U+8],"%l0.5").L([j,U+8],"%u2.75")
      .L([k+2,W],[j,W]).L([j,W],"%d0.5")   // 四大
      .L([k+2,W+3],[j,W+3]).L([j,W+3],"%u0.5")
      .L([l,W],"%l2").L([l,U+6],"%l2")     // 我所
      .L([l,W],"%d4.25").L([l,U+6],"%u5.25")
      .L([j+1,U+8],"%r1")                  // 我
      .XFT(i+1,V-2,0,0.5) // 攝取表像
      .XFT(i+1,V,0,-0.5)  // 形成概念
    ;
  }

  地水火風();
  四大五蘊();
  楞嚴七大();
});

createGP('十八界與五蘊四大', CAT_基本)
/* -- layout and variables
a       b       c   d             e     h           f   g i           k     j     l     m
〇〇〇〇〇〇〇〇〇〇眼根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇地：以堅為性                 ## W - 四大
〇〇〇〇〇〇〇〇〇〇耳根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇水：以濕為性〇四〇〇〇〇〇五 ## A - 六根
〇〇〇〇〇〇〇〇六〇鼻根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇火：以暖為性〇大〇〇〇〇〇大
〇〇〇〇〇〇〇〇根〇舌根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇風：以動為性
〇〇〇〇十〇〇〇〇〇身根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇空
〇〇〇〇二〇〇〇〇〇意根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇我
十〇〇〇處〇〇〇〇〇〇〇〇〇〇〇〇眼識〇〇〇〇〇〇〇〇〇色：質礙義。物質。〇〇〇〇所       ## U - 五蘊
八〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇耳識                                                     ## B - 六識
界〇〇〇〇〇〇〇六〇〇〇〇〇〇〇〇鼻識〇〇〇〇〇〇〇〇〇受：領納。苦樂感受。
〇〇〇〇〇〇〇〇識〇〇〇〇〇〇〇〇舌識〇〇〇〇〇〇〇〇〇〇〇攝取表像。〇〇〇五〇〇〇〇〇識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇身識〇〇〇〇〇〇〇〇〇想：〇〇〇〇〇〇〇〇〇〇〇〇〇〇大
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇意識〇〇〇〇〇〇〇心〇〇〇形成概念。〇〇〇蘊             ## V - 心
〇〇〇〇〇〇〇〇〇〇眼塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇行：造作。意志行為。               ## C - 六塵
〇〇〇〇〇〇〇〇〇〇耳塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇根
〇〇〇〇〇〇〇〇六〇鼻塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識：了別。認識作用。〇〇〇我〇〇大
〇〇〇〇〇〇〇〇塵〇舌塵
〇〇〇〇〇〇〇〇〇〇身塵
〇〇〇〇〇〇〇〇〇〇意塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇楞嚴七大
*/
.run((gp) => {
  var a=1, b=a+4, c=b+4, d=c+2, e=d+7, f=e+9, h=e+3, A=1, B=A+6, C=B+6, U=7, V=U+5,
      五根匯聚點 = [h,A+2], 五塵匯聚點 = [h,C+2], 心匯聚點 = [f-1,V];
  gp.setStyle(BOLD)
    .T(1,15,'/b|十八界/')
    .T(1,16,'/b|五蘊/')
    .T(1,17,'/b|四大、五大/')
    .T(1,18,'/b|楞嚴七大/')
    .include(cloneGP('十八界'), 1, 1)
    .include(cloneGP('五蘊四大'), f, 1);
  function 六根六塵to色() {   // 六根、六塵 -> 色
    gp.L([d+2,A  ],五根匯聚點).L([d+2,C  ],五塵匯聚點)
      .L([d+2,A+1],五根匯聚點).L([d+2,C+1],五塵匯聚點)
      .L([d+2,A+2],五根匯聚點).L([d+2,C+2],五塵匯聚點)
      .L([d+2,A+3],五根匯聚點).L([d+2,C+3],五塵匯聚點)
      .L([d+2,A+4],五根匯聚點).L([d+2,C+4],五塵匯聚點)
      .L(五根匯聚點,[f-1,U]).L(五塵匯聚點,[f-1,U])
      .L([f-1,U],[f+1,U]);
  }
  function 意根意塵六識to心() {
    var dashes = 'stroke="black" stroke-dasharray="3"';
    gp.L([d+2,A+5],[h-1,A+5]).L([h-1,A+5],心匯聚點) // 意根 -> 心
      .L([d+2,C+5],[h,C+5], dashes).L([h,C+5],心匯聚點, dashes) // 意塵 -> 心
                                      .L([h,C+5],[f,U], dashes) // 意塵 -> 色
      .L([e+2,B  ],心匯聚點).L([e+2,B+1],心匯聚點)              // 六識 -> 心
      .L([e+2,B+2],心匯聚點).L([e+2,B+3],心匯聚點)
      .L([e+2,B+4],心匯聚點).L([e+2,B+5],心匯聚點);
  }

  六根六塵to色();
  意根意塵六識to心();
});

createGP('意識了別作用', CAT_唯識).setLayout( // e corresponds to 十八界's 六識 colume
/* -- variables for key positions
e   f               g       h i       j    */ `
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇   ## A   - 六根
〇
〇
〇
〇
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇順次五心念/ail|：（前五識為第六識引導，亦通於三性矣）/
〇〇〇〇〇〇眼俱意識〇〇〇〇〇〇〇〇〇〇一、率爾心/ail|：意識初對外境，於剎那間的輕率了別/    ## B   - 六識
〇〇〇〇〇〇耳俱意識〇〇〇〇〇〇〇了〇〇二、尋求心/ail|：於率爾了別之後，進而生起尋求作用/
〇〇〇〇〇〇鼻俱意識〇〇〇〇〇〇〇別〇〇三、決定心/ail|：意識尋到目標，進而決心了別/
〇〇〇〇〇〇舌俱意識〇〇〇〇〇〇〇作〇〇四、染淨心/ail|：意識了別外境後，對怨親順違等境界所生之染淨心/
〇〇〇〇〇〇身俱意識〇〇〇〇〇〇〇用〇〇五、等流心/ail|：染淨之心（善惡之心）相續，故名之/
〇〇〇〇〇〇獨頭意識〇〇〇〇〇〇〇獨散意識           ## D   - 意識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇夢中獨頭意識       ## C   - 六塵
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇定中獨頭意識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇狂亂獨頭意識`)
.run((gp) => {
  gp.include(cloneGP('十八界'), 1, 1)
    .setShift(17, 0)
    .setStyle(AIL)
    .width = 60;

  var e=1, d=e-7, f=e+2, g=f+8, h=g+4, i=h+1, j=i+4, A=1, B=7, C=13, D=B+5;
  function 獨頭意識() {
    gp.L([f,D],[g-5,D])
      .L([g,D],[i+1,D  ]).L([g,D],[i+1,D+1])
      .L([g,D],[i+1,D+2]).L([g,D],[i+1,D+3]);
  }
  function 五俱意識() {
    gp.L([f,B  ],[g-5,B  ]).L([f,D],[g-5,B  ]).L([g,B  ],[i,B  ])
      .L([f,B+1],[g-5,B+1]).L([f,D],[g-5,B+1]).L([g,B+1],[i,B+1])
      .L([f,B+2],[g-5,B+2]).L([f,D],[g-5,B+2]).L([g,B+2],[i+1,B+2])
      .L([f,B+3],[g-5,B+3]).L([f,D],[g-5,B+3]).L([g,B+3],[i,B+3])
      .L([f,B+4],[g-5,B+4]).L([f,D],[g-5,B+4]).L([g,B+4],[i,B+4]);
  }
  function 了別作用() {
    gp.L([d+2,C  ],[g-1,C]).L([g,C  ],[h,B  ])
      .L([d+2,C+1],[g,C+1]).L([g,C+1],[h,B+1])
      .L([d+2,C+2],[g,C+2]).L([g,C+2],[h,B+2])
      .L([d+2,C+3],[g,C+3]).L([g,C+3],[h,B+3])
      .L([d+2,C+4],[g,C+4]).L([g,C+4],[h,B+4])
      .L([i,B],[i,B+4])
      .XFT(i+2,[B,B+1,B+2,B+3,B+4],0,-0.5)
      .XFT(j,B,0,-0.25).XFT(j,B+4,0,0.25).L([j,B],[j,B+4])
      .L([j-1,B+2],[j,B+2]);
  }

  五俱意識();
  了別作用();
  獨頭意識();
});

createGP('五法事理唯識', CAT_唯識).setLayout(`
〇五
〇法〇┌─ 心王〇〇 ── 識之自相 ─┐
〇事〇├─ 心所〇〇 ── 與識相應 ─┤
〇理─┼─ 色〇〇〇 ── 識之所變 ─┼─事──不離識；萬法唯識
〇唯〇├─ 不相應行 ── 識之分位 ─┘〇〇〇〇〇│
〇識〇└─ 無為〇〇 ─ 以上四法實性 ──理───┘
〇`)
  .XFT(2, [1,2,3,4,5,6], 0, 0.5)
  .L([4,2],"%r1")
  .L([4,3],"%r1")
  .L([3,4],"%r2")
  .L([4,5],"%r1")
  .L([4,6],"%r1")
  .L([4,2],[4,6]) // left-most
  .L([10,2],"%r3")
  .L([10,3],"%r3")
  .L([10,4],"%r3")
  .L([10,5],"%r3")
  .L([10,6],"%r2") // 2nd column
  .L([18,2],"%r2")
  .L([18,3],"%r2")
  .L([18,4],"%r2")
  .L([18,5],"%r2")
  .L([20,2],[20,5])
  .L([19,6],"%r3")
  .XFT([22,23,25,26],4,0,-0.5)
  .L([22,4],"%l2") // 事、理
  .L([25,4],"%l1")
  .L([24,6],"%r3").L([27,6],"%u1.75")
;

createGP('五重唯識', CAT_唯識).setLayout(`
五〇〇〇１遣虛存寶（空有相對，遣空存有）
重〇〇〇２捨濫留純（心境相對，捨境留心）〇〇〇唯識相
唯〇〇〇３攝末歸本（體用相對，攝用歸體）
識〇〇〇４隱劣顯勝（王所相對，隱所顯王）
觀〇〇〇５遣相證性（事理相對，遣事證理）〇〇〇唯識性`)
  .L([2,3],"%r1")    // 五重唯識觀
  .L([3,1],"%r1").L([3,5],"%r1").L([3,1],[3,5])
  .L([21,1],"%r1").L([21,4],"%r1").L([22,1],[22,4]) // 唯識相
  .XFT([22,24],2,0,0.5).L([22,2],"%r1")
  .L([21,5],"%r2")   // 唯識性
;

createGP('八識具緣', CAT_唯識).setLayout(`
〇〇┌─眼識────九緣──空、明、根、境、作意、種子依、分別依、染淨依、根本依
〇〇├─耳識────八緣──空、〇〇根、境、作意、種子依、分別依、染淨依、根本依
八〇├─鼻識──┐
識─┼─舌識──┼─七緣──〇〇〇〇根、境、作意、種子依、〇〇〇〇染淨依、根本依
具〇├─身識──┘
緣〇├─意識────五緣──〇〇〇〇根、境、作意、種子依、〇〇〇〇〇〇〇〇根本依
〇〇├─末那識───四緣──〇〇〇〇根、境、作意、種子依
〇〇└─阿賴耶識──四緣──〇〇〇〇根、境、作意、種子依`)
  .XFT(2,4,0,0.5).L([2,4],"%r1")
  .L([3,1],[3,8])
  .L([3,1],"%r1").L([3,2],"%r1").L([3,3],"%r1").L([3,4],"%r1")
  .L([3,5],"%r1").L([3,6],"%r1").L([3,7],"%r1").L([3,8],"%r1") // left colume
  .L([7,1],[10,1])
  .L([7,2],[10,2])
  .L([7,4],[10,4]).L([7,3],[9,3]).L([7,5],[9,5]).L([9,3],[9,5])
  .L([7,6],[10,6])
  .L([8,7],[10,7])
  .L([9,8],[10,8]) // mid colume
  .L([13,1],"%r1")
  .L([13,2],"%r1")
  .L([13,4],"%r1")
  .L([13,6],"%r1")
  .L([13,7],"%r1")
  .L([13,8],"%r1")
;

createGP('八識及能變體', CAT_唯識).setLayout(`
〇〇１眼識〇〇眼根緣色塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇　八識能變體
〇〇２耳識〇〇耳根緣聲塵
〇〇３鼻識〇〇鼻根緣香塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識（了別）〇七〇〇〇第三能變識：了別
〇〇４舌識〇〇舌根緣味塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇轉〇　　　六識各各了別各種粗顯外境，
〇〇５身識〇〇身根緣觸塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識〇〇〇〇名了別境識。
八〇６意識〇〇意根緣法塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
識〇〇〇末〇〇是第六意識所依之根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
〇〇７〇那〇〇常隨四煩惱：我癡、我見、我愛、我慢〇〇〇意（思量）〇〇〇〇〇第二能變識：思量
〇〇〇〇識〇〇向內執取阿賴耶為我，向外認識境界為實法〇〇〇〇〇〇〇〇〇　　　恆持第八識的見分為自我而審察思量。
〇〇〇〇〇〇〇〇〇〇〇〇〇能藏：能含藏一切法的種子
〇〇〇〇阿〇〇華譯藏識〇〇所藏：受第七識所薰習〇〇〇〇〇〇〇〇〇〇根
〇〇８〇賴〇〇〇〇〇〇〇〇執藏：受第七識所執取〇〇〇〇心（集起）〇本〇〇〇第一能變識：異熟
〇〇〇〇耶〇〇無覆無記〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識〇　　　異時而熟、變異而熟、異類而熟。
〇〇〇〇〇〇〇種子現行時，善惡分明，業報相續`)
  .L([1,5],[1,1]).L([1,1],[2,1])                      // 八識
  .L([1,8],[1,12]).L([1,12],[2,12])
  .L([6,1],"%r1").L([6,2],"%r1").L([6,3],"%r1")       // 六識
  .L([6,4],"%r1").L([6,5],"%r1").L([6,6],"%r1")
  .L([6,7],"%r1").L([6,9],"%r1").L([6,7],"%d2")       // 末那識
  .XFT(5,[7,8,9],-0.5,0)
  .L([6,11],"%r1").L([6,14],"%r1").L([6,11],"%d3")    // 阿賴耶
  .XFT(5,[11,12,13],-0.5,0)
  .L([12,10],"%r1").L([12,12],"%r1").L([12,10],"%d2") // 藏識
  .L([27,1],"%l14").L([27,2],"%l14").L([27,3],"%l14") // 識（了別為義）
  .L([27,4],"%l14").L([27,5],"%l14").L([27,6],"%l14")
  .L([27,1],"%d5")
  .XFT(28,3,0,0.5)
  .XFT(34,[3,4,5],0,0.5)                              // 七轉識
  .L([34,1],"%l1").L([34,1],"%d1.75")
  .L([34,8],"%l1").L([34,8],"%u1.75")
  .L([27,7],"%l1").L([27,7],"%d2").L([27,9],"%l0.5")  // 意（思量為義）
  .L([27,10],"%l1").L([27,10],"%d4").L([27,14],"%l1") // 心（集起為義）
  .XFT(33,12,-0.5,0).L([33,12],"%r0.5")               // 根本識

  .XFT(38,3,0,0.5).XFT(39,[4,5],0,0.5)                // 第三能變識
  .L([37,1],"%l1").L([37,2],"%l1").L([37,3],"%l1")
  .L([37,4],"%l1").L([37,5],"%l1").L([37,6],"%l1")
  .L([37,1],[37,6])
  .L([37,8],"%l1")                                    // 第二能變識
  .L([37,12],"%l1")                                   // 第一能變識
;

createGP('識體四分', CAT_唯識).setLayout(`
　　　　 ┌─見分：　　八識識體主能觀的認識的功能。
識體四分─┼─相分：　　為見分所認識的影像。
　　　　 ├─自證分：　識體證知見分所見有無謬誤的功能。
　　　　 └─證自證分：識體再度驗證的功能。
　　　　   　　　 │圓成實性　真空妙有│`)
  .XFT([1,5],2,0,0.5)
  .L([5,2],"%r1")
  .L([6,1],"%r1").L([6,2],"%r1").L([6,3],"%r1").L([6,4],"%r1")
  .L([6,1],[6,4])
  .L([12,5],"%u0.5").L([12,5],"%d0.5")
  .L([22,5],"%u0.5").L([22,5],"%d0.5")
;

createGP('六因四緣五果', CAT_唯識).setLayout(
/* -- variables for key positions
a                 b                 c           */ `
〇〇〇能作因〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇異熟果
〇〇〇俱有因〇〇〇〇〇〇因緣〇〇〇〇〇〇〇等流果
六〇〇相應因〇〇〇四〇〇等無間緣〇〇五〇〇士用果
因〇〇同類因〇〇〇緣〇〇所緣緣〇〇〇果〇〇增上果
〇〇〇遍行因〇〇〇〇〇〇增上緣〇〇〇〇〇〇離系果
〇〇〇異熟因`)
.run((gp) => {
  var a=1, b=10, c=19;
  gp
    .L([a+1,1],"%r1").L([a+1,6],"%r1")  // 六因
    .L([a+1,1],[a+1,6])
    .L([b+1,2],"%r1").L([b+1,5],"%r1")  // 四緣
    .L([b+1,2],[b+1,5])
    .L([c+1,1],"%r1").L([c+1,5],"%r1")  // 五果
    .L([c+1,1],[c+1,5])
    .XFT(c+3,[1,'-',5],0,0.5)
    .XFT(c+1,[1,'-',5],0,0.5)
});

createGP('種子分類', CAT_唯識).setLayout(`
依〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇┌─名言種子：表義名言，即等流種子；名言習氣
〇漏無〇〇〇┌─有漏種子；善、不善、無記種子─┼─我執種子：顯境名言；〇〇〇〇〇〇我見習氣
〇〇〇分類─┤〇〇三界六道眾生輪迴生死的種子。└─有支種子：業種子，亦名異熟種子；有支習氣
〇三性〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇┌─生空無漏種子：屬見道位無漏種子
〇〇〇〇〇〇└─無漏種子；純善種子〇〇〇〇〇─┼─法空無漏種子：屬修道位無漏種子
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇└─二空無漏種子：為無學道無漏種子
〇〇〇〇〇〇〇〇〇大乘菩薩轉染成淨、修行證果的種子。
〇〇〇〇〇〇┌─本有種子：本性住種，是無始以來法爾本具的，是先天本有的。
依生起分類─┤
〇〇〇〇〇〇└─新薰種子：習所成種，是種子生起現行，受現行薰習而成的新種子。`)
  .setStyle(AIL)
  .XFT([4,6],3,0,0.5) // 依有無漏 依三性 分類
  .XFT(1,1,0,2.5)
  .XFT(2,2,0,1)
  .L([6,3],"%r1").L([7,2],[7,5]).L([7,2],"%r1").L([7,5],"%r1")
  .L([24,1],[24,3]).L([24,1],"%r1").L([24,3],"%r1").L([23,2],"%r2") // 有漏 fanout
  .L([24,4],[24,6]).L([24,4],"%r1").L([24,6],"%r1").L([23,5],"%r2") // 有漏 fanout
  .XFT(10,7,0,-1)
  .TC(10,3,'ail')
  .TC(10,7,'ail')

  .L([6,9],"%r1").L([7,8],[7,10]).L([7,8],"%r1").L([7,10],"%r1") // 依生起分類
;

createGP('三自性', CAT_唯識).setLayout(`
　　　　　　遍計所執性　於依他起之事物上、分別執著名相，妄認為實我實法。
三自性　　　依他起性　　萬法皆以因緣和合生生起，只是組合，而無自性。
　　　　　　圓成實性　　於依他起法上、常一切時遠之離執著，即圓成實性。

　　　　　　相無性　　　此相為妄情所現，假名安立，故無自性。
三無性　　　生無性　　　仗因托緣而起的事物，只是組合，而非實有，故無自性。
　　　　　　勝義無性　　勝義是二空所顯真如，真如若有自性，就不是絕對的勝義了。`)
  .L([5,1],"%r1").L([4,2],"%r2").L([5,3],"%r1") // 三自性
  .L([5,1],[5,3])
  .L([12,1],"%l0.5")
  .L([11,2],"%r1")
  .L([11,3],"%r1")
  .L([5,5],"%r1").L([4,6],"%r2").L([5,7],"%r1") // 三無性
  .L([5,5],[5,7])
  .L([10,5],"%r2")
  .L([10,6],"%r2")
  .L([11,7],"%r1")
;

createGP('三性中道', CAT_唯識).setLayout(
/* -- variables for key positions
a     b             c       d         e       f     g             h           i         j    */ `
〇〇〇〇〇〇〇〇〇〇情有〇〇非空
〇〇〇遍計所執性〇〇〇〇〇〇〇〇〇〇〇中道〇〇〇〇〇遍計所執性〇〇體相都無〇〇非有          ## A
三〇〇〇〇〇〇〇〇〇理無〇〇非有〇〇〇〇〇〇〇三
性〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇性
各〇〇〇〇〇〇〇〇〇假有〇〇非空〇〇〇〇〇〇〇對
具〇〇依他起性〇〇〇〇〇〇〇〇〇〇〇〇中道〇〇望〇〇依他起性〇〇〇如幻假有〇〇非空〇〇〇〇中道 ## B
中〇〇〇〇〇〇〇〇〇實無〇〇非有〇〇〇〇〇〇〇中
道〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇道
〇〇〇〇〇〇〇〇〇〇真實〇〇非空
〇〇〇圓成實性〇〇〇〇〇〇〇〇〇〇〇〇中道〇〇〇〇〇圓成實性〇〇〇真空妙有                   ## C
〇〇〇〇〇〇〇〇〇〇無相〇〇非有`)
.run((gp) => {
  gp.setStyle(AIL);
  gp.height = 13;
  var a=1, b=a+3, c=b+7, d=c+4, e=d+5, f=e+4, g=f+3, h=g+7, i=h+6, j=i+5,
      A=2, B=6, C=10;
  function 三性各具中道() {
    gp.XFT(a,[B-3,'-',B+2],0,0.5) // 三性各具中道
      .L([a+1,A],"%r1").L([a+1,C],"%r1").L([a+1,B],"%r1")
      .L([a+1,A],[a+1,C])
      .L([c-2,A],"%l0.5") // 遍計所執性
      .L([c-2,A-1],"%r1").L([c-2,A+1],"%r1").L([c-2,A-1],[c-2,A+1])
      .L([c+2,A-1],"%r1").L([d+2,A-1],"%r1")   // 情有 非空
      .L([c+2,A+1],"%r1").L([d+2,A+1],"%r1")   // 理無 非有
      .L([d+3,A-1],[d+3,A+1]).L([d+3,A],"%r1") // 中道
      .L([c-2,B],"%l1") // 依他起性
      .L([c-2,B-1],"%r1").L([c-2,B+1],"%r1").L([c-2,B-1],[c-2,B+1])
      .L([c+2,B-1],"%r1").L([d+2,B-1],"%r1")   // 假有 非空
      .L([c+2,B+1],"%r1").L([d+2,B+1],"%r1")   // 實無 非有
      .L([d+3,B-1],[d+3,B+1]).L([d+3,B],"%r1") // 中道
      .L([c-2,C],"%l1") // 圓成實性
      .L([c-2,C-1],"%r1").L([c-2,C+1],"%r1").L([c-2,C-1],[c-2,C+1])
      .L([c+2,C-1],"%r1").L([d+2,C-1],"%r1")   // 真實 非空
      .L([c+2,C+1],"%r1").L([d+2,C+1],"%r1")   // 無相 非有
      .L([d+3,C-1],[d+3,C+1]).L([d+3,C],"%r1") // 中道
    ;
  }
  function 三性對望中道() {
    gp.XFT(f,[B-3,'-',B+2],0,0.5) // 三性對望中道
      .L([f+1,A],"%r1").L([f+1,C],"%r1").L([f+1,B],"%r1")
      .L([f+1,A],[f+1,C])
      .L([h-2,A],"%r1").L([i-2,A],"%r1") // 遍計所執性
      .L([h-3,B],"%r2").L([i-2,B],"%r1") // 依他起性
      .L([h-3,C],"%r2")                  // 圓成實性
      .L([i+2,A],"%r2") // 中道
      .L([i+2,B],"%r3")
      .L([i-2,C],"%r6")
      .L([i+4,A],[i+4,C])
    // adopt texts from 三自性
      .T(g,A+1,'/ail|於依他起之事物上分別執著名相，妄認為實我實法。/')
      .T(g,A+2,'相無性/ail|：此相為妄情所現，假名安立，故無自性。/')
      .T(g,B+1,'/ail|萬法皆以因緣和合生生起，只是組合，而無自性。/')
      .T(g,B+2,'生無性/ail|：仗因托緣而起的事物，只是組合，/')
      .T(g,B+3,'　　　/ail|　而非實有，故無自性。/')
      .T(g,C+1,'/ail|於依他起法上常一切時遠之離執著，即圓成實性。/')
      .T(g,C+2,'勝義無性/ail|：勝義是二空所顯真如。/')
      .T(g,C+3,'　　　　/ail|　真如若有自性，即非絕對勝義矣。/')
    ;
  }

  三性各具中道();
  三性對望中道();
});

createGP('三境|三量|三受|三性', CAT_唯識).setLayout(`
　　　┌─性　境：性境就是實境，是實種所生，事實上就是色聲香味觸五種物質實境。
三境─┼─獨影境：這是沒有本質的影像，是第六識虛妄分別想像出來的影子。
　　　└─帶質境：這是有本質的相分，而為見分所錯誤認知者。

　　　┌─現量：心識緣境，緣當下性境，沒有分別，不帶名言，此稱現量。
三量─┼─比量：心識緣境，以知識、經驗推測比度所獲的量果。
　　　└─非量：心識緣境，對所緣境認知謬誤所獲的量果。

　　　┌─苦受：領納違損境之謂。
三受─┼─樂受：領納順益境之謂。
　　　└─捨受：領納順違俱非境之謂。

　　　┌─善　性：於現在世未來世、於自他順益者。
　　　│ 　　　　《俱舍論》四種：勝義善，自性善，相應善，等起善
三性─┼─不善性：於現在世未來世、於自他違損者。
　　　│ 　　　　《俱舍論》四種：勝義不善，自性不善，相應不善，等起不善
　　　└─無記性：非善非不善，不能記為善、亦不能記為惡者。
　　　 　 ├──有覆無記：其性染汙，覆障聖道，染汙心識，而其勢用力弱，不能引生異熟果。
　　　　  └──無覆無記：識性非順益、非違損，非善、非不善，長保其中庸之性，無可記別。
　　　　  　　　　　　　　唯第八識是無覆無記。`)
.run((gp) => {
  var A=2, B=6, C=10, D=15;
  gp.L([4,A-1],[4,A+1]).L([4,A-1],"%r1").L([4,A+1],"%r1").L([3,A],"%r2") // 三境	
    .L([4,B-1],[4,B+1]).L([4,B-1],"%r1").L([4,B+1],"%r1").L([3,B],"%r2") // 三量
    .L([4,C-1],[4,C+1]).L([4,C-1],"%r1").L([4,C+1],"%r1").L([3,C],"%r2") // 三受	
    .L([4,D-2],[4,D+2]).L([4,D-2],"%r1").L([4,D+2],"%r1").L([3,D],"%r2") // 三受	
    .L([7,D+3],"%r2")                       // 無覆無記
    .L([7,D+4],"%u1.5").L([7,D+4],"%r2") // 無覆無記
});

createGP('心所法', CAT_唯識).setLayout(
/* variables
a   b         c                   v   w                           u z     x   y     d */ `
〇〇遍行：〇〇觸、作意、受、想、思〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五
〇〇別境：〇〇欲、勝解、念、定、慧〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五
心〇善：〇〇〇信、精進、慚、愧、無貪、無瞋、無癡、輕安、不放逸、行捨、不害〇〇〇〇十一〇五
所〇根本煩惱：貪、瞋、癡、慢、疑、惡見〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇六〇十
法〇隨煩惱：〇小十：忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，中二：無慚、無愧，〇〇〇〇〇一
〇〇〇〇〇〇〇大八：不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂〇〇〇〇〇〇〇〇廿
〇〇不定：〇〇睡眠、惡作、尋、伺〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四`)
.run((gp) => {
  var a=1, b=a+2, c=b+5, d=c+35, e=d+2, u=d-9, v=c+10, w=c+12, x=d-5, y=x+1, z=u+1,
      A=1, B=A+1, C=A+2, D=A+3, E=A+4, F=A+5, G=A+6, H=A+7;
  gp.setStyle(AIL)
    .L([a,A],"%r1").L([a,A],"%d1")           // 心所法
    .L([a,G],"%r1").L([a,G],"%u1")
    .L([e,A],"%l1").L([e,A],"%d1.3")         // 五十一
    .L([e,G],"%l1").L([e,G],"%d-1.3")
    .L([v,A],[d-2,A]) // count:5
    .L([v,B],[d-2,B]) // count:5
    .L([x,C],[d-2,C]) // count:11
    .L([w,D],[d-2,D]) // count:6
    .XFT(d,F,0,-0.5) // count:20
    .XFT(y,E,0,-0.25).XFT(y,G,0,-0.75).L([y,E],[y,G])
    .XFT(y,F,0,-0.5).L([y,F],"%r2")
    .L([v,G],[d-2,G]) // count:4
    .T(c, E, '/ail|小十：/忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，/ail|中二：/無慚、無愧，')
    .T(c, F, '/ail|大八：/不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂')
  ;
});

createGP('五位百法', CAT_唯識) // compare: 七十五法（小乘）
.setLayout(
/* variables are for 心所法()
    a   b         c                   v   w                           u z     x y       d   e  */ `
〇〇心王法：〇〇〇眼識、耳識、鼻識、舌識、身識、意識、末那識、阿賴耶識〇〇〇〇〇〇〇〇〇八
〇
〇
〇
〇
宇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇有〇百
宙〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇為
萬〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇法〇法
有〇色法：〇〇〇〇眼、耳、鼻、舌、身、色、聲、香、味、觸、法處所攝色〇〇〇〇〇〇〇〇〇十一
〇〇不相應法〇〇〇得、命根、眾同分、異生性、無想定、滅盡定、無想報、
〇〇〇行法：〇〇〇名身、句身、文身、生、住、老、無常、流轉、定異、〇〇〇〇〇〇〇〇〇〇廿四
〇〇〇〇〇〇〇〇〇相應、勢速、次第、時、方、數、和合性、不和合性
〇〇無為法：〇〇〇虛空無為、擇滅無為、非擇滅無為、不動滅無為、想受滅無為、真如無為〇〇〇六`)
.run((gp) => {
  function 不相應法行法() {
    gp.XFT(3,10,0,0.5).XFT(4,11,0,0.5)
      .XFT(9,10,0,-0.25)
      .L([9,10],"%d2.5", 'stroke-dasharray="5 2" stroke-opacity="0.5" stroke="black"')
      .XFT(36,10,0,-0.25).XFT(36,12,0,0.25)  // count:24
      .L([36,10],[36,12]).L([36,11],[43,11])
  }
  function LHS() {
    gp.XFT(1,[5,'-',10],0,-0.5)              // 宇宙萬有
      .L([1,1],"%r1").L([1,1],[1,5])
      .L([1,13],"%r1").L([1,13],[1,10]);
  }
  function RHS() {
    gp.XFT(49,[5,'-',9],0,-0.5)              // 有為法
      .L([49,1],[49,5])
      .L([49,12],"%l3").L([49,12],[49,9])
      .L([51,1],"%l5").L([51,1],[51,5])      // 百法
      .L([51,13],"%l5").L([51,13],[51,9]);
  }

  gp.setStyle(BOLD)
    .TC(51,6,'b').TC(51,8,'b')
    .L([36,1],[43,1])          // 心王法 count:8
    .L([36,9],[43,9])          // 色法   count:11
    .L([42,13],[43,13])        // 無為法 count:6
    .include(cloneGP('心所法'),3,2);
  LHS();
  RHS();
  不相應法行法();
});

createGP('六根本煩惱|十使', CAT_唯識)
  .setMarkNames('ABCD')
  .setLayout(`
　　┌　１貪──貪愛五欲（財色名食睡）─────────┐
　　│　２瞋──瞋恚無忍────────────────│　五
六　│　３癡──愚癡無明────────────────├─鈍─┐
根　│　４慢──驕慢自大────────────────│　使　│
本─A　５疑──狐疑猜忌────────────────┘　　　├─十　
煩　│　　　┌─１身見（薩迦邪見）執取五蘊根身─────┐　　　│　使
惱　│　　不│　２邊見──────執取常斷二見─────│　五　│
　　└─６正│　３邪見──────謗無因果，壞諸善事──├─利─┘
　　　　　見│　４見取見─────執持成見，非果非果──│　使
　　　　　　└─５戒禁取見────執持不正戒，非因計因─┘`)
  .L([3,1],"%r1").L([3,8],"%r1").L([3,1],[3,8])  // 六根本煩惱
  .L('A',"%l1")
  .XFT(33,5,0,0.5).L([33,5],"%r1") // 十使
  .L([33,3],"%l1").L([33,8],"%l1").L([33,3],[33,8])
  .L([7,1],"%r1").L([20,1],[29,1])     // 五鈍使
  .L([7,2],"%r1").L([13,2],[29,2])
  .L([7,3],"%r1").L([13,3],[30,3])
  .L([7,4],"%r1").L([13,4],[29,4])
  .L([7,5],"%r1").L([13,5],[29,5])
  .L([29,1],[29,5])
  .L([24,6],[29,6])                    // 五利使
  .L([12,7],[17,7]).L([24,7],[29,7])
  .L([12,8],[17,8]).L([27,8],[30,8])
  .L([13,9],[17,9]).L([27,9],[29,9])
  .L([14,10],[17,10]).L([28,10],[29,10])
  .L([29,6],[29,10])
  .L([7,6],"%r1").L([7,10],"%r1")      // 不正見
  .L([7,6],[7,10])
;

createGP('阿賴耶識相應心所', CAT_唯識)
.run((gp) => {
  gp.setStyle(AIL + HILITE)
    .T(1, 1, '阿賴耶識只相應五遍行心所。')
    .include(cloneGP('心所法')
      .T(8, 1, '/hl|觸/、/hl|作意/、/hl|受/、/hl|想/、/hl|思/'),
      1, 3);
});

createGP('末那識相應心所', CAT_唯識)
.run((gp) => {
  gp.setStyle(AIL + HILITE)
    .T(1, 1, '末那識相應十八個心所。')
    .include(cloneGP('心所法')
      .T(8, 1, '/hl|觸/、/hl|作意/、/hl|受/、/hl|想/、/hl|思/')
      .T(8, 2, '欲、勝解、念、定、/hl|慧/')
      .T(3, 4, '根本煩惱：/hl|貪/、瞋、/hl|癡/、/hl|慢/、疑、/hl|惡見/')
      .T(8, 6, '/ail|大八：//hl|不信/、/hl|懈怠/、/hl|放逸/、/hl|昏沉/、/hl|掉舉/、/hl|失念/、/hl|不正知/、/hl|散亂/'),
      1, 3);
});

createGP('五識相應心所', CAT_唯識)
.run((gp) => {
  gp.setStyle(AIL + HILITE)
    .T(1, 1, '眼識、耳識、鼻識、舌識、身識相應三十四個心所。')
    .include(cloneGP('心所法')
      .T(8, 1, '/hl|觸/、/hl|作意/、/hl|受/、/hl|想/、/hl|思/')
      .T(8, 2, '/hl|欲/、/hl|勝解/、/hl|念/、/hl|定/、/hl|慧/')
      .T(8, 3, '/hl|信/、/hl|精進/、/hl|慚/、/hl|愧/、/hl|無貪/、/hl|無瞋/、/hl|無癡/、/hl|輕安/、/hl|不放逸/、/hl|行捨/、/hl|不害/')
      .T(3, 4, '根本煩惱：/hl|貪/、/hl|瞋/、/hl|癡/、慢、疑、惡見')
      .T(8, 5, '/ail|小十：/忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，' +
                  '/ail|中二：//hl|無慚/、/hl|無愧/，')
      .T(8, 6, '/ail|大八：//hl|不信/、/hl|懈怠/、/hl|放逸/、/hl|昏沉/、/hl|掉舉/、/hl|失念/、/hl|不正知/、/hl|散亂/'),
      1, 3);
});

createGP('第六識相應心所', CAT_唯識)
.run((gp) => {
  gp.setStyle(AIL + HILITE)
    .T(1, 1, '第六識相應全部五十一個心所。')
    .include(cloneGP('心所法')
      .T(8, 1, '/hl|觸/、/hl|作意/、/hl|受/、/hl|想/、/hl|思/')
      .T(8, 2, '/hl|欲/、/hl|勝解/、/hl|念/、/hl|定/、/hl|慧/')
      .T(8, 3, '/hl|信/、/hl|精進/、/hl|慚/、/hl|愧/、/hl|無貪/、/hl|無瞋/、/hl|無癡/、/hl|輕安/、/hl|不放逸/、/hl|行捨/、/hl|不害/')
      .T(3, 4, '根本煩惱：/hl|貪/、/hl|瞋/、/hl|癡/、/hl|慢/、/hl|疑/、/hl|惡見/')
      .T(8, 5, '/ail|小十：//hl|忿/、/hl|恨/、/hl|惱/、/hl|覆/、/hl|誑/、/hl|諂/、/hl|憍/、/hl|害/、/hl|嫉/、/hl|慳/，' +
                  '/ail|中二：//hl|無慚/、/hl|無愧/，')
      .T(8, 6, '/ail|大八：//hl|不信/、/hl|懈怠/、/hl|放逸/、/hl|昏沉/、/hl|掉舉/、/hl|失念/、/hl|不正知/、/hl|散亂/')
      .T(8, 7, '/hl|睡眠/、/hl|惡作/、/hl|尋/、/hl|伺/'),
  1, 3);
});

createGP('三界之九地二十八天', CAT_基本)
  .setMarkNames('ABCDEFGH')
  .setLayout(`
〇〇〇〇〇（近）〇C〇五趣雜居地
〇〇〇A〇欲界〇〇〇〇〇〇〇〇〇〇〇地居天：四天王天、仞利天
〇〇〇〇〇〇〇〇〇D〇〇〇〇〇〇〇〇空居天：夜摩天、兜率天、化樂天、他化自在天
〇〇〇〇〇〇〇〇〇E〇離生喜樂地〇〇初禪天：梵眾天、梵輔天、大梵天
三界〇〇〇色界〇〇〇〇定生喜樂地〇〇二禪天：少光天、無量光天、光音天
〇〇〇〇〇〇〇〇〇〇〇離喜妙樂地〇〇三禪天：少淨天、無量淨天、遍淨天
〇〇〇〇〇〇〇〇〇F〇捨念清淨地〇〇四禪天：無雲天、福生天、廣果天、無煩天、無熱天、
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇善見天、善現天、色究竟天、無想天
〇〇〇〇〇〇〇〇〇G〇空無邊處地〇〇〇（天）
〇〇〇B〇無色界〇〇〇識無邊處地〇〇〇（天）
〇〇〇〇〇〇〇〇〇〇〇無所有處地〇〇〇（天）
〇〇〇〇〇（遠）〇H〇非想非非想處地〇（天）`)
  .XFT([1,3,4,6,8], 5, 0, 0.5)
  .XFT([4,6,9], 10, 0, 0.5)
  .L("A", "%r1")         // 三界 fanout
  .L("B", "%r1")
  .L("A", "B")
  .L([3,5], "%r1")
  .L([4,5], "%r1")
  .L("C", "%r1")         // 欲界 fanout
  .L("C", "D")
  .L([8,2], "%r10")
  .L("D", "%r8")
  .L([8,5], "%r2")       // 色界 fanout
  .L("E", "%r1")
  .L([10,5], "%r1")
  .L([10,6], "%r1")
  .L("F", "%r1")
  .L("E", "F")
  .L([17,4], "%r1")
  .L([17,5], "%r1")
  .L([17,6], "%r1")
  .L([17,7], "%r1")
  .L([9,10], "%r1")      // 無色界 fanout
  .L([10,10], "%r1")
  .L("G", "%r1")
  .L([10,10], "%r1")
  .L([10,11], "%r1")
  .L("H", "%r1")
  .L("G", "H")
;

createGP('二十八天', CAT_基本).setLayout(`
（近）〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇（非天諸趣）
〇〇〇〇〇〇〇〇四王天〇〇〇〇〇〇〇〇〇地居天
〇〇〇〇欲〇〇〇忉利天
〇〇〇〇界〇〇〇夜摩天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五趣雜居地
〇〇〇〇天〇〇〇兜率天
〇〇〇〇〇〇〇〇化樂天〇〇〇〇〇〇〇〇〇空居天
〇〇〇〇〇〇〇〇他化自在天
〇〇〇〇〇〇〇〇〇〇〇〇〇梵眾天
〇〇〇〇〇〇〇〇初禪〇〇〇梵輔天〇〇〇〇〇〇〇〇〇〇〇〇禪離生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇大梵天
〇〇〇〇〇〇〇〇〇〇〇〇〇少光天
〇〇〇〇〇〇〇〇二禪〇〇〇無量光〇〇〇〇〇〇〇〇〇〇〇〇禪定生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇光音天
二〇〇〇色〇〇〇〇〇〇〇〇少淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇九
十〇〇〇界〇〇〇三禪〇〇〇無量淨〇〇〇〇〇〇〇〇〇〇〇〇禪離喜妙樂地
八〇〇〇天〇〇〇〇〇〇〇〇遍淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇地
天〇〇〇〇〇〇〇〇〇〇〇〇無雲天
〇〇〇〇〇〇〇〇〇〇〇〇〇福生天
〇〇〇〇〇〇〇〇〇〇〇〇〇廣果天
〇〇〇〇〇〇〇〇〇〇〇〇〇無想天
〇〇〇〇〇〇〇〇四禪〇〇〇無煩天〇〇〇〇〇〇〇〇〇〇〇〇禪捨念清淨地
〇〇〇〇〇〇〇〇〇〇〇〇〇無熱天〇〇〇〇五
〇〇〇〇〇〇〇〇〇〇〇〇〇善見天〇〇〇〇淨
〇〇〇〇〇〇〇〇〇〇〇〇〇善現天〇〇〇〇居
〇〇〇〇〇〇〇〇〇〇〇〇〇色究竟天〇〇〇天
〇〇〇〇無〇〇〇空無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇空無邊處地
〇〇〇〇色〇〇〇識無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識無邊處地
〇〇〇〇界〇〇〇無所有處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無所有處地
（遠）〇天〇〇〇非想非非想處天〇〇〇〇〇〇〇〇〇〇〇〇〇非想非非想處地`)
  .XFT(5, [3,4,5], 0, 0.5)
  .XFT(1, [14,'-',17], 0, -0.5)
  .XFT([3,6], 4, 0, 0.5)
  .XFT([3,6], 27, 0, 0.5)
  .XFT(1,[4,27],0,0.5).XFT(1,[13,18],0,-0.5) // 二十八天
  .L([1,4],  "%r2").L([1,27], "%r2")
  .L([1,4],[1,13]).L([1,18],[1,27])
  .L([7,2],  "%r1")   // 欲界天 fanout
  .L([7,3],  "%r1")
  .L([7,4],  "%r1")
  .L([6,4],  "%r1")
  .L([7,5],  "%r1")
  .L([7,6],  "%r1")
  .L([7,7],  "%r1")
  .L([7,2],  "%d5")
  .XFT(21, 2, 0, 0.5) // 地居天 fanin
  .XFT(19, 5, 0, -2.5)
  .L([18,2], "%r1")
  .L([18,3], "%r1")
  .L([19,2], "%d1")
  .L([19,5], "%r1")
  .L([18,4], "%r1")   // 天居天
  .L([19,4], "%d8")
  .L([19,6], "%r1")
  .L([7,9],  "%r1")   // 色界天 fanout
  .L([7,12], "%r1")
  .L([6,15], "%r2")
  .L([7,21], "%r1")
  .L([7,9],  "%d12")
  .L([12,8], "%r1")   // 初禪 fanout
  .L([11,9], "%r2")
  .L([12,10], "%r1")
  .L([12,8], "%d2")
  .L([12,11], "%r1")  // 二禪 fanout
  .L([11,12], "%r2")
  .L([12,13], "%r1")
  .L([12,11], "%d2")
  .L([12,14], "%r1")  // 三禪 fanout
  .L([11,15], "%r2")
  .L([12,16], "%r1")
  .L([12,14], "%d2")
  .L([12,17], "%r1")  // 四禪 fanout
  .L([12,18], "%r1")
  .L([12,19], "%r1")
  .L([12,20], "%r1")
  .L([11,21], "%r2")
  .L([12,22], "%r1")
  .L([12,23], "%r1")
  .L([12,24], "%r1")
  .L([12,25], "%r1")
  .L([12,17], "%d8")
  .L([7,26],  "%r1")  // 無色界天 fanout
  .L([7,27],  "%r1")
  .L([7,28],  "%r1")
  .L([7,29],  "%r1")
  .L([7,26],  "%d3")
  .L([6,27],  "%r1")
  .XFT(21, [22,'-',25], 0, -0.5) // 五淨居天 fanin
  .L([18,21], "%r1")
  .L([18,25], "%r1")
  .L([19,21], "%d4")
  .L([19,23], "%r1")
  .L([27,1], "%l2").L([27,7], "%l2").L([27,1],[27,7]).L([27,4],"%r1")      // 五趣雜居地
  .L([27,8], "%l2").L([27,10], "%l2").L([27,8],[27,10]).L([27,9],"%r1")    // 禪離生喜樂地
  .L([27,11], "%l2").L([27,13], "%l2").L([27,11],[27,13]).L([27,12],"%r1") // 禪定生喜樂地
  .L([27,14], "%l2").L([27,16], "%l2").L([27,14],[27,16]).L([27,15],"%r1") // 禪離喜妙樂地
  .L([27,17], "%l2").L([27,25], "%l2").L([27,17],[27,25]).L([27,21],"%r1") // 禪捨念清淨地
  .L([25,26], "%r3") // 空無邊處地
  .L([25,27], "%r3") // 識無邊處地
  .L([25,28], "%r3") // 無所有處地
  .L([25,29], "%r3") // 非想非非想處地
  .L([38,4],"%l2").L([38,29],"%l2").L([38,4],[38,13]).L([38,17],[38,29])   // 九地
;

createGP('大乘', CAT_大乘) // 唯識宗所立。比較律宗所立之「四位」。
.setLayout(`
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇菩薩修行五位
〇〇〇十住/ail|（第一發心住內，包括十信，/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇資糧位（三賢位）
初〇〇十行
僧〇〇十迴向〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇方
祇〇〇〇暖〇〇〇〇〇〇四尋思觀〇〇〇〇〇〇〇〇〇〇〇〇便
劫〇〇〇頂〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇道
〇〇〇〇忍〇〇〇〇〇〇〇〇〇〇〇〇〇加行位
〇〇〇〇世第一位〇〇〇四如實智
〇
〇〇〇〇〇〇〇〇入心〇〇〇〇〇〇〇〇通達位（見道位）
二〇〇初地〇〇〇住心
僧〇〇〇〇〇〇〇出心
祇〇〇二地
劫〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無
〇〇〇七地〇〇〇〇〇〇〇〇〇〇〇〇〇修習位（修道位）〇漏
三〇〇八地〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇聖
僧〇〇九地〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇道
祇〇〇十地
劫〇〇等覺
〇〇〇妙覺〇〇〇〇〇〇〇〇〇〇〇〇〇究竟位（證得佛果）`)
  .setStyle(AIL + BOLD)
  .TC(19,1,'b') // title
  .XFT(1,[4,'-',7],0,-0.5)
  .L([2,2],"%r1").L([2,9],"%r1").L([2,2],[2,9])     // 初僧祇劫
  .XFT(1,[12,'-',15],0,0.5)                         // 二僧祇劫
  .L([2,12],"%r1").L([2,16],"%r1").L([2,12],[2,16])
  .XFT(4,15,0.4,-0.5).L([4,15],"%d1",`stroke="black" stroke-dasharray="2 2"`) // 二地-七地
  .XFT(19,3,0,0.5)                                  // 三僧祇劫
  .L([2,17],"%r1").L([2,20],"%r1").L([2,17],[2,20])
  .L([17,2],"%r1").L([7,5],[18,5]).L([18,2],[18,5]) // 資糧位
  .T(6,3,'/ail|由凡夫修十信成就，須經一萬大劫）/')
  .L([9,6],"%r1").L([9,7],"%r1").L([10,6],[10,7])   // 四尋思觀
  .XFT(12,6,0,0.5) // for text
  .XFT(10,5,0,1.5).L([10,5],"%r1")
  .L([9,8],"%r1").L([9,9],"%r1").L([10,8],[10,9])   // 四如實智
  .XFT(12,9,0,-0.5) // for text
  .XFT(10,10,0,-1.5).L([10,10],"%r1")
  .XFT([14,20],6,0,0.5).XFT([14,20],9,0,-0.5)       // 加行位
  .XFT(19,8,0,-0.5)
  .L([16,6],"%r2").L([16,9],"%r2").L([18,6],[18,9])
  .L([6,12],"%r2").L([7,11],"%r1").L([7,13],"%r1")       // 初地
  .L([7,11],"%d2")
  .L([11,11],"%r7")                                      // 通達位
  .L([11,12],"%r7").L([6,20],[18,20]).L([18,12],[18,20]) // 修習位
  .L([6,21],[18,21])                                     // 究竟位

  .XFT(14,[7,9],-2,0.5)
  .T(14,7,'/ail|所取之境空。有漏/')
  .T(14,9,'/ail|所取之境與能取之智空。無漏/')

  .XFT(28,[5,6,7],0,0.5) // 方便道
  .L([28,2],"%l1").L([28,2],"%d2.75")
  .L([28,11],"%l1").L([28,11],"%u2.75")

  .L([28,12],"%l1").L([28,12],"%d2.25") // 無漏聖道
  .L([28,21],"%l0.75").L([28,21],"%u2.25")
;

createGP('四位', CAT_大乘) // compare: 大乘
  .setLayout(`
　　┌　願樂位　　願樂信解，自利利他，　　　　　　　　為第一阿僧祇劫所修
四　│　　　　　　此當十信、十住、十行、十回向。
　─┤　見位　　　為見道位，此當初地。　　　　　　　　為第二阿僧祇劫所修
位　│　修位　　　為修道位，此當二至七地。
　　└　究竟位　　漸進至於佛地，此當八地至妙覺。　　　為第三阿僧祇劫所修`)
  .L([3,1],"%r1").L([3,5],"%r1").L([3,1],[3,5]) // 四位
  .L([3,3],"%l1")
  .XFT(28,1,0, 0.5)               // 第一阿僧祇劫
  .L([25,1],"%r1").L([25,2],"%r1")
  .L([26,1],[26,2])
  .XFT(27,1,-1,0.5).L([27,1],"%r1")
  .XFT(28,3,0, 0.5)               // 第二阿僧祇劫
  .L([25,3],"%r1").L([25,4],"%r1")
  .L([26,3],[26,4])
  .XFT(27,3,-1,0.5).L([27,3],"%r1")
;

createGP('六度', CAT_大乘).setLayout(`
　　　　　　　　　　　六
　　　　　　　　　　　度
　┌─────────┴─────────┐
　６　　　５　　　４　　　３　　　２　　　１
　般　　　禪　　　精　　　忍　　　持　　　布
　若　　　定　　　進　　　辱　　　戒　　　施
　│　　　│　　　│　　　│　　　│　　　│
┌┴┐　┌┴┐　┌┴┐　┌┴┐　┌┴┐　┌┴┐
一法生　意口身　求修斷　無法生　饒攝律　無法財
切空空　定定定　化精精　生忍忍　益善儀　畏施施
智智智　　　　　精進進　法　　　有法戒　施
智　　　　　　　進　　　忍　　　情戒
　　　　　　　　　　　　　　　　戒
└┬┘　└┬┘　└┬┘　└┬┘　└┬┘　└┬┘
　│　　　│　　　│　　　│　　　│　　　│
　度　　　度　　　度　　　度　　　度　　　度
　愚　　　散　　　懈　　　瞋　　　毀　　　慳
　癡　　　亂　　　怠　　　恚　　　犯　　　貪 `)
  .L([2,3],[22,3])                         // 六度
  .L([12,3],"%u0.5")
  .L([2,3],"%d0.5").L([22,3],"%d0.5")
  // set a macro for drawing one silo
  .run((gp) => {
    function silo(x,y) { // E.g. 布施 [x,y]=[22,8]
      gp.L([x-1,y],"%d0.5").L([x+1,y],"%d0.5")
        .L([x-1,y],[x+1,y]).L([x,y],"%u1.25");
      y += 6; // bottom fork
      gp.L([x,y],"%d1.25").L([x-1,y],[x+1,y])
        .L([x-1,y],"%u0.5").L([x+1,y],"%u0.5")
    }
    silo(22, 8) // 布施
    silo(18, 8) // 持戒
    silo(14, 8) // 忍辱
    silo(10, 8) // 精進
    silo(6,  8) // 禪定
    silo(2,  8) // 般若
  });

createGP('六相', CAT_大乘).setLayout(`
〇〇〇〇〇〇〇總〇〇〇〇〇〇〇〇〇（理法界）
〇〇〇〇體
〇〇〇〇〇〇〇別
六〇〇〇〇〇〇〇〇〇〇〇〇〇平等門（圓融門）
〇〇〇〇〇〇〇同
〇〇〇〇相
〇〇〇〇〇〇〇異
相〇〇〇〇〇〇〇〇〇〇〇〇〇差別門（行布門）
〇〇〇〇〇〇〇成
〇〇〇〇用
〇〇〇〇〇〇〇壞〇〇〇〇〇〇〇〇〇（事法界）`)
  .XFT(6,[2,'-',10],-0.5)
  .XFT(7,[2,'-',10],0.25)
  .XFT(9,[1,'-',11],-0.5)
  .XFT(14,[4,'-',8],0.25)
  .XFT(2,1,0,-0.5)
  .XFT(2,11,0,0.5)
  .L([2,1],"%r1").L([2,11],"%r1").L([2,1],[2,11]) // 六相
  .L([6,2],[7,1]).L([6,2],[7,3])    // 體
  .L([6,6],[7,5]).L([6,6],[7,7])    // 相
  .L([6,10],[7,9]).L([6,10],[7,11]) // 用
  .L([9,1],[14,4]).L([9,5],[14,4]).L([9,9],[14,4])  // 平等門
  .L([9,3],[14,8]).L([9,7],[14,8]).L([9,11],[14,8]) // 差別門
  .L([20,2],"%d1").L([20,9],"%d1")
;

createGP('天台五時八教', CAT_大乘)
.setLayout(
/*a         b           c         d         e     f         g  */`
〇化儀〇〇〇五時〇〇〇〇涅槃〇〇〇五時〇〇〇〇化法〇〇〇〇〇天台
〇四教〇〇〇〇〇〇〇〇〇五味〇〇〇配化〇〇〇〇四教〇〇〇〇〇五時
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇八教
〇頓〇〇〇〇華嚴時〇〇〇乳味〇〇〇兼〇〇〇〇〇藏教               ## A
〇〇初
〇〇中〇〇〇阿含時〇〇〇酪味〇〇〇但〇〇〇〇〇〇〇〇〇真諦〇〇權 ## B
〇〇末〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
〇秘密〇〇〇方等時〇〇〇生酥味〇〇對〇〇〇〇〇通教               ## C
〇〇
〇不定〇〇〇般若時〇〇〇熟酥味〇〇帶〇〇〇〇〇別教               ## D
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇中諦
〇四非〇〇〇法華〇〇〇〇醍醐味〇〇純〇〇〇〇〇圓教〇〇〇〇〇〇實 ## E
〇〇〇〇〇〇涅槃`)
.run((gp) => {
  gp.setStyle(BOLD)
    .TC(31,1,'b').TC(31,2,'b').TC(31,3,'b');
  var a=2, b=a+5, c=a+11, d=a+16, e=a+21, f=a+24, g=a+29,
      A=4, B=6, C=8, D=10, E=12;
  function 真諦中諦權實() {
    var 藏=[f,A], 通=[f,C], 別=[f,D], 圓=[f,E],
        真=[f+1,B], 中=[f+1,D+1], 權=[g,B], 實=[g,E];
    // 真諦中諦
    gp.L(藏,真).L(通,真).L(別,中).L(圓,中)
    // 權實
      .L([f+1,C],權).L([f+1,D],權).L([f+1,A],權)
      .L([f+1,E],實)
    ;
  }
  function 化法四教Mapping_涅槃時() {
    var 兼=[d+1,A], 但=[d+1,B], 對=[d+1,C], 帶=[d+1,D], 純=[d+1,E],
        藏=[e,A], 通=[e,C], 別=[e,D], 圓=[e,E],
        涅=[d+2,E+1];
    gp                        .L(兼,別).L(兼,圓)
      .L(但,藏)
      .L(對,藏).L(對,通).L(對,別).L(對,圓)
                  .L(帶,通).L(帶,別).L(帶,圓)
                                          .L(純,圓)
    // 涅槃時
      .L([b+3,E+1],涅)
      .L(涅,藏).L(涅,通).L(涅,別).L(涅,圓)
  }
  function 化儀四教Mapping() {
    var 華嚴=[b-1,A], 阿含=[b-1,B], 方廣=[b-1,C], 般若=[b-1,D];
    gp.L([a+2,A],華嚴)   // 頓
      .L([a+2,B-1],阿含).L([a+2,B],方廣).L([a+2,B+1],般若) // 漸
      .L([a+2,C],華嚴).L([a+2,C],阿含)           // 秘密
      .L([a+2,C],方廣).L([a+2,C],般若)
      .L([a+2,D],華嚴).L([a+2,D],阿含)           // 不定
      .L([a+2,D],方廣).L([a+2,D],般若)
  }
  function smallAdjusts() {
    gp.XFT(a-1,[A,B,C,D],-0.5,0)
      .L([a-1,A],"%r0.5").L([a-1,B],"%r0.5") // 化儀四教 left enclosure
      .L([a-1,C],"%r0.5").L([a-1,D],"%r0.5")
      .L([a-1,A],[a-1,D])
      .T(a,B,'漸')                               // 漸&初中末
      .XFT(a,B-1,0.5,-0.25).L([a,B-1],"%d2.5")
      .XFT(a+1,[B-1,B,B+1],0.2,0) // 初中末 slightly to right
      .XFT(b,1,0.5,0.5)                          // 五時
      .XFT(b,[E,E+1],0,-0.5)                     // 法華、涅槃時
      .T(b+2,E,'時')
     // both sides of 五味
      .L([b+3,A],"%r2").L([c+2,A],"%r2.5")
      .L([b+3,B],"%r2").L([c+2,B],"%r2.5")
      .L([b+3,C],"%r2").L([c+3,C],"%r1.5")
      .L([b+3,D],"%r2").L([c+3,D],"%r1.5")
      .L([b+3,E],"%r2").L([c+3,E],"%r1.5")
     // 配化列
      .XFT(d,[A,B,C,D,E],0.5,0)
      .XFT(d+1,[A,B,C,D,E],0.5,0)
  }

  smallAdjusts();
  化儀四教Mapping();
  化法四教Mapping_涅槃時();
  真諦中諦權實();
});

createGP('天台綱宗', CAT_大乘)
.setLayout(
/*  a   b     c       d     e       f     g     h             i */ `
天台綱宗〇〇〇〇〇〇〇〇〇藏（羊車）
〇〇〇〇〇〇〇〇化法〇〇〇通（鹿車）〇〇〇〇權
〇〇〇〇〇〇〇〇〇〇〇〇〇別（牛車）
〇〇〇〇教〇〇〇〇〇〇〇〇圓（大白牛車）〇〇實
〇〇〇〇〇〇〇〇〇〇〇〇〇頓
〇〇〇〇〇〇〇〇化儀〇〇〇漸〇〇〇〇〇〇〇〇〇〇〇〇為實施權
綱〇〇〇〇〇〇〇〇〇〇〇〇秘密〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇宗
〇〇〇〇〇〇〇〇〇〇〇〇〇不定〇〇〇〇〇〇〇〇〇〇〇開權顯實
〇〇〇〇〇〇〇〇〇〇〇〇〇分空觀
〇〇〇〇觀〇〇〇〇〇〇〇〇體空觀〇〇〇〇〇〇權
〇〇〇〇〇〇〇〇〇〇〇〇〇次第三觀
〇〇〇〇〇〇〇〇〇〇〇〇〇一心三觀〇〇〇〇〇實`)
.run((gp) => {
  gp.setStyle(BOLD).TC(1,1,'b');
  var a=3, b=a+2, c=a+5, d=a+9, e=a+12, f=e+4, g=f+3, h=g+3, i=h+7;
  function 權實to宗() {
    gp.L([h-1,2],[h+1,6]).L([h-1,10],[h+1,6]) // 權實..
      .L([h-1,4],[h+1,8]).L([h-1,12],[h+1,8])
      .L([i,6],"%l1").L([i,8],"%l1").L([i,6],[i,8])  // ..宗
      .L([i,7],"%r1")
  }
  function 綱教觀() {
    gp.XFT([a,b,b+1],4,0,0.5)    // 教 move down
      .XFT(c-1,[2,6],0,0.5)
      .XFT([a,b,b+1],10,0,0.5)   // 觀 move down
      .L([c-1,2],"%r1").L([c-1,6],"%r1").L([c-1,2],[c-1,6])
      .L([b+1,4],"%r1")
      .L([a,4],[a,10]).L([a,4],"%r1").L([a,10],"%r1") // 綱
      .L([a,7],"%l1")
      .L([d,9],"%r1").L([d,10],"%r1")               // 觀 left
      .L([d,11],"%r1").L([d,12],"%r1").L([d,9],[d,12])
      .L([b+1,10],"%r6")
      // 觀 right
      .L([f,9],[g,10]).L([f,10],[g,10]).L([f,11],[g,10]) // 權
      .L([f,12],"%r2") // 實
    ;
  }
  function 化法() {
    gp.XFT([c+1,d-1],2,0,0.5).L([d-1,2],"%r1") // left
      .L([d,1],"%r1").L([d,2],"%r1")
      .L([d,3],"%r1").L([d,4],"%r1").L([d,1],[d,4])
      .L([f,1],[g,2]).L([f,2],[g,2]).L([f,3],[g,2]) // right
      .L([f+1,4],[g,4]);
  }
  function 化儀() {
    gp.XFT([c+1,d-1],6,0,0.5).L([d-1,6],"%r1") // left
      .L([d,5],"%r1").L([d,6],"%r1")
      .L([d,7],"%r1").L([d,8],"%r1").L([d,5],[d,8]);
  }

  綱教觀();
  化法();
  化儀();
  權實to宗();
});

createGP('一心三觀', CAT_大乘).setLayout(
/*      o   a     b             c       d         e         f         g         h */ `
不可思議〇（三觀）（不思議境）（三諦）（破三惑）（證三智）（成三德）（教門）
一心三觀〇
〇〇〇〇〇〇空觀〇一法一切法〇〇俗諦〇〇見思惑〇〇一切智〇〇般若德〇〇漸
〇〇生〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇菩
〇〇死〇〇〇假觀〇一切法一法〇〇真諦〇〇塵沙惑〇〇道種智〇〇解脫德〇〇頓〇〇〇〇提
〇〇煩〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇涅
〇〇惱〇〇〇中觀〇非一非一切〇〇中諦〇〇無明惑〇〇一切種智〇法身德〇〇不定〇〇〇槃`)
.run((gp) => {
  gp.setStyle(BOLD)
    .TC(1,1,'b').TC(1,2,'b') // title bold
  var o=5, a=o+2, b=a+3, c=b+7, d=c+4, e=d+5, f=e+5, g=f+5, h=g+5;

  gp.L([o,3],"%r1").L([o,7],"%r1").L([o,3],[o,7])     // left
    .L([o,5],"%l1")
    .XFT(o-2,[4,'-',7],0,-0.5)   // 生死煩惱

    .L([h-2,3],"%l1").L([h-2,7],"%l1").L([h-2,3],[h-2,7]) // right
    .L([h-2,5],"%r1")
    .XFT(h,[4,'-',7],0,-0.5)     // 菩提涅槃

    .XFT(b,[3,5,7],0.5)          // 不思議境三條
    .XFT(e,7,-0.5)               // 一切種智
    .XFT(g,[3,5],0.5);           // 漸 頓
});

createGP('六即', CAT_大乘).setLayout(`
〇〇（十位階）〇〇〇〇〇〇〇〇〇〇〇〇（六種即佛）
〇１〇凡夫位（對於佛法，聞信全無）───理〇即佛
〇２〇凡夫位（對於佛法，有聞有信）───名字即佛
〇３〇五品弟子位───（外凡位）────觀行即佛
〇４〇十信位─────（內凡位）────相似即佛
〇５〇十住位───┐
〇６〇十行位〇〇〇│
〇７〇十迴向位〇〇├─（菩薩位）────分證即佛
〇８〇十地位〇〇〇│
〇９〇等覺位───┘
１０〇妙覺位─────（佛〇位）────究竟即佛`)
  .L([18,2],[20,2])    // 理即佛
  .L([18,3],[20,3])    // 名字即佛
  .L([17,4],[20,4])    // 觀行即佛
  .L([17,5],[20,5])    // 相似即佛
  .L([17,8],[20,8])    // 分證即佛
  .L([17,11],[20,11])  // 究竟即佛
  .L([7,6],[10,6]).L([7,10],[10,10]) // 菩薩位
  .L([10,6],[10,10])
  .XFT(11,8,0.5).L([10,8],[11,8])
;

createGP('六和敬', CAT_基本).setLayout(`
　理　和───證擇滅
　　　　　┌　身口同住
　　　　　│　口和無諍
　事　和　│　意和同悅
（六和敬）│　戒和同修
　　　　　│　見和同解
　　　　　└　利和同均`)
  .XFT(5,4,0,0.5)
  .L([5,1],"%r2")                       // 理和
  .L([5,4],"%r1")
  .L([6,2],"%r1").L([6,3],"%r1").L([6,4],"%r1")
  .L([6,5],"%r1").L([6,6],"%r1").L([6,7],"%r1")
  .L([6,2],[6,7])
;

createGP('聲聞乘', CAT_小乘)
.setLayout(
/*  a           b         u          v         w */ `
〇〇〇〇〇〇〇〇〇五停心觀〇┐
〇〇〇〇外凡〇〇〇別相念處〇├─資糧位〇┐
〇〇凡〇〇〇〇〇〇總相念處〇┘〇三〇賢〇├─七方便〇┐〇〇〇三
〇〇位〇〇〇〇〇〇暖────┐〇〇〇〇〇│〇〇〇〇〇│〇〇〇生
〇〇〇〇內凡〇〇〇頂〇〇〇〇├─加行位〇┘〇〇〇〇〇│〇修〇乃
聲〇〇〇〇〇〇〇〇忍〇〇〇〇│〇四善根〇〇〇〇〇〇〇├─四〇至
聞〇〇〇〇〇〇〇〇世第一法─┘〇〇〇〇〇〇〇〇〇〇〇│〇聖〇六
〇〇〇〇見道〇〇〇預流果〇〇┐〇〇〇〇〇〇〇〇〇〇〇│〇諦〇十
〇〇聖〇修道〇〇〇一來果〇〇├─四果位───────┘〇〇〇劫
〇〇位〇〇〇〇〇〇不還果〇〇│
〇〇〇〇無學道〇〇羅漢果〇┘`)
.run((gp) => {
   var a=3, b=9, u=15, v=u+6, w=v+6;
   function leftPart() {
     gp.L([b-1,1],"%r1").L([b-1,3],"%r1").L([b-2,2],"%r1") // 外凡
       .L([b-1,1],[b-1,3])
       .XFT([b-2,a+2,a],5,0,0.5)
       .L([b-1,4],"%r1").L([b-1,7],"%r1").L([b-2,5],"%r1") // 內凡
       .L([b-1,4],[b-1,7])
       .L([a,2],"%r1").L([a,2],"%d0.5")                // 凡位
       .L([a,5],"%r1").L([a,5],"%u1")

       .L([b-2,8],"%r2")                               // 見道
       .XFT(a+2,9,0,0.5).L([a+3,9],"%r1")              // 修道
       .XFT(a+3,9,1,0.5).L([a+3,9],"%r1")
       .L([a+5,9],"%r1").L([a+5,10],"%r1").L([a+5,9],"%d1")
       .L([b-1,11],"%r1")                              // 無學道
       .L([a,8],"%r1").L([a,8],"%d0.5")                // 聖位
       .L([a,11],"%r1").L([a,11],"%u0.5")

       .XFT(1,[3,9],0,0.5)                             // 聲聞
       .L([1,3],"%r1").L([1,3],"%d2")
       .L([1,9],"%r1").L([1,9],"%u2")
     ;
   }
   function rightPart() {
     gp.XFT(u+2,[2,3],0,-0.5).XFT(u+4,3,0,-0.5)        // 資糧位、三賢
       .L([u,1],"%l1").L([u,a],"%l1").L([u,1],[u,a])
       .L([u,2],"%r1")
       .L([u,4],"%l1").L([u,7],"%l1").L([u,4],[u,7])   // 加行位、四善根
       .XFT(u,[5,9],0,0.5).L([u,5],"%r1")
       .L([u,8],"%l1").L([u,11],"%l1").L([u,8],[u,11]) // 四果位
       .L([u,9],"%r1")
       .XFT([u+2,u+5,w],9,0,0.5)
       .L([v,2],"%l1").L([v,5],"%l1")                  // 七方便
       .XFT(v,5,0,0.5).L([v,2],[v,5])
       .XFT(v+2,3,0,0.75) // text
       .XFT([v,18,w],3,0,0.75).L([v,3],"%r1")
       .L([w,3],"%l1").L([w,9],"%l7").L([w,3],[w,9])   // right
       .XFT(w,6,0,0.5).L([w,6],"%r1")
       .XFT(w+4,[3,'-',9],0,0.5); // 三生乃至六十劫
   }

   leftPart();
   rightPart();
});

createGP('四聖諦', CAT_小乘).setLayout(`
　　┌　苦　諦（迷的果，即苦果）　┐
四　│　集　諦（迷的因，即苦因）　┘───世間的因果
聖─┤　滅　諦（悟的果，即樂果）　┐
諦　└　道　諦（悟的因，即樂因）　┘───出世間的因果`)
  .L([3,1],"%r1").L([3,4],"%r1").L([3,1],"%d3") // 四聖諦
  .XFT(3,3,0,-0.5).L([3,3],"%l1")
  .XFT(1,[2,3,4],0,-0.5)
  .XFT(17,[1,'-',4],-0.5)
  .L([18,1],[17,1]).L([18,2],[17,2]).L([18,1],"%d1") // 世間的因果
  .XFT([19,22],2,-1,-0.5).L([19,2],"%r2")
  .L([18,3],[17,3]).L([18,4],[17,4]).L([18,3],"%d1") // 出世間的因果
  .XFT([19,22],4,-1,-0.5).L([19,4],"%r2")
;

createGP('四諦十六行相', CAT_小乘)
  .setMarkNames('A')
  .setLayout(`
　　　　　　　　┌　苦：　（觀此身是苦）
　　　　　　　　│　空：　（觀因緣所生故空。）
　　┌　苦　諦─┤　無常：（觀因緣假成，故生滅無常。）
　　│　　　　　└　無我：（觀因緣假成，故無我體。）
　　│　　　　　┌　集：　（觀招集苦果。）
四　│　　　　　│　因：　（觀苦果之因。）
諦　│　集　諦─┤　生：　（觀苦果生，相繼存在。）
十　│　　　　　└　緣：　（觀諸緣成就苦果。）
六─A　　　　　┌　滅：　（觀諸漏已盡，生死斷滅。）
行　│　　　　　│　靜：　（觀三毒皆無，此心不亂，有明照作用，故靜。）
相　│　滅　諦─┤　妙：　（觀出離三界，無諸憂患，故妙。）
　　│　　　　　└　離：　（觀一切災害，皆已遠離。）
　　│　　　　　┌　道：　（觀八正道，可至涅槃。）
　　│　　　　　│　如：　（道契正理，故如。）
　　└　道　諦─┤　行：　（由此萬行，以趣涅槃。）
　　　　　　　　└　出：　（由此聖道，以出生死。）`)
  .XFT(3,[3,15],0,-0.5)    // 四諦十六行相
  .L([3,3],"%r1").L([3,15],"%r1").L([3,3],[3,15])
  .XFT('A',0,-0.5).L('A',"%l1")
  .run((gp) => {
     function item(x,y) { // Eg 苦諦: [x,y]=[9,1]
       gp.L([x,y],"%r1").L([x,y+3],"%r1").L([x,y],"%d3")
         .XFT([x,x-2,x-4],y+2,0,-0.5)
         .L([x,y+2],"%l1")
     }
     item(9,1)  // 苦諦
     item(9,5)  // 集諦
     item(9,9)  // 滅諦
     item(9,13) // 道諦
   });
;

createGP('三轉法輪', CAT_小乘).setLayout(`
〇〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是苦，逼迫性
〇〇〇〇苦諦〇〇苦果〇〇〇次轉〇〇勸修：此是苦，汝應知
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是苦，我已知
三〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是集，招感性〇〇〇〇〇三
轉〇〇〇集諦〇〇苦因〇〇〇次轉〇〇勸修：此是集，汝應斷〇〇〇〇〇轉
四〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是集，我已斷〇〇〇〇又十
聖〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是滅，可證性〇〇〇〇稱二
諦〇〇〇滅諦〇〇樂果〇〇〇次轉〇〇勸修：此是滅，汝應證〇〇〇〇〇法
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是滅，我已證〇〇〇〇〇輪
〇〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是道，可修性
〇〇〇〇道諦〇〇樂因〇〇〇次轉〇〇勸修：此是道，汝應修
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是道，我已修`)
  .L([7,2],"%r1").L([11,2],"%r2")                    // 苦諦
  .L([12,1],"%r1").L([12,3],"%r1").L([12,1],"%d2")
  .L([7,5],"%r1").L([11,5],"%r2")                    // 集諦
  .L([12,4],"%r1").L([12,6],"%r1").L([12,4],"%d2")
  .L([7,8],"%r1").L([11,8],"%r2")                    // 滅諦
  .L([12,7],"%r1").L([12,9],"%r1").L([12,7],"%d2")
  .L([7,11],"%r1").L([11,11],"%r2")                  // 道諦
  .L([12,10],"%r1").L([12,12],"%r1").L([12,10],"%d2")
  .L([29,1],"%r1").L([29,12],"%r1").L([30,1],[30,12]) // right
  .XFT(30,6,0,0.5).L([30,6],"%r1")
  .L([3,2],"%r1").L([3,11],"%r1").L([3,2],[3,11]) // left
  .XFT(2,6,0,0.5).L([2,6],"%r1")
  .XFT(1,[4,5,6,7,8],0,0.5)
;

createGP('十二因緣', CAT_小乘).setLayout(`
〇〇〇〇〇〇〇過去二因〇〇〇１〇〇無明〇（貪瞋痴等煩惱）〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇２〇〇行〇〇（造作諸業）〇〇〇〇〇〇〇業 ▾
〇〇〇〇〇〇〇〇〇〇〇〇〇〇３〇〇識〇〇（業識投胎）〇〇〇〇〇〇〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇４〇〇名色〇（但有胎形六根未具）〇〇〇苦 ✗◂
〇〇〇〇〇〇〇現在五果〇〇〇５〇〇六入〇（長成眼等六根人形）〇〇〇苦 ✗◂
十二因緣〇〇〇〇〇〇〇〇〇〇６〇〇觸〇〇（出胎與外境接觸）〇〇〇〇苦 ✗◂
三世因果〇〇〇〇〇〇〇〇〇〇７〇〇受〇〇（與外境接觸生苦樂感受）〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇８〇〇愛〇〇（對境生愛欲）〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇現在三因〇〇〇９〇〇取〇〇（追求造作）〇〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１０〇有〇〇（成業因能招未來果報）〇〇業 ▾
〇〇〇〇〇〇〇未來二果〇〇〇１１〇生〇〇（再受未來五蘊身）〇〇〇〇苦 ▸✗
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１２〇老死〇（未來之身又漸老而死）〇〇苦 ▸✗`)
  .L([6,1],[6,11])
  .XFT([6,8,12],1,0,0.5).XFT([6,8,12],11,0,0.5)
  .L([6,1],"%r1").L([6,5],"%r1").L([6,9],"%r1").L([6,11],"%r1") // left
  .XFT(5,7,0,-0.5).L([5,7],"%r1")
  .L([13,1],"%r1").L([13,1],[13,2]).L([13,2],"%r1")     // 過去二因
  .L([12,1],"%r1")
  .L([13,3],"%r1").L([13,7],"%r1")                      // 現在五果
  .L([13,3],[13,7]).L([12,5],"%r1")
  .L([13,8],"%r1").L([13,10],"%r1")                     // 現在五果
  .L([13,8],[13,10]).L([12,9],"%r1")
  .L([13,3],[13,7]).L([12,5],"%r1")
  .L([13,11],"%r1").L([13,11],[13,12]).L([13,12],"%r1") // 未來二果
  .L([12,11],"%r1")
;

createGP('七十五法', CAT_小乘) // compare: 五位百法
.setLayout(`
〇七〇〇〇〇〇〇〇〇〇五根：眼、耳、鼻、舌、身
〇十〇〇〇色〇法〇〇〇五境：色、聲、香、味、觸〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇十一
五五〇〇〇〇〇〇〇〇〇無表色
位法〇〇〇心〇法：眼識、耳識、鼻識、舌識、身識、意識〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一
〇〇〇〇〇〇〇〇〇〇〇遍大地法：受、想、思、觸、欲、慧、念、作意、勝解、三摩地〇〇〇〇〇十
〇〇有為法〇〇〇〇〇〇大善地法：信、不放逸、輕安、捨、慚、愧、無貪、無瞋、不害、勤〇〇〇十〇〇七
〇〇〇〇〇心所法〇〇〇大煩惱地法：癡、放逸、懈怠、不信、昏沉、掉舉〇〇〇〇〇〇〇〇〇〇〇六〇〇十
宇〇〇〇〇〇〇〇〇〇〇大不善地法：無慚、無愧〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二〇〇五
宙〇〇〇〇〇〇〇〇〇〇小煩惱地法：忿、覆、慳、嫉、惱、害、恨、諂、誑、憍〇〇〇〇〇〇〇〇十〇〇法
萬〇〇〇〇〇〇〇〇〇〇不定地法：尋、伺、睡眠、惡作、貪、瞋、慢、疑〇〇〇〇〇〇〇〇〇〇〇八
有〇〇〇〇不相應行法：得、非得、同分、無想果、無想定、滅盡定、命根、
〇〇〇〇〇〇〇〇〇〇〇生、住、異、滅、文身、名身、句身〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇十四
〇〇無為法：擇滅無為、非擇滅無為、虛空無為〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三`)
  .setStyle(BOLD) // title
  .TC(2,1,'b').TC(2,2,'b').TC(2,3,'b').TC(2,4,'b')
  .TC(1,3,'b').TC(1,4,'b')
  .T(1,1,'小').T(1,2,'乘')
  .L([1,7],"%u1").L([1,6],"%r1")   // 宇宙萬有 fanout
  .L([1,12],"%d1").L([1,13],"%r1")
  .L([4,2],"%d3").L([4,2],"%r1")   // 有為法 fanout
  .L([4,7],"%d4").L([4,11],"%r1")
  .L([9,2],"%r2").L([10,1],"%d2")  // 色法 fanout
  .L([10,1],"%r1").L([10,3],"%r1")
  .L([10,5],"%d5").L([10,5],"%r1") // 心所法 fanout
  .L([10,6],"%r1")
  .L([10,7],"%r1")
  .L([10,8],"%r1")
  .L([10,9],"%r1")
  .L([10,10],"%r1")
  .XFT([6,9],7,0,0.5).L([9,7],"%r1") // for "心所法"
  // counts
  .L([25,1],"%r1").L([26,1],"%d2")  // 十一
  .L([26,3],"%l1").L([25,2],"%r18")
  .L([27,4],"%r16")      // 一
  .L([40,5],"%r3")       // 十
  .L([42,6],"%r1")       // 十
  .L([35,7],"%r8")       // 六
  .L([23,8],"%r20")      // 二
  .L([37,9],"%r6")       // 十
  .L([35,10],"%r8")      // 八
  .XFT(44,12,0,-0.5)     // 十四
  .XFT(35,12,0,-0.5).L([35,12],"%r8")
  .L([22,13],"%r21")     // 三
  .XFT(35,14,0,-1.7).XFT(35,11,0,-0.3).L([35,11],[35,14])
  .L([46,2],"%r2").L([48,2],"%d3")    // 七十五法
  .L([46,13],"%r2").L([48,13],"%u3")
;

createGP('七十五法與百法對照', CAT_小乘)
  .include(cloneGP('七十五法'), 1, 1)
  .include(cloneGP('五位百法'), 1, 16)
;

createGP('八段五篇', CAT_戒律).setLayout(`
〇〇〇〇（名目）〇（比丘戒）〇（比丘尼戒）〇〇〇（名目）
〇〇第一〇波羅夷〇〇〇〇四〇〇〇〇〇〇八〇〇〇〇〇波羅夷
〇〇第二〇僧〇殘〇〇〇十三〇〇〇〇〇十七〇〇〇〇〇僧〇殘
〇〇第三〇不〇定〇〇〇〇二〇〇〇〇〇〇無
八〇第四〇捨〇墮〇〇〇三十〇〇〇〇〇三十〇〇〇〇〇〇墮〇〇五
段〇第五〇單〇墮〇〇〇九十〇〇〇〇一七八〇〇〇〇〇〇〇〇〇篇
〇〇第六〇提舍尼〇〇〇〇四〇〇〇〇〇〇八〇〇〇〇〇提舍尼
〇〇第七〇眾〇學〇〇〇一百〇〇〇〇〇一百
〇〇第八〇滅〇諍〇〇〇〇七〇〇〇〇〇〇七〇〇〇〇〇突吉羅
〇〇〇〇〇（共計）二百五十戒〇三百四十八戒`)
  .L([1,2],"%r1").L([1,2],[1,4])          // 八段
  .L([1,9],"%r1").L([1,9],[1,7])
  .L([22,2],"%r3")                        // 波羅夷
  .L([22,3],"%r3")                        // 僧殘
  .XFT(23,5,0.7).XFT(24,5,0.3)   // 墮
  .L([22,5],[23,5]).XFT(26,5,-0.2).L([24,5],[26,5])
  .L([22,6],"%r1").L([23,6],"%u1")
  .XFT(23,7,0.7).XFT(24,7,0.3)   // 提舍尼
  .L([22,7],[23,7]).L([24,7],[25,7])
  .L([22,9],"%r3")                        // 突吉羅
  .L([22,8],"%r2")
  .L([22,4],"%r2").L([24,4],"%d5")
  .L([29,2],[30,2]).L([30,2],[30,4])      // 五篇
  .L([30,7],[30,9]).L([30,9],"%l1")
;

createGP('四分律', CAT_戒律).setLayout(`
　　┌　初分前部─────────僧戒本───┬───止持
四　│　　　　　　　　　　　　　　　　　　　　│
分─┤　初分後部至第二分前部───尼戒本───┘
律　│　
　　└　第二分後部至第四分────二十犍度──────作持`)
  .L([3,1],"%r1").L([3,5],"%r1").L([3,1],[3,5]).L([3,3],"%l1")
  .L([9,1],"%r8").L([21,1],"%r6")
  .L([15,3],"%r2").L([21,3],"%r3").L([24,3],"%u2")
  .L([14,5],"%r3").L([22,5],"%r5")
;
