createGP('五法事理唯識').setLayout(`
〇五
〇法〇┌─ 心王〇〇 ── 識之自相 ─┐
〇事〇├─ 心所〇〇 ── 與識相應 ─┤
〇理─┼─ 色〇〇〇 ── 識之所變 ─┼─事──不離識；萬法唯識
〇唯〇├─ 不相應行 ── 識之分位 ─┘〇〇〇〇〇│
〇識〇└─ 無為〇〇 ─ 以上四法實性 ──理───┘
〇`)
  .shiftPoint(2, [1,2,3,4,5,6], 0, 0.5)
  .line([4,2],"%r1")
  .line([4,3],"%r1")
  .line([3,4],"%r2")
  .line([4,5],"%r1")
  .line([4,6],"%r1")
  .line([4,2],[4,6]) // left-most
  .line([10,2],"%r3")
  .line([10,3],"%r3")
  .line([10,4],"%r3")
  .line([10,5],"%r3")
  .line([10,6],"%r2") // 2nd column
  .line([18,2],"%r2")
  .line([18,3],"%r2")
  .line([18,4],"%r2")
  .line([18,5],"%r2")
  .line([20,2],[20,5])
  .line([19,6],"%r3")
  .shiftPoint([22,23,25,26],4,0,-0.5)
  .line([22,4],"%l2") // 事、理
  .line([25,4],"%l1")
  .line([24,6],"%r3").line([27,6],"%u1.75")
;

createGP('三界之九地二十八天').setLayout(`
〇〇〇〇〇（近）〇〇〇五趣雜居地
〇〇〇〇〇欲界〇〇〇〇〇〇〇〇〇〇〇地居天：四天王天、仞利天
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇空居天：夜摩天、兜率天、化樂天、他化自在天
〇〇〇〇〇〇〇〇〇〇〇離生喜樂地〇〇初禪天：梵眾天、梵輔天、大梵天
三界〇〇〇色界〇〇〇〇定生喜樂地〇〇二禪天：少光天、無量光天、光音天
〇〇〇〇〇〇〇〇〇〇〇離喜妙樂地〇〇三禪天：少淨天、無量淨天、遍淨天
〇〇〇〇〇〇〇〇〇〇〇捨念清淨地〇〇四禪天：無雲天、福生天、廣果天、無煩天、無熱天、
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇善見天、善現天、色究竟天、無想天
〇〇〇〇〇〇〇〇〇〇〇空無邊處地〇〇〇（天）
〇〇〇〇〇無色界〇〇〇識無邊處地〇〇〇（天）
〇〇〇〇〇〇〇〇〇〇〇無所有處地〇〇〇（天）
〇〇〇〇〇（遠）〇〇〇非想非非想處地〇（天）`)
  .defPoint("A", 4, 2)
  .defPoint("B", 4, 10)
  .defPoint("C", 10, 1)
  .defPoint("D", 10, 3)
  .defPoint("E", 10, 4)
  .defPoint("F", 10, 7)
  .defPoint("G", 10, 9)
  .defPoint("H", 10, 12)
  .shiftPoint([1,3,4,6,8], 5, 0, 0.5)
  .shiftPoint([4,6,9], 10, 0, 0.5)
  .line("A", "%r1")         // 三界 fanout
  .line("B", "%r1")
  .line("A", "B")
  .line([3,5], "%r1")
  .line([4,5], "%r1")
  .line("C", "%r1")         // 欲界 fanout
  .line("C", "D")
  .line([8,2], "%r10")
  .line("D", "%r8")
  .line([8,5], "%r2")       // 色界 fanout
  .line("E", "%r1")
  .line([10,5], "%r1")
  .line([10,6], "%r1")
  .line("F", "%r1")
  .line("E", "F")
  .line([17,4], "%r1")
  .line([17,5], "%r1")
  .line([17,6], "%r1")
  .line([17,7], "%r1")
  .line([9,10], "%r1")      // 無色界 fanout
  .line([10,10], "%r1")
  .line("G", "%r1")
  .line([10,10], "%r1")
  .line([10,11], "%r1")
  .line("H", "%r1")
  .line("G", "H")
;

createGP('十八界').setLayout(
/* -- variables for key positions
a       b       c   d             e     h           f   g i     j   */ `
〇〇〇〇〇〇〇〇〇〇眼根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇地    // A   - 六根
〇〇〇〇〇〇〇〇〇〇耳根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇水
〇〇〇〇〇〇〇〇六〇鼻根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇火
〇〇〇〇〇〇〇〇根〇舌根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇風
〇〇〇〇十〇〇〇〇〇身根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇色          //   D - 五蘊
〇〇〇〇二〇〇〇〇〇意根
十〇〇〇處〇〇〇〇〇〇〇〇〇〇〇〇眼識〇〇〇〇〇〇〇〇〇受          // B   - 六識
八〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇耳識〇〇〇〇〇〇〇〇〇〇〇〇〇五
界〇〇〇〇〇〇〇六〇〇〇〇〇〇〇〇鼻識〇〇〇〇〇〇〇〇〇想〇〇〇蘊
〇〇〇〇〇〇〇〇識〇〇〇〇〇〇〇〇舌識〇〇〇〇〇〇〇心              //   E - 心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇身識〇〇〇〇〇〇〇〇〇行
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇意識
〇〇〇〇〇〇〇〇〇〇眼塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識          // C   - 六塵
〇〇〇〇〇〇〇〇〇〇耳塵
〇〇〇〇〇〇〇〇六〇鼻塵
〇〇〇〇〇〇〇〇塵〇舌塵
〇〇〇〇〇〇〇〇〇〇身塵
〇〇〇〇〇〇〇〇〇〇意塵
`)
.setup((gp) => {
  var a=1, b=a+4, c=b+4, d=c+2, e=d+7, f=e+9, g=f+2, h=e+3, i=g+1, j=g+4,
      A=1, B=7, C=13, D=5, E=D+5,
      五根匯聚點 = [h,A+2], 五塵匯聚點 = [h,C+2], 心匯聚點 = [f-1,E];
  function 六根六塵to色() {   // 六根、六塵 -> 色
    return gp.line([d+2,A  ],五根匯聚點).line([d+2,C  ],五塵匯聚點)
             .line([d+2,A+1],五根匯聚點).line([d+2,C+1],五塵匯聚點)
             .line([d+2,A+2],五根匯聚點).line([d+2,C+2],五塵匯聚點)
             .line([d+2,A+3],五根匯聚點).line([d+2,C+3],五塵匯聚點)
             .line([d+2,A+4],五根匯聚點).line([d+2,C+4],五塵匯聚點)
             .line(五根匯聚點,[f-1,D]).line(五塵匯聚點,[f-1,D])
             .line([f-1,D],[f+1,D]);
  }
  function 意根意塵六識to心() {
    return gp.line([d+2,A+5],[h,A+5]).line([h,A+5],心匯聚點)     // 意根 -> 心
             .line([d+2,C+5],[h,C+5]).line([h,C+5],心匯聚點)     // 意塵 -> 心
             .line([e+2,B  ],心匯聚點).line([e+2,B+1],心匯聚點)  // 六識 -> 心
             .line([e+2,B+2],心匯聚點).line([e+2,B+3],心匯聚點)
             .line([e+2,B+4],心匯聚點).line([e+2,B+5],心匯聚點)
             .line([g-2,B],[g-2,E-1]).line([g-2,C],[g-2,E+1])    // 心 enclosure
             .line([g-2,B],"%r1").line([g-2,C],"%r1");
  }
  function 地水火風() {    // 色 -> 地水火風
    return gp.shiftPoint(i,[A+1,A+2],0,-0.5).shiftPoint(g,A+2,0,-0.5)
             .shiftPoint(g,A+3,0,0.5)
             .line([i,A],"%r1").line([i,A+3],"%r1").line([i,A],[i,A+3])
             .line([g,A+3],[g,A+2]).line([g,A+2],[i,A+2]);
  }
  function 五蘊() {   // 色受想行識 -> 五蘊
    return gp.line([i,D],[j,D]).line([j,D],[j,B])
             .line([i,C],[j,C]).line([j,C],[j,E]);
  }
  function 十八界十二處() {
    return gp.line([a+1,B+1],[b-1,B-1])                  // 十八界 <- 十二處
             .shiftPoint(c-1,[E,A+3,C+3],0,-0.5)         //        <- 六識
             .shiftPoint(b-1,B+3,0,-0.5).line([b-1,B+3],[c-1,B+3])
             .line([a+1,B+1],[b-1,B+3])
    .line([b+1,B-1],[c-1,A+3]).line([b+1,B-1],[c-1,C+3]) // 十二處 <- 六根、六塵
    .line([c,A],[c,A+1]).line([c,D+1],[c,D])             // 六根 enclosure
    .line([c,C],"%r1").line([c,D+1],"%r1")
    .line([c,C],[c,C+1]).line([c,C+5],[c,C+4])           // 六塵 enclosure
    .line([c,A],"%r1").line([c,C+5],"%r1")
    .line([c,B],[c,B+1]).line([c,E+2],[c,E+1])           // 六識 enclosure
    .line([c,B],[e-5,B]).line([c,E+2],[e-5,E+2])
    .line([d+2,A  ],[e-1,B  ]).line([d+2,C  ],[e-1,B  ]) // 六根、六塵 -> 六識
    .line([d+2,A+1],[e-1,B+1]).line([d+2,C+1],[e-1,B+1])
    .line([d+2,A+2],[e-1,B+2]).line([d+2,C+2],[e-1,B+2])
    .line([d+2,A+3],[e-1,B+3]).line([d+2,C+3],[e-1,B+3])
    .line([d+2,A+4],[e-1,B+4]).line([d+2,C+4],[e-1,B+4])
    .line([d+2,A+5],[e-1,B+5]).line([d+2,C+5],[e-1,B+5]);
  }

  十八界十二處();
  六根六塵to色();
  意根意塵六識to心();
  地水火風();
  五蘊();
});

createGP('意識').setLayout(
/* -- variables for key positions
a       b       c   d             e   f             g         h i       j    */ `
〇〇〇〇〇〇〇〇〇〇眼根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇            // A   - 六根
〇〇〇〇〇〇〇〇〇〇耳根
〇〇〇〇〇〇〇〇六〇鼻根
〇〇〇〇〇〇〇〇根〇舌根
〇〇〇〇十〇〇〇〇〇身根
〇〇〇〇二〇〇〇〇〇意根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇順次五心念<tspan class="ail">：（前五識為第六識引導，亦通於三性矣）</tspan>
十〇〇〇處〇〇〇〇〇〇〇〇〇〇〇〇眼識〇〇〇〇眼俱意識〇〇〇〇〇〇〇〇〇〇一、率爾心<tspan class="ail">：意識初對外境，於剎那間的輕率了別    // B   - 六識</tspan>
八〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇耳識〇〇〇〇耳俱意識〇〇〇〇〇〇〇了〇〇二、尋求心<tspan class="ail">：於率爾了別之後，進而生起尋求作用</tspan>
界〇〇〇〇〇〇〇六〇〇〇〇〇〇〇〇鼻識〇〇〇〇鼻俱意識〇〇〇〇〇〇〇別〇〇三、決定心<tspan class="ail">：意識尋到目標，進而決心了別</tspan>
〇〇〇〇〇〇〇〇識〇〇〇〇〇〇〇〇舌識〇〇〇〇舌俱意識〇〇〇〇〇〇〇作〇〇四、染淨心<tspan class="ail">：意識了別外境後，對怨親順違等境界所生之染淨心</tspan>
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇身識〇〇〇〇身俱意識〇〇〇〇〇〇〇用〇〇五、等流心<tspan class="ail">：染淨之心（善惡之心）相續，故名之</tspan>
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇意識〇〇〇〇獨頭意識〇〇〇〇〇〇〇獨散意識            // D   - 意識
〇〇〇〇〇〇〇〇〇〇眼塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇夢中獨頭意識        // C   - 六塵
〇〇〇〇〇〇〇〇〇〇耳塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇定中獨頭意識
〇〇〇〇〇〇〇〇六〇鼻塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇狂亂獨頭意識
〇〇〇〇〇〇〇〇塵〇舌塵
〇〇〇〇〇〇〇〇〇〇身塵
〇〇〇〇〇〇〇〇〇〇意塵
`)
.setup((gp) => {
  var a=1, b=a+4, c=b+4, d=c+2, e=d+7, f=e+2, g=f+7, h=g+5, i=h+1, j=i+4,
      A=1, B=7, C=13, D=B+5;
  gp.setStyle('.ail { font-size:12px; opacity:0.8 }');
  function 獨頭意識() {
    return gp.line([f,D],[g-4,D])
             .line([g+1,D],[i+1,D  ]).line([g+1,D],[i+1,D+1])
             .line([g+1,D],[i+1,D+2]).line([g+1,D],[i+1,D+3]);
  }
  function 五俱意識() {
    return gp.line([f,B  ],[g-4,B  ]).line([f,D],[g-4,B  ]).line([g+1,B  ],[i,B  ])
             .line([f,B+1],[g-4,B+1]).line([f,D],[g-4,B+1]).line([g+1,B+1],[i,B+1])
             .line([f,B+2],[g-4,B+2]).line([f,D],[g-4,B+2]).line([g+1,B+2],[i+1,B+2])
             .line([f,B+3],[g-4,B+3]).line([f,D],[g-4,B+3]).line([g+1,B+3],[i,B+3])
             .line([f,B+4],[g-4,B+4]).line([f,D],[g-4,B+4]).line([g+1,B+4],[i,B+4]);
  }
  function 了別作用() {
    return gp.line([d+2,C  ],[g+1,C  ]).line([g+1,C  ],[h,B  ])
             .line([d+2,C+1],[g+1,C+1]).line([g+1,C+1],[h,B+1])
             .line([d+2,C+2],[g+1,C+2]).line([g+1,C+2],[h,B+2])
             .line([d+2,C+3],[g+1,C+3]).line([g+1,C+3],[h,B+3])
             .line([d+2,C+4],[g+1,C+4]).line([g+1,C+4],[h,B+4])
             .line([i,B],[i,B+4])
             .shiftPoint(i+2,[B,B+1,B+2,B+3,B+4],0,-0.5)
             .shiftPoint(j,B,0,-0.25).shiftPoint(j,B+4,0,0.25).line([j,B],[j,B+4])
             .line([j-1,B+2],[j,B+2]);
  }
  function 十八界十二處() {
    return gp
    .line([a+1,B+1],[b-1,B-1])                              // 十八界 <- 十二處
    .shiftPoint(c-1,[B+3,A+3,C+3],0,-0.5)                   //        <- 六識
    .shiftPoint(b-1,B+3,0,-0.5).line([b-1,B+3],[c-1,B+3])
    .line([a+1,B+1],[b-1,B+3])
    .line([b+1,B-1],[c-1,A+3]).line([b+1,B-1],[c-1,C+3])    // 十二處 <- 六根、六塵
    .line([c,A],[c,A+1]).line([c,B-1],[c,B-2])              // 六根 enclosure
    .line([c,C],"%r1").line([c,B-1],"%r1")
    .line([c,C],[c,C+1]).line([c,C+5],[c,C+4])              // 六塵 enclosure
    .line([c,A],"%r1").line([c,C+5],"%r1")
    .line([c,B],[c,B+1]).line([c,B+5],[c,B+4])              // 六識 enclosure
    .line([c,B],[e-5,B]).line([c,B+5],[e-5,B+5])
    .line([d+2,A  ],[e-1,B  ]).line([d+2,C  ],[e-1,B  ])    // 六根、六塵 -> 六識
    .line([d+2,A+1],[e-1,B+1]).line([d+2,C+1],[e-1,B+1])
    .line([d+2,A+2],[e-1,B+2]).line([d+2,C+2],[e-1,B+2])
    .line([d+2,A+3],[e-1,B+3]).line([d+2,C+3],[e-1,B+3])
    .line([d+2,A+4],[e-1,B+4]).line([d+2,C+4],[e-1,B+4])
    .line([d+2,A+5],[e-1,B+5]).line([d+2,C+5],[e-1,B+5])
  }

  十八界十二處();
  五俱意識();
  了別作用();
  獨頭意識();
});

createGP('二十八天').setLayout(`
（近）〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇（非天諸趣）
〇〇〇〇〇〇〇〇四王天〇〇〇〇〇〇〇〇〇地居天
〇〇〇〇欲〇〇〇忉利天
〇〇〇〇界〇〇〇夜摩天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五趣雜居地 
〇〇〇〇天〇〇〇兜率天
〇〇〇〇〇〇〇〇化樂天〇〇〇〇〇〇〇〇〇空居天
〇〇〇〇〇〇〇〇他化自在天
〇〇〇〇〇〇〇〇〇〇〇〇〇梵眾天
〇〇〇〇〇〇〇〇初禪〇〇〇梵輔天〇〇〇〇〇〇〇〇〇〇〇〇禪離生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇大梵天
〇〇〇〇〇〇〇〇〇〇〇〇〇少光天
〇〇〇〇〇〇〇〇二禪〇〇〇無量光〇〇〇〇〇〇〇〇〇〇〇〇禪定生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇光音天
二〇〇〇色〇〇〇〇〇〇〇〇少淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇九
十〇〇〇界〇〇〇三禪〇〇〇無量淨〇〇〇〇〇〇〇〇〇〇〇〇禪離喜妙樂地
八〇〇〇天〇〇〇〇〇〇〇〇遍淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇地
天〇〇〇〇〇〇〇〇〇〇〇〇無雲天
〇〇〇〇〇〇〇〇〇〇〇〇〇福生天
〇〇〇〇〇〇〇〇〇〇〇〇〇廣果天
〇〇〇〇〇〇〇〇〇〇〇〇〇無想天
〇〇〇〇〇〇〇〇四禪〇〇〇無煩天〇〇〇〇〇〇〇〇〇〇〇〇禪捨念清淨地
〇〇〇〇〇〇〇〇〇〇〇〇〇無熱天〇〇〇〇五
〇〇〇〇〇〇〇〇〇〇〇〇〇善見天〇〇〇〇淨
〇〇〇〇〇〇〇〇〇〇〇〇〇善現天〇〇〇〇居
〇〇〇〇〇〇〇〇〇〇〇〇〇色究竟天〇〇〇天
〇〇〇〇無〇〇〇空無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇空無邊處地
〇〇〇〇色〇〇〇識無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識無邊處地
〇〇〇〇界〇〇〇無所有處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無所有處地
（遠）〇天〇〇〇非想非非想處天〇〇〇〇〇〇〇〇〇〇〇〇〇非想非非想處地`)
  .shiftPoint(5, [3,4,5], 0, 0.5)
  .shiftPoint(1, [14,'-',17], 0, -0.5)
  .shiftPoint([3,6], 4, 0, 0.5)
  .shiftPoint([3,6], 27, 0, 0.5)
  .shiftPoint(1,[4,27],0,0.5).shiftPoint(1,[13,18],0,-0.5) // 二十八天
  .line([1,4],  "%r2").line([1,27], "%r2")
  .line([1,4],[1,13]).line([1,18],[1,27])
  .line([7,2],  "%r1")  //   欲界天 fanout
  .line([7,3],  "%r1")
  .line([7,4],  "%r1")
  .line([6,4],  "%r1")
  .line([7,5],  "%r1")
  .line([7,6],  "%r1")
  .line([7,7],  "%r1")
  .line([7,2],  "%d5")
  .shiftPoint(21, 2, 0, 0.5) //  地居天 fanin
  .shiftPoint(19, 5, 0, -2.5)
  .line([18,2], "%r1")
  .line([18,3], "%r1")
  .line([19,2], "%d1")
  .line([19,5], "%r1")
  .line([18,4], "%r1")       //   天居天
  .line([19,4], "%d8")
  .line([19,6], "%r1")
  .line([7,9],  "%r1")  //   色界天 fanout
  .line([7,12], "%r1")
  .line([6,15], "%r2")
  .line([7,21], "%r1")
  .line([7,9],  "%d12")
  .line([12,8], "%r1")  //     初禪 fanout
  .line([11,9], "%r2")
  .line([12,10], "%r1")
  .line([12,8], "%d2")
  .line([12,11], "%r1") //     二禪 fanout
  .line([11,12], "%r2")
  .line([12,13], "%r1")
  .line([12,11], "%d2")
  .line([12,14], "%r1") //     三禪 fanout
  .line([11,15], "%r2")
  .line([12,16], "%r1")
  .line([12,14], "%d2")
  .line([12,17], "%r1") //     四禪 fanout
  .line([12,18], "%r1")
  .line([12,19], "%r1")
  .line([12,20], "%r1")
  .line([11,21], "%r2")
  .line([12,22], "%r1")
  .line([12,23], "%r1")
  .line([12,24], "%r1")
  .line([12,25], "%r1")
  .line([12,17], "%d8")
  .line([7,26],  "%r1") //   無色界天 fanout
  .line([7,27],  "%r1")
  .line([7,28],  "%r1")
  .line([7,29],  "%r1")
  .line([7,26],  "%d3")
  .line([6,27],  "%r1")
  .shiftPoint(21, [22,'-',25], 0, -0.5) // 五淨居天 fanin
  .line([18,21], "%r1")
  .line([18,25], "%r1")
  .line([19,21], "%d4")
  .line([19,23], "%r1")
  .line([27,1], "%l2").line([27,7], "%l2").line([27,1],[27,7]).line([27,4],"%r1")      // 五趣雜居地
  .line([27,8], "%l2").line([27,10], "%l2").line([27,8],[27,10]).line([27,9],"%r1")    // 禪離生喜樂地
  .line([27,11], "%l2").line([27,13], "%l2").line([27,11],[27,13]).line([27,12],"%r1") // 禪定生喜樂地
  .line([27,14], "%l2").line([27,16], "%l2").line([27,14],[27,16]).line([27,15],"%r1") // 禪離喜妙樂地
  .line([27,17], "%l2").line([27,25], "%l2").line([27,17],[27,25]).line([27,21],"%r1") // 禪捨念清淨地
  .line([25,26], "%r3") // 空無邊處地
  .line([25,27], "%r3") // 識無邊處地
  .line([25,28], "%r3") // 無所有處地
  .line([25,29], "%r3") // 非想非非想處地
  .line([38,4],"%l2").line([38,29],"%l2").line([38,4],[38,13]).line([38,17],[38,29])   // 九地
;

createGP('十二因緣').setLayout(`
〇〇〇〇〇〇〇過去二因〇〇〇１〇〇無明〇（貪瞋痴等煩惱）〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇２〇〇行〇〇（造作諸業）〇〇〇〇〇〇〇業 ▾
〇〇〇〇〇〇〇〇〇〇〇〇〇〇３〇〇識〇〇（業識投胎）〇〇〇〇〇〇〇苦 ✗◂
十二因緣〇〇〇〇〇〇〇〇〇〇４〇〇名色〇（但有胎形六根未具）〇〇〇苦 ✗◂
〇〇〇〇〇〇〇現在五果〇〇〇５〇〇六入〇（長成眼等六根人形）〇〇〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇６〇〇觸〇〇（出胎與外境接觸）〇〇〇〇苦 ✗◂
三世因果〇〇〇〇〇〇〇〇〇〇７〇〇受〇〇（與外境接觸生苦樂感受）〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇８〇〇愛〇〇（對境生愛欲）〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇現在三因〇〇〇９〇〇取〇〇（追求造作）〇〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１０〇有〇〇（成業因能招未來果報）〇〇業 ▾
〇〇〇〇〇〇〇未來二果〇〇〇１１〇生〇〇（再受未來五蘊身）〇〇〇〇苦 ▸✗
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１２〇老死〇（未來之身又漸老而死）〇〇苦 ▸✗`)
  .line([6,1],[6,11])
  .shiftPoint([6,8,12],1,0,0.5).shiftPoint([6,8,12],11,0,0.5)
  .line([6,1],"%r1").line([6,5],"%r1").line([6,9],"%r1").line([6,11],"%r1") // left
  .line([5,4],"%r1").line([5,7],"%r1")
  .line([13,1],"%r1").line([13,1],[13,2]).line([13,2],"%r1")     // 過去二因
  .line([12,1],"%r1")
  .line([13,3],"%r1").line([13,7],"%r1")                         // 現在五果
  .line([13,3],[13,7]).line([12,5],"%r1")
  .line([13,8],"%r1").line([13,10],"%r1")                        // 現在五果
  .line([13,8],[13,10]).line([12,9],"%r1")
  .line([13,3],[13,7]).line([12,5],"%r1")
  .line([13,11],"%r1").line([13,11],[13,12]).line([13,12],"%r1") // 未來二果
  .line([12,11],"%r1")
;

createGP('五位百法') // compare: 七十五法
.setLayout(`
〇〇心王法：〇〇〇眼識、耳識、鼻識、舌識、身識、意識、末那識、阿賴耶識〇〇〇〇〇〇〇〇〇八
〇〇〇〇遍行：〇〇觸、作意、受、想、思〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五
〇〇〇〇別境：〇〇欲、勝解、念、定、慧〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五〇五
〇〇心〇善：〇〇〇信、精進、慚、愧、無貪、無瞋、無癡、輕安、不放逸、行捨、不害〇〇〇〇十一〇十
〇〇所〇根本煩惱：貪、瞋、癡、慢、疑、惡見〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇六〇一
宇〇法〇隨煩惱：〇小十：忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，中二：無慚、無愧，〇〇〇〇〇心〇百
宙〇〇〇〇〇〇〇〇大八：不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂〇〇〇〇〇〇〇〇廿〇所
萬〇〇〇不定：〇〇睡眠、惡作、尋、伺〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四〇〇〇法
有〇色法：〇〇〇〇眼、耳、鼻、舌、身、色、聲、香、味、觸、法處所攝色〇〇〇〇〇〇〇〇〇十一
〇〇不相應法〇〇〇得、命根、眾同分、異生性、無想定、滅盡定、無想報、
〇〇〇行法：〇〇〇名身、句身、文身、生、住、老、無常、流轉、定異、〇〇〇〇〇〇〇〇〇〇廿四
〇〇〇〇〇〇〇〇〇相應、勢速、次第、時、方、數、和合性、不和合性
〇〇無為法：〇〇〇虛空無為、擇滅無為、非擇滅無為、不動滅無為、想受滅無為、真如無為〇〇〇六`)
  .setStyle('.ail { font-size:12px; opacity:0.5 }')
  .shiftPoint(1,[5,'-',10],0,-0.5)                // 宇宙萬有
  .line([1,1],"%r1").line([1,1],[1,5])
  .line([1,13],"%r1").line([1,13],[1,10])
  .line([3,2],"%r1").line([3,2],"%d1")            // 心所法
  .line([3,8],"%r1").line([3,8],"%u1")
  .shiftPoint(3,10,0,0.5).shiftPoint(4,11,0,0.5)  // 不相應法行法
  .shiftPoint(9,10,0,-0.25)
  .line([9,10],"%d2.5", 'stroke-dasharray="5 2" stroke-opacity="0.5" stroke="black"')
  .line([49,1],"%l3").line([49,1],[49,5])         // 百法
  .line([49,13],"%l3").line([49,13],[49,9])
  .line([47,2],"%l1").line([47,2],"%d0.3")        // 五十一心所
  .line([47,8],"%l1").line([47,8],"%d-0.3")
  .line([36,1],[43,1])                            // counts
  .line([20,2],[43,2])
  .line([20,3],[43,3])
  .line([40,4],[43,4])
  .line([22,5],[43,5])
  .line([19,8],[43,8])
  .line([36,9],[43,9])
  .shiftPoint([45,35],7,0,-0.5) // 廿
  .shiftPoint(41,7,0,-0.5).line([41,7],"%r2")
  .shiftPoint(41,6,0,-0.25).shiftPoint(41,8,0,-0.75).line([41,6],[41,8])
  .shiftPoint(36,10,0,-0.25).shiftPoint(36,12,0,0.25)  // 廿四
  .line([36,10],[36,12])
  .line([36,11],[43,11])
  .line([42,13],[43,13])        // 六
  .setText(10, 6, '<tspan class="ail">小十：</tspan>忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，<tspan class="ail">中二：</tspan>無慚、無愧，')
  .setText(10, 7, '<tspan class="ail">大八：</tspan>不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂');
;
