BKZYJ.volTitle = '不空羂索神變真言經'; // matters not
BKZYJ.volNum = 0;
BKZYJ.text = nVolsTOC(`
 1 : 1:1#母陀羅尼真言序品
 2 : 2:祕密心真言品
   : 3:祕密成就真言品:一
 3 :  :祕密成就真言品:二
   : 4:祕密印三昧耶品:一
 4 :  :祕密印三昧耶品:二
   : 5:法界密印莊嚴品
 5 : 6:罥索成就品:一
 6 :  :罥索成就品:二
 7 : 7:護摩增益品
   : 8:祕密灌頂品
 8 : 9:三三昧耶像品
   :10:護摩安隱品
   :11:清淨無垢蓮華王品
 9 :12:廣大解脫曼拏羅品
   :13:最勝明王真言品
10 :14:奮怒王品
11 :15:悉地王真言品
12 :16:12#廣博摩尼香王品
   :17:12,p17#金剛摩尼藥品
   :18:12,p18#如意摩尼瓶品
   :19:12,p19#如來加持品
13 :20:溥遍心印真言出世間品
   :21:溥遍心印真言世間品
14 :22:不思議觀陀羅尼真言品
   :23:陀羅尼真言辯解脫品
15 :24:最上神變解脫壇品
   :25:光焰真言品
   :26:出世解脫壇像品
   :27:一切菩薩敬禮解脫三昧耶真言品:一
16 :  :一切菩薩敬禮解脫三昧耶真言品:二
   :28:出世解脫壇印品
   :29:出世相應解脫品
17 :30:根本蓮華頂陀羅尼真言品
18 :31:十地真言品
   :32:世間成就品
   :33:蓮華頂阿伽陀藥品
19 :34:護摩成就品
   :35:根本蓮華壇品
   :36:根本蓮華頂像品
   :37:神變密印品
   :38:神變真言品
   :39:多羅菩薩護持品
   :40:大眾護持品
===
20 :41:溥遍解脫陀羅尼真言品
   :42:溥遍解脫心曼拏羅品
   :43:溥遍輪轉輪王阿伽陀藥品
   :44:溥遍輪轉輪王神通香品
21 :45:如意阿伽陀藥品
   :46:無垢光神通解脫壇三昧耶像品:一
22 :  :無垢光神通解脫壇三昧耶像品:二
   :47:大奮怒王品
   :48:一切種族壇印品:一
23 :  :一切種族壇印品:二
   :49:大奮怒王字輪壇真言三昧耶品
   :50:大奮怒王真言護持品
24 :51:執金剛祕密主問疑品
   :52:廣大明王央俱捨真言品
25 :53:廣大明王摩尼曼拏羅品
   :54:廣大明王三三昧耶品
   :55:廣大明王阿伽陀藥品
   :56:廣大明王央俱捨索曼拏羅品
   :57:廣大明王圖像品
26 :58:大可畏明王品
   :59:然頂香王成就品
27 :60:點藥成就品
   :61:護摩祕密成就品
   :62:斫芻眼藥成就品
   :63:神變阿伽陀藥品
   :64:召請諸天密護品
   :65:大可畏明王像品
   :66:大可畏明王壇品
28 :67:清淨蓮華明王品
   :68:灌頂真言成就品
29 :69:灌頂曼拏羅品
   :70:不空摩尼供養真言品
   :71:祈雨法品
   :72:清淨蓮華明王成就品
   :73:功德成就品
30 :74:供養承事品
   :75:明王曼拏羅像品
   :76:畝捺羅印品
   :77:密儀真言品
   :78:囑累品`, 50);

// src: https://cbetaonline.dila.edu.tw/zh/T1092
