// pronunciation: de https://www.daodejing.org
// 憨山大師註
// 純陽呂仙衍義本


var src = `
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§1 道非常道

1 道可道 非常道
2 名可名 非常名
3 無名天地之始
4 有名萬物之母
5 故|常無欲以觀其妙
6 常有欲以觀其徼[jiào]
7 此兩者|同出而異名|同謂之玄
8 玄之又玄 衆妙之門

L1  =道者。無極之理也。可道者。言人受天地之中以生。皆可得聞斯道也。常，中和也。常道者。卽四端五常。
    =合於中正之道也。
    :此二句。乃全篇之首領。言此經之所以言道者。乃一炁渾然之理。非四端五常之道也。
L2  =名，道之名也。玄元未判。道本無名。可名者。言可強為之名也。非常名者。言其無極之象。非尋常之言。
    =可以道其極也。
L3  =無名。卽無極之時。道猶未立名也。有無極。始生太極。太極生兩儀。兩儀生而天地位焉。故無名者。乃
    =天地之始祖也。
L4  =有名。言天地已分。而道之名立也。道旣成名。遂發為陰陽五行。以生萬物。所以有道之名。卽為萬物之母也。
L5  =無欲。言道之至靜。無一毫私欲也。妙，玄妙也。此言欲觀道之玄妙。常於二氣之靜。而無欲可得而見之也。
L6  =有欲。道之動也。徼，發洩之處也。蓋靜極必動。動必有所注意。故曰有欲。能知道之動。則可以觀道之發洩處也。
L7  =此兩者。指有欲無欲而言。同出。言動之與靜。皆道所出也。異名。言靜之與動也。各成其名也。同謂之玄者。
    =言末復合為一理。而同歸於道之玄妙也。
L8  =玄，遠也。言道之包羅天地。而超越三界。至遠難察。惟天玄之色。足以存其象。故曰玄。玄之又玄。言修道者。
    =得其深復見其深。進其遠復見其遠。得其妙復見其妙。不能窮其極也。衆妙之門者。言萬事之精微奧妙。
    =皆出於道之門也。
    +蓋世有三教之分。儒者誠意正心。窮理盡性。道家運神煉氣。養性修真。釋氏參禪學法。明心見性。教雖殊。
    +而其道則一也。推極其妙。以至於成聖成真。成仙成佛。皆由道門而出。故曰玄玄之道。欲得其妙者。無不入是門也。

H1  +此章總言道之體用，及入道工夫也。老氏之學，盡在於此。其五千餘言，所敷演者，唯演此一章而已。
    =所言道，乃真常之道。可道之道，猶言也。意謂真常之道，本無相無名，不可言說。凡可言者，則非真常
    =之道矣，故非常道。
H2  =且道本無名，今旣強名曰道，是則凡可名者，皆假名耳，故非常名。
    :此二句，言道之體也。
H3  =然無相無名之道，其體至虛，天地皆從此中變化而出，故為天地之始。
H4  =斯則無相無名之道體，全成有相有名之天地，而萬物盡從天地陰陽造化而生成。
    =此所謂一生二，二生三，三生萬物，故為萬物之母。
H5  :此二句，言道之用也。此下二句，乃入道之工夫。
    =常，猶尋常也。欲，猶要也。老子謂，我尋常日用安心於無，要以觀其道之妙處。
H6  =我尋常日用安心於有，要以觀其道之徼處。徼，猶邊際也。意謂全虛無之道體，旣全成了有名之萬物。
    :是則物物皆道之全體所在，正謂一物一太極。是則只在日用目前，事事物物上，就要見道之實際，所遇無
    :往而非道之所在。故莊子曰，道在稊稗，道在屎尿。如此深觀，纔見道之妙處。此二觀字最要緊。
H7  =此兩者同已下，乃釋疑顯妙。
    :老子因上說觀無觀有，恐學人把有無二字看做兩邊，故釋之曰，此兩者同。意謂我觀無，不是單單觀無。
    :以觀虛無體中，而含有造化生物之妙。我觀有，不是單單觀有。以觀萬物象上，而全是虛無妙道之理。是
    :則有無並觀，同是一體，故曰，此兩者同。有不能生有，必因無以生有。無不自無，因有以顯無。此乃有
    :無相生，故二名不一，故曰，出而異名。恐人又疑兩者旣同，如何又立有無之名，故釋之曰，出而異名。
    :意謂虛無道體，旣生出有形天地萬物。而至此恐人又疑旣是有無對待，則不成一體，如何謂之妙道，故釋之曰，
    :同謂之玄。斯則天地同根，萬物一體。深觀至此，豈不妙哉。
H8  =老子又恐學人工夫到此，不能滌除玄覽，故又遣之曰，玄之又玄。意謂雖是有無同觀，若不忘心忘跡，雖妙不妙。
    =殊不知大道體中，不但絕有無之名，抑且離玄妙之跡，故曰，玄之又玄。工夫到此，忘懷泯物，
    =無往而不妙，故曰，衆妙之門。斯乃造道之極也。
    +似此一段工夫，豈可以區區文字者也之乎而盡之哉。此愚所謂須是靜工純熟，方見此中之妙耳。

X1  = 斯物必存，然人所不及。是以非常道矣。若常，人可矣。
X2  = 可名者，唯人所能。可名則可道，不也。名者，分別妄想者也。
X3  = 無名，寂真之時，天地萬物不存。始者，未存也。
X4  = 有名，天地萬物生焉。然物惟名矣，實無物邪。是以物者，幻也。
X5  = 相由心生。無慾則見相非相，可見如來也。
X6  = 慾則見相，根可觀之。然相終不離道，故觀相以見道。如波在水。
X7  = 兩者者，法相耳。有無兩邊不住，故同出也。斯事甚玄，非乎。
X8  = 离四句，绝百非，迺玄而又玄。斯為衆妙之門。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§2 功成弗居

1 天下皆知|美之為美 斯惡[è]已
2 皆知|善之為善 斯不善已
3 故|有無相生
4 難易相成
5 長短相形
6 高下相傾
7 音聲相和[hè]
8 前後相隨
9 是以聖人|處無為之事|行不言之教
10 萬物|作焉而不辭 生而不有|為而不恃 功成而不居
11 夫[fú]惟不居是以不去

L1  =美，好也。惡，不美也。言天下之人。性本相同。好惡相通。若有一美好之事。則衆皆知其為美好也。設
    =有一惡以相形。則皆知此為惡事也。
L2  =善，卽道之所發於行事之間者也。言有一善行。則人皆知其為善。設有一不善者以相形。亦知斯為不善也。
    =此言人性皆善之意。
L3  =虛無成萬有。萬有復虛無。此有無相生之意也。
    :如天地初分。萬物皆無。而虛無之氣。發生萬物。是無中生有也。有萬物之生。必有萬物之死。死則復歸於無。
    :是有中生無也。
L4  =難易。指事而言。
    :事有遠近大小之殊。故有難易之分。知其易。可進於難。為其難。便知其易。
    =故曰相成也。言修道者高遠難成。而由其易以圖之。則難者亦不見其難。而道可成也。
L5  =長短。兼人物而言。
    :蓋天地生物。萬類悉備。而受氣成形。各有長短之分。無長不能形其短。無短不足見其長。
    =是以長短相形也。
L6  =天地旣分。而高下乃定。
    :傾，傾心以相從也。蓋道之分天地。定山川。皆以誘衆生於道。故易曰。天尊地卑。君臣定也。然高下皆
    :歸於一體。居高者必能服下。處下者必能事高。高下相從。而道乃得也。
L7  =音，五音也。
    :天有陰陽氣候。而人莫能測之。故顓頊氏探陰陽之氣候。聽天地之靈音。乃截竹為筒。陰陽各六。共有五音。
    :宮商角徵羽。而音乃出也。聲，人口所出也。律有五音。而聲亦有五。曰。喜聲。怒聲。哀聲。清聲。濁聲。
    :與五音相為表裏。出於聲者。卽現於音律之間。
    =故音聲相和也。
L8  =有引之於前者。必有隨之於後。如道成於前。而人行於後也。
    :語云。前車之覆。後車之鑒。其意本此。
L9  =聖人，卽開道之基者也。無事，謂上古之世。無奪無爭。而相安於無事也。不言之教。謂取法於天以教民。
    =不待言而民自治也。蓋天本無言。四時行而萬物化生。聖人知有無難易。長短高下。音聲前後。身修道以
    =齊之。亦無言而教化遂成。是以謂之不言之教也。
L10 =作，始制也。言天地始制萬物。雖賦以道。而道無形。聖人參伍以變。錯綜其數。而制為規矩法度。不敢
    =辭其勞苦也。
    =生而不有者。謂聖人曲成而不遺。使萬物各遂其生。而不以為己德也。
    =為，卽道之發輝。聖之作為也。恃，自恃也。言聖人體道而為。為之亦若無為。不自恃其能也。
    =功成，謂所作之事成。四海咸沾其功德也。而弗居者。謂聖人不自居其功。而推之於天也。
L11 =惟，獨也。言世之人。多自居功。而功每去而不立。惟聖人能謙遜以自處。不自居其功。而功竟歸於聖人。
    =萬世不能去也。
 
H1  +此釋前章可名非常名，以明世人居有為之跡，虛名不足尚。聖人處無為之道以御世，功不朽而真名常存之意也。
    =意謂天下事物之理，若以大道而觀，本無美與不美，善與不善之跡。
    :良由人不知道，而起分別取捨好尚之心，故有美惡之名耳。然天下之人，但知適己意者為美。殊不知在我以為美，
    :自彼觀之，則又為不美矣。譬如西施顰美，東施愛而效之，其醜益甚。此所謂知美之為美，斯惡已。惡，醜也。
H2  :又如比干，天下皆知為賢善也，紂執而殺之。後世效之以為忠，殺身而不悔。
    =此所謂知善之為善，斯不善已。
    :此皆尚名之過也。是則善惡之名，因對待而有。
H3  =故名則有無相生，
H4  =事則難易相成，
H5  =物則長短相形，
H6  =位則高下相傾，
H7  =言則音聲相和，
H8  =行則前後相隨，此乃必然之勢。
    :譬如世人以尺為長，以寸為短。假若積寸多於尺，則又名寸為長，而尺為短矣。凡物皆然，斯皆有為之跡耳。
    :凡可名者，皆可去。此所謂名可名，非常名也。
H9  =是以聖人知虛名之不足尚，故處無為之道以應事。知多言之不可用，故行不言之教以化民。
H10 =如天地以無心而生物，卽萬物皆往資焉，不以物多而故辭。雖生成萬物，而不以萬物為己有。雖能生物，
    =而不自恃其能。
H11 =且四時推移，雖有成物之功，功成而不居。夫惟不居其功，故至功不朽。不尚其名，故真名常存。
    :聖人處無為之道，亦由是也。蓋萬物作焉已下，皆是說天地之德，以比聖人之德。文意雙關，莊子釋此意極多。

X1  = 美，第一念也。為美，第二念也，謬也，故惡也。
X2  = 此論善，同上理，然其用更甚。
X3  = 有無相生者，萬般本皆無。然此隨上二句，何也？蓋次念隨首念生，首念自滅。又，真實與分別。
    = 餘文證之以例。
X4  = 難易相成者，如江湖一字訣，點破無玄機。能則易，不能則難。無易不難，無難不易。
X5  = 長短者，人之覺，分別之心。京滬甚遠，高鐵近之。兩國相望，國界遠之。
X6  = 高下者，未定也。君高臣下，然操挾君而令。世人有書曰管理上級，是也。傾者，爭也。
X7  = 音者，鼻出。聲者，口出，謂言。言外之音，言外有言。是以音聲相和，分則謬也。
X8  = 何為前後？何為東西？皆自分別也。
X9  = 聖人為無為而物自正，教不言而學自臻。尊者，示也。師者，導也。
X10 = 萬物之德，作而不辭如苗出土，生而不有如草獸，為而不恃如大樹，功成不居如果實花謝。
X11 = 不居是以不去者，本皆自然，何欲所居？旣無所居，安有所去？

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§3 不見可欲

1 不尚賢 使民不爭
2 不貴難得之貨|使民不為盜
3 不見[xiàn]可欲|使心不亂
4 是以聖人之治|虛其心實其腹|弱其志強其骨
5 常使民無知無欲|使夫[fú]知者不敢為也
6 為無為則無不治

L1  =不尚賢。謂不徒尚夫賢也。聖人在位。化天下皆為賢士。務使一道同風。故民無爭奪之患也。
L2  =不貴難得之貨。使民不為盜。難得之貨。異土所產之寶。故難得也。凡為上者。若以貨之難得。而貴其價以求之。
    =則民必爭取其利。貧者遂起盜賊之心也。聖人則不以為寶。而反賤之。是以民無所好。而各安其本業。故不為盜也。
L3  =可欲。謂心有所愛慕而思戀之也。凡外誘之私。皆由外而入內。若能見可欲而無欲。則私欲已去。無所擾亂於中心也。
L4  =虛，空也。心，一身之主也。言聖人之治世。心有所主。而洞徹無外。凡萬物之足以動其心者。皆能置之
    =度外。視為虛假。與人相接之際。復能虛心以待人也。
    =實，充滿也。腹所以藏心也。言聖人之心雖空。而道德仁義。皆充滿於腹中也。
    =志，心之所發也。弱，常若不足之意。言小心翼翼。不肆志而為矜驕滿假之弊也。
    =骨者，人所秉於天之度數以生。天有三百六十五度。骨有三百六十五節。因此而成其身也。疆，非悻悻之疆。
    =言疆健不息也。人之力皆本乎骨。疆其骨者。卽勉力之謂也。
L5  =無知，如詩云不識不知。順帝之則之謂也。無欲，謂民皆知自檢其心。不為私欲所蔽也。此言聖人之常。
    =以使民者如此。
    =知者。言民之智巧。靡所不知。而失於中道者也。不敢為者。言聖人以道齊之。使知者亦歸於醇厚。而不
    =敢為非分越理之事也。
L6  =為，作為朝政之事也。無為者。言作為主乎靜。故為之而亦若無為也。如聖人德輶如毛。君子德化如風未聞聲臭。
    =而風徽自至。天下自平。故曰為無為。則無不治也。

H1  +此言世人競有為之跡，尚名好利嗜欲之害，教君人者治之之方。以釋上章處無為之事，行不言之教之實效也。
    =蓋尚賢，好名也。名，爭之端也。故曰爭名於朝。若上不好名，則民自然不爭。
H2  =貴難得之貨，好利也。利，盜之招也。若上不好利，則民自然不為盜。
    :故曰苟子之不欲，雖賞之不竊。所以好名好利者，因見名利之可欲也，故動亂其心以爭競之。
H3  =若在上者苟不見名利有可欲，則民亦各安其志，而心不亂矣。故曰不見可欲，使心不亂。
    :然利，假物也。人以隋珠為重寶，以之投雀，則飛而去之。色，妖態也。人以西施為美色，麋鹿則見而驟
    :之。名，虛聲也。人以崇高為貴名，許由則避而遠之。食，爽味也。人以太牢為珍羞，海鳥則觴而悲之。
    :是則財色名食，本無可欲。而人欲之者，蓋由人心妄想思慮之過也。
H4  =是以聖人之治，教人先斷妄想思慮之心，此則拔本塞源，故曰虛其心。然後使民安飽自足，心無外慕，故
    =曰實其腹。然而人心剛強好爭者，蓋因外物誘之，而起奔競之志也。故小人雞鳴而起，孳孳為利，君子雞鳴而起，
    =孳孳為名，此強志也。然民旣安飽自足，而在上者則以清淨自正。不可以聲色貨利外誘民心，則民自絕貪求，
    =不起奔競之志，其志自弱，故曰弱其志。民旣無求，則使之以鑿井而飲，耕田而食，自食其力，故曰強其骨。
H5  =如此則常使民不識不知，而全不知聲色貨利之可欲，而自然無欲矣。故曰常使民無知無欲。縱然間有一二
    =黠滑之徒，雖知功利之可欲，亦不敢有妄為攘奪之心矣，故曰使夫知者不敢為也。
    :如上所言，乃不言之教，無為之事也。人君苟能體此而行以治天下，則天下無不治者矣。
H6  =故結之曰，為無為，則無不治。
    +老子文法極古，然察其微意，蓋多述古。或述其行事，或述其文辭，似此為無為則無不治，乃述上古聖人
    +之行事者。至若是謂等語，皆引古語以證今意，或以己意而釋古語者。且其文法機軸，全在結句，是一篇
    +主意。蓋結句，卽題目也。讀者知此，則思過半矣。至其句法，有一字一句，二字一句，三字一句者極多。
    +人不知此，都連牽讀去，不但不得老子立言之妙。而亦不知文章之妙也。

X1  = 尚賢則不平，不平而起爭。
X2  = 尊貴則生貪，貪使為盜。
X3  = 見可欲，起慾念，使心亂。
X4  = 聖人之治，虛心弱志，民之福也。蓋少慾知足，近道矣。
X5  = 常使民無知無欲，使夫知者不敢為也，則國泰而民安，民之福也。
X6  = 為無為則無不治，是為至治。以人適其居，非以居適人，則人合乎於天地，安也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§4 和光同塵

1 道沖而用之或不盈
2 淵兮似萬物之宗
3 挫其銳
4 解其紛
5 和其光
6 同其塵
7 湛兮似或存
8 吾不知誰之子|象帝之先

L1  =沖，與充同。盈，滿也。或不盈者。言道充足於內。而不自滿假。卽有若無。實若虛之意也。

L2  =淵，源也。宗，本也。聖人之道。其涵容發洩。如淵泉之深廣。統萬類而歸宗其道也。
L3  =挫，折也。銳，剛強也。言太剛必折。故必去其剛強之性也。
L4  =解，開也。紛，亂也。道有萬端。若不得其緒而妄動。猶治絲而紛之也。必解釋意義。條分縷晰。而後可明也。
L5  =和，禮之用也。光，道之見於容貌者。言道旣立。則誠於中而形於外。其威儀容止之間。融融而光彩也。
L6  =同其塵者。如柳下惠袒禓裸裎於我側。亦無厭惡之心。蓋心地光明。卽同乎流俗。亦不為塵垢所污也。
L7  =湛，深也。言大道汪洋。無形無影。求則得之。如存乎其間也。
L8  =吾，老子自謂。誰之子。誰所生也。帝，上帝也。言我不知道為誰所生育。先上帝而成象也。

H1  +此讚道之體用微妙，而不可測知也。
    =沖，虛也。盈，充滿也。淵，靜深不動也。宗，猶依歸也。謂道體至虛，其實充滿天地萬物。但無形而不可見，
    =故曰用之或不盈。
H2  =道體淵深寂漠，其實能發育萬物，而為萬物所依歸。但生而不有，為而不宰，故曰似萬物之宗。或，似，皆不定之辭。
    =老子恐人將言語為實，不肯離言體道，故以此等疑辭以遣其執耳。
H3  =銳，卽剛勇精銳。謂人剛銳之志，勇銳之氣，精銳之智，此皆無物可挫。唯有道者能挫之，故曰挫其銳。
    :如子房之博浪，其剛勇可知。大索天下而不得，其精銳可知。此其無可挫之者，唯見挫於圯上老人一草履耳。
    :由子房得此而進之於漢，卒以無事取天下。吾意自莊周以下，而功名之士，得老氏之精者，唯子房一人而已。
    :以此較之，周善體而良善用，方朔得之，則流為詭矣。其他何足以知之。
H4  =紛，謂是非紛擾。卽百氏衆口之辯也。然各是其是，各非其非，此皆無人解之者。唯有道者，以不言之辯而解之。
    =所謂大辯若訥。以道本無言，而是非自泯，故曰解其紛。
H5  =和，混融也。光，智識衒耀於外。卽所謂飾智驚愚，修身明汙者，是也。唯有道者，韜光內照，光而不耀。
    =所謂衆人昭昭，我獨若昏。衆人察察，我獨悶悶。故曰和其光。
H6  =與俗混一而不分。正謂呼我以牛，以牛應之。呼我以馬，以馬應之。故曰同其塵。
H7  =然其道妙用如此，變化無方。而其體則湛然不動，雖用而無跡。故曰湛兮或存。
H8  =要妙如此，而不知其所從來。故曰吾不知誰之子。且而不是有形之物，或象帝之先耶。帝，卽天帝。象，或似也。
    =愚謂此章讚道體用之妙，且兼人而釋者。
    :蓋老子凡言道妙，全是述自己胸中受用境界。故愚亦兼人而解之。欲學者知此，可以體認做工夫。方見老子妙處。
    :宇宇皆有指歸，庶不肖虛無孟浪之談也。
 
X1  = 沖與充同。道之用，綿綿不絕，無請不拒。
X2  = 萬物有始有終。道宗萬物，萬物歸道。
X3  = 人之剛銳，唯道能挫。人不能強為。
X4  = 道本無言，而是非自泯。
X5  = 道旣立，誠於中而形於外。有道者，韜光內照，光而不耀。
X6  = 心地光明，同乎流俗。好惡心不生。亦不為塵垢所汙也。
X7  = 湛然不動，雖用而無跡。無形無影，求則得之，如存乎其間也。
X8  = 吾者，著者自謂。大智若斯，豈不知己之所出哉！實告吾知無所出焉，故當為如來。
    = 如是，必在帝之先。象者，婉語。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§5 不如守中

1 天地不仁|以萬物為芻[chú]狗
2 聖人不仁|以百姓為芻狗
3 天地之間其猶橐[tuó]籥[yuè]乎
4 虛而不屈 動而愈出
5 多言數[shuò]窮 不如守中

L1  =天地者。陰陽二氣所結成。仁，愛也。芻，草也。狗，畜也。蓋天地以好生為心。莫不有仁慈之德。不仁
    =者。設言之辭為芻狗者。言賤之如草。而殺之如狗彘耳。
L2  =聖人體天地之心以為心。其待百姓。亦以仁慈為主。言聖人若不以仁存心。亦將視百姓如草芥狗彘之類。
    =而傷踐之也。蓋萬物之生死在天地。百姓之生死在聖人。極言仁不可無之意。
L3  =橐革囊也。籥，筐箱之類。皆所以盛物也。言天覆而地載。萬類居於中。如盛於橐籥者然也。
L4  =虛，空也。屈，枉也。言天地空闊無外。包容萬類。使各得其自然。不致有屈而不伸也。動發洩也。言天
    =地有所發洩。而所出者愈多也。此二句。言人當體天地之道。虛心以自待。則不為人所屈。變動有常。則
    =愈出於玄妙之意。
L5  =言，聲之所發。心之所傳也。數，盈虧之數也。窮，盡也。中，正也。蓋躁人之辭多。言多必失。數必至
    =於窮盡而無長益。不若守正道者。言不妄發。發必中理之為善也。

H1  =此言天地之道，以無心而成物。聖人之道，以忘言而體玄也。仁，好生愛物之心。芻狗，乃縛芻為狗，以
    =用祭祀者。
H2  =且天地聖人，皆有好生愛物之仁。而今言不仁者，謂天地雖是生育萬物，不是有心要生。蓋由一氣當生，
    =不得不生。故雖生而不有。譬如芻狗，本無用之物。而祭者當用，不得不用。雖用而本非有也。故曰天地不仁，
    =以萬物為芻狗。聖人雖是愛養百姓，不是有心要愛。蓋由同體當愛，不得不愛。雖愛而無心。譬如芻狗，
    =雖虛假之物。而尸之者當重，不得不重。雖重而知終無用也。故曰聖人不仁，以百姓為芻狗。猶，似也。
H3  =橐，卽皮韝。乃鼓風鑄物之器。籥，卽管籥。乃承氣出音之器。屈，枉己從人之意。動，猶感觸也。謂橐籥二物，
    =其體至虛而有用，未嘗恃巧而好為。
H4  =故用不為伸，不用則虛以自處，置之而亦不自以為屈，故曰虛而不屈。且人不用則已。若用之，則觸動其機，
    =任其造作而不休，故曰動而愈出。然道在天地，則生生而不已。道在聖人，則旣已為人己愈有，旣已與人己愈多。
    =大道之妙如此。
H5  =惜乎談道者，不知虛無自然之妙。方且衆口之辯說，說而不休，去道轉遠，故曰多言數窮。不若忘言以體玄，
    =故曰不若守中。蓋守中，卽進道之功夫也。
 
X1  =仁者，好生愛物之心。天地若道之器，喻道也。道無仁無不仁。
    =縛芻為狗，祭祀用之，祭畢棄之。心存，萬物存；無心，萬物本不存。
X2  =聖人行道，無仁無不仁，不著於相。雖度無邊衆生，實無衆生可度。故以百姓為芻狗。
X3  =以大心觀天地，惟般若見之。
X4  =般若無知而無不知；無能而無不能。
X5  =談道言多，虧失道妙。忘言守中，修禪入定，方為正修。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§6 谷神不死

1 谷神不死 是謂玄牝[pìn]
2 玄牝之門 是謂天地根
3 綿綿若存 用之不勤

L1  =谷，空闊幽深也。神，氣也。死，滅也。言道之幽深如谷。必有神氣存乎其間。永不喪滅也。玄，青色也。
    =牝，母也。此卽陰陽二氣。陽配於天。故色玄。陰生萬物。故為母。言存而不滅之神。卽陰陽二氣是也。
L2  =玄牝之門者。言陰陽二氣之所出納也。根，本也。謂二氣之包羅。卽天地之根本也。
L3  =天地陰陽不滅。日月往來無息。故曰綿綿。若存者。如立則見其參於前也之意。用之不勤者。猶言用之不
    =息也。此言道之深微。如川流之不息能實踐功修。時刻存之於心。自然日用行習。皆合夫常經。而大化流
    =行不息也。 

H1  +此言道體常存，以釋上章虛而不屈，動而愈出之意也。
    =谷，虛而能應者。以譬道體至虛，靈妙而不可測，亙古今而長存，故曰谷神不死。
H2  =且能生天生地，萬物生生而不已，故曰是謂玄牝。牝，物之雌者。卽所謂萬物之母也。門，卽出入之樞機。
    =謂道為樞機，萬物皆出於機，入於機。故曰玄牝之門，是謂天地根。
H3  =綿，幽綿不絕之意。謂此道體至幽至微，綿綿而不絕，故曰若存。愈動而愈出，用之不竭，故曰不勤。
    =凡有心要作，謂之勤。蓋道體至虛，無心而應用，故不勤耳。

X1  =谷者，深虛也。神，存而不見。谷神不死，迺生之母。
X2  =玄者，存而不見。玄牝之門，假名矣，喻生之母，故謂天地根。
X3  =此玄牝含天地萬物，無始無終，故用之不盡。勤通盡，今華南語同音。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§7 天長地久

1 天長地久
2 天地所以長且久者|以其不自生 故能長生
3 是以聖人|後其身而身先|外其身而身存
4 非以其無私耶|故能成其私

L1  =長，遠也。久，永也。言天道高明。地道博厚。而至誠無息。悠久無疆也。
L2  =天地之悠久無疆。而不傾崩者。以其至公無私。生育萬姓。而不自利其生。是以能長生不滅也。
    =此言欲求長生者。須置此身於度外。常存濟人利物之心。積德累功。雖不自求其生。而長生之術已得也。
L3  =是以，承上而言。聖人卽體天地長久之道。而能長生者也。言古之聖人。以正心誠意為先。以修身為後。
    =時刻存誠於內。而置身於外。然道修而身反在夫先。心正而身自不滅也。
L4  =私，私欲也，凡意之在已者。卽謂之私。邪，與耶同。助語詞也。言聖人後其身。復外其身。
    =誰不以為無私欲者哉。然所為者至公無私。而身先身存。竟能遂其私願也。

H1  +此言天地以不生故長生，以比聖人忘身故身存也。意謂世人各圖一己之私，以為長久計。殊不知有我之私者，
    +皆不能長久也。
    =何物長久，唯天地長久。
H2  =然天地所以長久者，以其不自私其生，故能長生。
H3  =其次則聖人長久，是以聖人體天地之德，不私其身以先人，故人樂推而不厭。故曰後其身而身先。
    =聖人不愛身以喪道，故身死而道存。道存則千古如生，卽身存也。故曰外其身而身存。
H4  =老子言此，乃審問之曰，此豈不是聖人以無私而返成其私耶。且世人營營為一身之謀，欲作千秋之計者，
    =身死而名滅。是雖私，不能成其私，何長久之有。

X1  =人間最長久者，天地也。
X2  =天地不自生故能長生。天地生滅非人力之所及，故以天地喻道，可也。
X3  =先身爭利，後身尊道。身捨道見，得道身存。
X4  =有意栽花花不發，無心插柳柳成陰是矣。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§8 上善若水

1 上善若水
2 水善利萬物而不爭
3 處衆人之所惡[wù]|故幾於道矣
4 居善地
5 心善淵
6 與善仁
7 言善信
8 政善治
9 事善能
10 動善時
11 夫惟不爭故無尤

L1  =上善，言在上者所為之善也。若水者。言如水之和柔也。
L2  =水善，言水之合於道也。凡萬物之生。皆賴水以灌溉滋潤。而後長育。是水之利於物者甚多。
    =在人則多與物爭功也。而水乃柔而不爭。故比於上善焉。
L3  =處，居也。惡，憎恨也。幾，近也。天下萬姓之心。皆惡居於下流。而水獨居之。是必有謙厚和平之德。
    =故近於道也。
L4  =居，處也。古者居必擇鄰。孔子又曰。里仁為美。卽居善地之意也。
L5  =心，所以裁制萬物者也。故當如淵泉之不測能容萬理。斯為善也。
L6  =與，與人也。如與朋友交之類。言君子之所以待人者。必以慈惠之德為善也。
L7  =信者。言之準。言而無信。則不可以謂之言。故言之善。必合乎信也。
L8  =政，治國之事也。凡為國者。必得民心。能善治其民。乃可謂政也。
L9  =事，日用行習之事也。能，才幹也。言作事者。必才高智廣。應動合宜之為善矣。
L10 =動，言國家有事而作為也。如修城築池之類。善時者。使民以時。則民事不妨。乃可謂善也。
L11 =惟，獨也。言獨有為善者。以身為天下則。而不爭取於下。故百姓無怨尤也。

H1  +此言不爭之德，無往而不善也。
    =上，最上。謂謙虛不爭之德最為上善，譬如水也，故曰上善若水。
H2  =水之善，妙在利萬物而不爭。不爭，謂隨方就圓，無可不可，唯處於下。
H3  =然世人皆好高而惡下。唯聖人處之。故曰處衆人之惡，故幾於道。幾，近也。
    =由聖人處謙下不爭之德，故無往而不善。
H4  =居則止於至善，故曰善地。
H5  =心則淵靜深默，無往而不定，故曰善淵。
H6  =與，猶相與。謂與物相與，無往而非仁愛之心，故曰與善仁。
H7  =言無不誠，故曰善信。
H8  =為政不爭，則行其所無事，故曰善治。
H9  =為事不爭，則事無不理，故曰善能。
H10 =不爭，則用捨隨時，迫不得已而後動，故曰善時。
H11 =不爭之德如此，則無人怨，無鬼責。故曰夫惟不爭，故無尤矣。

X1  =著者最推水德。
X2  =以水惟利他而不爭。
X3  =水永處最下，隨遇常安，故幾於道矣。
X4  =居則與善於地，作善於地。
X5  =心包太虛。
X6  =相與萬物皆善仁。
X7  =水不回流，似言無不誠。
X8  =滋潤一切，無所偏袒，如政善治。
X9  =水廼生命之本，故事無不能。
X10 =春去冬來，冰水相替，動之以時，順世間故。
X11 =無念無慾，不怨不悔，不爭無尤。
    =是故幾於道矣。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§9 名遂身退

1 持而盈之不如其已
2 揣[chuǎi]而銳之不可長保
3 金玉滿堂莫之能守
4 富貴而驕自遺其咎
5 功成名遂身退|天之道（哉）

L1  =持，行道而有所得也。盈，自誇其滿也。已，止也。盈則招損。故不如止而不為也。
L2  =揣，度也。銳，剛也。言揣度於心。而剛強太甚。則實以速其死。不能長保其身家也。
L3  =金玉，黃金白玉也。滿堂，極言其多也。蓋財者。禍之基。匹夫懷璧，而猶喪命。況財多者禍彌烈。豈能守乎。
L4  =富，財多也。貴，高官也。言富貴而生驕奢。驕奢則生淫逸。淫逸則生貧賤。貧賤旣至。而迴思富貴之難得。
    =則追悔從前。已徒自執其咎也。
L5  =功，言我之有利於人。事成而人推功於我也。名，謂我所學而成其名。如揚名顯親是也。凡人幼學壯行。
    =治國之功已成。而修道之名亦立。復能急流勇退。知止則止。是得天時自然之道也。

H1  +此言知進而不知退者之害，誡人當知止可也。
    =持而盈之不如其已者，謂世人自恃有持滿之術，故貪位慕祿進進而不已。
    :老子意謂雖是能持，不若放下休歇為高，故不如其已。倘一旦禍及其身，悔之不及。卽若李斯臨刑，顧謂其子曰，
    :吾欲與若復牽黃犬，出上蔡東門逐狡兔，豈可得乎。此蓋恃善持其盈而不已者之驗也。故云知足常足，
    :終身不辱，知止常止，終身不恥，此之謂也。
H2  =揣而銳之，不可長保者。揣，揣摩。銳，精其智思。
    :如蘇張善揣摩之術者是也。謂世人以智巧自處，恃其善於揣摩，而更益其精銳之思，用智以取功名，進進
    :而不已。老子謂雖是善能揣摩，畢竟不可長保。如蘇張縱橫之術，彼此相詐，不旋踵而身死名滅，此蓋揣銳之驗也。
H3  =如此不知止足之人，貪心無厭。縱得金玉滿堂，而身死財散，故曰莫之能守。
H4  =縱然位極人臣，而驕泰以取禍，乃自遺其咎。
H5  =此蓋知進不知退者之害也。人殊不知天道惡盈而好謙。
    :獨不見四時乎，成功者退。人若功成名遂而身退，此乃得天之道也。

X1  =雖能持，盈則溢，不如止。
X2  =揣度強銳，實以速死。
X3  =貪無厭，莫能守。
X4  =富貴而驕，自遺其咎。
X5  =功成名遂而身退，應天之道。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§10 是謂玄德

1 （載）|營魄抱一能無離乎
2 專氣致柔能如嬰兒乎
3 滌除玄覽能無疵乎
4 愛民治國能無為乎
5 天門開闔[hé]能無雌乎
6 明白四達能無知[zhì]乎
7 生之畜[xù]之
8 生而不有|為而不恃|長[zhǎng]而不宰
9 是謂玄德
 
L1  =載，受也。營魄，謂二氣之經營而初生魄也。抱，持也。一，心也。人本一心。心本至純。各所抱於懷者也。
    =能無離者。言不失其心也。蓋人受二氣以成形。善性各賦。而知識未開。故守其一心。無喪失之患也。
L2  =專氣致柔。言堅守其剛強之氣。而致其柔順之心。如孟子言持其志無暴其氣是也。孾兒，稟命初生者也。
    =初生之時。善性各備。能孾兒者。卽能復其善性也。
L3  =滌，洗也。除去也。玄，天也。覽，見也。言已有過而人不知。惟天見之也。學者每以過無人知。逡巡憚改。
    =故瑕疵日積於身也。若能暗室不欺。青天自凜。而品白如玉。非無瑕玷可指哉。
L4  =愛民。謂以仁愛之心待民也。治國，謂綱常大振。而成教於國也。能無知者。言使民醇厚如愚。不知爭奪也。
L5  =天門，卽上天予人以入德之門也。開闔，動靜也。雌，陰也。天本純陽之氣。而動則主陽。靜則主陰。動
    =靜無常。陰陽之氣紊也。能無雌者。言至誠不息。則復於純陽。而陰氣自消也。
L6  =明白，心性洞澈也。四達，卽舜典所謂明四目。達四聰是也。蓋明主乎目。而聰本乎耳。目明而耳聰。則
    =心性自能洞澈也。能無知者。謂心領神會。不求知而自知也。
L7  =生之，天之發生萬物也。畜之，地之長養萬物也。
L8  =生而不有。為而不恃。與上文同。蓋恐人之生而自有其功。為而自恃其能。故重為誥誡也。長，居衆人之上也。
    =宰，主也。長而不宰。謂年齒學問。皆長於人。而不妄自尊貴。以為衆人之主宰也。玄德，卽修玄妙之道。
    =而得於心者也。
L9  =以上所言。皆玄德也。

H1  =此章教人以造道之方，必至忘知絕跡，然後方契玄妙之德也。
    =載，乘也。營，舊註為魂。楚辭云，魂識路之營營，蓋營營，猶言惺惺，擾動貌。然魂動而魄靜，人乘此
    =魂魄而有思慮妄想之心者。故動則乘魂，營營而亂想。靜則乘魄，昧昧而昏沈。是皆不能抱一也。
    :故楞嚴曰，精神魂魄，遞相離合，是也。今抱一者，謂魂魄兩載，使合而不離也。魂與魄合，則動而常靜，
    :雖惺惺而不亂想。魄與魂合，則靜而常動，雖寂寂而不昏沈。道若如此，常常抱一而不離，則動靜不異，
    :寤寐一如。老子審問學者做工夫能如此。乎者，責問之辭。
H2  =專氣致柔。專，如專城之專。謂制也。然人賴氣而有生。以妄有緣氣，於中積聚，假名為心。氣隨心行，
    =故心妄動則氣益剛。氣剛而心益動。所謂氣壹則動志。學道工夫，先制其氣不使妄動以薰心，制其心不使
    =妄動以鼓氣，心靜而氣自調柔。工夫到此，則怒出於不怒矣。如嬰兒號而不嗄也。
    :故老子審問其人之工夫能如此乎。滌除玄覽。玄覽者，謂前抱一專氣工夫，做到純熟，自得玄妙之境也。
H3  =若將此境覽在胸中，執之而不化，則返為至道之病。只須將此亦須洗滌，淨盡無餘，以至於忘心絕跡，方為造道之極。
    :老子審問能如此乎。此三句，乃入道工夫，得道之體也。老子意謂道體雖是精明，不知用上何如，若在用上無跡，
    :方為道妙。故向下審問其用。
H4  =然愛民治國，乃道之緒餘也。所謂道之真以治身，其緒餘土苴以為天下國家。故聖人有天下而不與。愛民治國，
    =可無為而治。
    :老子審問能無為乎。若不能無為，還是不能忘跡，雖妙而不妙也。
H5  =天門，指天機而言。開闔，猶言出入應用之意。雌，物之陰者。蓋陽施而陰受，乃留藏之意。蓋門有虛通出入之意。
    =而人心之虛靈，所以應事接物，莫不由此天機發動。
    :蓋常人應物，由心不虛，凡事有所留藏，故心日茆塞。莊子謂室無空虛，則婦姑勃蹊。心無天遊，則六鑿相攘。
    :此言心不虛也。然聖人用心如鏡，不將不迎，來無所粘，去無蹤跡。所謂應而不藏。此所謂天門開闔而無雌也。
    :老子審問做工夫者能如此乎。
H6  =明白四達，謂智無不燭也。然常人有智，則用智於外，衒耀見聞。聖人智包天地，而不自有其知。謂含光內照。
    =故曰明白四達而無知。
    :老子問人能如此乎。然而學道工夫做到如此，體用兩全，形神俱妙，可謂造道之極。其德至妙，可以合乎天地之德矣。
H7  =且天地之德，生之畜之。
H8  =雖生而不有，雖為而不恃，雖長而不宰，
H9  =聖人之德如此，可謂玄妙之德矣。

X1  =（載，前段末之哉。）營，舊註為魂。魂陽動而魄陰靜。
    =魂魄抱一，使合而不離也。
    =魂與魄合，則動而常靜，雖惺惺而不亂想。
    =魄與魂合，則靜而常動，雖寂寂而不昏沈。
    =則動靜不異，寤寐一如，能乎？
X2  =制心調息，氣柔如嬰兒，能乎？
X3  =滌除玄覽，不執著於懷，忘心絕跡。能乎？
X4  =愛民治國，當能無為而治矣。
X5  =天門，天機也。天機交流，應事接物，莫不因天機發動。
X6  =知，智也。心性洞澈，含光內照。明四目，達四聰。得大智慧矣。
X7  =天地生萬物，且養之。
X8  =雖生不佔，雖為不恃，雖長不宰。
X9  =是謂玄妙之德，非凡人所具。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§11 無之為用
 
1 三十輻共一轂[gǔ]|當其無 有車之用
2 埏[shān]埴[zhí]以為器|當其無 有器之用
3 鑿戶牖[yǒu]以為室|當其無 有室之用
4 故|有之以為利|無之以為用

L1  =輻，木也。轂，車也。當，作也。上古之世。陸行無車。軒轅氏作。乃斲木為輻。以三十輻之木。
    =共成一轂。而車之制始於此。故曰轂者。無車之時而作用之也。
L2  =埏埴，土器也。上古之制作利備。而邊豆樽俎。一毫未有。故以土為器而盛物。以代無器之用也。
L3  =戶，門也。牖，窗也。洪荒之世。野處穴居。民皆靡室靡家。故鑿門戶窗牖以為居處。以代無室之時用之也。
L4  =歷代聖人。仰以觀於天文俯以察於地理。無之之物。聖人制為用焉。百工旣備。世人因以為利也。

H1  +此言向世人但知有用之用，而不知無用之用也。
    =意謂人人皆知車轂有用，而不知用在轂中一竅。
H2  =人人皆知器之有用，而不知用在器中之虛。
H3  =人人皆知室之有用，而不知用在室中之空。
H4  :以此為譬，譬如天地有形也，人皆知天地有用，而不知用在虛無大道。亦似人之有形，而人皆知人有用，
    :而不知用在虛靈無相之心。是知有雖有用，而實用在無也。然無不能自用，須賴有以濟之。
    =故曰有之以為利，無之以為用。利，猶濟也。老氏之學，要卽有以觀無。若卽有以觀無，則雖有而不有。
    =是謂道妙。此其宗也。

X1  =轂之有竅，得車之用。
X2  =器虛其內，得器之用。
X3  =室空於中，得室之用。
X4  =故實之以利，虛之以用。譬如人手，雖無蹄爪翅鰭之堅銳，可作百工，握抱拿捏，妙用無窮。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§12 去慾取道

1 五色令人目盲
2 五音令人耳聾
3 五味令人口爽
4 馳騁畋[tián]獵令人心發狂
5 難得之貨令人行妨
6 是以聖人|為腹不為目|故去彼取此

L1  =五色，青紅黃白黑。五行所發之色也。盲，瞎也。謂人之眼目。視必能明。然每為五色所蔽。而目注心移。
    =視遂不能明。故曰盲也。
L2  =天有五氣。發為五音。宮商角徵羽。聖人用以彰德。愚者心中無權。而嗜聽於淫聲。聽遂不能思聰。而為
    =五音所蔽。故曰聾也。
L3  =潤下作鹹。炎上作苦。曲直作酸。從革作辛。稼穡作甘。此五味者。所以養生。然心無主。則使人悅口。
    =貪饕而蔽於口也。
L4  =馳，乘馬而奔也。騁，驅逐也。田獵，巡取禽獸也。古者春蒐夏苗。秋獮冬狩。以為民除害者也。然多令
    =人樂而忘反。畋遊無度。若顛若狂。而為蔽於心者也。
L5  =難得之貨。奇珍異寶也。妨，害也。傳曰。小人懷璧。不可以越鄉。蓋貨之難得者。人所共貪。而令人遭其害也。
L6  =為腹。實經綸於腹內也。不為目。言不以悅目者為真也。
    :蓋聖人秉聰明睿知之權。是以目不視惡色。耳不聽惡聲。口不食珍饈。心不好嬉遊。難得者不貪。凡蔽於
    :耳目口鼻身心者。皆去之而取乎中道也。

H1  +此言物欲之害，教人離欲之行也。意謂人心本自虛明，而外之聲色飲食貨利，亦本無可欲。人以為可欲而貪愛之。
    =故眼則流逸奔色，而失其正見，故盲。
H2  =耳則流逸奔聲，而失其真聞，故聾。
H3  =舌則流逸奔味，而失其真味，故爽。
H4  =心則流逸奔境，而失其正定，故發狂。
H5  =行則逐於貨利，而失其正操，故有妨。
    :所謂利令智昏，是皆以物欲喪心，貪得而無厭者也。
H6  =聖人知物欲之為害。雖居五欲之中，而修離欲之行，知量知足。
    :如偃鼠飲河，不過實腹而已。不多貪求以縱耳目之觀也。諺語有之，羅綺千箱，不過一暖，食前方丈，不
    :過一飽，其餘皆為榮觀而已。故云雖有榮觀，燕處超然，是以聖人為腹不為目。去貪欲之害，而修離欲之行，
    :故去彼取此。

X1  =眼識雜而心亂。
X2  =耳識雜而心亂。
X3  =舌識雜而心亂。
X4  =身識狂而心亂。
X5  =意識貪而心亂。
X6  =聖人修離欲之行，知量知足。物慾為大患。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§13 寵辱若驚

1 寵辱若驚|貴大患若身
2 何謂寵辱若驚
3 寵為下|得之若驚|失之若驚|是謂寵辱若驚
4 何謂貴大患若身|吾所以有大患者|為吾有身
5 及吾無身|吾有何患
6 故貴以身為天下|則可寄於天下
7 愛以身為天下|乃可託於天下

L1  =寵，為貴人所愛也。辱，居下而受凌辱也。驚，恐懼也。貴，尊於衆人之上也。大患，言憂患之深也。
    =若身，吾身也。此二句乃下文之綱領。
L2  =何謂寵辱。乃解上句之語。言寵則榮也。辱為下也。而何以謂之寵辱哉。
L3  =蓋人情之常。愛久則疎。疎則取辱也。得之，卽得人之寵也。若驚者。言得人之寵愛。惟恐我之無福。
    =而反以禍我也。失之者。失寵也。若驚者。謂失寵於人。而辱居於下。必如君子之兢兢自恃。惟恐造乎愆尤。
    =而自罹羅網也。受寵若驚之意如此。
L4  =何謂貴大患若身。乃解次句之語也。言身旣貴也。而何以大患其身哉。吾，我也。言我心之所患者。為吾有身。
    =恐顧於己而不能克己之私欲。不足以服人也。
L5  =及，至也。言我至道明德立之時。能置身於天地之外。無一毫之所蔽。則我自能為貴也。而何以有憂患哉。
L6  =貴，尊也。貴以身者。言修道於吾身。而崇高累大也。為天下者。言吾之所為。皆為天下之人也。寄，託也。
    =蓋以一人之身。至尊至重。而為天下之人。則天下莫不歸服。而無不可以寄託其身也。
L7  =愛，慈也。言修慈惠之德於身。而推及於天下之人。則行於天下無不可以託其身也。

H1  +此言名利之大害，教人重道忘身以袪累也。
    =寵辱若驚者，望外之榮曰寵。謂世人皆以寵為榮，卻不知寵乃是辱。以其若驚。驚，心不安貌。
    =貴大患若身者，崇高之位曰貴，卽君相之位。
    :謂世人皆以貴為樂，卻不知貴乃大患之若身。以身喻貴，謂身為苦本，貴為禍根，言必不可免也。
    =此二句立定。
H2  =向下徵而釋之曰，何謂寵是辱之若驚耶。
H3  =寵為下，謂寵乃下賤之事耳。譬如僻倖之人，君愛之以為寵也。雖卮酒臠肉必賜之。非此，不見其為寵。
    =及其賜也，必叩頭而噉之。將以為寵。彼無寵者，則傲然而立。以此較之，雖寵實乃辱之甚也。豈非下耶。
    =故曰寵為下。且而未得之也，患得之。旣得之也，患失之。是則競競得失於眉睫之間，其心未嘗暫自安。
    =由此觀之，何榮之有。故曰得之若驚，失之若驚。此其所以寵是辱也。
H4  =貴大患若身者，是以身之患，喻貴之患也。然身，乃衆患之本。旣有此身，則飢寒病苦，死生大患，衆苦
    =皆歸，必不可免。故曰吾所以有大患者，為吾有身。
H5  =無身，則無患矣。故曰及吾無身，吾有何患。然位，乃禍之基也。旣有此位，則是非交謫，冰炭攻心，衆毀齊至，
    =內則殘生傷性以滅身，外則致寇招尤以取禍，必不可逃。故曰吾所以有大患者，為吾有貴。無貴，則無患矣。
    =故曰貴大患若身。
    :筆乘引王子搜，非惡為君也，惡為君之患也。蓋言貴為君人之患。莊子曰，千金重利，卿相尊位也。子獨
    :不見郊祀之犧牛乎。養食之數歲，衣以文繡，以入太廟。當是之時，雖欲為狐豚，豈可得乎。斯言貴為卿
    :相者之患。老子言苟知身為大患不可免。則知貴為大患，亦不可免也。然且世人不知貴為大患，返以為榮。
    :愛身取貴，以致終身之累。皆非有道之所為也。
H6  =唯有道者，不得已而臨蒞天下，不以為己顯。雖處其位，但思道濟蒼生，不以為己榮。此則貴為天下貴，
    =非一己之貴。如此之人，乃可寄之以天下之任。
H7  =然有道者，處崇高之位，雖愛其身，不是貪位慕祿以自保。實所謂衛生存身以行道。是則愛身，乃為天下
    =愛其身，非私愛一己之身。如此之人，乃可託以天下之權。
    :若以此為君，則無為而治。以此為臣，則功大名顯。故道為天下貴也。故日貴以身為天下，則可寄於天下。
    :愛以身為天下，乃可託於天下。

X1  =寵為貴人所愛，實辱也。辱，居下而受凌辱也。驚者，心不安貌。
    =尚大患若身。
X2  =徵釋。
X3  =寵乃下賤，得之患，失之亦患。
X4  =尚大患若身者，蓋因吾有身，故有飢寒病苦，死生憂惱，衆苦皆歸，必不可免。
X5  =及吾無身，諸患俱滅。
X6  =故斯身不足以貴。倘貴之以為天下，則可寄天下於斯身，斯人。
X7  =斯身不足以愛。倘愛斯身為天下，乃可託天下於斯身，斯人。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§14 執古御今

1 視之不見名曰夷|聽之不聞名曰希|搏之不得名曰微|此三者不可致詰[jié]|故混[hùn]而為一
2 其上不皦[jiǎo] 其下不昧|繩[mǐn]繩兮不可名
3 復歸於無物 是謂為|無狀之狀 無象之象|是謂惚恍
4 迎之不見其首|隨之不見其後
5 執古之道 以御今之有|能知古始 是謂道紀

L1  =視，目視之也。夷，遠也。言視之而不見其形。故曰遠也。聽，耳聽之也。希，虛無也。言太音希聲。聽
    =之而不聞其聲。故曰虛無也。搏，以手取物也。微，隱微也。言以手取之。而一無所得。故曰隱微也。此三者。
    =指夷希微三者而言。致，極也。詰，反覆言之也。混，合也。一，道也。言三者。本陰陽之氣。其深微之處。
    =非言所能傳。混而論之。則本乎一道也。
L2  =皦，明也。昧，暗也。此言道之高深。至上者難得而明。至下者亦不至於黑暗。而明可覩也。繩繩，緜緜不絶也。
    =言如繩之垂。永遠不斷。萬世不滅。浩蕩難名也。
L3  =無物，言道之隱微。雖浩蕩難名。惟氣以鼓盪。無聲無臭是也。無狀。謂無其形狀也。無狀之狀者。言無形之中。
    =而竟有形狀存焉。謂道之難測也。象，形也。無其物而有其象。故為惚恍也。惚恍者。如仰之彌高。
    =鑽之彌堅。瞻之在前。忽焉在後也。
L4  =首，領也。迎之，謂劈面相逢也。隨，相從也。後，終也。此言忽恍之形。迎之而不見其首領。追之而不見其踪跡。
    =則道之隱微難見可知也。
L5  =執，得也。古之道。古人所行之道也。御，佐也。言得古之道。踐迹而行。則可輔我之德而成道也。以自也。
    =言自知古人之道。以得其修道之始。而道可企也。故云知古者。卽得道之綱紀也。

H1  +此言大道體虛，超乎聲色名相思議之表，聖人執此以御世也。
    =夷，無色也。故視之不可見。希，無聲也。故聽之不可聞。微，無相也。故搏之不可得。搏，取之也。此
    =三者，雖有此名，其實不可致詰。致詰，猶言思議。由其道體混融而不可分，故為一。
H2  =其上日月不足以增其明，故不皦。皦，明也，其下幽暗不能以昏其禮，故不昧。繩繩，猶綿綿不絕之意。
    =謂道體雖綿綿不絕，其實不可名言。
H3  =畢竟至虛，雖生而不有，故復歸於無物。杳冥之內，而至精存焉，故曰無狀之狀。恍惚之中，而似有物焉，
    =故曰無象之象，是謂惚恍。
    :此正楞嚴所謂罔象虛無，微細精想耳。
H4  =由其此體，前觀無始，故迎之不見其首。後觀無終，故隨之不見其後。
H5  =此乃古始之道也。上皆歷言大道之妙，下言得道之人。然聖人所以為聖人者，蓋執此妙道以御世。故曰執
    =古之道，以御今之有。吾人有能知此古始之道者，卽是道統所係也。故曰能知古始，是謂道紀。紀，綱紀。
    =謂統緒也。

X1  =此三識表六識，皆不可得者，謂道之無相。
X2  =道無相之又觀。
X3  =復然。
X4  =遍虛空盡法界，何來首尾。
X5  =斯古之道也，今能執之，卽得道紀。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§15 微妙玄通

1 古之善為士者|微妙玄通深不可識
2 夫唯不可識 故強[qiǎng]為之
3 容與兮若冬涉川
4 猶兮若畏四鄰
5 儼兮其若客
6 渙兮若冰之將釋
7 敦兮其若樸
8 曠兮其若谷
9 渾兮其若濁
10 孰能濁以靜之徐清
11 孰能安以久動之徐生
12 保此者不欲盈
13 夫唯不盈|故能蔽不新成

L1  =微者，道之隱微也。妙者，道之奧妙也。玄通者，玄遠幽深也。此言上知之人。體道於心。深之又深。
    =玄之又玄。而人莫有能識者也。
L2  =此言困勉之士。知道之微妙玄通。人不能識。而勉強為之。欲以馴至於道也。以下正言求道之篤。
L3  =言求道者一念在道。不使邪欲得而參之。故曰容與。又恐私意得而蔽之。故時加愓厲。若冬日涉川。不敢輕涉。
    =謹之至也。
L4  =猶，豫也。言有事必籌思。以決其可否。蓋惟恐事有不善而貽羞於四鄰。故必猶豫而如畏人也。
L5  =客，賓也。賓主酬酢。必有恭敬之容。而求道者。容貌戒嚴。有以肖之也。
L6  =渙，散也。若冰之將釋。言求道者。真積力久。豁然貫通。如冰之解散。而得見深潭也。
L7  =敦，厚也。其若樸者。言敦厚誠樸。不務乎虛文也。
L8  =曠，寬闊也。谷，空谷也。言大道寬闊。若空谷之能容物也。
L9  =渾者，渾然包羅也。其若濁者。謂萬殊合為一理。察者難分。儼若濁氣相淆也。
L10 =孰能，誰能也。清濁，水之善惡所由分也。蓋水之所畜。動極則濁。靜久則清也。人之秉性濁者。若能靜
    =以養之。亦可為聖為賢。與秉之清者無異也。
L11 =孰能安者。言誰人能靜以自安也。以久動者。言靜極而動也。徐生，謂純陰旣盡。一陽復初則可以幾於長
    =生也。
L12 =保此道者。謂體天道而長保之人也。盈，滿也。盈則復虧。一定之理。故欲長保其道也。不自恃其盈。惟
    =合乎其道而已。
L13 =蔽，舊也。言唯不求其盈滿。故舊之得於身心者長存。不待新為創立也。
 
H1  +此言聖人體道深玄，故形神俱妙。人能靜定虛心，則故有常存也。莊子謂嗜欲深者天機淺。蓋今世俗之人，
    +以利欲熏心。故形氣穢濁麤鄙，固執而不化。不得微妙玄通。故天機淺露，極為易見，殆非有道氣象。
    +皆是不善為士也。
    =老子因謂古之善為士者，不淺露易見。乃微妙玄通，深不可識。
H2  =夫為不可識，最難形容。特強為之形容耳。
H3  =然形容其行動也。豫若冬涉川。猶若畏四鄰。猶豫，行不進貌。冬涉川，謂不敢遽進。
H4  =畏四鄰，謂不敢妄動。此乃從容不迫之意。
H5  =其威儀也，儼若客。儼，謂肅然可觀。若客，謂謙退不敢直前。
H6  =其氣也，渙若冰將釋。莊子謂暖然似春。又云冰解凍釋。謂其氣融和，使可親愛之意。
H7  =其外貌也，敦兮其若樸。敦，敦厚。樸，無文飾也。
H8  =其中心也，曠兮其若谷。曠，空也。谷，虛也。外體敦厚樸素，而中心空虛寂定也。
H9  =其跡也，渾兮其若濁。渾，與混同。謂和光同塵也。蓋有道之士，心空無著。故行動威儀，氣象體段，胸
    =次悠然，微妙玄通之若此。
    :所謂孔德之容，惟道是從。故可觀而不可識。世俗之人，以功名利祿交錯於前，故形氣穢濁，而不可觀。
H10 =老子因而愍之曰，孰能於此濁亂之中，恬退自養，靜定持心，久久而徐清之耶。
    :蓋心水汨昏，以靜定治之，則清。所謂如澄濁水，沙土自沈，清水現前，名為初伏客塵煩惱。不能頓了，
    :故曰徐清。
H11 =人皆競進於功利之間。老子謂孰能安定自守，久久待時而後生耶。生，乃發動。謂應用也。
    =卽聖人迫不得已而後應之意。
    :筆乘謂老子文法多什韻。蓋清，生，盈，成，一韻耳。若言徐動，徐應，則不什矣。
H12 =老子嗟歎至此，乃教之以守道之方，曰，保此道者不欲盈。盈，滿也。欲盈，乃貪得無厭，不知止足之意。
    =謂世人但知汨汨於嗜欲，貪得不足。殊不知天道忌盈，滿則溢矣。所謂持而盈之，不如其已。故此教之以
    =不欲盈也。
    :後乃結示知足常足之意，曰，夫惟不盈，是以能敝不新成，故敝。物之舊者謂之敝。
H13 :凡物舊者，最持久，能奈風霜磨折。而新成者，雖一時鮮明，不久便見損壞。老子謂世人多貪好盈，雖一
    :時榮觀快意，一旦禍及，則連本有皆失之矣。
    =惟有道者，善知止足。雖無新成之名利，而在我故有現成之物，則可常常持之而不失矣。故曰能敝不新成。
    :觀子房請留辟穀之事，可謂能敝不新成者。此余所謂子房得老之用也。
 
X1  =善為士者，體道於心。故玄深不可測，微妙不可識也。微言潛行，不淺露易見。
X2  =於困勉之士，道之微妙玄通，雖求而難識，故勉強為之。
    +在凡夫分上，語言不能知，無語亦不能知；分別不能知，無分別亦不能知。
    +究竟法身妙果，唯有如如與如如智，非凡情所能測。
X3  =求道，若冬涉川，不敢遽進，輕涉。
X4  =事必籌思，以決可否，惟恐不善而違於道，不敢妄動，猶豫如畏人也。
X5  =威儀者，內心之外顯也。外儼若客，如謙退不敢直前。內心之敬畏所現也。
X6  =渙，散也。冰之將釋，雖有形而鬆軟將化。豁然貫通，無以執著者也。
X7  =敦，厚也。其外貌，敦厚誠樸，無文飾，去虛意也。
X8  =曠，闊也。谷，空也。大道空闊，若空谷之能容物。得道者，肚大量大，無分別心也。
X9  =渾者，渾然包羅也；同混，謂和光同塵也。萬殊本歸一理。察者難分。儼若濁氣相淆也。
    :凡夫之人，功名利祿障於目前，只見形氣穢濁，於真道隔而不識。
    +世尊放大光明雲，大慈悲雲，大智慧雲，大般若雲，大三昧雲，大吉祥雲，大福德雲，大功德雲，大歸依雲，
    +大讚歎雲：當各各渾兮其若濁是也。
X10 =修道者，惟於此濁亂之中，恬退自養，靜定持心，久久而徐清之。斷無頓了之可能。
    :如澄濁水，沙土自沈，清水現前，名為初伏客塵煩惱。
X11 =縱然以競進功利之求，亦當先安定自守，久待時後而生耶。生，乃發動。謂應用也。
    =卽聖人迫不得已而後應之意。
    +或言，求道並非自絕，當以用為的。故當先濁，靜，清，而後安，動，生。
    :抑或如“看山不是山，看水不是水”之後“看山還是山，看水還是水”，時過境遷矣。
X12 =欲盈，乃貪得無厭，不知止足之意。得道者，無有貪欲，蓋道本無盡，何盈之有。欲盈者，不識道之無盈也。
X13 =蔽者，故物也。故物之所以長久，固也。唯不求盈者，故而不捨，蓋無以新創也。
    :世人多貪好盈，雖一時榮觀快意，一旦禍及，則連本有皆失之矣。
    +世尊曰：“若人言：如來有所說法，即為謗佛，不能解我所說故。”
    :子曰：“述而不作，信而好古。”

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§16 知常曰明

1 致虛極|守靜篤[dǔ]|萬物並作|吾以觀其復
2 夫物蕓蕓 各歸其根
3 歸根曰靜 靜曰復命
4 復命曰常 知常曰明
5 不知常 妄作凶
6 知常容 容乃公
7 公乃王[wàng]|王[wàng]乃天|天乃道|道乃久|沒[mò]身不殆

L1  =至虛極。守靜篤。萬物並作。吾以觀其復。天，至虛至極者也。地，守靜而篤厚者也。天地相成。故萬物
    =並生也。復，循環也。此言觀夫天地萬物。而知其循環之理也。
L2  =芸芸，方長之貌。言物之所以能長者。不失其本根故也。
L3  =根，物之本。而人以心為根。根本至靜。由於培養之不力。乃因物而遷也。誠能反其本而安靜自如。則可
    =以復其秉命於天之善性也。
L4  =常，至中之道。明，明此道也。言誠能復其命所畀之善性。則可謂中正不易之常經。旣知不易之常經。則
    =日躋於高明也。
L5  =妄作，亂為也。凶，禍也。言不知常道。而亂作糊行。是逆天之理。必有奇禍也。
L6  =常道主於仁。仁者自然容物。故知常道者。自能容衆也。公，不偏也。言心能容物。而無所偏愛。
L7  =則至公而無私也。王，一國之主也。至公無私者。乃可為一國之主也。天，上天也。王者受命於天。而為
    =天下之主。可與天參也。道，太極也天乃太極所生。故天之本。在乎道也。久，悠久也。言道先天地而成。
    =卽至誠無息。不息則久是也。殆，喪也。言能體此悠久之道。則身雖沒而名不朽。萬世不滅也。

H1  +此承上章要人作靜定功夫，此示功夫之方法也。致虛極守靜篤者。
    =致，謂推致推窮之意。虛，謂外物本來不有。靜，謂心體本來不動。
    +世人不知外物本來不有，而妄以為實。故逐物牽心，其心擾擾妄動，火馳而不返。見利亡形，見得亡真，
    +故競進而不休，所以不能保此道也。今學道工夫，先要推窮目前萬物，本來不有。則一切聲色貨利，當體
    +全是虛假不實之事。如此推窮，縱有亦無。一切旣是虛假，則全不見有可欲之相。旣不見可欲，則心自然
    +不亂。而永絕貪求，心閒無事。
    =如此守靜，可謂篤矣。故致虛要極，守靜要篤也。老子旣勉人如此做工夫，恐人不信。乃自出己意曰，我
    =之工夫亦無他術，唯只是萬物並作，吾以觀其復，如此而已。並作，猶言並列於前也。然目前萬物本來不
    =有，蓋從無以生有。雖千態萬狀，並列於前，我只觀得當體全無。故曰萬物並作，吾以觀其復。復，謂心
    不妄動也。
H2  =向下又自解之曰，夫物芸芸，各歸其根。意謂目前萬物雖是暫有，畢竟歸無，故云各歸其根。根，謂根本元無也。
H3  =物旣本無，則心亦不有。是則物我兩忘，寂然不動。故曰歸根曰靜，靜曰復命。命，乃當人之自性，賴而有生者。
    =然人雖有形，而形本無形。能見無形，則不獨忘世，抑且忘身。身世兩忘，則自復矣。故云靜曰復命。
H4  =性，乃真常之道也。故云復命曰常。人能返觀內照，知此真常妙性，纔謂之明。故云知常曰明。
H5  =由人不知此性，故逐物妄生，貪欲無厭。以取戕生傷性亡身敗家之禍。故曰不知常，妄作凶。
H6  =人若知此真常之道，則天地同根，萬物一體，此心自然包含天地萬物。故曰知常容。人心苟能廣大如此，
    =則民吾同胞，物吾與也。其心廓然大公，則全不見有我之私。故曰容乃公。
H7  =此真常大道，人若得之於內，則為聖。施之於外，則為王。故曰公乃王。王乃法天行事，合乎天心。故曰
    =王乃天。天法道，合乎自然。故曰天乃道。與天地參。故曰道乃久。人得此道，則身雖死而道常存。故曰
    =沒身不殆。殆，盡也。且此真常之道，備在於我。而人不知，返乃亡身殉物，嗜欲而不返，豈不謬哉。
 
X1  :世人不知外物本來不有，而妄以為實。今學道工夫，先要推窮目前萬物，本來不有。
    :則一切聲色貨利，當體全是虛假不實之事。如此推窮，縱有亦無。一切旣是虛假，則全不見有可欲之相。
    :旣不見可欲，則心自然不亂。而永絕貪求，心閒無事。
    =如此守靜，可謂篤矣。故致虛要極，守靜要篤也。
    =恐人不信。乃自出己意曰，我之工夫亦無他術，唯只是萬物並作，吾以觀其復，如此而已。
    =然目前萬物本來不有，蓋從無以生有。雖千態萬狀，並列於前，我只觀得當體全無。
X2  =目前萬物雖是暫有，畢竟歸無，故云各歸其根。根，謂根本元無也。
X3  =物旣本無，則心亦不有。是則物我兩忘，寂然不動。
    =命，乃當人之自性，賴而有生者。然人雖有形，而形本無形。能見無形，則不獨忘世，抑且忘身。
    =身世兩忘，則自復矣。故云靜曰復命。
X4  =性，乃真常之道也。故云復命曰常。人能返觀內照，知此真常妙性，纔謂之明。故云知常曰明。
X5  =由人不知此性，故逐物妄生，貪欲無厭。以取戕生傷性亡身敗家之禍。故曰不知常，妄作凶。
X6  =人若知此真常之道，則天地同根，萬物一體，此心自然包含天地萬物。故曰知常容。
    =人心苟能廣大如此，則民吾同胞，物吾與也。其心廓然大公，則全不見有我之私。故曰容乃公。
X7  =此真常大道，人若得之於內，則為聖。施之於外，則為王。故曰公乃王。
    =王乃法天行事，合乎天心。故曰王乃天。
    =天法道，合乎自然。故曰天乃道。
    =與天地參。故曰道乃久。
    =人得此道，則身雖死而道常存。故曰沒身不殆。殆，盡也。
    :且此真常之道，備在於我。而人不知，返乃亡身殉物，嗜欲而不返，豈不謬哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§17 信而貴言

1 太上下知有之
2 其次親之譽之
3 其次畏之
4 其次侮之
5 故信不足焉有不信
6 猶兮其貴言
7 功成事遂|百姓皆曰我自然

L1  =太上者，非謂道君也。卽秉陰陽二氣之清者。高出於衆人之上。達乎上下者也。知，生而知之也。有，言有此道也。
L2  =其次，卽賢智之流。親之者。言親近此道。日用行習皆不離也。譽之者。學而得之。又復贊揚斯道也。
L3  =又其次。卽中人以上之類。畏之，卽君子畏天命。畏聖人之言之意。
L4  =又言其次者。卽下愚之類。侮輕褻也。以上之字。皆指大道而言。
L5  =信，言之實也。信不足者。言毀謗之人。徒恃便佞之習。而不必有德。遂至言不顧行。行不顧言也。有不信者。
    =謂有頑梗之徒。不信此道也。
L6  =猶兮者。籌度之意。貴言者。謂籌度而言。言不輕發。發必有中。使人貴重而不輕賤也。
L7  =功，治國之功也。事，修身之事也。謂言之有信者。則治國之功已成。而修身之事已遂。百姓不以我為非。
    =而皆謂我得其自然也。

H1  +此言上古無知無識，故不言而信。其次有知有識，故欺偽日生。老子因見世道日衰，想復太古之治也。
    =太上下知有之者，謂上古洪荒之世，其民渾然無偽，與道為一，全不知有。旣而混沌日鑿，與道為二，故知有之。
    =是時雖知有，猶未離道，故知而不親。
H2  =其世再下，民去道漸疏，始有親之之意。是時雖知道之可親，但親於道，而人欲未流，尚無是非毀譽之事。
H3  =其世再下，而人欲橫流，盜賊之行日生。故有桀跖之非毀，堯舜之是譽。是時雖譽，猶且自信而不畏。
H4  =其世再下，而人欲固蔽，去道益遠，而人皆畏道之難親。
    :故孔子十五而志於學，至七十而方從心。卽顏子好學，不過三月不違仁，其餘則日月至焉。可見為道之難，
    :而人多畏難而苟安也。是時雖畏，猶知道之不敢輕侮。
H5  =其世再下，則人皆畔道而行。但以功名利祿為重，全然不信有此道矣。
    :老子言及至此，乃歎之曰，此無他，蓋由在上者自信此道不足，故在下者不信之耳。
H6  :然民旣已不信矣，而在上者，就當身體力行無為之道，以啟民信。清淨自正，杜民盜賊之心，可也。不能
    :如此，見民奸盜日作，猶且多彰法令，禁民為非。而責之以道德仁義為重，愈責愈不信矣，豈不謬哉。
    =故曰猶兮其貴言。貴，重也。此上乃歷言世道愈流愈下。此下乃想復太古無為之治。曰，斯皆有為之害也。
H7  =安得太古無為之治，不言而信，無為而成。使其百姓日出而作，日入而息，鑿井而飲，耕田而食。
    =人人功成事遂，而皆曰我自然耶。
    :蓋老氏之學，以內聖外王為主。故其言多責為君人者，不能清靜自正，啟民盜賊之心。
    :苟能體而行之，真可復太古之治。
 
X1  =謂上古洪荒之世，其民渾然無偽，與道為一，全不知有。
    =旣而混沌日鑿，與道為二，故知有之。是時雖知有，猶未離道，故知而不親。
X2  =其世再下，民去道漸疏，始有親之之意。是時雖知道之可親，但親於道，而人欲未流，尚無是非毀譽之事。
X3  =其世再下，而人欲橫流，盜賊之行日生。故有桀跖之非毀，堯舜之是譽。是時雖譽，猶且自信而不畏。
X4  =其世再下，而人欲固蔽，去道益遠，而人皆畏道之難親。
X5  =其世再下，則人皆畔道而行。但以功名利祿為重，全然不信有此道矣。
X6  =貴，重也。此上乃歷言世道愈流愈下。此下乃想復太古無為之治。曰，斯皆有為之害也。
X7  =安得太古無為之治，不言而信，無為而成。使其百姓日出而作，日入而息，鑿井而飲，耕田而食。
    =人人功成事遂，而皆曰我自然耶。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§18 仁義忠孝

1 大道廢 有仁義
2 智慧出 有大偽
3 六親不和 有孝慈
4 國家昏亂 有忠臣
 
L1  =大道，卽五帝三王相傳之道。廢者，代遠年湮。無人遵行此道也。
　  =仁者，在天為元。在人為德。卽命之所畀。慈祥惻怛之衷是也。義者，事之宜。所以裁制萬物者也。曰仁
    =與義。惟聖乃備。大道旣廢。而何有仁義哉。蓋世有大亂。則大才生。如列國紛爭。無父無君者衆。
    =天然後生仁且義之孔子是也。
L2  =智者，耳聰目明。心靈手敏之士。惠者，寬厚和平。溫恭謙遜之人。出，生於世也。偽，虛誣也。智惠者
    =出。而何以有大偽哉。蓋人類紛紛。真假難測。旣有君子之真。卽有色取行違之輩，雜乎其間也。
L3  =六親，卽父子兄弟夫婦之謂。不和者，言乖戾起於室家也。室家不和。而何以有慈孝哉。蓋不慈孝者。
    =與慈孝相形。而慈孝乃彰。如大舜父頑母囂象傲。而至誠感神。乃顯其慈孝也。
L4  =國家之興也。必有良臣。而太平之世。師師濟濟。亦莫不多吉士。但無以顯其忠。必於昏亂之世。而忠心乃見也。
    =如桀之無道。猶有龍逢。紂之不善。猶有比干。此二人者。皆於世亂君昏。而忠烈乃傳於萬古也。以上言道相傳。
    =古今不滅。卽五濁惡世亦有道存乎其間也。

H1  +此承上章言世道愈流愈下，以釋其次親之譽之之意也。
    =大道無心愛物，而物物各得其所。仁義則有心愛物，卽有親疏區別之分。故曰大道廢，有仁義。
H2  =智慧，謂聖人治天下之智巧。卽禮樂權衡斗斛法令之事。然上古不識不知，而民自樸素。及乎中古，民情日鑿。
    =而治天下者，乃以智巧設法以治之。殊不知智巧一出，而民則因法作奸。故曰智慧出，有大偽。
H3  =上古雖無孝慈之名，而父子之情自足。及乎衰世之道，為父不慈者衆，故立慈以規天下之父。為子不孝者衆，
    =以立孝以教天下之子。是則孝慈之名，因六親不和而後有也。
H4  =蓋忠臣以諫人主得名。上古之世，君道無為而天下自治。臣道未嘗不忠，而亦未嘗以忠立名。及乎衰世，
    =人君荒淫無度，雖有為而不足以治天下。故臣有殺身諫諍，不足以盡其忠者。是則忠臣之名，因國家昏亂而有也。
    :此老子因見世道衰微，思復太古之治，殆非憤世勵俗之談也。
 
X1  =大道既廢，方有仁義之說，實非真仁真義也。
X2  =真智慧不可思議。一旦歸於智巧，則大偽生焉。
X3  =上古雖無孝慈之名，而父子之情自足。及乎衰世，父不慈，故立慈以規父。子不孝，故立孝以教子。是則孝慈之名，非真孝慈也。
X4  =君道無為則朝政清明，天下自治。國家昏亂，良臣不忍，故有忠臣出。忠臣出，示國之不治也。
    +此四者，皆是第二念，非第一念也。第一念是真心；第二念是妄想。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§19 抱樸寡欲
 
1 絕聖棄智 民利百倍
2 絕仁棄義 民復孝慈
3 絕巧棄智 盜賊無有
4 此三者以為文不足
5 故令有所屬|見素抱樸 少思寡欲

L1  =絶，拒之也。棄，弗用也。利，貨財也。言無聖人在位。智者不能見用。則民惟利是依。貪心甚於尋常百倍也。
L2  =仁義二字。本聖智之所為。若棄絶仁義。則天下必亂。亂極則民思治。而慈孝之風可復也。
L2  =巧，華麗也。若能去其華麗。棄其貨利。則民無奪無爭。菽粟自如水火。盜賊無由而起也。
L3  =此三者。承上文而言。以為文不足者。謂徒尚乎文。不存其質。則治國之道。猶未足也。屬，猶守也。
    =言必使百姓各有所守。而其心乃定也。
L4  =素，本質也。樸，誠實也。私，顧己也。欲，嗜，好也。言必使百姓復其固有之良。以懷其誠樸之心。而
    =皆去其外誘之私。以絶其中心之欲。庶幾民可治而風可醇也。

H1  +此承前章而言智不可用，亦不足以治天下也。然中古聖人，將謂百姓不利，乃為斗斛權衡符璽仁義之事，
    +將利於民，此所謂聖人之智巧矣。殊不知民情日鑿，因法作奸。就以斗斛權衡符璽仁義之事，竊以為亂。
    +方今若求復古之治，須是一切盡去，端拱無為，而天下自治矣。
    =且聖智本欲利民，今旣竊以為亂，反為民害。棄而不用，使民各安其居，樂其業，則享百倍之利矣。
H2  =且仁義本為不孝不慈者勸，今旣竊之以為亂，苟若棄之，則民有天性自然之孝慈可復矣。此卽莊子所謂虎狼仁也。
    =意謂虎狼亦有天性之孝慈，不待教而後能。
H3  =況其人為物之靈乎。且智巧本為安天下，今旣竊為盜賊之資，苟若棄之，則盜賊無有矣。
H4  =然聖智仁義智巧之事，皆非樸素，乃所以文飾天下也。今皆去之，似乎於文則不定，於樸素則有餘。
H5  =因世人不知樸素渾全之道，故逐逐於外物，故多思多欲。今旣去華取實，故令世人心志，有所係屬於樸素之道。
    =若人人果能見素抱樸，則自然少思寡欲矣。
    :若知老子此中道理，只以莊子馬蹄胠篋作註解，自是超足。

X1  =人之初，性本善。以文飾聖飾智，虛妄偽善；絕棄之，真心現前，衆利百倍。
X2  =以文飾仁飾義，虛妄偽善；絕棄之，民自孝慈。
X3  =以文飾巧飾智，虛妄偽善，反生詭詐；絕棄之，良心發現，惡心不生。
X4  =聖智仁義智巧之事，皆非樸素，非可製文則以軌之。（而當“見素抱樸“。）
X5  =故令民衆有所真屬，歸於真道。至道即是至智，至德，至仁，至聖。於世見素抱樸，少思寡欲，清平世界矣。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§20 獨頑似鄙
 
1 絕學無憂 唯之與阿[ē]|相去幾何
2 善之與惡 相去何若
3 人之所畏 不可不畏
4 荒兮其未央哉
5 衆人熙熙如享太牢|如登春臺
6 我獨泊兮其未兆|如嬰兒之未孩
7 傫傫[lěi]兮若無所歸
8 衆人皆有餘|而我獨若遺
9 我愚人之心也哉|沌沌兮
10 俗人昭昭|我獨昏昏
11 俗人察察|我獨悶悶
12 澹[dàn]兮其若海|飂[liù]兮似無所止
13 衆人皆有以|我獨頑且鄙
14 我獨異於人|而貴求食[sì]於母
 
L1  =絶，窮其境也。學，學此道也。蓋古仙聖王。開此道於前。而後之人卽當效其為。然學有未純。
    =則道有未備。不能坦然無憂。必汲汲乾乾。日進月將。窮其至極。庶無終身憂辱之患也。
    =唯，應聲也。阿，逢迎也。君子之待人。心口如一。故應之速而無疑。若小人則心藏叵測。
    =而徒阿意以逢迎也。觀此二者相去為何如哉。
L2  =合乎理之謂善。違乎道之謂惡。善與惡皆出於一心。而推較其是非輕重。則相去之遠為何如哉。
L3  =畏，懼也。好惡之心。大抵相同。故人之所畏懼者。我亦不可不畏也。
L4  =荒兮者，言學業怠荒也。未央者，未明也。學業旣荒。則遠近善惡。不能分別。其心之不明。殆如長夜昏黑耳。
L5  =熙熙，和悅也。太牢，所以祭天地者也。言人皆和悅自得。而所享之榮華不啻太牢之厚也。
    =春臺，所以遊眺者也。如登春臺者。言如登遊眺之所。而快然自得目爽心怡也。
L6  =泊，淡泊也。兆，前知也。言我獨淡泊以明志。安其命之自然。不求前知而妄圖也。孾兒，初生也。未孩，
    =言未至於孩提也。孩提之童。尚有所知。而我則反其本樸。若孾兒之無知。無欲是也。
L7  =乘乘，飄飄也。言我之飄然於宇宙。若靡室靡家。而無所歸處也。
L8  =餘，過也。遺，失也。蓋衆人之心。皆貪乎貨利。而積之有餘。我獨心內矌然。如有所失也。愚，蠢也。
    =言衆人皆有餘。而我獨若失。
L9  =我豈愚人之心也哉。沌沌，渾然也。
L10 =昭昭，明也。昏，暗也。言我之心內。渾然一理。以觀於俗人之心。皆有所明。而我獨昏然不明也。
L11 =察察，辨析精明。悶悶，渾噩也。言觀諸於外。俗人求辨析幹練，我獨然大智若愚。
L12 =忽，難定也。海，衆流之所歸也。言我之心。深遠難定。而為天下所歸也。漂，流也。若無止者。
    =言如川流之不息。而無所窮其竟也。
L13 =以，用也。頑，如頑石之一無所欲也。鄙，如愚人之一無所知也。言人之耳目心思。各有所用。而我獨無
    =欲無知也如此。
L14 =異，不同也。貴，尊仰也。食母言畜我生我之本也。此道君言不同於衆人之心。而所貴者。在於稟命受生之始也。

H1  +此承前二章言聖智之為害，不但不可用，且亦不可學也。
    =然世俗無智之人，要學智巧仁義之事。旣學於己，將行其志。則勞神焦思，汲汲功利，盡力於智巧之間。
    =故曰巧者勞而智者憂。無知者又何所求。是則有學則有憂，絕學則無憂矣。
    :然聖人雖絕學，非是無智。但智包天地而不用。順物忘懷，澹然無欲，故無憂。
    :世人無智而好用。逐物忘道，汨汨於欲，故多憂耳。
    =斯則憂與無憂，端在用智不用智之間而已。相去不遠，譬夫唯之與阿，皆應人之聲也，相去能幾何哉，
    =以唯敬而阿慢。
H2  =憂與無憂，皆應物之心也，而聖凡相隔，善惡相反，果何如哉。此所謂差之毫釐，失之千里也。
    :老子言及至此，恐世俗將謂絕學，便是瞢然無知。故曉之曰，然雖聖人絕學，不是瞢然無知，其實未嘗不學也。
    :但世俗以增長知見，日益智巧，馳騁物欲以為學。聖人以泯絕知見，忘情去智，遠物離欲以為學耳。
H3  =且夫聲色貨利，皆傷生害道之物，世人應當可畏者。我則不可不畏懼而遠之。故曰人之所畏，不可不畏。
H4  =苟不知畏，汨沒於此，荒淫無度，其害非細。故曰荒兮其未央哉。央，盡也。由是觀之，世人以增益知見為學。
    =聖人以損情絕欲為學。所謂為學日益，為道日損，損之又損，以至於無為耳。
H5  =衆人忘道逐物，故汨汨於物欲之間。酷嗜無厭，熙熙然如享太牢之味，以為至美。
    =方且榮觀不休，如登春臺之望，以為至樂。
H6  =老子謂我獨離物向道，泊於物欲未萌之前，不識不知，超然無欲。故曰我獨泊兮其未兆，若嬰兒之未孩。
    =兆，念之初萌也。嬰兒，乃無心識愛惡之譬。孩，猶骸骨之骸。未骸，所謂骨弱筋柔。乃至柔之譬。
H7  :衆人見物可欲，故其心執著而不捨。老子謂我心無欲，了無繫累。泛然應物，虛心遊世，若不繫之舟。
    =故曰乘乘兮若無所歸。乘乘，猶泛泛也。
H8  =衆人智巧多方，貪得無厭，故曰有餘。我獨忘形去智，故曰若遺。遺，猶忘失也。
H9  =然我無知無我，豈真愚人之心也哉。但只渾渾沌沌，不與物辨，如此而已。
H10 =故俗人昭昭，而我獨昏昏。昭昭，謂智巧現於外也。
H11 =俗人察察，而我獨悶悶。察察，卽俗謂分星擘兩，絲毫不饒人之意。昏昏悶悶，皆無知貌。
H12 =我心如此，澹然虛明，若海之空闊不可涯量。颼然無著，若長風之御太虛。
H13 =衆人皆自恃聰明知見，各有所以。以，猶自恃也。我獨無知無欲，頑而且鄙，亦似庸常之人而已。
H14 =然我所以獨異於人者，但貴求食於母耳。凡能生物者，謂之母。所生者，謂之子。
    :且此母字，不可作有名萬物之母的母字。此指虛無大道，能生天地萬物，是以道為母，而物為子。食，乃
    :嗜好之意。衆人背道逐物，如棄母求食於子。聖人忘物體道，故獨求食於母。
    +此正絕學之學。聖人如此，所以憂患不能入也。前章絕聖棄智，乃無用之用。此章絕學無憂，乃無學之學。
    +後章孔德之容一章，乃無形名之形名耳。
 
X1  =世俗無智之人，要學智巧仁義之事。旣學於己，將行其志。
    =則勞神焦思，汲汲功利，盡力於智巧之間。故曰巧者勞而智者憂。
    =無知者又何所求。是則有學則有憂，絕學則無憂矣。
    :然聖人雖絕學，非是無智。但智包天地而不用。順物忘懷，澹然無欲，故無憂。
    :世人無智而好用。逐物忘道，汨汨於欲，故多憂耳。
    =斯則憂與無憂，端在用智不用智之間而已。
    =相去不遠，譬夫唯之與阿，皆應人之聲也，相去能幾何哉，以唯敬而阿慢。
X2  =憂與無憂，皆應物之心也，而聖凡相隔，善惡相反，果何如哉。此所謂差之毫釐，失之千里也。
X3  =聲色貨利，皆傷生害道之物，世人當畏之
    :（而不畏）。
    =而我不可不畏且遠之。
X4  =苟不知畏，汨沒於此，荒淫無度，其害非細。故曰荒兮其未央哉。央，盡也。
X5  =衆人忘道逐物，汨汨於物欲之間。
    =酷嗜無厭，熙熙然如享太牢之味，以為至美。
    =方且榮觀不休，如登春臺之望，以為至樂。
X6  =我獨離物向道，泊於物欲未萌之前，不識不知，超然無欲。兆，念之初萌也。
    =嬰兒，譬無心識愛惡。孩，猶骸骨之骸。未骸，所謂骨弱筋柔。乃至柔之譬。
X7  =我心無欲，了無繫累。泛然應物，虛心遊世，若不繫之舟。
    :（傫傫，憨山版曰“乘乘”，猶泛泛也。）
X8  =衆人智巧多方，貪得無厭，故曰有餘。我獨忘形去智，故曰若遺。遺，猶忘失也。
X9  =然我無知無我，豈真愚人之心也哉。但只渾渾沌沌，不與物辨，如此而已。
X10 =俗人昭昭，謂智巧現於外也。而我獨昏昏，智不外現。
X11 =俗人察察，卽俗謂分星擘兩，絲毫不饒人之意。昏昏悶悶，皆無知貌。
X12 =我心如此，澹然虛明，若海之空闊不可涯量。颼然無著，若長風之御太虛。
X13 =衆人皆自恃聰明知見，各有所以。以，猶自恃也。
    =我獨無知無欲，頑而且鄙，亦似庸常之人而已，呈玩世不恭狀。
X14 =然我所以獨異於人者，但貴求歸於能生天地萬物之大道耳。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§21 惟道是從
 
1 孔德之容 惟道是從
2 道之為物 惟恍惟惚
3 惚兮恍兮 其中有象
4 恍兮惚兮 其中有物
5 窈[yǎo]兮冥兮 其中有精
6 其精甚真 其中有信
7 自古及今|其名不去 以閱衆甫
8 吾何以知|衆甫之然哉|以此

L1  =孔德，猶言盛德也。容德之發見於外者。道，卽至玄之道。從，依也。又遵行也。言人欲有盛德之容積中
    =發外必體大道而遵行也。
L2  =物，有形有聲之類。恍，無定也。惚，顏子所謂忽焉在後之忽。此言道本陰陽。若論其形象。則或高或遠。
    =或前或後。其玄妙有如此。
L3  =像，如河圖洛書之類。言道雖高遠難測。前後難窺。而其中亦時有象之可指焉。
L4  =言道雖或有象之可指。而究竟恍惚無憑焉。以為恍惚無憑。則其中乃竟有聲臭者存。如天地之五氣五行見也。
L5  =窈，虛也。冥，莫測也。精者，天地絪縕之氣所由結也。言道中有物。虛杳難測。以為難測。則其中有精在。
    =而長生立命。皆本乎此也。
L6  =言求長生者。必先固其精液。而後存其神氣。是精為受氣之本。立命之根。至真之寶也。
　  =信，孚也。言道之中。有至誠不息之理。故發而為信。與行相孚也。
L7  =古今相繼。無非道之相承。去此道。則無以為世界。故古今來。大道之名不去也。
    =閱，鑒觀也。衆甫，猶萬方也。
L8  =言旣行此道。復鑒觀於萬方。萬方之人。皆以道為是也。
    =道君言吾何以知衆人皆以為是哉。蓋卽以此道揆之耳。 

H1  +此章言道乃無形名之形名也。
    =孔，猶盛也。謂道本無形，而有道之士，和氣集於中，英華發現於外，而為盛德之容。且此德容，皆從道體所發，
    =卽是道之形容也。故曰孔德之容，惟道是從。
H2  =然此道體本自無形，又無一定之象可見。故曰道之為物，惟恍惟惚。恍惚，謂似有若無，不可定指之意。
H3  =然且無象之中，似有物象存焉。故曰惚兮恍，其中有象。
H4  =恍兮惚，其中有物。其體至深至幽，不可窺測。
H5  =且此幽深窈冥之中，而有至精無妄之體存焉。故曰窈兮冥，其中有精。
H6  :其精甚真，此正楞嚴所謂唯一精真。精色不沈，發現幽秘，此則名為識陰區宇也。
    =學者應知。然此識體雖是無形，而於六根門頭，應用不失其時。故曰其中有信。
H7  :此上皆無形之形。下言無名之名。
    :謂世間衆美之名自外來者，皆是假名無實，故其名易去。
    =惟此道體有實有名，故自古及今，其名不去，以閱衆甫也。閱，猶經歷。甫，美也。謂衆美皆具。
H8  :是以聖人功流萬世而名不朽者，以其皆從至道體中流出故耳。其如世間王侯將相之名，皆從人欲中來，故
    :其功亦朽，而名亦安在哉。唯有道者，不期於功而功自大，不期於名而名不朽。
    =是知聖人內有大道之實，外有盛德之容，衆美皆具，惟自道中而發也。故曰吾何以知衆甫之然哉，以此。

X1  =孔，猶盛也。謂道本無形，而有道之士，和氣集於中，英華發現於外，而為盛德之容。
    =且此德容，皆從道體所發，卽是道之形容也。
X2  =然此道體本自無形，又無一定之象可見。恍惚，謂似有若無，不可定指之意。
X3  =然且無象之中，似有物象存焉。
X4  =恍兮惚，其中有物。其體至深至幽，不可窺測。
X5  =且此幽深窈冥之中，而有至精無妄之體存焉。
X6  :其精甚真，此正楞嚴所謂唯一精真。精色不沈，發現幽秘，此則名為識陰區宇也。
    =然此識體雖是無形，
    :而於六根門頭，
    =應用不失其時。
X7  =此道體有實有名，故自古及今，其名常在。
    =閱，鑒觀也。衆甫通衆父，猶萬物也。道以用之鑒觀萬物。
X8  =吾之所以知，蓋衆生萬物皆然也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§22 曲則為全

1 曲則全
2 枉則直
3 窪則盈
4 敝則新
5 少則得
6 多則惑
7 是以|聖人抱一為天下式
8 不自見[xiàn]故明|不自是故彰
9 不自伐故有功|不自矜故長
10 夫惟不爭|故天下莫能與之爭
11 古之所謂|曲則全者 豈虛言哉|誠全而歸之

L1  =曲，偏端也。全，純全也。欲道之成者。必由偏端以至於純全。如中庸所言其次致曲。曲能有誠之意。
L2  =枉，不直也。直，正直也。枉則直者。如孔子言父為子隱。子為父隱事雖徇徧。而直在其中之意。
L3  =漥，虛也。盈，滿也。言天下之物。虧而復盈。一定之理也。
L4  =弊，壞也。新，美也。去舊則可以從新。如衣之弊。而必易以新也。
L5  =少，寡也。得，得於身心也。言謙則受益。惟常恐其少。而以不及人為憂。則必孳孳前進。其道乃得於身也。
L6  =多，衆也。惑，疑也。蓋言多必失。反致聽者生疑也。
L7  =聖人，參贊化育者也。一，卽孔子所謂一貫之道。心志純一者是也。式，法也。蓋天下人心紛紛不一。
    =愚者不及而智者過中。聖人抱中道於懷。純一不雜。其心卽能齊天下之心。故可以為天下法也。
L8  =不自見者。謂聖人不自以為所見之明。必如舜之好問察邇。故道得而明也。
L9  =不自是者。聖人不自恃其所為之是。必揆情度理而後可。故大道乃能彰顯也。伐，矜誇也。有小人之為。
    =必自驕其所長。以求稱譽。聖人則不然。萬善悉備。而不誇其功。雖不居功。而功自立也。矜，自恃也。
    =言聖人不矜不驕。謙恭是尚。故道德日長也。
L10 =不爭卽君子無所爭之意。凡爭勝者。不可以治國家。維彼聖人。自息其爭端。而天下之人。亦不與之爭也。
L11 :曲則全之語。蓋羲皇以上之言。老子引之。
    =故曰古之所謂。豈虛言哉者。言至真至確也。誠，信斯言也。言能體貼此語。乃可以全身。父母全而生之。
    =庶可全而歸之也。
    :若不然。如子路之剛強長苰之才智。有過於道。皆足以殺其軀而已也。

H1  +此承前章言聖人所以道全德備衆美皆具者，蓋由虛心體道，與物無競，故衆德交歸也。
    =曲，委曲。卽曲成萬物而不遺之意。謂聖人委曲以御世，無一事不盡其誠，無一人不得其所。譬如陽春發
    =育萬物，雖草芥毫芒，春氣無不充足。若纖毫不到，則春氣不全。聖人之於人，無所不至。苟不曲盡其誠，
    =則其德不全矣。故曰曲則全。
H2  =枉則直者，屈己從人曰枉。直，伸也。謂聖人道高德盛，則大有徑庭，不近人情。
    =若不屈己從人，俯循萬物，混世同波，則人不信。人不信，則道不伸。由人屈而道伸。故曰枉則直。
H3  =窪則盈者，衆水所聚，地之最下者，曰窪。譬如江海最為窪下，故萬派皆歸。
    =而聖人之心至虛至下，故衆德交歸，德無不備。故曰窪則盈。
H4  =敝則新者，衣之汙損曰敝。不敝，則不浣濯，不見其新。以其敝乃新耳。以譬聖人忘形去智，日損其知見，
    =遠其物欲，洗心退藏於密。欲不敝，則道不新。故曰敝則新。
H5  =聖人忘知絕學，專心於一，故於道有得。故曰少則得。
H6  =世人多知多見，於道轉失。故曰多則惑。
H7  =是以聖人因愍世人以多方喪道，故抱一為天下學道之式。式，法也。
H8  =智巧衒耀於外曰見。自見者不明，故不自見乃為明耳。執己為必當曰是，自是者不彰，故不自是乃彰耳。
    =彰者，盛德顯於外也。
H9  =誇功，曰伐。自伐者無功，故不自伐乃有功耳。
    :司馬遷嘗謂韓信，假令學道謙讓，不伐己功，不矜其能。則庶幾於漢家勳，可比周召太公之徒矣。意蓋出此。
    :恃己之能曰矜。
    =長，才能也。自矜者不長，不自矜者乃長耳。
H10 =此上四不字，皆不爭之德也。惟聖人有之。故曰夫惟不爭，故天下莫能與之爭者。
H11 =由其聖人委曲如此，故萬德交歸，衆美備具。故引古語以證之曰，古之所謂曲則全者，豈虛言哉，誠全而歸之。
 
X1  =曲，委曲。卽曲成萬物而不遺之意。謂聖人委曲以御世，無一事不盡其誠，無一人不得其所。
X2  =屈己從人曰枉。直，伸也。謂聖人道高德盛，則大有徑庭，不近人情。
    =若不屈己從人，俯循萬物，混世同波，則人不信。人不信，則道不伸。
X3  =衆水所聚，地之最下者，曰窪。譬如江海最為窪下，故萬派皆歸。
    =聖人之心至虛至下，故衆德交歸，德無不備。
X4  =敝則新者，衣之汙損曰敝。不敝，則不浣濯，不見其新。以其敝乃新耳。
    =以譬聖人忘形去智，日損其知見，遠其物欲，洗心退藏於密。欲不敝，則道不新。
X5  =聖人忘知絕學，專心於一，故於道有得。
X6  =世人多知多見，於道轉失。
X7  =聖人，參贊化育者也。
    =一，卽孔子所謂一貫之道。心志純一者是也。式，法也。蓋天下人心紛紛不一。
    =愚者不及而智者過中。
    =聖人抱中道於懷，純一不雜，其心卽能齊天下之心。故可以為天下法也。
X8  =智巧衒耀於外曰見。自見者不明。
    =執己為必當曰是，自是者不彰。彰者，盛德顯於外也。
X9  =誇功，曰伐。自伐者無功。長，才能也。自矜者不長。矜，自恃也。
X10 =此上四不字，皆不爭之德也。惟聖人有之。
    =凡爭勝者，不可以治國家。彼聖人，自息其爭端。而天下之人，亦不與之爭也。
X11 =由其聖人委曲如此，故萬德交歸，衆美備具。故引古語以證之。
    =誠，信斯言也。言能體貼此語，乃可以全身。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§23 同道樂得

1 希言自然
2 飄風不終朝[zhāo]|驟雨不終日|孰為此者 天地
3 天地尚不能|而況於人乎
4 故從事於道者|道者同於道|德者同於德|失者同於失
5 同於道者道亦樂得之|同於德者德亦樂得之|同於失者失亦樂得之
6 信不足 有不信

L1  =希，少也。希言，謂吉人之辭寡。故得其自然也。
L2  =飄風，狂風也。驟雨，猛雨也。此二者。大而且急。故不能久長。孰為此者。言飄風驟雨。孰使之而然也。
    =推而論之。則風雨皆主乎天地。
L3  =天地者。大化流行。萬物之所託也。豈不能長久乎。然所施之風雨若太急迫。猶且不能長久凡為人也。
    =而自高自大。浮躁粗率。豈能久乎。
L4  =此言天道如是。故引矢志修途。從事於道者而言也。道者，明乎此道之人也。言能明乎道。則以道為友。
    =故同乎道也。德者，行道而有得於心之謂也。言行道而有所得。則以德為鄰。故同於德也。
    =失者，失此道德也。言失此道之人。則面牆而立。茫然無所定向。故同乎失也。
L5  =此以下承上而言。道亦樂得之者。謂旣與道相摩。則煆煉琢磨。日躋於道。
    =道亦樂與人相得也。德亦樂得之者。
    =謂旣與德為同類。則砥礪切磋。德亦樂得於人。而人樂有乎德也。失亦樂失之者。
    =謂失道德之人。則逸游宴樂。放其心而不知求。亦以失道為歡樂也。
L6  =信不足者。言世之人有奉行此道。而信心不堅也。有不信者。謂見此道而疑惑不信也。

H1  +此章言聖人忘言體道，與時俱化也。
    =希，少也。希言，猶寡言也。
    :以前云多言數窮，不如守中。由其勉強好辯，去道轉遠，不能合乎自然。惟希言者，合乎自然耳。
H2  :向下以飄風不終朝，驟雨不終日，以比好辯者之不能久。然好辯者，蓋出憤激不平之氣。
    =如飄風驟雨，亦乃天地不平之氣。非不迅激如人，特無終朝之久。
H3  =且天地不平之氣，尚不能久，而況於人乎。
    :此甚言辯之不足恃也。蓋好辯者，只為信道不篤，不能從事於道，未得玄同故耳。
H4  =惟聖人從事於道，妙契玄同，無入而不自得。故在於有道者，則同於道。在於有德者，則同於德。失者，
    =指世俗無道德者。謂至於世俗庸人，亦同於俗。
    :卽所謂呼我以牛，以牛應之，呼我以馬，以馬應之，無可不可。
H5  =且同於道德，固樂得之。卽同於世俗，亦樂而自得。
H6  =此無他，蓋自信之真，雖不言，而世人亦未有不信者。且好辯之徒，曉曉多言，強聒而不休，人轉不信。
    =此無他，以自信不足，所以人不信耳。
 
X1  =希言，猶寡言也。好辯者，去道轉遠，不合自然。
    =惟希言者，反而近乎自然。蓋道而如是，人同此道。
X2  =如飄風驟雨，亦乃天地不平之氣。非不迅激如人，特無終朝之久。風雨皆主乎天地也。
X3  =天地者，大化流行，萬物所託，豈不能長久乎。
    =然所施之風雨若太急迫，猶且不能長久凡為人也。而自高自大，浮躁粗率，豈能久乎。
X4  =故引矢志修途，事道者也，各有差異。
    =明乎此道者，能明乎道，則以道為友，故同乎道也。
    =德者，行道而有得於心也。行道而有所得，則以德為鄰，故同於德也。雖未盡道，終有所得。
    =失者，不得者也。茫然無所定向也。
X5  =各得其所。
X6  =於道信不足者，不能體道。且好辯之徒，更曉曉多言，強聒而不休，人轉不信。蓋人心不惑耳。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§24 自見自伐
 
1 跂者不立|跨者不行
2 自見[xiàn]者不明|自是者不彰
3 自伐者無功|自矜者不長
4 其在道也|曰餘食贅[zhuì]行|物或惡[wù]之
5 故有道者不處[chǔ]也

L1  =跂，獨立也。跨，跛行也。獨立難久。跛行難遠。一定之理也。此以喻下數端而言。
L2  =自見者。不屑受教於人。而無審問慎思明辨之功。故天下之理。不得而明也。自是者。任性而妄為。
    =不從今古之制。故所為之事。不能彰顯也。
L3  =我之有功。人縱推之於我。而我猶不敢居。其功乃大也。若為一事。而自炫其功。亦屬無功已耳。己之道德。
    =必謙遜而愈進。若妄自矜誇。而無涵養之學。是道德不日進而日退也。
L4  =其於道也。謂如此之人。其所以修道者。亦修其天爵。以要人爵己耳。故曰餘食贅行。餘食，卽徒餔啜之意。
    =贅行，卽遊說縱橫之徒。言自見自是。自伐自矜。多是此類。若為國家。非惟不能化民成俗。
    =且萬物皆是以增其惡。
L5  =此有道之君子。斷不如是也。

H1  +此承前章言好辯者不能持久，猶如跂跨之人不能立行，甚言用智之過也。
    =跂，足根不著地也。跨，闊步而行也。
    =蓋跂者只知要強高出人一頭，故舉踵而立。殊不知舉踵不能久立。
    =跨者只知要強先出人一步，故闊步而行。
    =殊不知跨步不能長行。以其皆非自然。
    :以此二句為向下自見自是自伐自矜之譬喻耳。
H2  =自見，謂自逞己見。自是，謂偏執己是。此一曲之士，於道必暗而不明。
H3  =自伐，謂自誇其功。自矜，謂自恃其能。
    :此皆好勝強梁之人，不但無功，而且速於取死。
H4  =然此道中本無是事。故曰其在道也，如食之餘，如形之贅，皆人之所共惡。
H5  =而有道之士，以謙虛自守，必不處此。故曰有道者不處。以其不能合乎自然也。

X1  =跂，足根不著地也。跨，闊步而行也。
    =蓋跂者只知要強高人一頭，故舉踵而立。然舉踵不能久立。
    =跨者只知要強先人一步，故闊步而行。然跨步不能長行。
    =以其皆非自然。
X2  =自見，謂自逞己見。自是，謂偏執己是。此一曲之士，於道必暗而不明。
X3  =自伐，謂自誇其功。自矜，謂自恃其能。
    :此皆好勝強梁之人，不但無功，而且速於取死。
X4  =於道而言，過度食，行，皆非自然，故物或惡之，喻事常敗也。
X5  =故有道者，不行斯事，不自取其辱也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§25 道法自然

1 有物混[hùn]成|先天地生
2 寂兮寥兮|獨立而不改
3 周行而不殆|可以為天下母
4 吾不知其名|字之曰道|強[qiǎng]為之名曰大
5 大曰逝|逝曰遠|遠曰反
6 故|道大|天大 地大|王亦大
7 域中有四大|而王處一焉
8 人法地
9 地法天
10 天法道
11 道法自然

L1  =物，卽道也。混成，太極之象也。太極生兩儀。兩儀者，天地也。玄黃未判之先。卽有道存焉。
    =故先天地而生也。
L2  =寂，至靜也。寥，高遠也。獨立者。言道之一炁自成。
L3  =周行者，周而復始之意。殆危也。此謂道之至靜無動。高遠難名。特立於天地之中。絲毫不能改變。
    =流行於宇宙之內。萬世不滅也可以為天下母者。言天地本此而生。萬象本此而出其與母之生子無以異也。
L4  =吾，道君自謂。不知其名者。卽蕩蕩乎民無能名之意。字之曰道。言可取法於人。為終身奉行。
    =日用出入當由之徑。
    =故字之曰道也。強為之名者。無其名，而加之以名也。大者，極言其廣也。
L5  =逝，如行路之長往也。惟其廣大莫被而無所止。故曰逝也。旣長往而無所止。則悠遠難測也。故逝曰遠。
    =然道雖悠遠不待外求。反而尋之。則前後左右。皆充滿也。故遠曰反。
L6  =言乾坤內外。無有過於道者。故首曰道大。論道之外。唯天高明。
    =故次曰天大。昊天之下。有地焉。博厚載物。
    =而廣大莫測。可以配天。故天之下。乃曰地大。王者受命於天。統御乎地。傳前代之道統。管萬國之黎民。
    =至尊無上。故天地之中王者亦大。
L7  =域中，卽宇宙之中。四大而王居其一。謂王者亦在四大之內。
L8  =言人之所以得道者。皆取法於地。
    :如孔子在川而有不舍晝夜之思。孟子言泰山。而別高下之殊。致知格物之功。莫不取法於地也。
L9  =地居卑下。取法於天。故觀於四時之行。然後百物乃生。卽可得而知也。
L10 =天之取法於道者。蓋道本至靜。而北辰亦能至靜。道本至明而日月亦能至明。溯厥由來。道有以立於前。
    =而天乃成象於後也。
L11 =言萬彚皆以道為宗。道又何由取法哉。蓋虛無之炁。惟得其自然。卽以為法耳。

H1  +此承前言世俗之士，各以己見己是為得。曾不知大道之妙，非見聞可及。故此特示大道以曉之也。
    =有物者，此指道之全體，本來無名，故但云有一物耳。渾渾淪淪，無有絲毫縫隙，故曰混成。未有天地，
    =先有此物，故曰先天地生。
H2  =且無聲不可聞，無色不可見，故曰寂寥。超然於萬物之上，而體常不變，故曰獨立而不改。
H3  =且流行四時，而終古不窮，故曰周行而不殆。殆，窮盡也。天地萬物，皆從此中生，故曰可以為天下母。
H4  =老子謂此物至妙至神，但不知是何物，故曰吾不知其名，特字之曰道。且又強名之曰大道耳。
H5  :向下釋其大字。
    =老子謂我說此大字，不是大小之大。乃是絕無邊表之大。往而窮之，無有盡處。故云大曰逝。
    :向下又釋逝字。
    =逝者遠而無所至極也。故云逝曰遠。遠則不可聞見，無聲無色，非耳目之所到。
    =故云遠曰反。反，謂反一絕跡。
    :道之極處，名亦不立，此道之所以為大也。然此大道，能生天生地，神鬼神王。
H6  =是則不獨道大，而天地亦大。不獨天地大，而王亦大。
H7  =故域中所稱大者有四，而王居其一焉。
H8  =世人但知王大，而不知聖人取法於天地。
H9  =此則天地又大於王。
H10 =世人但知天地大，而不知天地自道中生，取法於道。此則道又大於天地也。
H11 =雖然，道固為大，而猶有稱謂名字。至若離名絕字，方為至妙，合乎自然。故曰道法自然。
    :且而大道之妙，如此廣大精微。而世人豈可以一曲之見，自見自是以為得哉。
    :此其所以自見者不明，自是者不彰耳。
 
X1  =天地之前，似先有物，斯為道體。渾渾淪淪，無有間隙。
X2  =無聲不可聞，無色不可見，故曰寂寥。超然於萬物之上，而體常不變。
X3  =流行四時，終古不窮。殆，窮盡也。天地萬物，皆從此中生，故道為天下母。
X4  =此物至妙至神，但不知是何，更不知其名，特字之曰dharma，漢譯稱“道”。且又強名之曰大道耳。
X5  =此大字，非大小之大，乃絕無邊表之大。往而窮之，無有盡處，故云大曰逝。
    =逝者遠而無所至極也，故云逝曰遠。
    =遠則不可聞見，無聲無色，非耳目之所到，故云遠曰反。反，謂反一絕跡。
    :道為至極，名亦不立，此道之所以為大也。
X6  =非道獨大，天，地，王亦如此大。
X7  =此四大中，王佔其一。
X8  =人王取法於地。
X9  =地取法於天。故人王後於天地。
X10 =天取法於道。故天地後於道。
X11 =道者，無論何名何物，自有軌持。法爾如是。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§26 燕處超然

1 重為輕根|靜為躁君
2 是以|聖人終日行|不離輜[zī]重
3 雖有榮觀[guàn]|燕處超然
4 奈何萬乘[shèng]之主|而以身輕天下
5 輕則失根|躁則失君

L1  =重，多也。輕，微也。根，本也。蓋任重任勞。而心每思其輕。故重者乃為輕之本。
　  =靜，不動也。躁，煩腦也。君，主也。言人靜極。則心易於躁也。
L2  =聖人任重致遠。靜而能安者也。輜，車也。言聖人雖終日行而不離輜重者。蓋喻道之大。如輜車所載之重。
    =聖人行息不離。恐其輕忽也。孔子曰。君子不重則不威。其意本此。
L3  =榮，華也。觀，仰望也。燕處，卽心無私累。而能安處也。超然，出類拔萃也。此言聖人雖見榮華之可瞻仰。
    =而安靜自然。不為躁暴所累。所以超羣拔萃也。
L4  =乘，馬匹也。四十匹為一乘。萬乘之君。富有天下者也。此言聖人惟不自輕。故為萬世法。欲為國者。必
    =效聖人而後可。奈何以一人之身。而自輕於天下乎。
L5  =為人君者止於仁。若輕薄是尚。仁喪而禮衰。則賢臣退位。而國殆也。
　  =臣之事君。貴有乎忠。若躁氣未平。而犯顏諫諍。不惟不見用於君。而且速其亡身之禍也。孔子云。事君數。
    =斯辱矣。卽此躁則失君之意。

H1  +此誡君人者，當知輕重動靜，欲其保身重命之意也。
    =然重字指身。輕字指身外之物，卽功名富貴。靜字指性命。躁字指嗜慾之情。
    :意謂身為生本，固當重者。彼功名利祿，聲色貨利，乃身外之物，固當輕者。且彼外物必因身而後有，
    :故重為輕之根。性為形本，固至靜者。
    :彼馳騁狂躁，甘心物慾，出於好尚之情者，彼必由性而發，故靜為躁之君。
H2  :世人不知輕重，故忘身徇物，戕生於名利之間。不達動靜，故傷性失真，馳情於嗜慾之境。
    =惟聖人不然，雖終日行而不離輜重。輜重，兵車所載糧食者也。
    :兵行而糧食在後，乃大軍之司命。雖千里遠行，深入敵國，戒其擄掠，三軍不致鼓譟以取敗者，賴其所保
    :輜重也。聖人遊行生死畏途，不因貪位慕祿，馳情物慾，而取戕生傷性之害者，以其所保身心性命為重也。
    :故曰不離輜重。
H3  =縱使貴為天子，富有四海之榮觀，但恬澹燕處，超然物慾之表。
    :此其堯舜有天下而不與也。
H4  =奈何後之人主，沈暝荒淫於聲色貨利之間，戕生傷性而不悟。是以物為重而身為輕也。故曰身輕天下。奈
    =何者，怪歎之詞。
H5  =物重則損生，故曰輕則失根。慾極則傷性，故曰躁則失君。君，謂性也。
    :莊子養生讓王，蓋釋此篇之意。子由本云，輕則失臣。然臣字蓋亦指身而言。齊物以身為臣妾，以性為真君，
    :源出於此。
 
X1  =重指身。輕指功名富貴。
    :身為生本，固當重者。功名利祿，聲色貨利，乃身外之物，固當輕者。外物必因身而有，故重為輕之根。
    =靜指性命。躁指嗜慾之情。
    :性為形本，固至靜者。
    :馳騁狂躁，甘心物慾，好尚之情，必由性而發，故靜為躁君。
X2  =輜重，兵車所載糧食者也。
    =聖人遊行生死畏途，不離輜重，故可不貪位慕祿，馳情物慾，逍遙自在。
X3  =縱使貴為天子，富有四海之榮觀，但恬澹燕處，超然物慾之表。
X4  =奈何後之人主，沈暝荒淫於聲色貨利之間，戕生傷性而不悟。是以重身而輕天下，自然亦重物而輕身。
X5  =物重則失根本，慾極則傷性。躁氣不平則失君道，亦即失性也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§27 善行無跡

1 善行無轍跡
2 善言無瑕[xiá]謫[zhé]
3 善數[shǔ]不用籌策
4 善閉無關楗[jiàn]|而不可開
5 善結無繩約|而不可解
6 是以聖人|常善救人故無棄人|常善救物故無棄物
7 是謂襲明
8 故|善人者不善人之師|不善人者善人之資
9 不貴其師|不愛其資
10 雖智大迷|是謂要妙

L1  =善行者，善人之行也。轍迹，車轍之迹也。無轍迹者。卽不踐迹之意。
L2  =善言者，和平遜順之言。瑕，疵也。讁，指讁也。蓋善人所出之言。至情至理。而無失言之患。人不得而指讁也。
L3  =善計，良謀也。蓋善人進退避藏。無所不知。所謀之計。不待籌策而成也。
L4  =閉，阻滯也。關，門也。鍵，鎖鑰也。言善人之為邦。其所以避藏者。全在乎善。雖不用關鎖之力。已如牆如城。
    =卽千軍萬馬。亦不能破也。
L5  =結，結交也。言善人能交於鄰國。永通和好。不待玉帛往來。而爭端自息。如物之不用繩以約束。
    =自相結而不可解也。
L6  =以上言善政如是。此又言聖人之心。皆本乎善。故常以仁愛之意。救民於水火之中。使萬姓皆登袵席。
    =而天下無可棄之人也。善救物者。推仁民之德而愛惜物類也。無棄物者。謂萬物被其恩膏。相成不害。
    =而終無可棄之物也。
L7  =襲，取也。明，文明之德也。言聖人之所以為此者。是謂取於高明之德而行之也。
L8  =書曰。德無常師。主善為師。天之生善人者。所以之人。善者得而裁制栽培也。或曰。
    =此二句。如孟子言。勞心者治人。勞力者治於人之意。亦通。
L9  =不貴其師者。言不善者。不以善人為可師。而輕慢之也。不愛其資者。言彼不率教善人亦不屑教之意也。
L10 =智者。聰明之士。大迷者。一無所知也。言不率教於人。則無以化其不善故聰明之士。猶必如迷者之審問於人。
    =乃無過則失中之弊也。是持上文而言。謂以上。皆切妙之要道也。

H1  :此言聖人善入塵勞，過化存神之妙也。
    =轍跡，猶言痕跡。世人皆以人我對待，動與物競，彼此不忘，故有痕跡。
    =聖人虛己遊世，不與物忤，任物之自然，
    =所謂忘於物者物亦忘之。彼此兼忘，此行之善者。故無轍跡。
H2  =瑕謫，謂是非辨別，指瑕謫疵之意。聖人無意必固我。因人之言。然，然。不然，不然。可，可。不可，不可。
    =未嘗堅白同異，此言之善者，故無瑕謫。
H3  =籌策，謂揣摩進退，算計得失利害之意。聖人無心御世，迫不得已而後應，曾無得失之心。然死生無變於己，
    =而況利害之端乎。此計之善者，故不用籌策。
H4  =關鍵，閉門之具。猶言機關也。世人以巧設機關，籠羅一世，將謂機密而不可破。
    =殊不知能設之，亦有能破之者。
    =歷觀古之機詐相尚之士，造為勝負者，皆可破者也。唯聖人忘機待物，在宥群生。然以道為密，不設網羅，
    =而物無所逃。此閉之善者，所謂天下莫能破。故無關鍵而不可開。
H5  =繩約，謂繫屬之意。世人有心施恩，要以結屬人心。殊不知有可屬，亦有可解。
    =然有心之德，使人雖感而易忘，所謂賊莫大於德有心。聖人大仁不仁，利澤施乎一世，而不為己功，
    =且無望報之心，故使人終古懷之而不忘。
    =此結之善者，故無繩約而不可解。
H6  =是以聖人處世，無不可化之人，有教無類，故無棄人。無不可為之事，物各有理，故無棄物。物，猶事也。
H7  =如此應用，初無難者，不過承其本明，因之以通其蔽耳。故曰襲明。襲，承也。猶因也。
    :莊子庖丁游刃解牛，因其固然，動刀甚微，劃然已解。意出於此。觀留侯躡足附耳，因偶語而乞封，
    =借四皓而定漢，以得老氏之用。故其因事處事，如此之妙，可謂善救者也。其他孰能與之。
H8  =故世之善人，不善人之師。不善人，善人之資。
    =由其飾智矜愚，修身明汙，故皆知師之可貴。擇類而教，樂得而育，故皆知資之可愛。
H9  =若夫聖人為舉世師保，而不知其師之可貴。化育億兆，而不知其資之可愛。所謂兼忘天下易，使天下忘己難。
H10 =此雖在智者，猶太迷而不知，況淺識乎。斯所過者化，所存者神，是謂要妙。
 
X1  =轍跡，猶言痕跡。真善之行，合乎自然，不自見伐，無有痕跡。
X2  =瑕謫，謂是非辨別，指瑕謫疵之意。聖人無意必固我。因人之言。自然而然，無有瑕謫。
X3  =籌策，謂揣摩進退，算計得失利害之意。聖人無心御世，不得已而後應，曾無得失之心。
    =此計之善者，故不用算計。
X4  =關鍵，閉門之具。猶言機關也。世人之巧機，能設必能被破。
    =唯聖人忘機待物，在宥群生。以道為密，不設網羅，而物無所逃。此閉之善者，所謂天下莫能破。
    :猶如大聖難逃如來掌。
X5  =繩約，謂繫屬之意。世人有心施恩，要以結屬人心。殊不知有可屬，亦有可解。
    :然有心之德，使人雖感而易忘，所謂賊莫大於德有心。
    =聖人大仁不仁，利澤施乎一世，而不為己功，且無望報之心，故使人終古懷之而不忘。
    =此結之善者，故無繩約而不可解。
X6  =是以聖人處世，無不可化之人，有教無類，故無棄人。無不可為之事，物各有理，故無棄物。物，猶事也。
X7  =如此應用，初無難者，不過承其本明，因之以通其蔽耳。故曰襲明。襲，承也。猶因也。
X8  =世之善處人者，為拙於處人者之師。不善處者，為善處者之用。
    :此解可矣。
X9  =不貴善處者，亦不重不善處者。
    :平等對待，無分別心。
X10 =雖有斯智，示若渾然不知，是要妙也。
    :不自見，不自伐，是謂要妙。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§28 大制不割
 
1 知其雄|守其雌|為天下谿[xī]
2 為天下谿|常德不離|復歸於嬰兒
3 知其白|守其黑|為天下式
4 為天下式|常德不忒[tè]|復歸於無極
5 知其榮|守其辱|為天下谷
6 為天下谷|常德乃足|復歸於樸
7 樸散則為器
8 聖人用之 則為官長[zhǎng]|故大制不割

L1  =雄，公雉。雌，母雉。谿，山溪。水所歸也。雄者好鬬。多不得而死。雌者守下。乃可以全身。維彼詩者。
    =雖知雄之強暴。而必如雌之守下。所以能為天下萬姓之所歸也。
L2  =常德，中庸之德也。言能為天下萬姓所歸服者。則於中庸之德。必常一一遵守。而未有須臾離也。孾兒，
    =善性天賦。本質無虧也。言不離於德。則復其本質。而充其本然之善。故曰復歸於孾兒也。
L3  =白，明也。黑，暗也。言知光明之可羨。而常以幽獨是慎。不自稱為高明也。式，法則也。為天下式者。
    =言能知白守黑。則可以為天下萬姓法則也。
L4  =忒，紊亂也。此復言為天下法則之人。則於大中至正之德。必有條而不紊也。無極者。太極之本。無私無欲。
    =廣大之象也。蓋人之生也。而無極之理。莫不寓於其中。但因物而遷耳。若不亂乎常德。則無私無欲。
    =廣大之機可復也。
L5  =榮，顯逹也。辱，卑下也。谷，深谷也。凡舍辱求榮。行險僥倖。此乃小人之為。實足以殺其軀而已。維
    =彼賢者。守器待時。深藏若谷。故能為天下所瞻仰也。
L6  =足，充足也。謂知榮守辱者。其於五常之德。乃能充足也。樸本質也。惟其常德充足。則本來姿質。必自
    =此而可復也。
L7  =散，行之於處。施之於人也。言以天所賦之姿質。發於行事之間。則可為盛物之器。如孔子謂子貢為瑚璉者然也。
L8  =聖人，如商湯周文之等。用以為官長者。因才任政。無求備於一人之意。制，法度也。割，喪失也。聖人
    =之為國家舉賢才。故制度大彰。而無喪失之患也。 

H1  +此承上章行道之妙，而言聖人不以知道為難，而以守道為要妙也。
    :古德云，學道，悟之為難。旣悟，守之為難。然行道之妙，實出於守道之要耳。
    =蓋此中知字，卽悟也。知雄守雌者，物無與敵謂之雄，柔伏處下謂之雌。
    =谿，乃窊下之地。衆水所歸之處也。嬰兒者，柔和之至也。
    :前云專氣致柔，能如嬰兒乎。然氣雖勝物，物有以敵之。而道超萬物，物無與敵者。故謂之雄。
    :聖人氣與道合，心超物表。無物與敵，而能順物委蛇，與時俱化，不與物競，故曰知其雄，守其雌。
    =由守其雌，故衆德交歸，如水之就下，故為天下谿也。
H2  =由乎處下如谿，故但受而不拒，應而不藏，流潤而不竭，故曰常德不離。
    =以入物而物不知，如嬰兒終日號而嗌不嗄，和之至也。以能勝物而不傷，故曰復歸於嬰兒。
H3  =知白守黑者。白，謂昭然明白。智無不知之意。黑，昏悶無知之貌。式，謂法則。
    =謂聖人智包天地，
    =明並日月，而不自用其知。所謂明白四達，能無知乎。故曰知其白，守其黑。由其真知而不用其知，
    =故無強知之過謬，故可為天下式。
H4  =忒，差謬也。
    =然強知則有謬，謬則有所不知。旣有所不知，則知不極矣。今知旣無謬，則知無不極，故曰復歸於無極。
H5  =知榮守辱者。榮，乃光榮貴高。辱，乃汙辱賤下。谷，乃虛而能應者也。
    =謂聖人自知道光一世，德貴人臣，而不自有其德。乃以汙辱賤下，蒙恥含垢以守之。
    =所謂光而不耀，仁常而不居者，虛之至也。故為天下谷。
H6  =樸，謂樸素。乃木之未雕斲也。
    =由其虛，故常德乃足。德自足於中，
    =則不緣飾於外，故復歸於樸素也。
H7  =以虛而能應物，故樸散則為器。
H8  =聖人以此應運出世，則可以官天地府萬物。故能範圍天地而不過。曲成萬物而不遺。化行於世而無棄人棄物。
    =故曰大制不割。割，截斷也。不割者，不分彼此界限之意。

X1  :古德云，學道，悟之為難。旣悟，守之為難。然行道之妙，實出於守道之要耳。
    =物無與敵謂之雄，柔伏處下謂之雌。
    =谿，乃窊下之地。衆水所歸之處也。
    =能知雄守雌者，衆智之源泉，天下之福澤。
X2  =由乎處下如谿，故但受而不拒，應而不藏，流潤而不竭，故曰常德不離。
    =孾兒，善性天賦。本質無虧也。言不離於德，則復其本質，而充其本然之善。
X3  =白，謂昭然明白。智無不知之意。黑，昏悶無知之貌。式，謂法則。
    =明白四達，能無知乎。而不自用其知。無強知之過謬，故可為天下之範本，起心動念永無過謬。
X4  =忒，差謬也。為天下之範本，德常而不差謬，則惡心燼滅，善心亦不起，是歸於無極，極致境界。
X5  =榮，乃榮光貴高。辱，乃汙辱賤下。谷，乃虛而能應者也。
    =境界高尚，行為簡樸。為天下人之所賴。
X6  =樸，謂樸素。乃木之未雕斲也。
    =光而不耀，仁常而不居，虛之至也。為天下谷，由其虛，故常德乃足。德自足於中，
    =則不緣飾於外，故復歸於樸素也。
X7  =散，行之於處。施之於人也。以天所賦之姿質，發於行事之間，則可為世造福。
X8  =割，喪失也。聖人以此應運出世，則可以治國齊家。故大制不割，
    :天下和順，日月清明，風雨以時，災厲不起，國豐民安，兵戈無用，
    :崇德興仁，務修禮讓，國無盜賊，無有冤枉，強不淩弱，各得其所。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§29 去奢去泰
 
1 將欲取天下而為之|吾見其不得已
2 天下神器|不可為也
3 為者敗之|執者失之
4 故物|或行 或隨|或歔[xū] 或吹|或強 或羸[léi]|或載 或隳[huī]
5 是以聖人|去甚 去奢 去泰

L1  =將欲取天下而為之者。如湯之伐桀。武之伐紂是也。蓋所以拯天下於陷溺。救斯民於塗炭。皆不得已而為之也。
L2  =神器，如宗廟祭祀之器。不可為。謂不可奢華靡麗。為之有過於分也。
L3  =敗，壞也。為者敗之。猶言成敗皆主於一人也。執，得也。旣得之而復失之者。不以其道故也。
L4  =物，兼萬類而言。行則在前。隨則在後。呴者咨嗟。吹者喜悅。強者剛勇。嬴者瘦弱。載者努劣。隳者抛
    =棄。此言物類之不齊也如此。
L5  =甚，失中也。奢，過分也。泰，矜驕也。聖人知陰陽二氣之理。太剛必折。盈者必虧。
    =故合於中道而行。不使過份。
    =去甚，如孔子云由也兼人。故退之之類。去奢，如孔子云奢則不孫。儉則固。與其不孫也。甯固之等。
    =去泰如溫良恭儉。讓之容是也。

H1  +此言聖人道全德備，應運出世，為官為長。當任無為無事，而不可有為太過也。由上章云，樸散則為器。
    +聖人用之則為官長。
    =故老子因而誡之曰，將欲取天下者，當任自然，不可有心為之。而有心為之者，吾見其必不可得已。
H2  =何也，且天下者大器，有神主之。豈可以人力私智取而奪之耶。故曰不可為也。
H3  =而為之者，必反敗之。縱為而得之，亦不可執為己有。而執之者，必反失之。
    :故如強秦力能併吞六國，混一天下，是為之也。且誓云一世以至萬世，是執之也。故不旋踵而敗，二世而亡，
    :豈非為者敗之，執者失之之驗歟。
H4  :然而所以敗之失之者，以其所處過甚，而奢泰之極也。凡物極則反，此亦自然之勢耳。
    =故物或行而在前。
    =或復隨而在後。或呴而煖。或反吹而寒。或強而壯。或又尪羸而弱。或正載而成。或卽隳頹而毀。
H5  :此何以故，是皆用力過甚，而奢泰之極也。此皆聖人所不處。
    =故曰是以聖人去甚，去奢，去泰。

X1  =取天下者，不可得已而為之。是道也。:欲無端奪天下者，必自食其果。
X2  =何也，且天下者大器，有神主之。豈可以人力私智取而奪之耶。
X3  =而為之者，必反敗之。縱為而得之，亦不可執為己有。而執之者，必反失之。
X4  =物類種種相，其不齊也者如此。
X5  =甚，失中也。奢，過分也。泰，矜驕也。是故以聖人秉持中道。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§30 物壯則老

1 以道佐人主者|不以兵強天下
2 其事好[hào]還
3 師之所處|荊棘生焉
4 大軍之後|必有凶年
5 善者果而已|不敢以取強
6 果而勿矜|果而勿伐|果而勿驕
7 果而不得已|果而勿強
8 物壯則老|是謂不道|不道早已

L1  =以道佐人者。如伊尹周公之流。不以兵強者。惟以德服人。不假兵革之利。士卒之多。以威逼於天下之人。
L2  =事，卽治國之事。還，謂反求諸己。不徒責於人也。
L3  =師，二千五百人為師。處，卽兵所屯之處也。荊棘生焉。言師旅之處。民皆流離。而土地荒蕪也。
L4  =大軍之後。謂兩國紛爭之後。必有凶年者。謂耕種失時。而礫石不榖者有也。蒿萊不榖者有也。飢饉不由
    =是而至乎況殺伐爭競。大傷天地之和。而旱魃為虐。淫雨為災。必相因而至耳。
L5  =善者，卽善治國之人。果，果敢也。言惟使民理真氣壯而已。不敢取強者。謂不以剛強自恃也。
L6  =矜，誇也。伐，爭功也。驕，逞能也。言善治者之民。雖果敢而不自矜其力。理直而不自伐其功。氣壯而
    =不自驕其勇也。
L7  =言果敢是尚者。干戈擾攘之中。不得已而用之也。然雖果而不可自逞其強者。蓋恐太剛則折耳。
L8  =壯則老者，言人之強壯。必易至於衰老也。不道者。言不得長生之道也。已，死也。不得其道。
    =則不可以長生固宜其早死也。

H1  +此承上言聖人不為已甚，故誡之不可以兵強天下也。
    =凡以兵強者，過甚之事也。
H2  =勢極則反，故其事好還。
H3  =師之所處，必蹂踐民物，無不殘掠，故荊棘生。
H4  =大軍之後，殺傷和氣，故五穀疵癘而年歲凶，此必然之勢也。
H5  =然於濟弱扶傾，除暴救民，蓋有不得不用之者，惟在善用。善用者，果而已。已者，休也，此也。
    =果，猶言結果。俗云了事便休。謂但可了事令其平服便休，不敢以此常取強焉。
H6  =縱能了事，而亦不可自矜其能。亦不可自伐其功。亦不可驕恃其氣。
H7  =到底若出不得已。此所謂果而不可以取強也。取強者，速敗之道。
H8  =且物壯甚則易老，況兵強乎。凡物恃其強壯而過動者，必易傷。如世人恃強而用力過者，必夭死於力。
    :恃壯而過於酒色者，必夭死於酒色。蓋傷元氣也。元氣傷，則死之速。兵強亦然。故曰是謂不道。
    :不道早已。已者，絕也。又已者，止也。言旣知其為不道，則當速止而不可再為也，亦通。
    :孟子言威天下不以兵革之利，其有聞於此乎。
 
X1  =凡以兵強者，過甚之事也。
X2  =勢極則反，故其事好還。
X3  =師之所處，必蹂踐民物，無不殘掠，故荊棘生。
X4  =大軍之後，殺傷和氣，故五穀疵癘而年歲凶，此必然之勢也。
X5  =然於濟弱扶傾，除暴救民，蓋不得不用之者，惟在善用。已者，休也。果，猶言結果。
    =但可了事令其平服便休，不以此常取強焉。
X6  =縱能了事，而亦不可自矜其能。亦不可自伐其功。亦不可驕恃其氣。
X7  =到底若出不得已。此所謂果而不可以取強也。取強者，速敗之道。
X8  =且物壯甚則易老，況兵強乎。凡物恃其強壯而過動者，必易傷。如世人恃強而用力過者，必夭死於力。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§31 恬淡為上

1 夫佳兵者|不祥之器物|或惡[wù]之|故有道者不處[chǔ]
2 君子|居則貴左|用兵則貴右
3 兵者不祥之器|非君子之器|不得已而用之
4 恬淡為上
5 勝而不美|而美之者 是樂[yào]殺人
6 夫樂[yào]殺人者|不可以得志於天下矣
7 吉事尚左|凶事尚右|偏將軍居左|上將軍居右
8 言居上勢|則以喪禮處之
9 殺人衆多|以悲哀泣之
10 戰勝|以喪[sāng]禮處之

L1  =佳兵，利刃也。然皆所以殺人者。故為不祥。物或惡之者。言兵之所到。禽獸為之驚恐。是物亦惡此兵也。
    =處，用也。有道者之為國。則不輕用此兵也。
L2  =君子，卽有道之人。居，安處也。貴左者，以左為吉也。凡人之執干戈。皆以右手為能。故用兵者。則以右為貴也。
L3  =言兵旣為不祥之器。定非君子所用之器。而何以用之哉蓋如湯之伐毫。文之伐崇。誅無道以安百姓。
    =不得已而用之也。
L4  =恬然無為也。上古聖人。無為而天下治。如皇陶所謂君旣修德。則四凶自化。可以不用刑戮也。故老子曰。
    =恬淡無為。治國者必以此為上也。
L5  =勝，戰勝也。美，盡美也。言爭戰而得勝。則不可為美好而歡樂之也。如以戰勝為美者。是必樂於殺人。
    =而不知美非其美耳。
L6  =孟子云。今有不嗜殺人者。則天下之民。皆引領而望之也。彼好殺人者。人人得而誅之。豈能得志於天下乎。
L7  =此承上而言。吉事，燕饗朝聘之類。凶事，喪葬師旅之事。偏將軍，乃上軍之羽翼也。所以防患救援。保全軍士。
    =故居吉位也。上將軍，運籌幃幄。志在必勝。卽不幸而敗。必以死報君。故居凶位也。
L8  =處之以喪禮者。言上將軍居於凶位。如居喪之禮然也。
L9  =謂不幸而兵敗。則死者甚衆。故以悲哀泣之也。
L10 =一戰而勝。猶以喪禮處之者。明兵器之不祥。國家所深禁也。

H1  +此承上言不以兵強天下，故此甚言兵之不可尚也。
    =佳兵，乃用兵之最精巧者，謂之佳兵。凡善用兵者，必甘心於殺人。兵益佳而禍益深，故為不祥之器。
    =歷觀古今善用兵者，不但不得其死，而多無後。此蓋殺機自絕，而造物或惡之者。以其詐變不正，好殺不仁，
    =故有道者不處。不但有道者不處，而苟有仁心者，亦不處也。何以知其然耶。
H2  =觀夫君子所居則以左為貴，用兵則以右為貴，然右乃凶地。
H3  =由是而知兵者，乃不祥之器，非君子之器也。萬一不得已而用之者。
H4  =老子誡曰，當以恬淡為上。恬淡者，言其心和平，不以功利為美，而厭飽之意。
H5  =旣無貪功欲利之心，則雖勝而不以為美。縱不貪功利，而若以勝為美者，亦是甘心樂於殺人。
H6  =夫樂於殺人者，必不可使其得志於天下。所謂造物或惡之也。若使此輩得志於天下，將為殘害而無涯量矣。
H7  =且世之吉事必尚左。凶事則尚右。凶事，謂喪事也。所以用兵則貴右，言其可哀也。故兵家以偏將軍居左，
    =以上將軍居右者，蓋上將軍司殺之重者。
H8  =言居上勢者，則當以喪禮處之也。
H9  =故殺人衆多，則當以悲哀泣之。
H10 =卽戰勝，亦當以喪禮處之。甚言其不得已而用之，卽不得已而處之也。
    +上二章，通言人臣不能以道佐人主，而返以兵為強者，故切誡之。
 
X1  =佳兵，乃用兵之巧者。必甘心於殺人。兵益佳而禍益深，故為不祥之器。
    :歷觀古今善用兵者，非但不得其死，而多無後。此蓋殺機自絕，而造物或惡之者。
    :以其詐變不正，好殺不仁，故有道者不處。乃至苟有仁心者，亦不處也。
X2  =觀夫君子所居則以左為貴，用兵則以右為貴。
    :右乃凶地。
X3  =其義自明。
X4  =當以恬淡為上。恬淡者，言其心和平，不以功利為美，而厭飽之意。
X5  =夫兵者，雖勝而不以為美。若以勝為美者，則是好殺，何美之有。
X6  =夫樂於殺人者，必不可使其得志於天下。
X7  =且世之吉事必尚左。凶事，喪事也，尚右。故用兵則貴右，言其可哀也。
    =故兵家以偏將軍居左，以上將軍居右者，蓋上將軍司殺之重者。
X8  =言上將軍居於凶位。如居喪之禮然也。
X9  =戰事殺人衆多，當以悲哀泣之。
X10 =卽戰勝，亦當以喪禮處之。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§32 知止不殆

1 道常無名
2 樸雖小 天下不敢臣
3 侯王若能守|萬物將自賓
4 天地相合 以降甘露
5 民莫之令而自均
6 始制有名|名亦旣有|夫亦將知止
7 知止所以不殆
8 譬道之在天下|猶川谷之於江海也

L1  =無名者。道之廣大難名也。
L2  =樸，實也。言能修此道者。守其樸實之資。雖一介草茅。萬乘之君。求與之友而不可得也。而況得而臣之乎。
L3  =侯，諸侯也。王，天子也。言或為諸侯。或為天子。若能守此道者。則萬物皆賓服於他也。
L4  =天地不和。則雨澤不降。為人君者。修道以勷天地之和。天地交泰。而甘露自降也。
L5  =均，如天下國家可均，之均。卽平治也。蓋蒼蒼蒸民。其心不一。若徒以命令驅之。民弗從也。
    =治國平天下者。修道其身。則上行下效。不待命令而自均平矣。
L6  =道立於天地之先。蕩蕩平平。雖為萬姓所共由。而卒無能名之者。惟聖人出。始制有道之名。旣制為道之名。
    =天亦從此而知之。
L7  =惟其知之。所以並行不悖。長存於宇宙間也。
L8  =譬，比也。川之流。不舍晝夜。谷之深。不摧不崩。江海之汪洋。及其不測。故比譬乎道也。

H1  +此承上章不以兵強天下，因言人主當守道無為，則萬物賓而四海服，天地合而人民和，自然利濟無窮也。
    =常者，終古不變之義。凡有名者，必遷變。道之所以不變者，以其無名也。故曰道常無名。
H2  =樸，乃無名之譬。木之未制成器者，謂之樸。若制而成器，則有名矣。小，猶眇小。謂不足視也。
    :且如合抱之材，智者所不顧。若取徑寸以為冠，則愚者亦尊焉。是以名為大，而以無名為小。
    :甚言世人貴名，概以樸為不足視。故以道曰樸曰小也。
    :然道雖樸小，而為天地萬物之本。卽愚夫愚婦，而亦知所尊。
    =故曰天下不敢臣。
H3  =但侯王不能守耳。藉使侯王若能守，則萬物自然賓服矣，奚假兵力哉。然兵者凶器，未必賓服一國。且上
    =干和氣，必有凶年。若以道服之，不但萬物來賓。
H4  =抑且和氣致祥，天地相合以降甘露。
H5  =兵來未必盡和民人，若以道宥之，則民莫之令而自然均調，各遂其生。無名之樸，利濟如此，惜乎侯王不
    =能守之善用耳。若散樸為器，始制則有名矣。
H6  =始，猶方纔也。謂樸本無名，方纔制作，則有名生焉。且從無名而有名。
    =旣有名，而名又有名，將不知其所止矣。
    =莊子所謂從有適有，巧歷不能得，故曰名亦旣有。而殉名者愈流愈下，逐末忘本，不知其返矣。
    =故老子戒之曰，夫名者，不可馳騖而不返。亦將知止而自足。
H7  =苟不知止足，則危殆而不安。知止所以不殆也。
H8  =由是而知道在天下，為萬物之宗，流潤無窮，猶川谷之於江海也。
    =然江海所以流潤於川谷，川谷無不歸宗於江海。
    =以譬道散於萬物，萬物莫不賓服於大道。此自然之勢也。
    :意明侯王若能守，其效神速於此。
 
X1  =常者，終古不變。有名者，必遷變。道之所以常，以其無名也。
X2  =樸，乃無名之譬。木之未制成器者，謂之樸。若制成器，則有名矣。小，猶眇小。謂不足視也。
    =世人以名為大，而以無名為小。然道雖樸小，而為天地萬物之本。
X3  =但侯王不能守耳。藉使侯王若能守，則萬物自然賓服矣，奚假兵力哉。
X4  =天地不和，則雨澤不降。為人君者，修道以勷天地之和。天地交泰，而甘露自降也。
X5  =蒼蒼蒸民，其心不一。若徒以命令驅之，民弗從也。
    =治天下者，修道其身，則上行下效，不令而自均平矣。
X6  =道立於天地之先，雖為萬姓所共由，而卒無能名之者。
    =惟聖人出，始制有道之名。旣制為道之名，天亦從此而知之。
X7  =苟不知止足，則危殆而不安。故知止則不殆也。
X8  =川之流，不舍晝夜。谷之深，不摧不崩。江海之汪洋，及其不測。故比譬乎道也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§33 自勝者強

1 知人者智
2 自知者明
3 勝人者有力
4 自勝者強
5 知足者富
6 強行者有志
7 不失其所者久
8 死而不亡者壽

L1  =人有善惡不均。真假難擇。誠能有知人之哲。聽其言。察其色。觀其行。而誠偽自辨。可謂智矣。
L2  =人多任性。而不自覺其非。誠能時時省察。有過則改。於大道之中。一見了然。可謂明矣。
L3  =我之取勝於人者。惟力足以勝之也。
L4  =自勝者。克伐怨欲之私。我之心有以勝之。不使存乎其中。可謂自強不息也。
L5  =知足，如衛公子荊之為人是也。蓋富不知足其富必傾。石崇之豪富。卒以取敗。故必知足。乃能長保其富也。
L6  =強行者。如人一能之已百之之類。蓋賦性愚者。每甘為人下而不行乎道。誠能勉力行之。可謂有志之士也。
L7  =所，所習之業也。不失其所。謂念茲在茲。釋茲在茲。永遠不忘也。此惟有恆者能之。
L8  =死而不亡者。謂終身不亡乎道也。壽，永久也。言不失此道。則壽自長久。雖沒世而不朽也。

H1  +此因上言侯王當守道無為，故此教以守之之要也。
    =知人者，謂能察賢愚，辨是非，司黜陟，明賞罰，指瑕摘疵，皆謂之智。
H2  =但明於責人者，必昧於責己。然雖明於知人為智，不若自知者明也。
    :老子謂孔子曰，聰明深察而近於死者，好議者也。博辯宏大而危其身者，好發人之惡也。
    :去子之恭驕與智能，則近之矣。謂是故也。
    :莊子云，所謂見見者，非謂見彼也，自見而已矣。所謂聞聞者，非謂聞彼也，自聞而已矣。
    :能自見自聞，是所謂自知者明也。
H3  =世之力足以勝人者，雖云有力。但強梁者必遇其敵，不若自勝者強。然欲之伐性，殆非敵國可比也。
    =力能克而自勝之，可謂真強。
H4  =如傳所云，和而不流，中立而不倚者，所謂自強不息者也。
    :凡貪得無厭者，必心不足。苟不知足，雖尊為天子，必務厚斂以殃民。雖貴為侯王，必務強兵而富國。
    :卽縱適其欲，亦將憂而不足，故雖富不富。
H5  =苟自知足，則鷦鷯偃鼠，藜藿不糝，抑將樂而有餘，此知足者富也。
H6  =強志，好過於人者，未為有志。惟強行於道德者，為有志也。
H7  =所者，如北辰居其所之所。又故有之義，蓋言其性也。
H8  :孟子曰，性者故而已矣。世人貪欲勞形，冀立久長之業。殊不知戕生傷性，旋踵而滅亡，誰能久哉。
    :惟抱道凝神，而復於性真者，德光終古，澤流無窮，此所謂不失其所者久也。
    :世人嗜味養生，以希壽考，殊不知厚味腐腸，氣憊速死，誰見其壽哉。
    =惟養性復真，形化而性常存，入於不死不生，此所謂死而不亡者壽也。
    :老子意謂道大無垠，人欲守之，莫知其向往。苟能知斯數者，去彼取此，可以入道矣。
    :侯王知此，果能自知自勝，知足強行。
    :適足以全性復真，將與天地終窮。不止賓萬物，調人民而已。又豈肯以蝸角相爭，以至戕生傷性者哉。
 
X1  =知人者，謂能察賢愚，辨是非，司黜陟，明賞罰，指瑕摘疵，皆謂之智。
X2  =但明於責人者，必昧於責己。然雖明於知人為智，不若自知者明也。
X3  =世之力足以勝人者，雖云有力。但強梁者必遇其敵，不若自勝者強。然欲之伐性，殆非敵國可比也。
    =力能克而自勝之，可謂真強。
X4  =如傳所云，和而不流，中立而不倚者，所謂自強不息者也。
X5  =苟自知足，則鷦鷯偃鼠，藜藿不糝，抑將樂而有餘，此知足者富也。
X6  =強志，好過於人者，未為有志。惟強行於道德者，為有志也。
X7  =所者，如北辰居其所之所。又故有之義，蓋言其性也。
X8  =惟養性復真，形化而性常存，入於不死不生，此所謂死而不亡者壽也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§34 終不為大

1 大道氾兮其可左右
2 萬物恃之以生而不辭
3 功成不名有
4 愛養萬物而不為主
5 常無欲 可名於小
6 萬物歸焉 而不為主|可名為大
7 是以|聖人終不為大|故能成其大

L1  =氾，洋洋之貌。其可左右者。言大道之洋洋。取之左右逢其原是也。
L2  =萬物恃之而生而不辭。此卽曲成萬物而不遺之意也。蓋玄黃二氣。絪縕凝結。萬物乃得以生。而道之涵容。
    =未嘗或辭其任也。
L3  =功成，謂兩儀分。八卦定。萬象俱備之功已成。不名者，而人猶不知其名也。
L4  =愛，慈仁之德。養，惠澤之恩。言萬物之生。皆賴二氣之長養。日月所照。霜露所隊。而物乃成焉。推其本。
    =皆道之所發。萬物乃有賴。然道亦不自居其主也。
L5  =欲，私欲也。小者，專靜純一也。道之為德。至純至粹。故常無私欲而專靜純一也。
L6  =為萬物之所歸。而不自居其主。故可名之曰大。大者，至極而無以復加也。
L7  =聖人能體此道。常卑牧以自待。故不為大也。然道旣得於身。積於中而形於外。大化聖神。參天位地。
    =竟能成其大也。此以上。言治國當有知人之哲。及自知之明。而謙遜自守。常若不及。乃能成功也。

H1  +此言道大無方，聖人心與道合，故功大無外，以實前侯王能守之效也。
    =氾者，虛而無著之意。以道大無方，體虛而無繫著，故其應用無所不至。故曰其可左右。
H2  =以體虛無物，故生物而不辭。
H3  =以本無我，但任物自生。故生物功成而不名己有。
H4  =以與物同體，故雖愛養萬物而不為主。
H5  =其體所以真常者，以其至淡無味，無可欲也。由無可欲，故不足視，似可名於小。
H6  =若夫萬物歸焉而不為主，則可名為大矣。然小大因物以名之，道豈然耶。
H7  =是以聖人忘形釋智，圖於至細，志與道合，終不為大，故能成其大。
    :若夫侯王專務於大，豈能成其大哉。言外之教，亦深切矣。
 
X1  =氾者，虛而無著之意。以道大無方，體虛而無繫著，故其應用無所不至。
X2  =以體虛無物，故生物而不辭。
X3  =以本無我，但任物自生。故功成而不有。
X4  =以與物同體，故雖愛養萬物而不為主。
X5  =其體所以真常者，以其至淡無味，無可欲也。由無可欲，故不足視，似可名於小。
X6  =若夫萬物歸焉而不為主，則可名為大矣。然小大因物以名之，道豈然耶。
X7  =是以聖人忘形釋智，圖於至細，志與道合，始終不為大，故能成其大。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§35 往而不害
 
1 執大象|天下往|往而不害
2 安平泰 樂[yuè]與餌 過客止
3 道之出口|淡乎其無味
4 視之不足見[jiàn]|聽之不足聞|用之不可旣

L1  =大象，卽大道之象。執，得之也。言得大道之象以教於民。則天下之人。皆無災害也。
L2  =安平，太平無事。國家相安也。太樂，樂之極也。餌，香味也。客止，言宴客留連也。此言太平無事。
    =而民之和樂深味有如此者。
L3  =道之出口。如談仁義禮智之言是也。其言高遠幽深。愚者每視為迂濶。不若小人之言。津津有味也。
L4  =其詞微，則難察。故視之不足見也。道之理深。深則愚者難聞。卽或從事於道者。心不在焉。聽之猶不聞也。
    =用，用此道也。旣，窮也。言道雖無形無影。而終身用之不盡也。

H1  +此明前章未盡之意也。
    =無象，謂之大象。大象無形，而能入衆形，有形者無不歸。
    =聖人執無我以御天下，故天下莫不往，以其與物同體也。萬物恃之以生，故無往而不利，故云往而不害。
    =然忘於物者，物亦忘之，故物各得其所而無不安。
H2  =物物相忘而無競，故無不平。暖然如春，故無不泰。此所謂萬物賓，而天地合，人民和，故聖人終不為大，
    =而能成其大也。
H3  =前云道之所以常者，以其淡然無味，無可欲也。若夫樂之於耳，餌之於口，皆有味而可欲者。
    =若張之於途，雖過客亦止之。然雖暫止，而不能久留，以其用之有盡，蓋不常也。
    =若夫道之出口，則淡乎無味，不若餌之可欲。
H4  =視之不足見，聽之不足聞，不若樂之可欲。此可名於小。然而其體真常，故用之不可旣。旣，盡也。
    =故可名為大。此大象之譬，以譬人君苟能執大象以御天下，恬淡無為。
    =雖無聲色以悅天下之耳目。無貨利以悅天下之心志。
    =而天下歸往樂推而不厭。此所謂萬物歸焉而不為主，可名為大也。如此用之，豈有盡耶。

X1  =無象，謂之大象。大象無形，而能入衆形，有形者無不歸。
    =忘於物者，物亦忘之，故物各得其所而無不安。
X2  =物物相忘而無競，故無不平。暖然如春，故無不泰。此所謂萬物賓，而天地合，人民和，故聖人終不為大，
    =而能成其大也。
X3  =道之所以常者，以其淡然無味，無可欲也。若夫樂之於耳，餌之於口，皆有味而可欲者。
    =若夫道之出口，淡乎無味，不若餌之可欲。
X4  =此三者可名於小。然而其體真常，故用之不可旣。旣，盡也。故可名為大。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§36 以柔克剛

1 將欲翕[xī]之 必固張之
2 將欲弱之 必固強之
3 將欲廢之 必固興之
4 將欲奪之 必固與之
5 是謂微明
6 柔弱勝剛強
7 魚不可脫於淵
8 國之利器 不可以示人

L1  =蹹，納之於內也。張，顯之於外也。言欲納此道於心。而必固張顯之也。
L2  =弱，柔也。強，剛也。固，堅固也。言欲修此道於柔。必固其自強之力也。
L3  =將欲廢之者。言心志怠荒。欲廢此道。必堅固其心以興之也。
L4  =奪，取也。與，授也。言人欲取此道。而我必固以道與之也。
L5  =微，隱微也。言誠能如此。則隱微之中。亦可無愧。而道益明矣。
L6  =柔之可以勝剛。弱之可以勝強者。如水之勝火然也。
L7  =魚，淵中之物。若離脫於淵則立見其死也。
L8  =利器，如奇珍異寶之類，君若以利示人。則上下交征利。而國危矣。

H1  +此言物勢之自然，而人不能察，教人當以柔弱自處也。天下之物，勢極則反。譬夫日之將昃，必盛赫。
    +月之將缺，必極盈。燈之將滅，必熾明。斯皆物勢之自然也。
    =故固張者，翕之象也。
H2  =固強者，弱之萌也。
H3  =固興者，廢之機也。
H4  =固與者，奪之兆也。
H5  =天時人事，物理自然。第人所遇而不測識，故曰微明。
H6  =斯蓋柔弱勝剛強之義耳。
H7  =譬夫淵為魚之利處，但可潛形而不可脫。脫則塊然無能為。
H8  =柔弱為國之利器，人主但可恭默自處，不可揭示於人。
    :示人則致敵而招侮，將反見其不利也。夫是之謂微明。世之觀此章，皆謂老子用機智，大非本指。
    :蓋老子所以觀天之道，執天之行是已。殆非機智之端也。
 
X1  =蹹，納之於內也。張，顯之於外也。言欲納此道於心，而必固張顯之也。
X2  =弱，柔也。強，剛也。固，堅固也。言欲修此道於柔，必固其自強之力也。
X3  =將欲廢之者。言心志怠荒。欲廢此道，必堅固其心以興之也。
X4  =奪，取也。與，授也。言人欲取此道，而我必固以道與之也。
X5  =微，隱微也。言誠能如此。則隱微之中，亦可無愧，而道益明矣。
X6  =柔之可以勝剛。弱之可以勝強者，如水之勝火然也。
X7  =譬夫淵為魚之利處，但可潛形而不可脫，脫則塊然無能為。
X8  =柔弱為國之利器，人主但可恭默自處，不可揭示於人。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§37 不欲自正

1 道常無為|而無不為
2 侯王若能守|萬物將自化
3 化而欲作
4 吾將鎮之|以無名之樸
5 無名之樸|亦將不欲
6 不欲以靜|天下將自正

L1  =道本無為。而推及於萬事。則無不為也。如孔子曰。無為治者。其舜也與。然舜之治天下。豈真無為哉。
    =其所以明四目。達四聰者。蓋納天下之善言善行而為之也。
L2  =世之天子諸侯。若能守此道。而念念不忘。推及於天下。則萬物將自化醇也。
L3  =然民風旣醇。久則逸。逸則私欲之念復生也。
L4  =鎮者、言道之鎮乎天地萬物也。無名之樸。卽道予人本來樸實之性也。此道君言民心若有疎虞。卽以道鎮之。
    =使各反其本然之性。而樸實是尚也。
L5  =此言旣反其本然樸實之性。則民亦將行乎道。而去其私欲也。
L6  =私欲旣去。而此心至靜無動。則四海文明。天下自定也。

H1  +此教人君乘流救弊之意也。
    =以其道常無為而無不為，故侯王但能守之者，而萬物不期化而自化矣。
H2  =此言守道之效，神速如此。然理極則弊生。且而物之始化也皆無欲。
H3  =化久而信衰情鑿，其流必至於欲心復作。
H4  =當其欲作，是在人君善救其弊者，必將鎮之以無名之樸，而後物欲之源可塞也。若施之以有名，則不濟耳。
H5  =然無名之樸，雖能窒欲，若執此而不化，又將為動源矣。譬夫以藥治病，病去而藥不忘，則執藥成病。
    =故云無名之樸，亦將不欲。
H6  =此亦不欲，則可專以靜而制群動，無敢作者。故云天下將自正。自正者，謂不待正而自正矣。
    :鎮，猶壓也。如石壓草，非不生也。蓋以無名之樸，鎮壓之而已。若欲樸之心，亦是欲機未絕。是須以靜制之，
    :其機自息。機息則心定，而天下自正矣。故雖無名之樸，可用而不可執，況有名乎。 

X1  =以其道常無為而無不為，故侯王但能守之者，而萬物不期化而自化矣。
X2  =此言守道之效，神速如此。然理極則弊生。且而物之始化也皆無欲。
X3  =化久而信衰情鑿，其流必至於欲心復作。
X4  =當其欲作，是在人君善救其弊者，必將鎮之以無名之樸，而後物欲之源可塞也。若施之以有名，則不濟耳。
X5  =然無名之樸，雖能窒欲，若執此而不化，又將為動源矣。譬夫以藥治病，病去而藥不忘，則執藥成病。
    =故云無名之樸，亦將不欲。
X6  =此亦不欲，則可專以靜而制群動，無敢作者。故云天下將自正。自正者，謂不待正而自正矣。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§38 上德不德

1 上德不德 是以有德
2 下德不失德 是以無德
3 上德無為 而無以為
4 下德為之 而有以為
5 上仁為之 而無以為
6 上義為之 而有以為
7 上禮為之 而莫之應
8 則攘[rǎng]臂而仍之
9 故失道而後德|失德而後仁|失仁而後義|失義而後禮
10 夫禮者|忠信之薄[bó]|而亂之首也
11 前識者道之華|而愚之始
12 是以大丈夫|處其厚不居其薄[bó]|處其實不居其華|故去彼取此

L1  =上德、謂積德之厚。而居於上位也。不德、言謙遜自處。不自以為德也。蓋謙尊而光。是以能有乎德也。
L2  =下、臣民也。不失德者。謂在下之人。雖有是德。而不以失德為可憂。則德必至於喪失。是以謂之無德也。
L3  =言在上之德。靜而不動。固無所作為然萬端充盡。亦不待作為而德自備也。
L4  =言在下之人。動而難靜。固其德必有為。然兢兢不遑。亦有其事而為之也。
L5  =仁、慈愛也。言在上者。施慈愛之德於民。雖有所為。不過存於身心之內。而仁風廣播。則仍不待作為而治也。
L6  =義者、事之宜。上好義、則民易治也。然義之道。必施於行事之間乃見。故為之而遂見其有以為也。
L7  =禮、規矩法度也。上所行之禮。形於威儀容止之間。彼在下者莫不親之畏之。悉應從而效法之也。
L8  =攘臂、謂振臂相從也。仍、因也。言上之好仁好義好禮。則民亦攘臂相從。因而效法於上也。
L9  =失、非得失之失。當與充實之實同。猶足也。德者、道之功效也。言充足夫道。而後有其功德也。仁、心之主。
    =德之光也。旣充足夫德。而德光發外。乃為仁也。義、仁之經也。旣充足乎仁。而事乃合宜。
    =方不悖乎常經也。。禮、義之節文也。旣能行事合義。而後節文乃彰也。
L10 =禮之節文。皆尚夫外忠信存諸心者。卽本質也。言禮之興也。風化日衰。遂徒尚乎文。而不存其質。
    =故為忠信之薄也。亂、作亂也。首、初也。徒事繁文。卽為亂之首也。
L11 =前識者。卽先覺也。道之華者。言先覺者之制禮。所以增道之光華也。然後之人。遂徒務於外。而不存諸內。
    =愚而不明夫道者日多。故曰愚之始也。
L12 =大丈夫。如孟子言窮則獨善其身。達則兼善天下之人。厚、卽道也。薄、卽禮儀也。實、忠信也。華、虛文也。
    =言丈夫之所為。甯可道有餘。而禮儀不足。甯可存忠信。而不務虛文。蓋恐敗壞世風。故去末而存本也。

H1  +此言世降道衰，失真愈遠，教人當返其本也。所言道，乃萬物之本。德，乃成物之功。道為體而德為用。
    +故道尊無名，德重無為。故道言有無，而德言上下。此道德之辨也。
    =上德者，謂上古聖人，與道冥一，與物同體。雖使物各遂生，而不自有其德。以無心於德，故德被群生，
    =終古不忘。故云上德不德，是以有德。
H2  =下德者，謂中古以下，不知有道，但知有德。故德出於有心，自不能忘。且有責報之心，物難感而易忘。
    =故云下德不失德，是以無德。失，忘也。以，恃也。
H3  =然上德所以有德者，以德出無為。功成事遂，而無恃為之心，故云無以為。
H4  =下德所以無德者，以德出有心。而又矜功恃為，故云有以為。
    :由是觀之，道無真偽，而德則有真有偽矣。此世數淳薄之辨也。德又下衰，上德不稱，而下德為尊，於是
    :始有仁義之名。然仁義皆出於不德，故皆不免有心為之。
H5  =但上仁雖為，而無恃為之心，故云無以為。
H6  =上義則恃之矣，故云有以為。
    :且仁義上者為真，三王是已。下則為假，五霸是已。故不足言。此又下衰，仁義之下，則禮為上矣。
H7  =禮則但以虛名相尚，不復知有仁義，故上禮為之，有莫之應者。
    :如孔子作春秋，雖正名分，而卒莫能正，此莫之應也。
H8  =不唯不應，且將臂攘而仍之。
    :此五霸之餘，戰國之習也。
    =且彼旣不知仁義，則必相因而報復之矣。仍，相因之意。又復也。
    :此所以為忠信之薄，而亂之首也。故其德下衰，至此已極，聖人亦無可為天下之具矣。
H9  =故失道而後德。失德而後仁。失仁而後義。失義而後禮。
H10 =故禮乃忠信之薄，為亂之首也。
    :所以愈流愈下者，乃用智之過也。
H11 =前識，猶言蚤智，謂明見利害於未然者。
    :然蚤智在孔子，則為周身之防，所謂明哲保身之意。其次則如范蠡樂毅之儔，以為避名全節之計。又其次
    :則為儀秦縱橫遊說之流矣。然在聖人，則謂之權。在樂范，則謂之好高而務名。名者實之賓，故謂道之華。
    :在儀秦用之，則為愚之始也。
H12 :此所謂才智，君子用之則成名，小人用之則殺身，豈非愚之始耶。故太上以道德為尊，而仁義次之。
    =故大丈夫處厚而不處薄。務實而不務華。故去彼取此。
 
X1  +道，乃萬物之本。德，乃成物之功。道為體而德為用。故道尊無名，德重無為。
    +故道言有無，而德言上下。此道德之辨也。
    =上德者，謂上古聖人，與道冥一，與物同體。
    =雖使物各遂生，而不自有其德。以無心於德，故德被群生，終古不忘。
X2  =下德者，謂中古以下，不知有道，但知有德。故德出於有心，自不能忘。
    =且有責報之心，物難感而易忘。故云下德不失德，是以無德。失，忘也。
X3  =然上德所以有德者，以德出無為。功成事遂，而無恃為之心，故云無以為。
X4  =下德所以無德者，以德出有心。而又矜功恃為，故云有以為。
X5  =但上仁雖為，而無恃為之心，故云無以為。
X6  =上義則恃之矣，故云有以為。
X7  =禮則但以虛名相尚，不復知有仁義，故上禮為之，有莫之應者。
X8  =不唯不應，且將臂攘而仍之。且彼旣不知仁義，則必相因而報復之矣。仍，相因之意。又復也。
X9  =故失道而後德。失德而後仁。失仁而後義。失義而後禮。
X10 =故禮乃忠信之薄，為亂之首也。
X11 =前識，猶言蚤智，謂明見利害於未然者。
X12 :此所謂才智，君子用之則成名，小人用之則殺身，豈非愚之始耶。故太上以道德為尊，而仁義次之。
    =故大丈夫處厚而不處薄。務實而不務華。故去彼取此。
    =厚，卽道也。薄，卽禮儀也。實，忠信也。華，虛文也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§39 賤為貴本

1 昔之得一者
2 天得一以清
3 地得一以寧
4 神得一以靈
5 谷得一以盈
6 萬物得一以生
7 侯王得一以為天下正
8 其致之一也
9 天無以清 將恐裂
10 地無以寧 將恐發[廢]
11 神無以靈 將恐歇
12 谷無以盈 將恐蹶[jué]
13 萬物無以生 將恐滅
14 侯王無以正|而貴高將恐蹶
15 故貴以賤為本|高以下為基
16 是以|侯王自謂孤寡不穀[gǔ]
17 此其以賤為本耶 非乎
18 故致數[shuò]車 無車
19 不欲碌[lù]碌如玉 珞珞[luò]如石

L1  =昔、天地未判之前也。一、道之子。天地之宗也。道乃生一。故言昔之得一也。
L2  =清、明也。輕清之氣。上浮者為天。而天之所以輕清者。得一陽之氣而成故耳。
L3  =寧、靜鎮也。重濁之氣。下沈者為地。然地亦得純陰之一炁。故山岳鎮靜。而無崩頹之患也。
L4  =神、聰明正直而一者也。故曰得一。言神必得一氣相通。乃能靈爽不昧也。
L5  =谷、深谷也。盈、滿也。言深谷之處。必得一氣之道存乎其間。然後衆派歸之。乃能盈滿也。
L6  =萬物、萬有不齊之物也。凡物之生。必天地交泰。二炁合而為一乃能生生不已也。
L7  =為天子諸侯者。必承天之命以一心為主。心之所存者純一不雜。則天下之人。自歸於正矣。
L8  =致、極也。推而論其至極之意。
L9  =言觀象於天。若損其一道。則天無以清。而將崩裂也。
L10 =發、傾也。無以寧。謂地失一道。則地不能寧。而將傾地也。
L11 =歇、止也。神無以靈。謂神失其一道。則不能昭其靈應。而人之祭祀將止也。
L12 =竭、枯也。言深谷之中。無一道以相統。則水自不能盈滿。而將有枯竭之患也。
L13 =滅、絶也。萬物無以生。謂天地不和。無一道以生物。則萬物必滅。而無以為世界也。
L14 =蹙、顛覆也。若失其一道。則無以為貴高。而衆叛親離其位必將至於顛覆也。
L15 =貴、如侯王之貴賤庶民也。蓋得乎邱民為天子。故位高者。必以賤為本。乃能成其貴也。高、上也。下、卑也。
    =基、業也。言欲道之高。必卑下以自牧。欲位之高者。亦必以下為基業也。
L16 =此承上而言。孤寡不轂。皆侯王自謙之詞也。謂居上位而猶自謙者。卽以賤為本之意。蓋不以勢凌賤也。
L17 =乎者。疑詞也。言明知以賤為本。而猶以為非乎。
L18 =數車、貴者也。無車、賤者也。
L19 =琭琭、光華也。落落、無光也。極而論之。貴者之與賤者共處。如玉與石相參。一見而知之也。 

H1  +此言道無為而無不為，以明無用之用為大用。欲君人者，當以無為而治也。一者，道之體也。其體至虛而
    +無為，精一無二。
    =凡諸有為，莫不以之為本。以，用也。意謂天地萬物，皆以道體而為本也。
H2  =故天得之而清覆於上。
H3  =地得之而寧載於下。
H4  =神，指人心而言。謂人得之而為萬物之靈。
H5  =谷，卽海也。海得之而容納百川，故長盈。
H6  =萬物得之而各遂其生。
H7  =侯王得之而為天下正。正，猶長，所謂君長也。
H8  =如此者，雖其跡不同，而推其本則一，故曰致之一也。
H9  =其下又返釋之曰，天不得此，將恐分裂而不能圓覆於上矣。
H10 =地不得此，將恐發動而不能寧載於下矣。
H11 =人不得此，將恐生機休歇，而不能子子孫孫亹亹而無窮矣。
H13 =萬物若不得此，將恐絕滅而無有矣。
H14 =侯王若不得此，將恐顛蹶而不能安其貴高之位矣。
    +此老子主意，只重在侯王無以正而貴高將恐蹶這一句。必欲人君當體道無為而治耳。凡人聽其所用而從於人者，
    +謂之下賤。此道之譬也。夫道本無名，故天地萬物皆得而用之。如人之下賤也。且侯王不得此道，而處貴高之位，
    +將恐蹶。豈不以是而為基本耶。
H15 =故云貴以賤為本，高以下為基。
H16 =且侯王自謂曰，孤，寡，不穀，此三名者，皆賤者之稱也。
H17 =而侯王以之，其意豈不是以賤為本耶，非乎。
    :所以稱此者，正欲人君忘其貴高之名，而體道凝神，知其無用為用耳。且而侯王所以貴高者，以百官執事
    :總之而為君。若指其所用，而各有所事。至若人君，則無所用其事矣。所謂臣道有為，而君道無為也。
H18 =若夫輪輻衡軛，會之而為車。故數其車，則件件可數。其車則無可數矣。以無可數，故得車之用。
H19 :是故侯王以無為之道，而後方大有為也。然道之在物，本無貴賤高下之分。故侯王當體道忘懷，不可執貴
    =高之名，而取顛蹶之患。故誡之曰，不欲琭琭如玉，落落如石，謂不可視己琭琭如王之貴，視物落落如石之賤也。
    :苟忘貴賤之分，則人人皆為我用矣。豈非無用之為大用耶。
 
X1  =昔，天地未判之前也。一，道之子，天地之宗也。道乃生一。故言昔之得一也。
X2  =清，明也。輕清之氣，上浮者為天。而天之所以輕清者，得一陽之氣而成故耳。
X3  =寧，靜鎮也。重濁之氣，下沈者為地。然地亦得純陰之一炁，故山岳鎮靜，而無崩頹之患也。
X4  =神，聰明正直而一者也，故曰得一。言神必得一氣相通，乃能靈爽不昧也。
X5  =谷，深谷也。盈，滿也。言深谷之處，必得一氣之道存乎其間。然後衆派歸之，乃能盈滿也。
X6  =萬物，萬有不齊之物也。凡物之生，必天地交泰，二炁合而為一乃能生生不已也。
X7  =為天子諸侯者。必承天之命以一心為主。心之所存者純一不雜，則天下之人，自歸於正矣。
X8  =雖跡不同，而推其本則一。
X9  =言觀象於天。若損其一道，則天無以清，而將崩裂也。
X10 =發，傾也，無以寧。謂地失一道，則地不能寧，而將傾地也。
X11 =歇，止也。神無以靈，謂神失其一道。則不能昭其靈應，而人之祭祀將止也。
X12 =竭，枯也。言深谷之中，無一道以相統，則水自不能盈滿，而將有枯竭之患也。
X13 =滅，絶也。萬物無以生，謂天地不和。無一道以生物，則萬物必滅，而無以為世界也。
X14 =蹙，顛覆也。若失其一道，則無以為貴高，而衆叛親離其位必將至於顛覆也。
X15 =貴，如侯王之貴賤庶民也，蓋得乎邱民為天子。故位高者，必以賤為本，乃能成其貴也。
    =高，上也。下，卑也。基，業也。言欲道之高，必卑下以自牧。欲位之高者，亦必以下為基業也。
X16 =此承上而言。孤寡不轂，皆侯王自謙之詞也，謂居上位而猶自謙者。卽以賤為本之意，蓋不以勢凌賤也。
X17 =言明知以賤為本，而猶以為非乎。
X18 =數車，貴者也。無車，賤者也。
X19 =琭琭，光華也。落落，無光也。極而論之，貴者之與賤者共處。如玉與石相參，一見而知之也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§40 有生於無
 
1 反者道之動
2 弱者之用
3 天下之物|生於有|有生於無

L1  =反、逆也言道之微。靜則順。而動則逆也。
L2  =弱柔也。道有剛柔。惟柔可以制萬物。故行道者。必以柔為用也。
L3  =有者有此道也。蓋天地旣分。八卦定位。有道存乎其間而萬物乃生也。
    =無極生太極。太極有象。而無極無象。是有生於無也。 

H1  +此承上章以明道為天地萬物之本也。
    =反者，道之體也。謂道體虛無至靜，為群動之主。
    :世人祇知動之為動，不知動處卽靜。易云天下之動，貞夫一者也。以其群動之動，皆自虛無至靜而發，
    :不動而動，故云反者道之動也。
H2  =然道體至虛，柔弱無用，而為天下有用之本。
    :世人祇知有用之用，不知無用之用為大用也。故云弱者道之用。
H3  =是故世人祇知天下之物生於有，而不知有生於無也。
    :苟知有生於無，則自然不事於物，而能體道凝神矣。豈易得哉。
 
X1  =反者，道之體也。謂道體虛無至靜，為群動之主。
    :世人祇知動之為動，不知動處卽靜。
X2  =然道體至虛，柔弱無用，而為天下有用之本。
    :世人祇知有用之用，不知無用之用為大用也。
X3  =是故世人祇知天下之物生於有，而不知有生於無也。
    :苟知有生於無，則自然不事於物，而能體道凝神矣。豈易得哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§41 大器晚成

1 上士聞道 勤而行之
2 中士聞道 若存若亡
3 下士聞道 大笑之|不笑 不足以為道
4 故建言有之
5 明道若昧
6 進道若退
7 夷道若類
8 上德若谷
9 大白若辱
10 廣德若不足
11 建德若偷
12 質貞若渝[yú]
13 大方無隅[yú]
14 大器晚成
15 大音希聲|大象無形
16 道隱無名
17 夫惟道 善貸且成

L1  =上士、卽見善如不及。見不善如探揚之士。聞道者。得聞此道也。勤、孜孜矻矻之意言聞之而卽行。
    =不敢怠惰自安也。
L2  =中士、卽中材也。或存或亡。如或日一至焉。或月一至焉。而心不能堅定也。
L3  =下士、卽下愚不肖之類。言愚不肖之人。惟利是貪。惟私是存。間聞君子之大道。必笑其迂濶而不為也。
　  =言道存乎天壤。必有毀謗者之笑謔。而道無所虧。乃能成其為道也。
L4  =建言、建功立業之言、有之者卽有合於斯道也。
L5  =明道者。如帝典所言。克明峻德是也。若昧者。若道行高深。使人莫測。如夫子之牆萬仞。人不得而窺之也。
L6  =進道、如君子之上達。道日進於高明也。若退者。言學問旣深。而涵養有素。其謙遜涵容。若無知之貌也。
L7  =夷道者、異端之道。若類者、言小人竊君子之行。而飾之於外。儼若與道同類也。此承上中下之士而言。
L8  =上德、謂高出於萬類之德。若谷者言如空谷之幽深也。
L9  =大德者、言聖人之德。與天地參之謂也。若辱者。言常存羞惡之心。恐德有所虧。忝居大德之名。而為人所羞辱也。
L10 =廣德、謂使天下之民物。咸沾其德也。。若不足者。如修已以安百姓。堯舜其猶病諸之意。蓋恐德之未廣也。
L11 =建、樹立也。偷、薄也。言有道者所樹之德業。愚者觀之。儼若偷薄也。
L12 =質、姿質。渝、過也。言本然之質。至真至實。若愚者然。惟恐有過於道也。
L13 =方者必有隅。無隅、謂大而難見其隅也。
L14 =器之小者。工少而成速。若夫大者。非一朝一夕所能成。必待積日累月。故曰大器晚成也。
L15 =大音、虛無自然之音也。希、少也。言其聲音之大者。必不輕易鳴也。大象。如太極之包羅天地。其象至大也。
    =又誰得見其形乎
L16 =道之隱微。人所難見。故不可得而名之也。
L17 =唯獨也。言獨有此道也。貸、假之於人也。成、成功也。言道不棄於人。但有能修之者。卽與以自然之理。
    =而成其功也。以上言道之旨如此。

H1  +此言道出常情，而非下愚小智之所能知，必欲上根利智可能入也。
    =謂上根之人，志與道合，一有所聞，便身體而力行之。
    :如顏子聞者未嘗不知，知之未嘗不行。故曰上士聞道，勤而行之。
H2  =若夫中人之資，則且信且疑，或日月至焉。故曰若存若亡。
H3  =至若下根之士，卽有所聞，了不相蒙，而且以為怪。故大笑之矣。以道出常情，非愚所測。此輩不笑，不足以為道。
    :以其道與常情，每相反而已矣。何以知之。
H4  =故古之建言者有云。
    +此下十二句，皆古之立言者之辭，老子引之以明相反之意。
H5  =謂小人用智，恃知以為能。聖人光而不耀，以有智而不用。故明道若昧。
H6  =小人矜誇競躁。聖人以謙自守，以卑自牧。故進道若退。
H7  =世人崖嶷自高。聖人心與道合，同塵混俗，和而不同。故夷道若類。
H8  =世人局量扁淺，一毫不容。聖人心包天地，德無不容，如海納百川。故上德若谷。
H9  =小人內藏瑕疵，而外矯飾以為潔。聖人純素貞白，一塵不染，而能納汙含垢，示同庸人。故大白若辱。
H10 =小人一德不忘，必恃自多而責報於人。聖人德被群生，而不以為功。故廣德若不足。
H11 =小人一善之長，必衒弄自售，欲求知於人。聖人潛行密用，凡有所施於人者，惟恐人之知己也。
    :如泰伯三讓，民無德而稱。故建德若偷。
H12 =小人隨時上下，見利而趨，望勢而變。聖人之心，貞介如玉，而不可奪。而能與世浮沉，變化無窮，無可不可。
    =故質貞如渝。渝，變也。
H13 =世人圭角自立，一定而不化。聖人心如太虛，無適不可。故大方無隅。隅，猶定向也。
H14 =世人小智自用，以圖速效。聖人深畜厚養，藏器於身，待時而動。迫不得已而後應，乘運而出，必為天下之利具。
    =故大器晚成。
H15 =所以然者，譬夫大音之希聲，大象之無形，殊非常情之所易見易聞。宜乎下士聞而大笑之也。以其世之所尚者，名也。
H16 =然道隱於無名，又豈常情所易知耶。所以聖人之廣大難測者，以其有大道也。
H17 =夫惟道也，萬物皆往資焉而不匱，曲成萬物而不遺。故曰善貸且成。聖人如此，所以世人皆以大似不肖。
    =而輕笑之。然不笑，不足以為道也。

X1  =上根器者聞道，卽勤而行之。
X2  =中根器者聞道，且信且疑。
X3  =下根器者聞道，了不相蒙，怪而笑之。若此輩不笑，則不足以為道。不大笑，不足為大道也。
X4  =故古之建功立言者得言。
X5  =小人用智，恃知以為能。聖人光而不耀，以有智而不用。
X6  =小人矜誇競躁。聖人以謙自守，以卑自牧。
X7  =夷者，異端。正邪種種，各各依類而聚。
X8  =世人局量扁淺，一毫不容。聖人心包天地，德無不容，如海納百川。
X9  =小人內藏瑕疵，而外矯飾以為潔。聖人純素貞白，一塵不染，而能納汙含垢，示同庸人。
X10 =小人一德不忘，必恃自多而責報於人。聖人德被群生，而不以為功。
X11 =小人一善之長，必衒弄自售，欲求知於人。聖人潛行密用，凡有所施於人者，惟恐人之知己也。
X12 =小人隨時上下，見利而趨，望勢而變。聖人之心，貞介如玉，而不可奪。與世浮沉，變化無窮，無可不可。渝，變也。
X13 =世人圭角自立，一定而不化。聖人心如太虛，無適不可。隅，猶定向也。
X14 =（晚，或當作免。試如此解。）小人器度微小，行雞鳴狗盜。聖人器度恢宏，海納百川。
X15 =聲音之大者，必不輕鳴也。其象至大，誰得見其形乎。
X16 =道隱於無名，又豈常情所易知耶。以聖人之廣大難測者，以其有大道也。
X17 =貸，假之於人也。道也，萬物皆往資焉而不匱，曲成萬物而不遺。而世人皆以大似不肖。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§42 損之而益

1 道生一|一生二|二生三|三生萬物
2 萬物負陰而抱陽
3 沖氣以為和
4 人之所惡[wù]|唯孤寡不穀[gǔ]|王公以為稱[chēng]
5 故物或損之而益|或益之而損
6 人之所教[jiào] 我亦教之
7 強梁者不得其死
8 吾將以為教父

L1  =道凝而為天。天、一數也。故曰道生一也。
　  =天一地二。地者承天而生。故一生二也。
    =天地陰陽。二氣相合。乃生物焉。生三者。震一索而得男。故謂之長男。坎再索而得男。故謂之中男。艮
    =三索而得男。故謂之少男。其數三也。
    :巽一索而得女。故謂之長女。離再索得女。故謂之中女。兌三索得女。故謂之少女。數亦三也。三陰三陽。
    =皆二氣所生。故曰二生三也。言有此三陰三陽。乃生萬物。如周易繫辭所言乾為天為父以下之謂也。
L2  =此言萬物之生。必從陰而出。抱陽者。必賴陽氣以育之也。
L3  =沖、上昇也。言天氣下降。地氣上騰。二氣乃相和也。
L4  =幼而無父曰孤。老而無夫曰寡。不轂、言命之薄。忝食五穀之意。此三者。人之所惡。恒情也。而王公自稱。
    =則曰孤曰寡曰不轂。殆自謙之詞。惟能自謙。故民從而歸之也。
L5  =物、兼萬類而言。日中則昃。月盈則蝕。日月且然。而況於人乎。故損久則益。益久則損。一定不移之理也。
L6  =人之所教。言人有善行。而指陳於我也。我亦教之者。謂我有善行。亦舉以教誨於人。相規勸善之意也。
L7  =強梁者、凶惡之人。不得其死。如子路行行如也。竟不得其死然之意。蓋強梁好勝。則必遇其敵。終有殺身之禍也。
L8  =吾、老子自謂。教父者。言教化百姓。如父母之保赤子也。 

H1  +此承前言道體沖虛，而為天地萬物之本，誡人當以道為懷，以謙自處也。
    =謂道本無名，強名之一。故曰道生一。然天地人物，皆從此生。故曰一生二，二生三，三生萬物。
H2  =是則萬物莫不負陰而抱陽也。
H3  =所以得遂其生，不致夭折者，以物各含一沖虛之體也。和氣積中，英華昭著，秀實生成，皆道力也。
    =故云沖氣以為和。是則物物皆以沖虛為本也。
H4  :且沖虛柔弱，與物不類，似乎無用，人皆惡之而不取。殊不知無用之用為大用也。
    =卽如世人之所惡者，唯孤寡不穀，以為不美。而王公返以此為稱者，豈不以柔弱為天下之利器耶。
H5  =且孤寡不穀，皆自損之辭也。然而侯王不自損，則天下不歸。
    :故堯舜有天下而不與，至今稱之，澤流無窮，此自損而人益之。故曰或損之而益。若夫桀紂以天下奉一己，
    :暴戾恣睢，但知有己，而不知有人。故雖有天下，而天下叛之，此自益者而人損之。故曰或益之而損。
H6  =以人人皆具此道，但日用不知，須待教而後能。且人之所教者，我亦未嘗不教之也。
H7  =惟人不善教人，祇知增益知見，使之矯矜恃氣，好為強梁。殊不知強梁者，不得其死。我唯教人以日損其欲，
    =謙虛自守，以全沖和之德。
H8  =是故吾將以為教父。而風天下以謙虛之德也。教父，猶木鐸意。
 
X1  =道凝為天。地承天生。天地陰陽，二氣相合，物乃生焉。
X2  =萬物之生，必從陰出，而賴陽之育也。
X3  =得生者，含沖虛之體也。和氣積中，英華昭著，秀實生成，皆道力也。物以沖虛為本。
X4  =沖虛柔弱，與物不類，譬孤寡不穀，似乎無用，人皆惡之而不取。王公以之為稱，迺以柔弱為天下之利器也。
X5  =孤寡不穀，皆自損之辭也。然侯王不自損，則天下不歸。若或有天下，但知有己，不知有人，衆起叛之。是自益而損也。
X6  =人所教之善行，雖不及道，我亦教之。
X7  =此二句之帛书行文乃“强良者不得死，我将以为學父”。
X8  =此二句當謂，教人從善者得善報，我將以之為師。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§43 不言之教

1 天下至柔|馳騁天下之至堅
2 無有入無間|吾是以知無為之有益
3 不言之教|無為之益|天下希及之

L1  =天下之人。紛紛不一。上之教化行。而下之風俗化。以此觀之。可見民心之至柔也馳騁驅逐也。言在上者。
    =不施德教。而徒以命令驅逐於天下。則民不遵從至堅難化也。
L2  =無有人、言行道之無其人也。無間、不輟也。言未見有行道而無間斷者也。知無為之有益。言在上者。誠能修德。
    =則無為而天下治。故有益也。
L3  =不言之教、謂在上者。不待言語之教誨。而民之聞風感發也。無為言在上者。不待身力之作為。而民自然興起。
    =其益莫大焉。希少也。言此二者。天下少有能及之者也。 

H1  +此承上言無為之益，以明不言之教也。
    =然天下之至堅，非至柔不足以馳騁之。如水之穿山透地，浸潤金石是已。
H2  =若以有入有，卽相觸而有間。若以空入有，則細無不入。如虛空偏入一切有形，卽纖塵芒芴，無所不入，
    =以其虛也。若知虛無之有用，足知無為之有益矣。
H3  :前云人不善教人者，以其有言也。有言則有跡，有跡則恃智，恃智則自多。自多者則矜能而好為。
    :凡好為者必易敗。此蓋有言之教，有為之無益也。
    =如此，則知不言之教，無為之益，天下希及之矣。

X1  =然天下之至堅，非至柔不足以馳騁之。
X2  =若以有入有，卽相觸而有間。若以空入有，則細無不入。
    =如虛空偏入一切有形，卽纖塵芒芴，無所不入，以其虛也。
    =若知虛無之有用，足知無為之有益矣。
X3  :前云人不善教人者，以其有言也。有言則有跡，有跡則恃智，恃智則自多。
    :自多者則矜能而好為。凡好為者必易敗。
    :此蓋有言之教，有為之無益也。
    =如此，則知不言之教，無為之益，天下希及之矣。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§44 知止不殆

1 名與身 孰親
2 身與貨 孰多
3 得與亡 孰病
4 甚愛必大費|多藏必厚亡
5 知足不辱|知止不殆|可以長久

L1  =名、謂人之稱揚於我者。身、卽吾之形體。親、猶重也。言身修而后名立。若身不修。而徒以名傳。是亦虛名已耳。
    =名馬有如身之重哉。
L2  =貨、財也與貨孰多者。言身之與貨財。誰多誰寡也。
L3  =得者、得之於身。亡者、失之也。病、不善也。言得之與失。誰是誰非也。此三句。言輕重多寡善惡。一見自明。
    =不待想而知也。
L4  =甚、過也。費、棄也。言人之所愛。若過於常。則愛必不久終而亦棄也。
    =多藏。謂財物所藏之多也。厚亡。言所失者必多也。此貨悖而入。亦悖而出之意。
L5  =知足者、不過於貪。故無羞辱之患也。
    =知止、如為人君止於仁。為人臣止於敬之類。言旣知所止。則得其自然。而無殆危之慮也。
    =言人能知足知止。方可長久無虞也。

H1  +此言名利損生，誡人當知止足也。
    =謂世人祇知名之可貪，故忘身以殉名。殊不知名乃身外之虛聲耳。與身較之，身親而名疏。故曰孰親。
H2  =貨，利也。謂世人祇知利之可貪，故忘身以殉利。殊不知利乃身之長物耳。與身較之，身在則有餘。故曰孰多。
H3  =世人不察，每役役於名利之間，貪得而無厭，戕生而傷性。與夫貪得而身亡，不若身存而遠害。故曰得與亡孰病。
H4  =故凡愛之甚者，費必大。藏之多者，亡必厚。
    :如以隋侯之珠，彈千仞之雀，雀未得而珠已失。此愛之甚，而不知所費者大矣。如斂天下之財，以縱鹿臺之欲，
    :天下叛而臺已空。此藏之多，而不知所亡者厚矣。不唯愛者費而藏者亡。抑且身死名滅，國危而不安。
    :斯皆不知止足之過也。
H5  =故知足則不辱，知止則不殆，卽斯可以長久矣。噫，老氏此言，可謂破千古之重昏，啟膏肓之妙藥，昭然
    =如揭日月於中天也。而人不察乎此，惜哉。
 
X1  =名乃身外之虛聲。與身較之，身親而名疏，無庸置疑。
X2  =利乃身之長物耳。與身較之，身在則有餘，無庸置疑。
X3  =貪得而身亡，不若身存而遠害，無庸置疑。
X4  =甚，過也。費，棄也。
    =言人之所愛，若過於常，則愛必不久終而亦棄也。
    =多藏，謂財物所藏之多也。厚亡，言所失者必多也。此貨悖而入，亦悖而出之意。
X5  =知足者，不過於貪，故無羞辱之患也。
    =言旣知所止，則得其自然，而無殆危之慮也。
    =人能知足知止，方可長久無虞也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§45 大巧若拙

1 大成若缺 其用不敝
2 大盈若沖 其用不窮
3 大直若屈
4 大巧若拙
5 大辯若訥
6 躁勝寒 靜勝熱
7 清淨為天下正

L1  =大成者、大道之成也。缺、不滿也。言大道旣備。則局量宏深。不自滿假。儼若不滿者然也。
    =弊私欲蒙蔽也。言雖若不滿。而措施於萬事之閒。事事合宜。無一毫之私也。
L2  =盈、滿也。沖、以昇也。言大道之盈者。其氣上昇。充塞於天地之間也。
L3  =直、伸也。屈、枉也。言直道之人。能屈能伸。其心雖至直而其所為。儼若屈者然也。
L4  =巧、才智之士。拙、愚也。小有才之人。則令色巧言以恃其巧。若大智之人。則藏之於內。而不見之於外。
    =觀其外。儼若愚者之所為。究而論之。非大巧者不能也。　
L5  =辯、能言之士。訥、遲鈍也。言能言之士。言不妄發。發必有中。欲出之口。必揆諸心。若遲鈍者之不多言也。
L6  =躁、焦躁也。寒、冷也。靜、不動也。熱、盛暑也。此言躁可勝寒。靜可勝熱者。如冬日則畏寒。若能身心不間。
    =躁生而寒退也。夏日則畏熱。若心靜而身不勞。則熱自解也。
L7  =清靜者、卽無為之意。言在上者。在朝廷之上。能以清靜無為為主。不貪利。不施刑。惟一心之仁慈以惠天下。
    =則人心自歸於正也。 

H1  +此言聖人法天制用，與道為一，故能勝物而物不能勝。以申明前章不言之教，無為之益也。
    =大成若缺，其用不敝者。若天地生物曲成萬物而不遺，可謂成之大矣。然必春生而夏方長之，秋殺而冬方成之。
    =以此觀之，似若有所缺。苟不如此，若一徑生長而無秋冬之肅殺。不但物不能成，而造物者亦將用之而敝矣。
    =由其若缺，故所成者大，而其用不敝也。
H2  =大盈若沖，其用不窮者。若陽和之氣，充塞天地，無處不至，無物不足，可謂盈矣。其體沖虛而不可見。
    =若塊然可見，亦將用之有盡矣。由其若沖，故旣已與人己愈有，旣已為人己愈多，故其用不窮也。
H3  =大直若屈者。若一氣浩然，至大至剛，可謂直矣。然潛伏隱微，委曲周匝，細入無間，故若屈。由若屈，
    =故能伸其生意也。
H4  =大巧若拙者。若天之生物，刻雕衆形而不見其巧。故云若拙。若恃其巧者，巧於此而拙於彼，則巧非大矣。
H5  =大辯若訥者。上云若缺，則天地無全功，故人猶有所憾。然天何言哉，四時行焉，百物生焉。是則生物之功，
    =不辯而自白矣。故曰若訥。是以天地不言而萬物成，聖人不言而教化行。以聖人法天制用，故以不言之教，
    =無為之化，似乎不勝，而物卒莫能勝之也。
H6  =且躁能勝寒而不能勝熱，靜能勝熱而不能勝寒。斯皆有所勝，則有所不勝。
H7  =是故聖人貴乎清淨為天下正。此其不言之教，無為之益，天下希及之矣。

X1  :世尊八相成道，終於涅槃，若有其缺，何不住世長久？
    =然由其若缺，故所成者大，而其用不敝也。
X2  =盈，滿也。沖，以昇也。由其若沖，故旣已與人己愈有，旣已為人己愈多，故其用不窮也。
X3  =若一氣浩然，至大至剛，可謂直矣。然潛伏隱微，委曲周匝，細入無間，故若屈。由若屈，故能伸其生意也。
X4  =若天之生物，刻雕衆形而不見其巧。若恃其巧者，巧於此而拙於彼，則巧非大矣。
X5  =天何言哉，四時行焉，百物生焉。是則生物之功，不辯而自白矣。故曰若訥。
    =是以天地不言而萬物成，聖人不言而教化行。
    =以聖人法天制用，故以不言之教，無為之化，似乎不勝，而物卒莫能勝之也。
X6  =且躁能勝寒而不能勝熱，靜能勝熱而不能勝寒。斯皆有所勝，則有所不勝。
X7  =是故聖人貴乎清淨為天下正。此其不言之教，無為之益，天下希及之矣。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§46 知足常足
 
1 天下有道 卻走馬以糞
2 天下無道 戎馬生於郊
3 罪莫大於可欲
4 禍莫大於不知足
5 咎莫大於欲得
6 故知足之足 常足

L1  =天下有道、謂德教行而天下平也。走馬、千里之馬。糞、糞土也。言兵戈不作。
    :而坐享成功如武王之歸馬於華山之陽。雖有良馬。亦棄之如糞土也。
L2  =無道、謂大道衰而天下亂也。戎馬、西戎所出之馬。生於郊。謂戰陣無停。而馬遂生於中國也。
L3  =欲、私欲也。可欲者。言私欲之蔽人耳目心思。而令人思慕於物也。造罪之由。皆在於此。若以私欲為可
    =欲而不去之。則罪莫大焉。
L4  =不知足者、則肆行無忌。如篡國弑君。皆貪心不足所至。迨其後。合族誅夷。禍事不亦彌烈乎。
L5  =咎、過失也。得、貪得也。言所欲者惟貪得。則所造罪咎。莫之紀極也。
    :如為民牧者。常以貪得為心。而朘民以自奉。則人怨神嗔。罪豈容赦乎。
L6  :此承上而。言謂人必去私欲之心。甯安於貧賤。勿求乎富貴。俯仰無虧。可謂足矣。
    =誠能知足。則身可存。家可保。富可以久。貴可以永。何患乎不足哉。 

H1  +此承上清淨無為之益，甚言多欲有為之害，以誡人君當以知足自守也。
    =謂上古之世，有道之君，清淨無欲，無為而化。故民安其生，樂其業，棄卻走馬而糞田疇。
    :所以家給人足，而無不足者。
H2  =及世衰道微，聖人不作，諸侯暴亂。各務富國強兵，嗜欲無厭，爭利不已，互相殺伐。故戎馬生於郊。
    :以致民不聊生，奸欺並作。此無他，是皆貪欲務得，不知止足之過也。
H3  =故天下罪之大者，莫大於可欲。
    :以其戕生傷性，敗亂彝倫。以至君臣父子，皆失其分者，皆見可欲之罪也。以致敗國亡家，覆宗滅族之禍者，
    =皆不知止足所致也。由不知足，故凡見他人之所有，而必欲得之。
H4  =然欲得之心，為衆罪大禍之本。
H5  =故咎之大者，莫大於欲得。欲得者，心不足也。
    :古人云，若厭於心，何日而足。以貪得不止，終無足時。
H6  =惟知足之足，無不足矣，故常足。

X1  =有道之世，棄良馬之用，但以糞田。
X2  =無道之世，兵戈起於郊。
X3  =可欲者，私欲之蔽人耳目心思。令人思慕於物也，禍之由。其罪莫大焉。
X4  =不知足，大禍之本。
X5  =欲得，大咎成。
X6  =故知足之足，無不足而常足。則身家保持，富貴雋永。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§47 不為而成

1 不出戶 知天下
2 不窺牖 見天道
3 其出彌遠 其知彌少
4 是以聖人不行而知
5 不見而名 不為而成

L1  =戶、門也。不出門而知天下事者。亦君子不出家而成教於國之意。
L2  =牖、窗也。不窺牖而見天道者。言道之玄妙。以一心領會。自然得見。不待觀望也。
L3  =出彌遠而知彌少者。言致知格物之功。由心而得。若徒觀象於世。雖行盡天下之遠。終亦有所不知也。
L4  =是以古之聖人。不待行路奔馳終日。乾乾於學問。而天下之事。無不知之也。
L5  =不見而名。
    :如孔子知萍實商羊之類。雖未見之。而亦知其名也。
    =不為而成。言身不動而事成也。

H1  +此承上言聖人所以無為而成者，以其自足於己也。謂聖人性真自足，則智周萬物，無幽不鑒。
    =故天下雖大，可不出戶而知。
H2  =天道雖微，可不窺牖而見。以其私欲淨盡，而無一毫障蔽，故也。
H3  :若夫人者，沉瞑利欲，向外馳求，以利令智昏，故去性日遠，情塵日厚，塵厚而心益暗。
    =故其出彌遠，其知彌少。
H4  =是以聖人淡然無欲，不事於物。故寂然不動，感而遂通天下之故。故曰不行而知。
H5  =如此，則尸居而龍見，淵默而雷聲。故曰不見而名。道備於己，德被群生，可不言而化。故曰不為而成。
    =是皆自足於性也。
 
X1  =聖人不出戶而知天下。（當以友人之訊，洞悉世事之緣也。）
X2  =聖人不窺牖而見天道。
X3  =其格物之功，由心而得。若徒觀象於世，雖盡行天下，終有所不知也。
X4  =是以聖人淡然無欲，不事於物。寂然不動，感而遂通天下。
X5  =如此，則尸居而龍見，淵默而雷聲。道備於己，德被群生，不言而化。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§48 為道日損

1 為學日益 為道日損
2 損之又損 以至於無為
3 無為而無不為
4 故取天下常以無事
5 乃其有事|不足以取天下

L1  =學、行道之基也。言學。自踐迹而後。故日見其增益也。道之深遠難測。修道者。必去其浮誇之習。
    =以返其樸實之基。儼若道之有損焉。
L2  =損之又損者。言一切雜念。除之又除也。至於無為者言私欲旣去。天理盡復。乃能至誠不動也。
L3  =此言道之旣成。雖一無所為。而順親信友。推及於萬事。亦無不為也。
L4  =取天下、得天下而治之也。言修道之人。若得天下而治之。則天下安平。共享無事之樂也。
L5  =言若治天下。而天下紛紛不息者。是亦道之未修。不足以取天下而治之也。 

H1  +此承上言無為之德，由日損之功而至也。
    =為學者，增長知見，故日益。為道者，克去情欲，窮形泯智，故日損。初以智去情，可謂損矣。
H2  =情忘則智亦泯，故又損。如此則心境兩忘，私欲淨盡，可至於無為。
H3  =所謂我無為而民自化。民果化，則無不可為之事矣。此由無為而後可以大有為，故無不為。
H4  =是故取天下者，貴乎常以無事也。無事，則無欲。我無欲，而民自正。民自正，而天下之心得。
    =天下之心得，則治國如視諸掌，此所以無事足以取天下也。
H5  =若夫有事則有欲，有欲則民擾，民擾則人心失。人心旣失，則衆叛親離，此所以有事不足以取天下也。
    =無為之益，天下希及之者，此耳。
    :舊注取字訓為攝化之意。應如春秋取國之取，言得之易也。

X1  =為學者，增知長見，故日益。為道者，克情去欲，窮形泯智，故日損。
X2  =情忘則智亦泯，故又損。如此心境兩忘，私欲淨盡，可至於無為。蓋無為乃至境也。
X3  =無為而無不為。不為則皆可為。
X4  =取天下者，貴乎常以無事也。潛移默化也。
X5  =事多則亂，天下何以得？
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§49 聖常無心

1 聖人無常心|以百姓心為心
2 善者 吾善之|不善者 吾亦善之|德善矣
3 信者 吾信之|不信者 吾亦信之|德信矣
4 聖人之在天下|歙歙[xī]為天下渾其心
5 百姓皆注其耳目|聖人皆孩之

L1  =常、一定也。聖人之心無定。而必以百姓之心為心者。蓋得乎民心。而天下可治也。孟子曰。得乎邱民為
    =天子。其意本此。
L2  =善者、為善之民也。吾善之、謂聖人卽奬勸之。使之日進於善也。不善者、為不善之民也。吾亦善之。
    =謂聖人亦誘掖之。使日歸於善也。德善者、謂聖人之德。足以化民為善也。
L3  =信。孚也。謂民心之孚合於聖心者。而聖人之心。亦孚合之也。不信者、謂民之心。不孚合於聖心。
    =而聖人亦教化之。以使歸於孚合也。德信者、謂聖人之德。足以孚合於天下也。
L4  =怵惕、惻怛也。言聖人之治天下。惟以惻怛為心。而使天下萬姓之心。渾而為一也。
L5  =注意所在也。言民心無常。惟上是法。上有所為。而民之耳目。早以注之也。孩愛之如赤子也。言聖人之愛民。
    =如保赤子。民之注意於見聞者。必心誠求之也。

H1  +此言聖人不言之教，無心成化，故無不可教之人也。
    =常者，一定不移之意。謂聖人之心，至虛無我。以至誠待物，曾無一定之心。但以百姓之心為心耳。
H2  =以聖人復乎性善，而見人性皆善。故善者固已善之，卽不善者亦以善遇之。彼雖不善，因我以善遇之。
    =彼將因我之德所感，亦化之而為善矣。故曰德善。
H3  =以聖人至誠待物，而見人性皆誠。故信者固已信之，卽不信者亦以信待之。彼雖不信，因我以信遇之。
    =彼將因我之德所感，亦化之而為信矣。故曰德信。
H4  =以天下人心不古，日趨於澆薄。聖人處其厚而不處其薄，汲汲為天下渾厚其心。惵惵，猶汲汲也。
H5  =百姓皆注其耳目者，謂注目而視，傾耳而聽，司其是非之昭昭。聖人示之以不識不知，無是無非，渾然不
    =見有善惡之跡，一皆以淳厚之德而遇之，若嬰孩而已。故曰皆孩之。若以嬰孩待天下之人，則無一人可責其過者。
    =聖人之心如此，所以不言而信，無為而化，則天下無不可教之人矣。

X1  =聖人無常心，是以得道。而以百姓心為心，是為無為而無所不為，不為而皆可為。
X2  =善者，吾善之。不善者，吾亦善之。不分別，不執著，則德善矣，近道矣。
X3  =信道者，吾合之。離道或偏道者，吾亦合之，是德信之合矣。
X4  =天下人心不古，日趨澆薄。聖人處其厚而不處其薄，汲汲為天下，渾厚其心。
X5  =因聖人之德，故百姓皆注其耳目而視聽，則聖人皆育之如孩。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇

§50 厚生無死

1 出生 入死
2 生之徒十有三
3 死之徒十有三
4 人之生動之死地者|亦十有三
5 夫何故 以其生生之厚
6 蓋聞善攝生者|陸行不遇兕[sì]虎|入軍不被[pī]甲兵
7 兕[sì]無所投其角|虎無所措其爪[zhǎo]|兵無所容其刃
8 夫何故 以其無死地

L1  =人之生也、則如泥蟲之出戶。故曰出生。及其死也。魂歸於天。
    :魄歸於地。尸入於土。如蟲蟻之入戶。故曰入死也。
L2  =徒、路也。生之徒十有三者。
    :言人受天地之中以生。四肢全。九竅通。故云十有三也。
L3  =死之徒十有三者。言旣死之人。
    :三魂上昇。七魄下墜。一元散為昭明。陰陽二氣散於上下。是死之徒十有三也。
L4  =此言人之生斯世也。至動無靜。勞碌以至於死。其死之地亦十有三。
    :卽八方之中。五行之內是也。
L5  =夫何故、乃承上而言。言其何所由來也。生而死。死而生。是謂生生。言相繼不絶也。
    :厚者。言人生相繼不絶。由於道之所畀者厚也。
L6  =善攝生者。猶言善養其生也。陸行涉地而行也。兕、野牛也。兕虎皆傷人之物。陸行而不遇者。言能見機而作。
    =趨吉以避凶也。
　  =軍、三軍也。言三軍之衆。生死難測。入軍而不避甲兵者。卽自反而縮。雖千萬人吾往矣之意。
L7  =兕之傷人者惟以角。無所投其角者。言避之合宜。兕亦不能用其角以傷之也。
　  =虎之利者惟其爪。措、施也。無所施其爪者。謂道路不相逢。牙爪亦無所施也。
　  =容、用也。刃、刀也。言卽遇千軍萬馬。而言語足以相安。無怨無仇。兵亦不能加以刀斧也。
L8  =此言攝生者。何以兕虎不能傷。甲兵不能損乎。蓋趨避有方。保守有術。身不罹於死地耳。 

H1  +此言聖人所以超乎生死之外者，以其澹然無慾，忘形之至，善得無生之理也。出生入死者，謂死出於生也。
    +言世人不達生本無生之理，故但養形以貪生，盡為貪生以取死。
    =是所以入於死者，皆出於生也，大約十分而居其九。
    :而不屬生死者，唯有一焉，而人莫之知也。
H2  =生之徒者，養形壽考者也。
H3  =死之徒者，汨欲忘形，火馳而不返者也。
H4  =動之死地者，嗜欲戕生，無所避忌者也。舉世之人，盡此三種，而皆不免入於死者，以其出於貪生也。
H5  =何所以故，以其生生之厚耳。是皆但知養生，而不知養生之主。
H6  :苟不知養生之主，皆為不善養生者也。攝，養也。蓋聞善養生者，不養其生，而養其生之主。然有其生者，
    :形也。主其生者，性也。性為生主。性得所養，而復其真，則形骸自忘。
    =形忘則我自空，我空則無物與敵。故陸行不遇兕虎，入軍不避甲兵。
H7  :色欲伐性，甚於兕虎甲兵也。以無我故，蹤遇之而亦無可傷。
    =故兕無所投其角，虎無所措其爪，兵亦無所容其刃矣。
H8  =夫何故，以其無死地焉。是知我者，生之寄。生者，死之地也。無我無生，又何死之。
    :孔子曰，未知生，焉知死。是知生本無生，則知死亦不死，此所以貴朝聞道而夕死可矣。
    :非超乎生死之外者，不易致此。

X1  =出生入死，等而視之。
X2  =生之徒者，養形壽考者也。十有三。
X3  =夭折早逝之徒，亦十有三。
X4  =亡於世事不測之人，亦十有三。
X5  =究其因，以愛護生命之仁厚心之差異。
X6  =故聞有善心愛生之人，陸行不遇凶險，戰事全身而退。
X7  =凶險無處施暴，兵戈不容加身。
X8  =究其因，宅心仁厚，無有死地。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§51 尊道貴德

1 道生之 德畜[xù]之
2 物形之 勢成之
3 是以萬物莫不|尊道而貴德
4 道之尊 德之貴|夫莫之命而常自然
5 故道|生之 畜之
6 長之 育之
7 成之 熟之
8 養之 覆之
9 生而不有 為而不恃
10 長[zhǎng]而不宰 是謂玄德

L1  =生、發育也。畜、長養也。形、體象也。成、全備也。言萬物皆道所發生。而所以長養之者。惟在乎德。
    =如天地有好生之德。乃長養萬物。天若無好生之德以畜萬物。則物雖生。亦不可存也。有德以養育。
L2  =必借物以成形蓋道德之發育本無形。其有形者惟物耳。勢、卽風化水土之勢。言因地土之剛強柔弱而成其性也。
    =萬物、統人物而言。
L3  =蓋萬物皆道之所生。德之所畜。故莫不尊道而貴德也。
L4  =此言萬物之尊崇乎道。貴重乎德者。非有以使之而然。物之自然尊仰也。
L5  =此言萬物皆知尊道而貴德。故道德不棄於物。而生之畜之也。
L6  =長之、如雨露降而百物長是也。育之、如道之生人。復生五穀以育人是也。
L7  =成之、謂生一物。必使成其一物也。熟之、如菓木之類。必使至於成熟也。
L8  =養之、如物之生。皆令有以養其生也。覆之、謂天之蓋覆於上也。
L9  =道生萬物。亦各隨其自然。道不自有其功也。
    =萬物之長養生成。皆德之所為。而德不恃能也。
L10 :長、謂成物也。宰、殺也。言天之生物。長養生成。而不傷害之也。此承上數者而言。謂能生物而不自有其利。
    :為事而不自恃其功。
    =長物而不傷害。故能成其幽深玄遠之德也。 

H1  +此言道德為萬物之本，欲人體道虛懷，而造乎至德也。
    =然道為天地根，故萬物非道不生。
    =且道但能生之而已，然非德不畜。畜，長養也。如陽和之氣，含有而培養之，皆其德也。
H2  =故道德無形，乃因物以形。形，猶見也。苟不知道德之大，但卽物而觀，可知已。故曰物形之。且道之生物，
    =唯一氣流行。苟無四時寒暑之序，生殺之勢，則雖生之畜之，而亦不能成熟之也。所以成萬物者，又因其勢也。
    =勢者，凌逼之意。若夫春氣逼物，故物不得不生。秋氣逼物，故物不得不成。此其皆以勢成之也。
H3  =觀其成物之功，故知其道無位而尊，無名而貴。
H4  =所以如此尊貴者，乃道體之自然，又非有以命之者。故曰莫之命而常自然。
    :若侯王之尊，則受命於天。卿相之貴，則受命於君。故凡稟命而得之者，亦可奪而失之也。豈常然耶。
    :以道德乃天然尊貴，故莫之命而常自然耳。
H5  =所以常然而不失者，以其體至虛，故其用至大。所以萬物賴之以生長之。
H6  =旣生長而又含育之。旣育而又成熟之。
H7  =旣成熟而又愛養以覆護之。此所謂成始成終，而道德之量，何如耶。
H8  =且如此生之，生生不已，而不自有其生。
H9  =如此作為，以成熟之，而不自恃其為。
H10 =雖為萬物之主，而不自以為宰。所以為玄德也。
    :是故君天下者，貴乎體道虛懷，而造乎德之至也。
 
X1  =道為天地根，故萬物非道不生。畜，長養也。天地有好生之德，乃長養萬物。
X2  =道德無形，萬物不離。因物以形，緣勢而成。
X3  =蓋萬物皆道之所生，德之所畜。故莫不尊道而貴德也。
X4  =道德所以如此尊貴者，非是有命之而行者，自然而然。
X5  =故道，及其所擁之德，生、畜、
X6  =長、育、
X7  =成、熟、
X8  =養、覆。
X9  =生發一切而不佔有，維護一切而不居功，
X10 =成長一切而不主宰。故謂玄德。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§52 塞兌閉門

1 天下有始|以為天下母
2 旣知其母|復知其子
3 旣知其子|復守其母|沒[mò]身不殆
4 塞[sè]其兌 閉其門|終身不勤
5 開其兌 濟其事|終身不救
6 見[jiàn]小曰明|守柔曰強
7 用其光|復歸其明
8 無遺身殃|是謂襲常
 
L1  =天地皆道所結成。萬物皆道所發洩。此言為天下母者。卽此道也。
L2  =知其母。言能知道之為母也。子、卽道所生者。言旣識其本。又能知其所生也。
L3  =殆、危也。言誠能堅守此道。則終身不至於顛危也。
L4  =兌、少陰也。塞、沮滯也。謂沮滯其少陰。而復其純陰之象也。
    =門、出入當由之徑。閉其門。猶言防意如城。不使心放於外也。
    =不勤。謂不受勤勞。而終身得其清靜自然也。
L5  =謂放其心。而少陰日長也。
    =言遂其私事。而徒以自濟也。
    =不救。謂不修其德。則禍患必臨。終身難保也。
L6  =見小。如察秋毫之類。物之至微者亦能見之。是以謂之明也。
    =柔與剛雖異。然柔則制剛。故善守其柔者。乃可謂之強。如孔子與子路論強之意。
L7  =明者。必有其光。如日月之長明。惟用其光故耳。言人能用其光。如舜之明其四目。則德業有成。可以復歸於明也。
L8  =殃、禍也。常、中庸之道也。言過與不及。皆非所以全身。惟不使禍殃累及其身。乃可謂習於常道也。

H1  +此言道體之方，當以背物合道為要妙也。由萬物皆資始乎道。
    =故曰天下有始，以為天下母。所謂道生之也。是知道為體，而物為用。故道為母，物為子。
    :人若但知道體虛無，而不知物從此生，是知母而不知子，則淪於斷滅。若但知物而不知道，是殉物而忘道，
    :則失其性真。
H2  =所以旣知其母，亦復要知其子，所謂有體有用也。
H3  =旣知物從道生，則不事於物。故曰旣知其子，復守其母。所謂用不離體也。
    =體用兩全，動靜不二，故沒身不殆。殆，危也，又盡也。
    :下示守母之方。
H4  =兌為口，門乃眼耳，為視聽之根。謂道本無言，言生理喪。妄機鼓動，說說而不休，去道轉遠。唯是必緘默以自守，
    =所謂多言數窮不如守中。故曰塞其兌。然道之於物，耳得之而為聲，目得之而為色。若馳聲色而忘返，則逐物而背性。
    =是必收視返聽，內照獨朗。故曰閉其門。如此，則終身用之而不勤矣。勤，勞也。
H5  =若徒執言說以為得。以資耳目之欲，火馳而不返。則是開兌濟事，喪心於物，則終身不可救矣。
H6  =是皆不能戒謹於隱微之間，而忽於欲機之兆，非為明也。
    :孔子曰，知機其神乎。
    =故曰見小曰明。以道自勝，故曰守柔曰強。
H7  =是故學人當用其光，復其明，則無遺身殃也。
    :然光，道之用也。明，道之體也。用不離體，故用愈光，而體愈明。此所以能無遺其殃也。
H8  =襲，承也。
    :且真常之道，吾固有之。但凡人不能承襲而自絕耳。
    =苟能如此做工夫，則綿綿而不絕矣。故曰是謂襲常。

X1  =天地皆道所結成。萬物皆道所發洩。道為天下之母，萬物為道之子。
X2  =既知其母，當知其子本為道生。
    :既皆道之所生，豈有不敬之理。
    :故當禮敬諸佛。
X3  =既明其子之用，當守其母之體，體用兩全，動靜不二。凡事合乎於道，則全身無危、不盡也。
    :何以守母之方？
X4  =兌為口，門乃眼耳，出、入之根也。
    =緘默自守，所謂多言數窮不如守中。故曰塞其兌。
    =若馳聲色而忘返，則逐物而背性。是必收視返聽，內照獨朗。故曰閉其門。
    =如此，則終身用之而不慮無謂之勞矣。勤，勞也。
X5  =反其道而行，則人生艱難矣。
X6  =察微小而悟大道，是為明。堅守至柔之道，是為至強。
    :忍辱仙人，非歌利王之利劍所能動。
X7  =光，道之用也。明，道之體也。用不離體，故用愈光，而體愈明。
X8  =遺，與也。殃，禍也，非道也。故無與爾身於非道，恆守正道，則承受恆常也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§53 行於大道

1 使我介然有知
2 行於大道唯施[迤yí]是畏
3 大道甚夷 而民好徑
4 朝[cháo]甚除 田甚蕪 倉甚虛
5 服文采 帶利劍 厭飲食
6 財貨有餘 是為盜夸|非道哉

L1  =介然、猶豁然也。有知、謂心性明明也。
L2  =謂時刻所行。皆合於大中至正之道也。
　  =施、人之所求於我也。言修道必精。則人有所求。而皆足以應之。若道有未明。則人之所求。必無以應之。
    =固獨以施為畏懼也。
L3  =夷、遠也。徑、邪徑也。言道之高遠。民多畏勞。乃好履邪徑。以求其捷。遂違乎道也。
L4  =朝、朝廷也。除、無良臣也。田、畝也。蕪荒也。倉、所以積榖者。虛、空也。此言為國者。不修德政。
    =而徒取貨財。入朝廷。則朽木為官。斗筲食祿。出草野。則農夫廢業。田野荒蕪。倉庫空虛。國無餘蓄也。
L5  =文綵、錦衣也。利劍、寶刀也。厭、棄之也。如狗彘食人食而不知檢是也。
    :財貨、如玉帛珍寶之類。盜、竊取於人也。竿也者、五音之長也。言竿先則鐘瑟相隨。竿唱則諸樂皆和。
    :今大姦作於上。則俗之民唱。俗之民唱。則小盜必和。皆文綵為衣。利劍是佩。飲食過於浪費者。
L6  =資財雖有餘。而必謂之盜竿。有道者顧如是哉。

H1  +此言世衰道微，人心不古，而極歎道之難行也。
    =介然，猶些小。乃微少之意，蓋謙辭也。老子意謂使我少有所知識，而欲行此大道於天下。
H2  =奈何天下人心奸險可畏，而將施之於誰耶。故曰唯施是畏。且有施而無受者，非徒無益而又害之。所謂生
    =乎今之世，反古之道，災及其身者，故可畏。何也。
H3  =以大道甚坦夷直捷，而民心邪僻，不由於大道，皆好徑矣。民好徑，則教化衰。
H4  =教化衰，則奸愈甚。奸愈甚，則法益嚴。故曰朝甚除。除，謂革其弊也。且法令滋彰，盜賊多有。是以朝
    =廷之法日甚嚴，而民因法作奸，更棄本而不顧，好為游食，故田日甚蕪。田甚蕪，則倉日甚虛。倉甚虛，
    =而國危矣。風俗之壞，民心之險，一至於此。君人者，固當躬行節儉，清淨無欲，以正人心可也。
H5  =且在上之人，猶然不知止足。而虛尚浮華，極口體之欲。而服文采，帶利劍，厭飲食，而積貨財。
H6  :且上行下效，捷如影響。故上有好之，而下必有甚焉者。是則民之為盜，皆由上以唱之也。
    =故曰是為盜竽。竽，樂之首，而為先唱者也。如此，豈道也哉。上下人心之如此，所以道之難行也。

X1 =介然，猶些小，微少之意，謙辭也。謂我些許有知。
X2 =行於大中至正之道，。所謂生乎今世，反古之道，災及其身者，故可畏。
   :何以故？
X3 =雖則大道甚坦夷直捷，而民心邪僻，不由於大道，皆好徑矣。民好徑，則教化衰。
X4 =朝乏良臣，田畝蕪荒，倉榖空無。風俗之壞，民心之險，一至於此。
X5 =且在上之人，猶然不知止足。而虛尚浮華，極口體之欲。
X6 =上行下效，捷如影響。上有好之，下必有甚焉者。故此下民為盜。
   =上下人心之如此，所以道之難行也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§54 善建善抱

1 善建者不拔|善抱者不脫|子孫祭祀不輟
2 修之於身 其德乃真
3 修之於家 其德乃餘
4 修之於鄉 其德乃長[zhǎng]
5 修之於國 其德乃豐
6 修之於天下 其德乃普
7 故|以身觀身 以家觀家
8 以鄉觀鄉 以國觀國|以天下觀天下
9 吾何以知天下然哉|以此

L1  =建、立也。拔、傾也。抱、懷也。脫、遺失也。輟、絶也。言善建功立業者。萬世不至於傾頹也。善抱、
    =言善於抱道懷德者。兢兢自持。故不至於遺失也。祭祀不絶者。惟其立德之固。懷道之堅。故能貽謀後嗣。
    =而明禋休享也。
L2  =修之於身。謂修道於吾身。卽大學所言正心誠意之旨是也。蓋德者。行道而有得者也。然必修之於身。乃可謂之真德。
L3  =修之於家。卽齊家之理。言道旣修之於身。復推之以齊其家也。餘、多也。言家旣齊。則可以成教於國。
    =本孝以事君。本弟以敬長。德乃有餘不盡也。
L4  =鄉、五州為鄉。修之於鄉者。言家旣齊。而推及於鄉里之間。如孔子之於鄉黨。化一鄉為仁厚之俗。則里黨咸稱。
    =而聲名乃能長久也。
L5  =一鄉旣化。復推此道以治國。誠使一國之中。於變時雍。其德乃豐滿而不虧也。
L6  =聖人之心。以天下為一家。中國為一人。若徒治其國。而未洽於天下。則道猶未廣。故必修此道以推於天
    =下。誠使薄海內秩然。藹然。則道所修之德。乃溥徧而無遺也。
L7  =以身觀身。言以吾之身。鑒觀於人之身也。
    =以吾之家。鑒觀於人之家也。
L8  =以吾所治之鄉。覽觀於他人所居之鄉也。
    =以吾所治之國。覽觀於人之國也。
    =以吾所治之天下。鑒觀於古聖王所治之天下也。
L9  =吾。道君自謂。言一人之心。何以知天下萬姓之心。皆以修道為然哉。蓋卽以上數端而知之也。凡事之善
    =惡。民之愛惡。惟一心可以會通。如以吾之身。鑒觀於人之身。合於善知之。合於惡亦知之也。以吾所治
    =之家。與鄉國天下。揆之於古今之家國天下。善則民服。不善則民離。我自知修德足以服民。不待想而知也。 

H1  +此言聖人所以功德無窮，澤及子孫者，皆以真修為本也。舉世功名之士，靡不欲建不拔之功，垂不朽之業。
    :至皆不能悠久者，以其皆以智力而建之，則有智力過之者，亦可以拔之矣。
    =抱，守也。脫，猶奪也，謂失脫也。以機術而守之，則有機術之尤者，亦可以奪之矣。是皆不善建，不善
    =守者也。至若聖人復性之真，建道德於天下。天下人心感服，確乎而不可拔。故功流萬世，澤及無窮，傑
    =然而不可奪。此皆善建善抱，所以福及子孫，故祭祀綿遠而不絕也。
H2  =是故學道之人，修之於身，故其德乃真。
    :莊子曰，道之真以治身，其緒餘以為國家，其土苴以為天下。
H3  =故曰修之家，其德乃餘。
H4  =修之鄉，其德乃長。
H5  =修之國，其德乃豐。
H6  =修之天下，其德乃普。
H7  =故以性觀身，則性真而身假。若以我身而觀天下之身，則性同而形忘。以此觀家則家和。
H8  =以此觀鄉則鄉睦。以此觀國則國治。以此觀天下則天下平。
H9  :所謂以性融物，則天下化。會物為己，則天下歸。故其德乃普。
    =是以聖人一真之外無餘事，故唯以此。
 
X1 =建，立也。拔，傾也。抱，懷也。脫，遺失也。輟，絶也。
   =言善建功立業者，萬世不至於傾頹也。善抱，言善於抱道懷德者，兢兢自持，故不至於遺失也。
   =善建善抱，福及子孫，故祭祀綿遠而不絕也。
X2 =修道於吾身，卽大學所言正心誠意之旨是也。
   =德者，行道而有得者也。然必修之於身，乃可謂之真德。
X3 =修之於家，卽齊家之理。道旣修之於身，復推之以齊其家也。
   =餘、多也。家旣齊，則可以成教於國。
   =本孝以事君，本弟以敬長，德乃有餘不盡也。
X4 =家旣齊，推及於鄉里之間。則里黨咸稱，聲名乃能長久也。
X5 =復推此道以治國。誠使一國之中。於變時雍。其德乃豐滿而不虧也。
X6 =聖人之心，以天下為一家。必修此道以推於天下。
   =誠使薄海內秩然，藹然，則道所修之德，乃溥徧而無遺也。
X7 =以性觀身，則性真而身假。
   =若以我身而觀天下之身，則性同而形忘。以此觀家則家和。
X8 =以此觀鄉則鄉睦。以此觀國則國治。
   =以此觀天下則天下平。
X9 =言一人之心，何以知天下萬姓之心。皆以修道為然哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§55 不道早已

1 含德之厚比於赤子
2 毒蟲不螫[shì]|猛獸不據|攫[jué]鳥不搏
3 骨弱筋柔而握固
4 未知牝牡之合而脧[zuī]作|精之至也
5 終日號而嗌不嗄[shà] 和之至也
6 知和曰常 知常曰明
7 益生曰祥 心使氣曰強
8 物壯則老|謂之不道|不道早已

L1  =含德、謂德之含蓄於中。深厚無極也。赤子、孾兒也。言赤子之性。至誠至樸。良知良能。修德之厚者。亦若是焉。
L2  =毒蟲、如蚖蛇蜂蝎之類。螯、囓人也。言蟲之有毒者。每每害人。而厚德有以化之。則亦不為害也。
    =猛獸、如虎豹之類。謂獸之猛者。每據於山林之內。日俟人而食之。若厚德所及。則猛獸潛逃。而自不為虐也。
    =玃鳥、如鷹隼之類。搏、追而食之也。鷹隼每每搏雀鳥以為食。不搏者。亦德有以化之也。
L3  =弱、小也。握、持物也。固、堅固也。如人之一身惟十指骨弱而筋柔。故能持握固。此卽柔能制物之意也。
L4  =牝、陰也。牡、陽也。朘作、胎成也。故易曰。男女媾精。而萬物化生。蓋精之所至。乃能成形受氣也。
L5  =號、大哭也。啞、失聲也。言號哭終日。而聲不啞者。蓋音出於和之極而然也。
L6  =和、卽致中和之和。常、不偏不易之常道。明、高明也。言中和之理。可謂常道也。知不偏不易之常經。
    =可以參天而同其高明也。
L7  =益、增也。祥、卽國家將興。必有禎祥之祥。言道有增益。而禎祥日見也。
    =人之所行貴乎氣。而所主貴乎心。欲有成者。固必以心使氣。而勇往直前也。
L8  =物之生也。幼而壯。壯則老。一定之理也。不道者。言不能除其強暴之氣。是以速老。皆不合於道也。
    =已、死也。言此不合於道之人。定知其必死也。

H1  +此承上言聖人善建善抱，而不為外物之所搖奪者，以其所養之厚也。
    :然人之所以有生者，賴其神與精氣耳。此三者苟得其養如赤子，則自不被外物所傷矣。
    =故曰含德之厚，比於赤子。
H2  =且毒蟲猛獸攫鳥，皆能傷人之物。至於赤子，則毒蟲雖毒而不螫，猛獸雖惡而亦不據，攫鳥雖梟而亦不搏。
    :何也，以其赤子不知不識，神全而機忘也。所謂忘於物者，物亦忘之。入獸不亂群，入鳥不亂行。
    :彼雖惡而不傷，以其無可傷之地。此言聖人神之王也。
H3  =且如赤子之骨最弱，筋極柔。手無執，而屈握極固，不可擘。
H4  =且又不知陰陽之合，而峻亦作者，乃精滿之至。
    :聖人筋骨亦柔弱，而所握亦堅固者，以其精純之至也。故草木之有精液者，則柔弱而連固，精竭者，則枯
    :槁而萎散。是知聖人如嬰兒者，以精得其養故也。
H5  =然赤子終日號啼而咽嗌不嗄啞者，以其心本不動，而無哀傷怨慕之情，乃氣和之至。
H6  :聖人之心和，亦然。斯三者，皆得其所養之厚，故所以比赤子之德也。且此三者，以神為主，以精為衛，以氣為守。
    :故老子教人養之之方，當先養其氣。
    =故曰知和曰常。
    :何也，蓋精隨氣轉，氣逐心生。故心妄動則氣散，氣散則精溢。所謂心著行淫，男女二根自然流液。故善養者，
    :當先持其心，勿使妄動。心不妄動則平定，心平則氣和，氣和則精自固，而神自安，真常之性自復矣。
    :故曰知和曰常。
    :如所云不認緣氣之心為心，則真常之性自見。
    =故曰知常曰明。意謂知真常之性者，可稱明智矣。
H7  :苟不知真常之性，徒知形之可養，而以嗜欲口腹以益其生。殊不知生反為其戕，性反為其傷。
    =故曰益生曰祥。
    :祥，妖也。言益生反為生之害也。心不平，則妄動而使氣，氣散則精竭，精竭則形枯。
    =故曰心使氣曰強。
H8  :強，木之枯槁也。過強曰壯。故曰物壯則老。
    :草木之物過壯，則將見其枯槁而老。人之精神元氣不知所養，而斲喪太過，可謂不道之甚矣。
    =不道之甚，乃速其死也。故曰不道早已。已者，絕也。
    :此老氏修養功夫，源頭蓋出於此。而後之學者，不知其本。妄搆多方傍門異術，失老氏之指多矣。

X1 =赤子、孾兒也。言赤子之性。至誠至樸。良知良能。修德之厚者。亦若是焉。
X2 =毒蟲猛獸攫鳥，皆能傷人之物。
   =至於赤子，則毒蟲雖毒而不螫，猛獸雖惡而亦不據，攫鳥雖梟而亦不搏。
   :何也，以其赤子不知不識，神全而機忘也。
   :所謂忘於物者，物亦忘之。
   =入獸不亂群，入鳥不亂行。彼雖惡而不傷，以其無可傷之地。
   :此言聖人神之王也。
X3 =赤子之骨最弱，筋極柔。手無執，而屈握極固，不可擘。
X4 =又不知陰陽之合，而峻亦作者，乃精滿之至。朘：婴孩之陽具。
X5 =赤子終日號啼而咽嗌不嗄啞者，以其心本不動，而無哀傷怨慕之情，乃氣和之至。
X6 =和，卽致中和之和。
   =常，不偏不易之常道。
   =明，高明也。
   =言中和之理。可謂常道也。知不偏不易之常經。可以參天而同其高明也。
X7 =苟不知真常之性，徒知形之可養，而以嗜欲口腹以益其生。
   =殊不知生反為其戕，性反為其傷。故曰益生曰祥。祥，妖也。
   =言益生反為生之害也。
   =心不平，妄動使氣，氣散則精竭，精竭則形枯。故曰心使氣曰強。
X8 =物之生也，幼而壯，壯則老，一定之理也。
   =不道者，言不能除其強暴之氣，是以速老。皆不合於道也。
   =已，死也。言此不合於道者，必早死也。
 
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§56 知者不言
 
1 知[zhì]者不言|言者不知[zhì]
2 塞[sè]其兌 閉其門|挫其銳 解其紛|和其光 同其塵|是謂玄同
3 故|不可得而親|不可得而疏|不可得而利|不可得而害|不可得而貴|不可得而賤|故為天下貴

L1  =知者、謂知道之人。不言者。謂不徒尚乎便佞也。多言者。言多必失。故曰不知道者也。
//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
L2  =塞、阻滯也。兌、少陰之象也。閉、關也。門、戶也。挫、折也。銳、勇也。解、排解也。紛、紛亂也。
    =和、禮之用也。光、容也。同、與彼同也。塵囂塵之俗也。玄、道也。
    :此言人能阻滯其少陰。使之不動。而無擾於心。復閉其出納之門。而言不妄發。修道以挫折其剛強之銳氣。
    :知慧以排解其私欲之紛紜。和順積中而發外。謙厚流光。雖塵囂亦可同居。如柳下惠之行是也。
    =玄同。言與道同躋於幽深玄妙之域也。
L3  =親、近也。疏、遠也。利、益也。害、損也。
    :不可得而貴。如齊宣王欲與孟子以萬鍾之意。得而賤。謂得而為民也。為天下貴者。言其尊重如此。
    :故能為天下萬姓所當欽仰也。此言旣與道同。則超羣拔萃。非常人可得而親近也。
    :然而民胞物與為懷老安少懷在抱。其於大衆。不勝仁愛也。焉可得而疏之乎。或曰。道之成者。望之儼然。
    :故不可得而親。卽之也溫。故不可得而疏。亦通。聖人所懷者德。不尚貨利者也。焉可以利誘之乎。
    :況聖人受天命而生。天欲生之。人豈能害之。故孔子云天生德於予。桓魋其如予何。亦不可得而害之意。
    :不可得而貴者。言棄天下猶棄敝屣然。若以不義處。雖一介不取也。而況可得而貴乎。不可得而賤者。
    :言抱道自高。千乘之君。求與之友而不可得。況得而賤之乎。
    =其德之大。至於如此。所以能為天下貴也。 

H1  +此言聖人所以為天下貴者，以其善得所養，妙契忘言，而能與道玄同也。
    :謂聖人自知之明，故善能含養於心，而不形於言。以自知之真，言有所不及也。
    :若夫常人嘵嘵資於口談者，皆非真知者也。
    =故曰知者不言，言者不知。
    :下言養之之方。
H2  :兌為口，為說。謂聖人緘默自守，不事口舌。=故曰塞其兌。
    :不事耳目之玩。=故曰閉其門。
    :遇物渾圓，不露鋒芒。=故曰挫其銳。
    :心體湛寂，釋然無慮。=故曰解其紛。紛，謂紛紜雜想也。
    :含光斂耀，順物忘懷。=故曰和其光，同其塵。
    :此非妙契玄微者，不能也。=故曰是謂玄同。
H3  :聖人造道之妙，大而化之至於此。其心超然塵表，=故不可得而親。
    :精誠動物，使人見而不能捨，=故不可得而疏。
    :淡然無欲，=故不可得而利。
    :妙出死生，故不可得而害。視王侯之如隙塵，=故不可得而貴。
    :披褐懷玉，=故不可得而賤。
    :以其聖人跡寄寰中，心超物表，不在親疏利害貴賤之間，=此其所以為天下貴也。

X1  =智者不言，言者不智。
X2  =兌者，口也。塞兌閉門，挫銳解紛，和光同塵，行之而非言之，是謂玄同。
X3  =玄同則不可得。因不可得，則或親或疏，或利或害，或貴或賤，無所適從。玄，故貴。其不言之智哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§57 以正治國

1 以正治國 以奇用兵|以無事取天下
2 吾何以知其然哉 以此
3 天下多忌諱 而民彌貧
4 民多利器 國家滋昏
5 人多伎[jì]巧 奇物滋起
6 法令滋彰 盜賊多有
7 故聖人云|我無為而民自化|我好靜而民自正|我無事而民自富|我無欲而民自樸

L1  =以正治國。謂修身以正。率天下而為正也。奇、神妙也。言用兵不貴勇而貴智。若能妙算無遺。用兵如神。
    =卽可取勝也。無事、卽無為也。言以智治國。則民懷德。以奇用兵。則民威畏。不待作為。而天下可得也。
L2  =道君言吾何以知國可治。兵可用。天下可取哉。以此。言卽以正奇無事揆諸心。而知其必然也。
L3  =忌諱、卽兵革之事。言所當深戒者也。若天下多起紛爭。則國削而民貧也。
L4  =利器、貨財之類。國、諸侯之國。家、大夫之家也。滋、漸也。昏、暗也。言民心好競。徒尚貨財。多懷
    =利器者。因大夫之利其家。諸侯之利其國。上不修德。昏暗如此。故民若是也。
L5  =伎巧、言民類繁華。造作者。不敦樸實而徒尚虛華。以恃其技藝之巧也。奇物、如雕鏤珠玉之類。
    =滋起、言上好之。故民為之。是以奇物漸滋而起也。
L6  =法、刑法也。法物、如刑書之類。滋彰、言在上者之法律大彰也。盜、竊取也。賊、搶劫也。
    =法律所以弭盜賊。而盜賊多有者。言教化不興。而徒以刑律罔民。則民不知畏懼。故為盜賊者多也。
L7  =聖人、卽上古之為國家者。云、言也。我、卽聖人自稱。無為而民化者。言德修於身。不待作為。
    =而民自化為良善也。
　  =好靜、言我之所好者。誠其意以正其心。靜而不動。而民自相率而為正也。
　  =無事、謂國家安靜也。言我不尚虛華之費。不妨民事。不奪民時。而民之鑿井耕田。自鼓腹於光天之下。
    =是我無事而民自富也。
　  =欲、私欲也。言我食不重食。器不雕鏤。不尚紛華。一無所欲。卑宮室而惡衣服。是以民自反其醇樸也。
    =此以上。皆聖人之言。老子引之。以證上文正治國。奇用兵。無事取天下之當然也。 

H1  +此言治天下國家者，當以清淨無欲為正，而不可用奇巧以誘民也。
    =奇巧詐術，是為詭道。但可用之於兵，不可以治國。
    =故曰以正治國，以奇用兵。
    :然兵者不祥之器，不得已而用之，乃好事者為之耳，非取天下之具也。
    =故以無事取天下。
H2  =吾何以知無事可以取天下之然哉，以此。
    :此，指下文有事而言。蓋忌諱，利器，技巧，法令，皆有事也。此何以不足取天下。
H3  =且天下多忌諱，而民彌貧。忌，謂禁不敢作。諱，謂不敢言。
    :只如文王之囿七十里，與民共之，芻蕘雉兔取之者無禁。卽有不便於民者，言之不諱，所以民得安其生。
    :故在上者無事，而民日富。今則殺其糜鹿者，如殺人之罪，取之者死，民有不便，言之者戮，故民不聊生，
    :且又無所措手足。
    =此多忌諱之事，而民彌貧也。
H4  :賢者，國之利器也。
    =今國無道，賢者在野。是利器在民不在朝。所以國家滋昏。
H5  =由上多欲好奇，故人心雕琢，技巧日生。技巧生，而奇物滋起。
    :奇物起，則貪愈甚。
H6  =貪愈甚，而盜賊生。故法令滋彰，而盜賊多有也。
    :以此天下擾擾而不安。是皆有為忘動，有事多欲之過也。
H7  =故古之聖人有言曰，我無為而民自化。我好靜而民自正。我無事而民自富。我無欲而民自樸。宜矣。
 
X1  =治天下國家者，當以清淨無欲為正，而不可用奇巧以誘民也。
    =奇巧詐術，是為詭道。但可用之於兵，不可以治國。
    =然兵者不祥之器，不得已而用之，乃好事者為之耳，非取天下之具也。故以無事取天下。
X2  =吾何以知無事可以取天下之然哉，以此。
    :此，指下文諸有事：忌諱，利器，技巧，法令。
X3  =忌，謂禁不敢作。諱，謂不敢言。多忌諱之事，而民彌貧也。
X4  =利器，貨財之類。
    =國，諸侯之國。
    =家，大夫之家也。
    =滋，漸也。
    =昏，暗也。
    =言民心好競，徒尚貨財，多懷利器者。因大夫之利其家，諸侯之利其國。
    =上不修德，昏暗如此，故民若是也。
X5  =伎巧，言民類繁華，不敦樸實而徒尚虛華，以恃巧技也。
    =奇物，如雕鏤珠玉之類。
    =滋起，言上好之，故民為之。是以奇物漸滋而起也。
X6  =法，刑法也。滋彰，以大彰法律而治，弗能震懾，令民畏懼，故為盜賊者多也。
    =盜，竊取也。
    =賊，搶劫也。
X7  =聖人，卽上古之君。
    =無為，言德修於身，不待作為，而民自化為良善也。
    =好靜，誠其意以正其心，靜而不動，而民自相率而為正也。
    =無事，言不尚虛華之費，不妨民事，不奪民時，而民之鑿井耕田，自鼓腹於光天之下，則無事而民自富也。
    =欲，私欲也。言我食不重食，器不雕鏤，不尚紛華，一無所欲，卑宮室而惡衣服，則民自反其醇樸也。
    :此以上，皆聖人之言，老子引之，以證上文正治國，奇用兵，無事取天下之當然也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§58 禍福倚伏

1 其政悶悶 其民醇醇
2 其政察察 其民缺缺
3 禍兮福所倚|福兮禍所伏
4 孰知其極 其無正耶
5 正復為奇 善復為妖
6 人之迷 其日固久
7 是以聖人|方而不割
8 廉而不劌[guì]|直而不肆|光而不耀

L1  =政、卽朝廷之事。所以施於天下者也。悶悶、無為之象也。
    :言觀有道者之政。一無所為如愚人之悶悶者然也。
    =醇醇、和厚也。言政雖無為。
    :而民之風俗。自敦厚而雍熙也。
L2  =察察、苛察也。言為政者。不講道德。:而徒號令之整齊。刑律之嚴密也。
    =觖、怨望之貌。言舍此無為之化。:而徒法律之嚴密。則民必生怨望之心也。
L3  =禍、殃也。福、祥也。倚、依也。伏、藏也。善則降福。惡則降禍。誠一定不易之理。然常以憂患自處。
    =則福可依也。若相安於福。而不慮其憂患之來。則蕩檢踰閑。禍已早藏於中也。孰知其極。言誰能知其中
    =至極之理也。
    =其、設若之詞。正、正道也。奇、非正道也。
L4  =言在上者若無正道。則民之正者。亦復不正。而為可巧也。
L5  =訞、惡也。言善者亦復轉而為惡也。
L6  =迷、昧其心也。人性本善。人心本正。上無有以倡之。故民迷其心性也。日、時日也。固、非堅固之固。
    =烏能也。言世道若此。喪無日也。烏能長久乎。
L7  =方、端方也。割、除之也。言古之聖人。為天下正。其於端方正直之事。終身不去也。
L8  =廉、不欲也。害、傷之也。言聖人心無私欲。廉潔是尚。而不傷害乎風化也。
    =直、正直也。肆、放肆也。言聖人所存者。正直而不放肆也。
    =光、言德之謙厚流光也。不曜者、不顯其光也。 

H1  +此詳言上章有為之害，而示之以無為之方也。
    =悶悶，無知貌。所謂民可使由之，不可使知之之意。
    :由百姓皆注其耳目，若示有知，卽上云法令滋彰，盜賊多有矣。故聖人潛行密用，令其悶悶然若無所知。
    :則民情不鑿，奸偽自然不生。
    =故其政悶悶，其民醇醇。
H2  :若其政令察察然分星擘兩，則民多不自安，缺缺然憂有餘矣。
    =故云其政察察，其民缺缺。缺缺，多憂不足之意。
H3  =蓋禍福之機，端在人心之所萌。若其機善，則禍轉為福。若其機不善，則福轉而為禍。此禍福相倚伏也。
    =由人機心不息，則禍福旋轉如循環之無端，人孰能知其止極耶。
    :故孔子曰，知機其神乎，謂是故也。
H4  :然禍福循環之如此，豈無真人而以理正之耶。
H5  :但世衰道微，人心不古，邪正不分，善惡顛倒。
    =本示之以正，則彼反以為奇詭。本教之以善，而彼反以為妖怪。正所謂未信而勞諫，則以為厲謗。
H6  =此人心之迷固已久矣，縱有聖人之教，亦不能正之矣。
    :莊子曰，三人行，一人迷方，猶有解者。二人惑，則不能易。今天下皆迷，其誰能解之耶。
H7  :是以聖人遊濁世以化民，貴在同塵和光，渾然無跡。
    =故雖方而不傷其割。割，謂割截，乃鋒稜太露也。
H8  =雖廉而不傷於劌。劌，謂刻削太甚也。雖直而不傷於肆。肆，謂任意無忌也。
    =雖光而不傷於耀。耀，謂衒耀己見也。
    :此聖人有所長，而能養其所長，故為天下貴。此所以無為而治，好靜而自安，無為而民自化矣。
 
X1  =悶悶，無知貌。所謂民可使由之，不可使知之。若示百姓有知，如上所云，盜賊多有矣。
    =故聖人潛行密用，悶悶然若無所知，則民情不鑿，奸偽自然不生，故而其民醇醇。
X2  =若其政令察察然分星擘兩，則民多不自安，缺缺然憂有餘矣。缺缺，多憂不足之意。
X3  =禍，殃也。福，祥也。倚，依也。伏，藏也。
    =善則降福，惡則降禍，誠一定不易之理。
    =然常以憂患自處，則福可依也。
    =若相安於福，而不慮其憂患之來，則蕩檢踰閑，禍已早藏於中也。
X4  =倘知此理至極於此，則安有正信耶？
X5  =正奇顛倒，善妖相混。
    :真正悟道者，才不迷失。
X6  =人的顛倒妄想，曠日持久，根深蒂固。縱有聖人之教，亦不能正之矣。
X7  =方，端方也。割，除之也。言古之聖人，為天下正，其於端方正直之事，終身不去也。
X8  =廉，不欲也。劌，謂刻削太甚也。直，正直也。肆，謂任意無忌也。光，言德之謙厚流光也。耀，謂衒耀己見也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§59 長生久視

1 治人事天 莫若嗇|夫惟嗇 是謂早復
2 早復 謂之重[chóng]積德
3 重[chóng]積德 則無不克
4 無不克 則莫知其極
5 莫知其極 可以有國
6 有國之母 可以長久
7 是謂深根固柢[dǐ]|長生久視之道

L1  =治人、撫育百姓也。事天、謂承天之命。故當事奉乎天也。嗇、誠實也。服、佩服也。言治人者。以誠實處之。
    =而事天亦必以誠實敬之。則人心乃順。天心乃合也。而推其誠實之由。非可以形容假者。必存於中而發於外。
    =是以謂之早佩服乎道者也。
L2  =此言道之早服於吾身。則心領神會。含蓄已久。故言積德之重也。
L3  =克、勝也。言積德之重者。治人則人服。事天則天悅。推以及於萬事。無不能勝其任也。
L4  =言旣能克制萬事。則道之高遠。莫可得而知也。
L5  =旣無以知其極至。則道德已備。固可以有國家而治之也。
L6  =母、本也。言有治國之道。復得治國之本。則國家可以長久不廢也。
L7  =根、樹之根。蒂、花之蒂。根之深者。樹乃榮。蒂之固者。果乃成。此言積德之重。得道之本者。亦如根
    =之深。蒂之固也。
    =長生、謂壽高而不死也。久視、言能久視天下之人也。道、謂玄道。卽至誠無息。不息則久。久則徵之意。
    =久者、卽長生也、徵者、卽視也。 

H1  +此言聖人離欲復性，以為外王內聖之道也。
    =嗇，有而不用之意。
    :老子所言人天，莊子解之甚明。如曰，不以人害天，不以物傷性。蓋人，指物欲。天，指性德也。
    =言治人事天莫若嗇者。然嗇，卽復性工夫也。
    :謂聖人在位，貴為天子，富有四海。其子女玉帛，聲色貨利，充盈於前。而聖人以道自守，視之若無，澹
    :然無欲，雖有而不用。所謂堯舜有天下而不與，此以嗇治人也。聖人并包四海，智周萬物。不以私智勞慮，
    :而傷其性真。所謂毋搖爾精，毋勞爾形，毋使汝思慮營營。
    =蓋有智而不用其智，此以嗇事天也。復性工夫，莫過於此。故曰是謂之早復。
    :此復字，是復卦不遠復之意。言其速也。
H2  :又如一日克己復禮，天下歸仁之意。莊子曰，賊莫大於德有心。然有心之德施於外，故輕而不厚。復性之
    :功，天德日全，不期復而自復，所謂復見天地之心。
    =故曰早復謂之重積德。
H3  =能重積德，則無不克矣。此克字，乃克敵之克。:卽顏子克己之克。
H4  :以性德日厚，則物欲消融。而所過者化，無物與敵。則其德高明廣大，民無得而稱焉。
    =故曰無不克，則莫知其極。
H5  :極，至極，猶涯量也。此內聖之德旣全，雖無心於天下，乃可以託於天下。=故曰莫知其極，可以有國。
H6  :此內聖之道，真以治身，其緒餘以為天下國家。=故曰可以有國。
H7  :此道先天地不為老，後天地不為終。故曰可以長久。=古人所言深根固蒂長生久視之道者，如此而已。
    :結句蓋古語。老子引證，以結其意耳。

X1  =???
X2  =???
X3  =???
X4  =???
X5  =???
X6  =???
X7  =???

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§60 鬼不神傷

1 治大國若烹小鮮|以道蒞[lì]天下
2 其鬼不神|非其鬼不神|其神不傷人
3 非其神不傷人|聖人亦不傷人
4 夫兩不相傷|故其德交歸焉

L1  =治大國、如治千乘萬乘之國也。鮮、美味也。若烹小鮮者、極言其易也。然烹小鮮而數撓之。則糜爛無成。
    =治大國而政令屢更。則民變而難馭。其理然也。若得其道。則平治天下。不誠如烹小鮮之易哉。
    =莅、臨民也。言以道臨天下之民也。
L2  =鬼、陰氣也。神、聰明正直而一者也。其鬼不神者。言道之行於天下。陰陽不紊。上下克敦。
    =故鬼神各安其所而無紊亂也。非其鬼不神者。言宗廟山川。祀各有主。非所當祭之鬼。亦不假託於神明以惑人也。
    =神之為德。體萬物而不可遺者也。其神、謂名山大川。社稷宗廟所當祭祀之神。不傷人者。言神道設教。
    =惟憑清淨。固不傷害於人。若非其神。則必有害於人。而亦不傷人者。
L3  =謂天下有道。人神各安其所。非惟不傷人。而且降福孔多也。
    =在上位者。設刑律以治民。是傷於民也。若聖人之道民以德。治期於無治。刑期於無刑。而猶有傷人者乎。
L4  =兩不相傷者、謂在下之人。不作奸犯科。以干國令。在上之人。為慈祥惻怛以治民心。是上下相安。
    =而無相傷之弊也。則德盛化神。有不一道同風哉。 

H1  +此言無為之益，福利於民，反顯有為之害也。
    =凡治大國，以安靜無擾為主，行其所無事，則民自安居樂業，而蒙其福利矣。故曰若烹小鮮。
    :烹小鮮，則不可撓。撓，則靡爛而不全矣。治民亦然。
H2  :夫虐政害民，災害並至，民受其殃。不知為政之道，乃以鬼神為厲而傷人，反以祭祀以要其福。
    :其實君人者不道所致也。
    =若以道德君臨天下，則和氣致祥，雖有鬼而亦不神矣。不神，謂不能為禍福也。
    :且鬼神非無，然洋洋乎如在其上，如在其左右，豈不昭格於上下耶。第雖靈爽赫然，但只為民之福，不為民害。
    =故曰非其鬼不神，但其神不傷人耳。
H3  :然非其神不傷人，實由聖人含哺百姓，如保赤子。與天地合其德，鬼神合其吉凶，而絕無傷民之意，
    :故鬼神協和而致福也。
    =故曰非其神不傷人，聖人亦不傷之。
H4  :如湯之時，七年大旱。湯以身代犧牲，藉茅以禱，致雨三尺。
    =故民皆以湯王克誠感格所致，斯蓋由夫兩不相傷，故其德交歸焉。此無為之德，福民如此。

X1  =治大國，以安靜無擾為主，行其所無事，則民自安居樂業，蒙其福利。故曰若烹小鮮。蒞者，光臨、來到。道自臨天下。
X2  =道之行於天下，陰陽不紊，上下克敦，故鬼神各安其所而無紊亂也。
    =鬼神非無，洋洋乎如在上下左右。第雖靈爽赫然，但只為民之福，不為民害。故曰非其鬼不神，但其神不傷人耳。
X3  =聖人含哺百姓，如保赤子。與天地合其德，鬼神合其吉凶，而絕無傷民之意，故鬼神協和而致福也。
    =故聖人亦不傷之。
X4  =在下之人，不作奸犯科，以干國令。在上之人，為慈祥惻怛以治民心。
    =是上下相安，而無相傷之弊也。則德盛化神，有不一道同風哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§61 大者宜下

1 大國者下流|天下之交
2 天下之牝|牝常以靜勝牡|以靜為下
3 故|大國以下小國|則取小國|小國以下大國|則取大國
4 故|或下以取|或下而取
5 大國不過欲兼畜[xù]人|小國不過欲入事人|夫兩者各得其所
6 欲大者宜為下

L1  =大國、萬乘之國也。下流者、言天下之小國。皆如水之就下而歸服之也。交、卽朝聘之類。言天下之所樂交。
    =而輸其朝聘也。
L2  =牝、陰也。天下之牝者。言如天下之母也。牡、陽也。陽多剛而躁動。牝則柔而能靜。柔足以制剛。靜足以制動。
    =故謂以靜勝也。此言為大國者。宜主乎靜之意。孔子曰。為政以德。譬如北辰。居其所。而衆星拱之。
    =蓋北辰。至靜而不動者也。衆星常動。故拱向於北辰。非靜有以勝之乎。此意大抵相同。
    =以靜為下、言心處於靜。而卑以自牧也。
L3  =以下小國。如仁者以大事小之意。此承上而言。謂大國之君。若能靜以自虛。復下事於小國。則小國之人。
    =皆歸服於我。取之如反掌也。小國之君。亦靜以自處。而能以小事大。則國可保。而大國之民心亦可得也。
    =如孟子言湯事葛。文王事昆夷。以大事小也。而竟取小國。太王事獯鬻。句踐事吳。以小事大也。而皆取大國。
    =卽此之意云耳。
L4  =或下以取者、言大國之取於下也。下而取者。以小國而取大國也。或、無定之詞。言不在於地之險。國之強。
    =兵革之利。惟以靜為主也。
L5  =大國之心。其所欲者。不過欲統天下之人物。而兼畜之也。
    =小國弱則不能兼人而畜之。故所欲者。不過趨事於人。以求保護也。
    =兩者、謂欲兼畜人。欲入事人也。言強弱相依。永通和好。則各得其平安之所也。
L6  =欲大者、言欲成大國。合天下而為一也。宜為下者。言必以卑下自處為合宜。如文王之小心翼翼。不自崇高。
    =而後可成。 

H1  +此言君天下者，當以靜勝為主，不可以力相尚也。
    =夫流之在下者，如江海，衆水歸之。故大國之在天下，衆望歸之。故如流之在下，以為天下之交。
    =納汙含垢，無所不容。又虛而能受，如天下之牝也。
H2  =凡物之雌曰牝，雄曰牡，牡動而牝靜。動則不育，靜能有生，是牝以靜勝牡也。以此譬喻聖人之德。
    =然聖人為天下牝者。以天下之人，衣食皆賴之以生，爵祿皆賴之以榮，萬幾並集於一人。故君道無為，而皆任其所欲，
    =各遂其所生。所謂萬物皆往資焉而不匱，此似牝以靜勝牡也。是則靜為群動之歸趨，故以靜為下。
H3  =大字小，小事大，皆有以下之也。取者，得之易也。大字小，如母育子。小事大，如子奉母。精神相孚，
    =相得最易，故如掇之也。
H4  =然大字小，必有所容。故曰或下以取。以，猶左右之也。小事大，必有所忍。故曰或下而取。而，因而取之也。
    =皆無妄動之過，故交歸焉。
H5  =且大國之欲，不過兼畜人，非容無以成其大。小國之欲，不過入事人，非忍無以濟其事。
H6  =兩者旣各得其所欲，而大者更宜下。何也。以大國素尊，難於下耳，故特勉之。
    :此老子見當時諸侯，專於征伐，以力不以德，知動不知靜，徒見相服之難，而不知下之一字，為至簡之術。
    :蓋傷時之論也。

X1  =大國之在天下，衆望歸之。故如流之在下，以為天下之交。納汙含垢，無所不容。
X2  =凡物之雌曰牝，雄曰牡，牡動而牝靜。動則不育，靜能有生，是牝以靜勝牡也。以此譬喻聖人之德。
    =靜為群動之歸趨，故以靜為下。
X3  =大字小，小事大，皆有以下之也。取者，得之易也。大字小，如母育子。小事大，如子奉母。精神相孚，相得最易，故如掇之也。
X4  =然大字小，必有所容。故曰或下以取。以，猶左右之也。小事大，必有所忍。故曰或下而取。
    =而，因而取之也。皆無妄動之過，故交歸焉。
X5  =且大國之欲，不過兼畜人，非容無以成其大。小國之欲，不過入事人，非忍無以濟其事。
X6  =兩者旣各得其所欲，而大者更宜下。何也。以大國素尊，難於下耳，故特勉之。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§62 美言可市

1 道者 萬物之奧|善人之寶 不善人之所保
2 美言可以市|尊行可以加人
3 人之不善 何棄之有
4 故立天子 置三公|雖有拱璧以先駟馬|不如坐進此道
5 古之所以貴此道者何|不曰|求以得 有罪以免耶
6 故為天下貴

L1  =道者、玄遠幽深。萬物皆所化育。故曰萬物之深奧也。
    =善人率性而行。故以此道為珍寶。而拳拳服膺。永不相離也。
    =不善者。昧其心性。而不修道者也。然道亦生之成之。不使喪其身家。故曰不善者。亦賴此道以保護也。
L2  =美言、善言也。市、沽也。謂言之善者。可以沽名譽於人也。
    =尊行、善行也。加入、施之於人也。蓋己所不欲。固不可加之於人。我行之而尊重。則可以加人之身也。
L3  =棄、拒絶也。孔子曰。其不善者而改之。是不善者。卽為去惡之師也。而棄之乎。況彼之不善。無損於我。
    =我亦親愛教誨之而已。何必拒絶於人哉。子張云。我之大賢與。於人何所不容。我之不賢與。人將拒我。
    =如之何其拒人也。其意本此。
L4  =立天子。謂萬姓歸心。共尊之為天子也。三公、輔佐大臣也。置、天子建官也。
    =璧、圭玉也。駟馬、四馬所駕之車也。言立主建官。雖鞠躬執圭於前以示敬。駟馬以顯其尊榮。此皆小節也。
    =不如坐處於廊廟之上。為君者。則展道以安天下。為臣者。則進嘉謨於君前。乃可謂善矣。
L5  =古、古之人。如舜禹臯陶。皆不離乎道。是所貴者道也。
    =言今之為國者。何不遵古明訓。而日夜揣摩。以求得之於心也。
    =有罪。卽湯誓天下有罪。罪在朕躬之意。免、猶愧勉之勉。邪萬姓之不正也。言歸天下之罪於厥躬。使邪者自知愧勉。
L6  =故可正南面而立。使天下人。皆尊貴之也。 

H1  +此言道之為貴，誡人當勉力求之也。
    =道者，萬物之奧。奧者，室之西南隅。有室必有奧。但人雖居其室，而不知奧之深邃。
    :以譬道在萬物，施之日用尋常之間，人日用而不知，故如奧也。然道旣在萬物，足知人性皆同。
    :雖有善惡之差，而性未嘗異，以其俗習之偏耳。
    =故善人得之以為寶。惡人雖失，亦賴此道保之以有生。故曰所保。苟非其道以保之，則同無情瓦石矣。
    =足見理本同也，所謂堯舜與人同耳。由此觀之，天下豈有可棄之人耶。
H2  =且一言之美，則可以市。市，利也。一行之尊，則可以加於人之上。況大道之貴，豈止一言之美，一行之尊。
H3  =且人之全具而不欠缺一毫者，斯則不善之人，又何棄之有耶。
H4  =故立天子，置三公，雖有拱璧以先駟馬，不如坐進此道，此古語也。
    :老子解之曰，然天子三公，不足為尊貴。拱璧駟馬，不足為榮觀。總不如坐進此道。
H5  =所以貴此道者，何耶。豈不曰，求道以得之，縱有罪亦可以免之耶。
    :是知桀紂，天子也，不免其誅。四凶，三公也，不免其戮。
    =非無拱璧駟馬，而竟不能免其罪。故夷齊諫武王而不兵，巢許傲天子而不譴，豈非求以得有罪以免耶。
    =況夫一念復真，諸罪頓滅。
H6  =苟求而得，立地超凡。故為天下貴也。
 
X1  =奧者，室之西南隅，尊者所居，故為貴。道者萬物之奧，乃尊道為貴。
    =而道善待人之寶，不屑人之所保。人之寶，德也。人之所保，利也。
X2  =至理名言當利於人，尊行善事得人之心
X3  =人所不珍之物，何謂有棄？
X4  =故立王封官，貢送貴禮，不如坐而奉獻此道。
X5  =古之貴此道者，何耶。豈不曰，求道以得之，有罪亦免耶。
X6  =是故為天下貴

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§63 大細難易

1 為無為|事無事|味無味
2 大小多少
3 報怨以德
4 圖難於其易|為大於其細
5 天下難事 必作於易
6 天下大事 必作於細
7 是以聖人|終不為大 故能成其大
8 夫|輕諾必寡信|多易必多難
9 是以聖人|猶難之 故終無難

L1  =為、行之也。無為、不見所為也。:言聖人之所以為者。幽深玄遠。為之而亦若無為也。
    =事、卽所為者也。聖人清靜為主。:故所作之事。人不見其有事也。
    =味、五味也。無味者。言道以恬淡為上。故味深長。而人不知其味也。
L2  =大、物之大者。小、物之小者。多、數之多者。少、數之少者。言洽天下之道。以多易大。以少易小。各有所稱。
    =而民心乃均也。
L3  =怨、人之有怨恨於我者。報、復也。言怨相報復。則成大害。不如舍其怨。復施德以感之。則人自知慚愧也。
L4  =圖、謀也。難、事之難者。言欲為一難成之事。必於易成者圖之。由易以及難。則不見其難。而事已成也。
    =大、大事也。細、微也。言小者、大之基。若欲為大事。必先於微者立其基。而後大功可成也。
L5  =天下之難事如修道立德。至難者也。而矢志修途。惟日用行習。以及動靜語默之間。合理而已。
    =豈非易為哉。然皆由漸積而成。是以謂之作於易而成於難也。
L6  =天下大事。如治國平天下之事。至大者也。而所作必本於修身之理。此細事也。然身修而家齊。
    =家齊而國治。國治而天下平。非作於細而成於大哉。
L7  =聖人、知本末之切要。故不為其末而為其本。一言之兢。一行之必慎。所為者雖不大。而成功則大也。
L8  =諾、人有言而應之也。言之所出。信所攸關。若待出之於口。而不揆之於心。人有所求輒應之。
    =必多失信於人。而自取輕賤也。
    =易之與難。相為表裏。若徒恃其易。則事必難成。蓋易中亦有難者也。
L9  =聖人之心。裁制萬事。無不合宜。猶難之。言聖不輕以為易。而生玩忽之心。故常恐我之難成。
    =為終身憂辱。遂黽勉不遑。而於天下竟無難作之事也。 

H1  +此言聖人入道之要妙，示人以真切工夫也。
    :凡有為，謂智巧。有事，謂功業。有味，謂功名利欲。此三者，皆世人之所尚。
    =然道本至虛而無為。至靜而無事。至淡而無味。獨聖人以道為懷，去彼取此。
    =故所為者無為。所事者無事。所味者無味。
H2  =故世人皆以名位為大，以利祿為多而取之。然道至虛微淡泊無物，皆以為小少，故棄而不取。聖人去功與名，
    =釋智遺形，而獨與道游。是去其大多，而取其小少。故以至小為至大，至少為至多。故大其小，而多其少也。
H3  =試觀世人報怨以德，則可知矣。何也。
    :且世之人，無論貴賤，事最大而難解者，怨也。然怨之始也，偶因一言之失，一事之差。遂相搆結，
    :以至殺身滅名，亡國敗家之禍。甚至有積怨深憤，父子子孫，累世相報而未已者。此舉世古今之恆情也。
    :豈非其事極大且多哉。惟聖人則不然。察其怨之未結也，本不有。始結也，事甚小。旣結也，以為無與於己。
    :故無固執不化之心，亦無有我以與物為匹敵。其旣往也，事已消之，求其朕而不可得。以此觀之，則任彼之怨，
    :在我了無報之之心矣。然彼且以為有怨，在我全無報復之心，彼必以我為德矣。
    =是所謂報怨以德，非謂曲意將德以報怨也。
    :孔子以直報怨，正謂此耳。斯則怨乃事之至大而多，人人必有難釋者。
H4  :殊不知有至易者存焉。是所謂為無為，事無事，大其小，而多其少也。天下之事，何獨於怨，而事事皆然。
    =故天下之事至難者，有至易存焉。至大者，有至細存焉。
H5  =人不見其易與細，而於難處圖之，大處為之，必終無成。苟能圖之於易，而為之於細，鮮不濟者。
H6  =以天下難事必作於易。天下大事必作於細，故也。作者，始起也。
H7  =是以聖人虛心體道，退藏於密。跡愈隱而道愈光，澤流終古而與天地參。此所謂終不為大，故能成其大也。
H8  :老子言及至此，抑恐世人把易字當作容易輕易字看。故誡之曰，夫輕諾必寡信，多易必多難。
    :謂世人不可將事作容易看也。
    =且容易許人，謂之輕諾。凡輕許者，必食言而寡信。
    =見事之容易而輕為者，必有始而無終。是故易字，非容易也。
H9  :世人之所難，而聖人之所易。世人之所易，而聖人之所難。
    =故曰聖人猶難之，故終無難。猶，應作尤。古字通用。更也。謂世人之所甚易者，而聖人更難之，故終不難耳。
    :觀夫文王兢兢，周公業業，戒慎恐懼乎不睹不聞，皆聖人之所難也。余少誦圖難於易為大於細二語，
    :只把作事看。及余入山學道，初為極難，苦心不可言。及得用心之訣，則見其甚易。然初之難，卽今之易。
    :今之易，卽初之難。然治心如此，推之以及天下之事皆然。此聖人示人入道之真切工夫也。志道者勉之。

X1  =道本至虛而無為。至靜而無事。至淡而無味。故為而不著為，事而不著事，謀而不趨利。
X2  =以小為大，以少為多。
X3  =將德報怨，以任彼之怨，在我了無報之之心。然彼且以為有怨，在我全無報復之心，彼必以我為德矣。
X4  =天下之事至難者，有至易存焉。至大者，有至細存焉。故圖難則於易入，為大則於細啟。
X5  =天下難事，行之以易捷。
X6  =天下大事，作之於細小。
X7  =是以聖人虛心體道，退藏於密。跡隱而道光，澤流終古而與天地參。此所謂終不為大，故能成其大也。
X8  =夫 輕諾輕許，必寡信而不周，多易必多難。
X9  =是以聖人以難處事，故終無難。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§64 未兆易謀

1 其安易持
2 其未兆易謀
3 其脆易泮[pàn] 其微易散
4 為之於未有|治之於未亂
5 合抱之木 生於毫末|九層之臺 起於累土|千里之行 始於足下
6 為者敗之 執者失之
7 聖人無為 故無敗|無執 故無失
8 民之從事|常於幾成而敗之
9 慎終如始 則無敗事
10 是以聖人欲不欲|不貴難得之貨
11 學不學 復衆人之所過
12 以輔萬物之自然|而不敢為

L1  =安、安處也。持、扶也。危而扶持。則難於安也。故於安而扶持之。則無顛危之患也。
L2  =未兆。言未卜也。國之守龜。有事則卜。未兆易謀者。言謀之於無事之時。則易成其謀而不待卜也。
L3  =脆、弱骨也。言柔弱者。必易於破折也。
    =微細也。言物之細微則易散。而無影無形也。
L4  =未有、言無有德政也。能作為於未有德政之時。則所為者易成也。未亂、民心未變之時也。蓋世亂則難治。
    =於未亂而卽治之。則治天下不難也。
L5  =合抱之木、言其大也。毫末、細也。此言木之生也。本於毫末之細。積日累月。乃至合抱之大。可見由小而能大也。
    =九層之臺。極言其高也。累土、一簣之士也。言臺之至高。非一簣所能成。然推其本。必始於一簣。積累而成。
    =可見崇高者。必於下而得之也。
    =千里、言其遠也。蓋千里之遙。非朝夕所能到。然行之者。不辭跋涉。則程途盡在吾足下也。舍近而求遠者。
    =可不返而自思乎。
L6  =為者、必有成。敗之者。言為之不以其道。則事不成而無功也。執、得也。失之者。言得之而無堅守之力。
    =是以必失也。
L7  =聖人於成敗得失。則諳之熟也。故無為而成。乃不至於敗亂也。無執、謂不待夫矜持。惟仁以守之。故有得而無失也。
L8  =從事、卽為事也。幾成、謂將成也。敗之、謂不能成功而毀棄也。言民心無恆。多畏難而苟安。故作事將成而亦敗也。
L9  =慎、謹戒也。終者、事之末、始者、事之初。若為事者。能鼓其一往莫遏之氣。勤於始。復勤於終。兢兢
    =焉不敢稍懈。則無敗壞難成之事也。
L10 =欲、私欲也。言物類擾於心。則人多徇夫欲也。惟古之聖人。雖所欲之事。亦不累於心。而無貪得之意。
    =故於天下難得之貨。皆視如草芥。而不以為可貴也。
L11 =學、效也。後覺者。必效先覺之所為也。不學者。謂學業難成。人多畏難苟安而不學也。學不學。
    =言聖人於人所不學者。而必學之也。復、反其初也。過、失於道也。蓋聖人之無所不學者。將以復衆人於中道。
    =而去其過與不及也。
L12 =輔、相也。言萬物之生。皆賴道以裁成輔相。乃能各得其自然也。而不敢為者。言道之靜而不動。為則有近於動。
    =故不為也。

H1  +此釋上章圖難於易為大於細之意，以示聖人之要妙，只在為人之所不為，以為學道之捷徑也。
    +治人事天工夫，全在於此。安與末兆。蓋一念不生。喜怒未形。寂然不動之時。
    +吉凶未見之地。乃禍福之先。所謂幾先也。
    =持字，全是用心力量。
    :謂聖人尋常心心念念，朗然照於一念未生之前，持之不失。此中但有一念動作，當下就見就知。是善則容，
    :是惡則止，所謂早復。孔子所謂知幾其神乎。此中下手甚易，用力少而收功多。
    =故曰其安易持。
H2  =兆，是念之初起。未兆，卽未起。:此中喜怒未形，而言謀者。
    =此謀，非機謀之謀，乃戒慎恐懼之意。於此著力，圖其早復。
    :蓋第一念為之於未有也。若脆與微，乃是一念始萌，乃第二念耳。
H3  =然一念雖動，善惡未著，甚脆且微。
H4  =於此著力，所謂治之於未亂也。
H5  :合抱之木以下，三句皆譬喻。
    =毫末，喻最初一念。
    =累土足下，喻最初一步工夫也。
    :上言用心於內，下言作事於外。
H6  =為執二句，言常人不知著力於未然之前，卻在旣發之後用心。為之則反敗，執之則反失矣。
H7  =聖人見在幾先，安然於無事之時，故無所為，而亦無所敗。虛心鑒照，故無所執，而亦無所失。
    :以其聖人因理以達事耳。
H8  =常民不知在心上做，卻從事上做，費盡許多力氣，且每至於幾成而敗之。
    :此特機巧智謀，有心做來，不但不成，縱成亦不能久，以不知聽其自然耳。
H9  =慎終如始。始，乃事之初。終，乃事之成。
    :天下之事，縱然盈乎天地之間。聖人之見，察其始也本來不有。以本不有，故將有也，任其自然，而無作為之心。
    =及其終也，事雖已成，觀之亦似未成之始，亦無固執不化之念，此所謂慎終如始，故無敗事也。
H10 :是以以下，總結聖人返常合道也。
    =若夫衆人之所欲者，功名利祿，玉帛珍奇。
H11 =所學者，權謀智巧。
    :火馳於此，往而不返，皆其過也。至於道德無為，皆以為賤而所不欲，以為無用而不學。故恃智好為，以傷自然之樸。
    =聖人離欲釋智，以復衆人之過耳。
H12 =以恃萬物之自然，故終不敢為也。
    :莊子內聖外王學問，全出於此。
    :吾人日用明此，可以坐進此道。以此用世，則功大名顯。伊周事業，特緒餘耳。豈不至易哉。

X1  =其安易持
X2  =其未兆易謀
X3  =其脆易泮[pàn] 其微易散
X4  =為之於未有|治之於未亂
X5  =合抱之木 生於毫末|九層之臺 起於累土|千里之行 始於足下
X6  =為者敗之 執者失之
X7  =聖人無為 故無敗|無執 故無失
X8  =民之從事|常於幾成而敗之
X9  =慎終如始 則無敗事
X10 =是以聖人欲不欲|不貴難得之貨
X11 =學不學 復衆人之所過
X12 =以輔萬物之自然|而不敢為

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§65 將以愚之

1 古之善為道者|非以明民 將以愚之
2 民之難治 以其智多
3 以智治國 國之賊|不以智治國 國之福
4 知此兩者 亦楷式
5 能知楷式 是謂玄德
6 玄德深矣遠矣
7 與物反矣 乃至於大順

L1  =善為道者。善於修道之聖人。明、明之也。蓋聰明者。每多任性而妄為。
    =故善於修道者。不啟民之聰明。以使習於華麗也。
    =愚、不識不知也。詩有云。不識不知。順帝之則。卽治之有導。而民之醇厚如愚也。
L2  =智、聰明也。此言治民者。不使民歸於樸實。而徒啟其聰明。則民之自矜才智者。遂多奸詐邪淫。
    =靡所不至也。而欲治之。不亦難乎
L3  =以智治國。言不效善為國者之所為。而徒恃其才智設政令以防閑。具刑律以警戒。非惟治國無功。
    =且為治國之賊害也。
L4  =不以智治國者。言不逞其聰明。以導民於奸巧之俗也。蓋智則風俗遂至於淩夷。若治國者。
    =厚澤深仁以及之。則民心自醇。而太平有象。故國之福也。
    =兩、卽智與不智二等。楷、規模也。式、則效也。言此二者。或從或去。亦治國之規模也。
L5  =常知楷式者。謂常以二者為懷。為國之福者則效之。為國之賊者則去之。是謂能志於道。而得其玄妙者然也。
L6  =所謂玄德者。言道之高遠幽深。至於無極也。物、私欲也。蓋私欲每觸物而生。人心每因物而變。
    =有物存於心。而玄德遂喪。
L7  =故道之與物。兩相反矣。
    =順、順於理。合於義也。言玄德之積於身而措於事。乃能順乎理之大端也。 

H1  +此言聖人治國之要，當以樸實為本，不可以智誇民也。
    :明者，昭然揭示之意。愚者，民可使由之不可使知之之意。夫民之所趨，皆觀望於上也，所謂百姓皆注其耳目。
    :凡民之欲蔽，皆上有以啟之。故上有好者，下必有甚焉者也。故聖人在上，善能以斯道覺斯民，當先身以教之。
    :上先不用智巧，離欲清淨，一無所好，若無所知者。則民自各安其日用之常，絕無一念好尚之心。
    :而黠滑之智自消，奸盜之行自絕矣。所謂我好靜而民自正，我無為而民自化。
    =故曰非以明民，將以愚之。此重在以字。:前云衆人皆有以。以，如春秋以某師之以。謂左右之也。
H2  =此其上不用智，故民易治耳。然民之難治者，皆用智之過也。
H3  =足知以智治國者，反為害也，乃國之賊。
    =不用智而民自安，則為國之福矣。
H4  =人能知此兩者，可為治國之楷式也。楷式，好規模也。
H5  =苟能知此楷式，是謂之玄德矣。
H6  :玄德，謂德之玄妙，而人不測識也。
    =故歎之曰，玄德深矣遠矣。:非淺識者所可知也。
H7  :民之欲，火馳而不返。
    =唯以此化民，則民自然日與物相反，而大順於妙道之域矣。
    :語曰，齊一變至於魯，魯一變至於道。猶有智也。況玄德乎。

X1  =明者，昭然揭示之意。愚者，民可使由之不可使知之之意。
    =夫民之所趨，皆觀望於上也，所謂百姓皆注其耳目。凡民之欲蔽，皆上有以啟之。
    =故聖人在上，善能以斯道覺斯民，先身以教之，不用智巧，離欲清淨，一無所好，若無所知者。
    =則民自各安其日用之常，絕無一念好尚之心。
    =故曰非以明民，將以愚之。此重在以字。
X2  =此其上不用智，故民易治耳。然民之難治者，皆用智之過也。
X3  =足知以智治國者，反為害也，乃國敗之因。不用智而民自安，則為國之福矣。
X4  =人能知此兩者，可為治國之楷式也。楷式，好規模也。
X5  =苟能知此楷式，是謂之玄德矣。
X6  =故歎之曰，玄德深矣遠矣。:非淺識者所可知也。
X7  =唯以此化民，則民自然日與物相反，而大順於妙道之域矣。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§66 處下不爭

1 江海所以能為百谷王者|以其善下之 故能為百谷王
2 是以聖人|欲上民 必以言下之
3 欲先民 必以身後之
4 是以聖人|處上而民不重|處前而民不害
5 是以天下樂推而不厭
6 以其不爭|故天下莫能與之爭

L1  =谷、幽深之處。水所居也。百谷、言流水縱橫之多也。百川皆歸於江海。故江海為百谷之王。王、主也。
    =其所以能納百川而歸一者。旣有涵容之量。又有謙卑之德。是以百谷推之為王而歸之也。
L2  =此承上而言。以明治天下之宜下也。故有道之聖人欲居於民之上。亦必以謙恭遜順之言。
    =下言於羣黎。而以下為本也。
L3  =先民者。為天下倡。居民之先也。以身後之。言雖欲居先。而必以民為先務。不先私及其身也。
L4  =不重、言敬重乎聖人。而不自為尊重也。不害、謂民皆隨其後。不為悖理叛上之害也。此言聖人能下於民。
    =故居上位而民無輕慢之心。身後於民。而民有遵行之意。其功效也如此。
L5  =樂、心悅誠服也。推、輸將於上也。不厭、無倦怠也。言聖人之居其下。後其身。故民心悅誠服。
    =而蠲納賦稅。無倦怠也。
L6  =其故何哉蓋聖人不與民爭。而天下之人。亦莫與之爭也。 

H1  +此教君天下者，以無我之德，故天下歸之如水之就下也。
    =百川之水，不拘淨穢，總歸於江海。江海而能容納之，以其善下也。
    :此喻聖人在上，天下歸之，以其無我也。
H2  =欲上民，必以言下者。言者，心之聲也。故君天下者，尊為天子。
    =聖人虛心應物，而不見其尊，故凡出言必謙下。
    :如曰孤寡不穀，不以尊陵天下也。
H3  =欲先人，必以身後之者。身者，心之表也。君天下者，貴為天子，天下推之以為先。
    :聖人忘己與人，而不自見有其貴。故凡於物欲，澹然無所嗜好，不以一己之養害天下也。
H4  :重者，猶不堪也。是則聖人之心，有天下而不與。
    =故雖處上，而民自堪命，不以為重。雖處前，而民自遂生，不以為害。
H5  =此所以天下樂推而不厭。蓋無我之至，乃不爭之德也。此爭非爭鬥之謂，蓋言心不馳競於物也。
H6  =以其不爭，故天下莫能與之爭。莊子所謂兼忘天下易，使天下忘己難。此則能使天下忘己，故莫能與之爭耳。

X1  =百川之水，不拘淨穢，總歸於江海。江海而能容納之，以其善下也。
X2  =欲上民，必以言下者。言者，心之聲也。故君天下者，尊為天子。
    =聖人虛心應物，而不見其尊，故凡出言必謙下。
X3  =欲先人，必以身後之者。身者，心之表也。君天下者，貴為天子，天下推之以為先。
X4  =重者，猶不堪也。是則聖人之心，有天下而不與。
    =故雖處上，而民自堪命，不以為重。雖處前，而民自遂生，不以為害。
X5  =此所以天下樂推而不厭。蓋無我之至，乃不爭之德也。此爭非爭鬥之謂，蓋言心不馳競於物也。
X6  =聖人不與民爭，而天下之人，亦莫與之爭也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§67 三寶慈衛

1 天下皆謂我道 大似不肖[xiào]
2 夫惟大 故似不肖|若肖 久矣其細
3 我有三寶 持而寶之|一曰慈 二曰儉|三曰不敢為天下先
4 慈 故能勇
5 儉 故能廣
6 不敢為天下先|故能成器長[zhǎng]
7 今捨慈且勇 捨儉且廣|捨後且先 死矣
8 夫慈 以戰則勝 以守則固
9 天將救之 以慈衛之

L1  =大、能容物也。不肖、無能也。言我之廣大。能容萬物。人皆謂我為一無所能之人也。
L2  =此言唯能廣大容衆。不與天下爭。故似於不肖之人。一無所能者然也。
    =肖、賢者也。久、悠久也。細、細微也。言若賢者之所為。則心有恆而自能長久。常謹慎於細微也。
L3  =我、老子自謂。言得道之要有三。老子以為珍寶。而時刻懷藏也。
    =慈、仁德也。儉、本質也。不敢為天下先。謙遜之德也。此三者。德之基故老子以為寶也。
L4  =慈者。親親仁民愛物之心。而何以能勇哉。此所謂勇者。蓋德足以勝物。
    =如文王之一怒而安天下之民。非血氣之勇也。
L5  =守其儉則紛華悉去。奢侈皆除。以復其性生之理。由此而道全德立。廣大莫備也。器、所以盛物者。
    =如百官之任事是也。長、居其上也。
L6  =言能謙遜以待人接物。雖不敢為天下先。而天下之人。必推尊之。故能成其萬物之長也。
L7  =今、謂後世之人。舍慈且勇。謂不存慈仁惻怛之心。而徒恃其血氣之勇。若撫劍疾視者然也。舍儉且廣。
    =謂不務樸實。而徒務乎虛文。以求其廣大也。舍後且先。謂不以謙遜自守。而徒居於衆人之先也。
    =死、謂喪身也。蓋不慈而勇者。太剛必折也。不儉且廣者。無本必傾也。舍後且先者。人所共惡也。
    =由此思之。不死何為。
L8  =能敦慈愛之德。而戰則勝者。蓋我以慈惠施於兵卒之間。則兵士懷德。而勇可鼓也。況慈仁者。天下所樂
    =與。彼民陷於塗炭之中。我兵若至。民必簞食壼漿以相迎。兵必倒戈而相向也。何不可勝哉。
    =守、謂守城也。言國小兵微。而困於鄰國。則必堅守也。然地利不如人和。若能以慈仁之德惠及於民。則
    =民心相和。而守乃能堅固也。
L9  =天將救之者。言皇天無親。惟德是輔。人以慈愛為德人能體慈愛之心。則合乎天意。天亦將救其災難也。
    =衛、保護也。言天何能救人哉。亦惟以慈仁之德。衛護衆生而已也。 

H1  +此章老子自言所得之道至大，世人不知，其實所守者至約也。
    =道大，如巍巍乎惟天為大，蕩蕩乎民無稱焉，言其廣大難以名狀也。不肖，如孔子云不器。
    :太史公謂孟子迂遠而不切於事情之意。卽莊子所謂大有徑庭，不近人情也。此蓋當時人見老子其道廣大，
    =皆如下文所云，以勇廣器長稱之，且不得而名，故又為不肖，卽若孔子稱之猶龍也。故老子因時人之言，
    =乃自解之曰，天下人皆謂我之道大，似乎不肖，無所可用。
H2  =惟其大，所以似不肖耳。肖者，與物相似。如俗云一樣也。
    =若肖，作一句。久矣其細，作一句。倒文法耳。
    :謂我若是與世人一樣，則成細人久矣，又安得以道大稱之哉。
H3  :下文釋其大之所以。謂世人皆見其物莫能勝我，遂以我為勇。
    =見我寬裕有餘，遂以我為廣。見其人皆推我為第一等人，遂以我為器長。器者，人物之通稱也。
    =以此故，皆謂我道大，其實似無所肖。
    =殊不知我所守者至約。乃慈，儉，不敢為天下先，三法而已。
H4  =慈者，并包萬物，覆育不遺，如慈母之育嬰兒。
    =且無己與物敵，物自莫能勝矣。故曰慈故能勇。
H5  =儉者，嗇也，有而不敢盡用。
    =心常自足，雖有餘而不用，所處無不裕然寬大矣。故曰儉故能廣。
H6  =不敢為天下先者，虛懷游世，無我而不與物對。然以慈育物，物物皆己。
    =物我兩忘，超然獨立，而不見有己以處人前。故人皆以我為畸人，推為人中之最上者矣。
    =故曰不敢為天下先，故能成器長。
    :以此故，皆以我為道大似不肖耳。以我所守者如此，卽前所云我獨異於人，而貴求食於母也。
    =以此三者，乃大道之要妙耳。
H7  =且今世人，捨慈而言勇，捨儉而言廣，捨後而言先，死矣。此死字，非生死之死，如禪家所云死在句下。
    =蓋死活之死，言其無生意也。以世人不知大道之妙，但以血氣誇侈爭勝做工夫。
    =故一毫沒用頭，皆死法，非活法也。
H8  :且此三者之中，又以慈為主。不但學道，卽治天下國家莫不皆然。
    =若以戰則勝，以守則固，故王師無敵，民效死而勿去，皆仁慈素有所孚，故為戰勝守固之道。
    :此所謂道之真以治身，其緒餘以為天下國家。以天地之大德曰生。
H9  =故天將救斯民，而純以慈衛之。
    =故聖人法天利用，而以慈為第一也，世俗惡足以知之。
    :故知治世能用老氏之術，坐觀三代之化。所以漢之文景，得糟粕之餘，施於治道，迴超百代耳。
    :此老子言言皆真實工夫，切於人事，故云甚易知易行。
    :學人視太高，類以虛玄談之，不能身體而力行，故不得其受用耳。惜哉。

X1  =道大，如巍巍乎惟天為大，蕩蕩乎民無稱焉，言其廣大難以名狀也。不肖，不器也。
    =天下人皆謂我之道大，似乎無所可用。
X2  =惟其大，所以似不肖耳。肖者，與物相似。如俗云一樣也。
X3  =我所守者至約，乃慈，儉，不敢為天下先，三法而已。
X4  =慈者，并包萬物，覆育不遺，如慈母之育嬰兒。且無己與物敵，物自莫能勝矣。
X5  =儉者，嗇也，有而不敢盡用。雖有餘而不用，所處無不裕然寬大矣。
X6  =虛懷游世，無我而不與物對。然以慈育物，物物皆己。
    =物我兩忘，超然獨立，而不見有己以處人前。故人皆以我為畸人，推為人中之最上者矣。
X7  =且今世人，捨慈而言勇，捨儉而言廣，捨後而言先，死矣。
    =此死字，非生死之死，如禪家所云死在句下。
X8  :且此三者之中，又以慈為主。不但學道，卽治天下國家莫不皆然。
    =若以戰則勝，以守則固，故王師無敵，民效死而勿去，皆仁慈素有所孚，故為戰勝守固之道。
X9  =故天將救斯民，而純以慈衛之。故聖人法天利用，而以慈為第一也，世俗惡足以知之。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§68 善戰不怒

1 善為士者不武
2 善戰者不怒
3 善勝敵者不爭
4 善用人者為之下
5 是謂不爭之德
6 是謂用人之力
7 是謂配天 古之極

L1  =士、儒者也。善為士者。修德於身。惟以經綸治天下。臨事而懼。好謀而成。不為赳赳武夫也。
L2  =怒則傷肝。傷肝則胆裂。必懼而取敗。故善戰者不怒也。
L3  =勝戰、謂戰則必勝也。不與、不與爭鬬也。言善於戰勝之人。以智取勝。不徒刀劍相迎也。
L4  =善用人者、言舉賢用才。朝無倖位之君。為下者、如周公之握髮吐哺。下禮賢士也。
L5  =不爭之德、謂不武不怒。
L6  =而戰必勝者。皆有德之人。一無所爭者能之也。用人之力。承上善用人者而言。
L7  =蓋能下禮賢士。則朝無倖位。可謂得其力也。配天古之極。承上不爭之德。用人之力而言。
    =謂如此之人。道可以配天地。德可以配古人。其尊重至極也如此。 

H1  +此言聖人善於下人，以明不爭之德，釋上三寶之意也。一章主意，只在善用人者為之下一句。
    =乃假兵家戰勝之事，以形容其慈，乃不爭之至耳。士者，介胄之士。武者，武勇。然士以武為主。
H2  =戰以怒為主。勝敵以爭為主。三者又以氣為主。況善於為士者不用武。善於戰者不在怒。
H3  =善於勝敵者不必爭。卽前所云以慈用兵也。意謂武怒爭三者，獨兵事所必用。
H4  =若用之而必死，故善者皆不用。何況常人，豈可恃之以為用耶。
H5  =乃驕矜恃氣，不肯下人，故人不樂其用，乃不善用人耳。故古之善用人者，必為之下，卽此是謂不爭之德也。
H6  =若以力驅人，能驅幾何。若以下驅人，則天下歸之。是以下用人，最有力也。
H7  =所謂上善若水，水善利萬物而不爭，以其有力也。是謂配天古之極者。
    :乾天，坤地。若天地正位，則為否，而萬物不生。若乾下坤上，則為泰。是知天在上而用在下也。
    :聖人處民上而心在下，可謂配天之德。此古皇維極之道，置百姓於熙皞至樂之中。
    :斯豈不爭之德以治天下，而為力之大者與。
    +此章主意，全在不用氣上做工夫。卽前云專氣致柔，能如嬰兒。純和之至，則形化而心忘。不見物為對，
    +則不期下而自下矣。殆非有心要下，而為用人之術也。然學人有志於謙德，則必尊而光，況聖人無我之至乎。

X1  :乃假兵家戰勝之事，以形容其慈，乃不爭之至耳。
    =士者，介胄之士。武者，武勇。然士以武為主。
X2  =戰以怒為主。勝敵以爭為主。三者又以氣為主。況善於為士者不用武。善於戰者不在怒。
X3  =善於勝敵者不必爭。卽前所云以慈用兵也。意謂武怒爭三者，獨兵事所必用。
X4  =若用之而必死，故善者皆不用。何況常人，豈可恃之以為用耶。
X5  =乃驕矜恃氣，不肯下人，故人不樂其用，乃不善用人耳。
    :故古之善用人者，必為之下，卽此是謂不爭之德也。
X6  =若以力驅人，能驅幾何。若以下驅人，則天下歸之。是以下用人，最有力也。
X7  =所謂上善若水，水善利萬物而不爭，以其有力也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§69 哀兵必勝

1 用兵有言|吾不敢為主 而為客|不敢進寸 而退尺
2 是謂|行[xíng]無行[háng] 攘[rǎng]無臂|仍無敵 執無兵
3 禍莫大於輕敵|輕敵幾喪吾寶
4 故抗兵相加|哀者勝矣

L1  =用兵有言、謂用兵之策。會有明訓。以下卽其言也。
    =吾不敢為主。謂我師不妄動也。凡先至為主。後至為客。而為客者。必俟彼兵之出。我師乃迎之也。
    =不敢進寸。謂守我邊疆。不過爭於人也。退尺者。如避三舍之意。言我師旣退。彼復相追。是曲在彼。
    =而直在我。自能取勝也。
L2  =行、卽行軍也。言如此行兵。我之理直氣壯。亦無損於行也。攘、奪也。臂、與悖同。違於理也。
    =言我雖攘奪人之器械邊疆。亦不悖於理也。仍、相繼也。敵、爭鬬也。言用兵如此。雖相繼而戰。
    =無有能敵於我者也。執、謂得不義而擒之也。無兵、言不待兵革之利也。
L3  =禍、災難也。敵、寇兵也。言行兵之道。貴於謹慎。不可輕視敵人也。若或不然。而防閑不堅。軍戎不整。
    =遽欲與敵相抗。則必有敗亡之禍也。
    =此言輕敵者。則必有浮躁之習。而無慈仁之心。是喪其寶。一也。輕敵者。精兵飾於外。嬴弱積於中。
    =是不務本質而無儉德。此失其寶。二也。每輕進以爭先。是失其寶。三也。故老子曰。輕敵者幾喪吾寶也。
L4  =抗、相對敵也。哀、謂以兵戎為可哀。而恐懼戒慎也、蓋輕敵者。恃強則多敗。戒慎則謀成。故能取勝矣。 

H1  +此重明前章不爭之德，以釋上三寶以慈為本之意也。然慈，乃至仁之全德也。所謂大仁不仁。以其物我兼忘，
    +內不見有施仁之心，外不見有受施之地。故凡應物而動，皆非出於有心好為，蓋迫不得已而後應。
    +故借用兵以明慈德之至也。
    =何以知之。且如古之用兵者有言曰，吾不敢為主而為客，不敢進寸而退尺。
    :以此觀之，足可知也。古之用兵，如涿鹿孟津之師是也。兵主，如春秋征伐之盟主。蓋專征伐，主於兵者，
    :言以必爭必殺為主也。
    =客，如諸侯應援之師。本意絕無好殺之心。今雖迫不得已而應之，然亦聽之待之，若可已則已。
    =以無心於功利，故絕無爭心，所以進之難而退之易。故曰不敢進寸而退尺。言身進而心不進，是以退心進也。
H2  =以無爭心，故雖行而如不在行陣，雖攘而若無臂之人。仍，相仍，猶就也。言彼以我為敵，而我以彼為敵也。
    =雖就，亦似無敵可對。雖執，猶若無兵可揮。
H3  =戒懼之至，而不敢輕於敵。由不敢輕敵，所以能保全民命，不傷好生之仁。然禍之大者莫大於輕敵。
    =以輕敵則多殺，多殺則傷慈，故幾喪吾寶矣。
H4  =抗兵，乃兩敵相當，不相上下，難於決勝。但有慈心哀之者，則自勝矣。
    :何則，以天道好生，助勝於慈者也。由是觀之，兵者對敵，必爭必殺以取勝。
    =今乃以不爭不殺而勝之，蓋以慈為本故也。足見慈乃不爭之德，施於必爭地，而以不爭勝之，豈非大有力乎。
    =用之於敵尚如此。況乎聖人無物為敵，而以平等大慈，并包萬物，又何物而可勝之耶。
    =故前云不爭之德，是謂用人之力，是謂配天古之極。
    +此章舊解多在用兵上說，全不得老子主意。今觀初一句，乃借用兵之言。至輕敵喪寶，則了然明白。
    +是釋上慈字，以明不爭之德耳。

X1  =古之用兵者有言曰，不為主而為客，不進寸而退尺。
    =客，如諸侯應援之師。本意絕無好殺之心。今雖迫不得已而應之，然亦聽之待之，若可已則已。
    =以無心於功利，故絕無爭心，所以進之難而退之易。言身進而心不進，是以退心進也。
X2  =以無爭心，故雖行而如不在行陣，雖攘而若無臂之人。
    =仍，相仍，猶就也。言彼以我為敵，而我以彼為敵也。雖就，亦似無敵可對。雖執，猶若無兵可揮。
X3  =戒懼之至，而不敢輕於敵。由不敢輕敵，所以能保全民命，不傷好生之仁。然禍之大者莫大於輕敵。
    =以輕敵則多殺，多殺則傷慈，故幾喪吾寶矣。
X4  =抗兵，兩敵相當，不相上下，難於決勝。但有慈心哀之者，則自勝矣。
    :何則，以天道好生，助勝於慈者也。
    :由是觀之，兵者對敵，必爭必殺以取勝。今乃以不爭不殺而勝之，蓋以慈為本故也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§70 被褐懷玉

1 吾言甚易知 易行
2 天下莫能知 莫能行
3 言有宗 事有君
4 夫惟無知 是以不我知
5 知我者希 則我者貴
6 是以聖人彼褐懷玉

L1  =吾言甚易知。此老子言此語甚明。人所易曉也。甚易行者。言非舍近而求遠。卽動靜語默之間。
    =人所易行之事也。
L2  =天下莫能知者。言天下之人。皆習焉不察。故無有能知者也。莫能行。言人皆求難而不求易也。此四句。
    =如孔子言中庸之道夫婦之愚。可以與知。夫婦之不肖。可以與能。而行中庸之道者竟鮮。意亦相同。
L3  =宗、本也。君、主也。言出言者。勿忘其本。卽言顧行是也。人以心為主。凡欲為事者。必心有主。
    =而後可為也。
L4  =無知、乃承上莫能知而言。謂不知此道也。不我知者。老子言不知道之人。必以吾言為虛論。
    =而不知我之玄妙也。
L5  =希、少也。則、法也。貴、居於人之上也。老子言人之知我者少。故貴者亦少。若以吾言為則效。則可以為邦。
    =而居於衆人之上也。
L6  =被、披也。褐、粗布衣也。玉、寶也。懷、藏也。聖人抱道自高。守器待時。如被褐之貧窮。亦必卷而懷之耳。
    =如子貢問於孔子曰。有美玉於斯。韞匱而藏諸。求善價而沽諸。孔子答以待善價而沽。卽此意也。 

H1  +此章示人立言之指，使知而行之，欲其深造而自得也。
    =老子自謂我所言者，皆人人日用中最省力一著工夫。明明白白，甚容易知，容易行。
H2  =只是人不能知，不能行耳。
H3  =以我言言事事，皆以大道為主，非是漫衍荒唐之說。故曰言有宗，事有君。宗，君，皆主也。
H4  =且如一往所說，絕聖棄智，虛心無我，謙下不爭，忘形釋智，件件都是最省力工夫，放下便是，
    =全不用你多知多解。只在休心二字，豈不最易知最易行耶。
    =然人之所以不能知者，因從來人人都在知見上用心。除卻知字，便無下落。以我無知無識一著，極難湊泊，
    =所以人不知我耳。故曰夫惟無知，是以不我知。
H5  :然無知一著，不獨老子法門宗旨，卽孔子亦同。如曰吾有知乎哉，無知也，有鄙夫問於我空空如也，此
    :豈不是孔聖亦以無知為心宗耶。此夫子見老子後，方得妙悟如此。故稱猶龍，正謂此耳。
    =然以無知契無知，如以空合空。若以有知求無知，如以水投石。所以孔老心法，千古罕明。
    =故曰知我者希。若能當下頓悟此心，則立地便是聖人，故曰則我者貴。
    :則，謂法則。言取法也。
H6  =聖人懷此虛心妙道以遊世。則終日與人周旋，對面不識。故如披褐懷王。
    :永嘉云，貧則身常披縷褐，道則心藏無價珍。此一章書，當在末後結束。蓋老子向上一往所言天人之蘊，
    :至此已發露太盡，故著此語。後章只是要人在日用著力做工夫，以至妙悟而後已。

X1  =我所言者，明明白白，甚易知，易行。
X2  =然人不能知，不能行。
    :何以故？天下以上士為希。而中士聞道，若存若亡。下士聞道，大笑之矣。
X3  =以我言言事事，皆以大道為主，非是漫衍荒唐之說。故曰言有宗，事有君。宗，君，皆主也。
X4  =且如一往所說，絕聖棄智，虛心無我，謙下不爭，忘形釋智，放下，不用多知多解。
    =只在休心二字，豈不最易知最易行耶。
    =然人從來都用心於知見上。以我無知無識一著，極難湊泊，所以人不知我耳。
X5  =以無知契無知，如以空合空。若以有知求無知，如以水投石。所以孔老心法，千古罕明。故曰知我者希。
    =若能當下頓悟此心，則立地便是聖人，故曰則我者貴。則，謂法則。言取法也。
X6  =聖人懷此虛心妙道以遊世。則終日與人周旋，對面不識。故如披褐懷王。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§71 病病不病

1 知不知 上
2 不知知 病
3 夫惟病病 是以不病
4 聖人不病
5 以其病病 是以不病

L1  =知、知此道也不知上者。言修道之人。日躋於上。
L2  =而不自知也。不知言我所不知者也。病、有損於吾身者也。言我所不知者。則闕疑以求其知。若以不知為知。
    =則所累於吾身者不淺也。
L3  =病病者、言知弊端之事。損於吾身。而常恐其病已也。不病、言常以為憂。則操守必嚴。而弊端不起於吾身也。
L4  =聖人之心。無一毫之累。是不病也。
L5  =以其病者。言猶兢兢自持。恐其弊病之未能去也。病是以不病。言所憂者在於弊病。則弊自不病於吾身也。
    =此節。言人不可以知之自許。不可以無過自居。必時時省察。念念思維。乃能成其知而去其病也。 

H1  +此承上言惟無知，是以不我知。恐人錯認無知，故重指出無知之地也。
    =然世人之知，乃敵物分別之知，有所知也。聖人之知，乃離物絕待，照體獨立之知，無所知也。
    =故聖人之無知，非斷滅無知，乃無世人之所知耳。無所知，乃世人所不知也。世人所不知，乃聖人之獨知。
    =人能知其所不知之地，則為上矣。故曰知不知上。
H2  =若夫臆度妄見，本所不知，而強自以為知。或錯認無知為斷滅，同於木石之無知。
    =此二者皆非真知，適足為知之病耳。故曰不知知病。
H3  =若苟知此二者為知之病，則知見頓亡，可造無知之地，而無強知妄知之病矣。故曰夫惟病病，是以不病。
H4  =聖人但無強妄之知，故稱無知，非是絕然斷滅無知也。故曰聖人不病。
H5  =此段工夫，更無別樣玄妙。唯病其妄知強知是病而不用。是以不墮知病之中，而名無知。此無知，乃真知。
    =若如此真知，則終日知而無所知。斯實聖人自知之明，常人豈易知哉。
    =此所以易知易行，而世人不能知不能行也。
    =古云，知之一字，衆妙之門。知之一字，衆禍之門。然聖人無知之地，必假知以入。若悟無知，則妄知自泯。
    =此乃知之一字，衆妙之門也。若執有知以求無知，則反增知障，此乃衆禍之門。正是此中知之病也。
    =知不知上，最初知字，正是入道之要。
    :永嘉云，所謂知者，但知而已，此句最易而難明。學者日用工夫，當從此入。

X1  =人能知其所不知之地，則為上矣。
X2  =若夫臆度妄見，本所不知而強以為知。或錯認無知為斷滅，同於木石。
    =此二者皆非真知，適足為知之病耳。
X3  =若識此知之二病為病者，則知見頓亡，而去強知妄知之病矣。
X4  =聖人但無強妄之知，故稱無知，非是絕然斷滅無知也。
X5  =以此知病之明，儘管尚未得道，終究不病矣。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§72 無厭所生

1 民不畏威 大威至矣
2 無狎[xiá]其所居 無厭[压yà]其所生
3 夫惟不厭[yàn] 是以不厭
4 是以聖人自知不自見[xiàn]|自愛不自貴 故去彼取此

L1  =畏、懼也。威、嚴也。民不畏威者。言入則無法家拂士。出則無敵國外患。民之蕩檢踰閑。一無所畏也。
    =大威、猶大患也。言國家如此。則大患將臨。而喪無日矣。
L2  =狹、不正也。居、私居也。言卽私居暗室之中。亦不可茍於言行。失其禮貌也。厭、棄也。所生、卽天所生之人類也。
    =言不見絶於人之意。
L3  =此言在上者。獨能不棄絶於人。是以百姓歸之。而不棄絶於君也。
L4  =自知、謂生而知之。於萬事無不曉也。不自見者。言不自以為所見之明。必揆情度理。而後為之也。
    =自愛、言自成其身。惟恐失其身也。不自貴。言雖自愛其身。而不自高於天下也。去、彼、謂去其不善。
    =如上文所言。失於道者皆是也。取此、言卽取於不病以其病。不狹其所居。不厭其所生。故能如是也。 

H1  +此章教人遺形去欲，為入道之工夫，以造聖人無知之地也。
    =凜然赫然而可畏者，謂之威。如云寒威，炎威，是也。是則凡可畏者，皆謂之威。唯國之大罰，與天地之肅殺，
    =乃大威也。此借以為戕生傷性者之喻。世人以為小惡不足戒，而不知畏，必致殺身而後已。
    =此民不畏威，大威至矣。喻世人祇知嗜欲養生，而不知養生者，皆足以害生而可畏也。
    =且若嗜酒色，必死於酒色。嗜利欲，必死於利欲。嗜飲食，必死於飲食。
    =是則但有所嗜，而不知畏，必至於戕生傷性而後已。此不畏威，故大威至矣。
H2  =然人但知嗜而不知畏者，以其止知有身之可愛，有生之可貴，以此為足。而不知大有過於此者，性也。
    =且吾性之廣大，與太虛同體，乃吾之真宅也。
    =苟以性視身，則若大海之一涵，太虛之一塵耳，至微小而不足貴者。
    =人不知此，而但以蕞爾之身。以為所居之地。將為至足，而貴愛之，則狹陋甚矣。故戒之曰，無狹其所居。
    =狹其居者，將以此身此生為至足也。故又戒之曰，無厭其所生。厭，足也。
H3  =若知此身此生之不足貴，則彼物欲固能傷生，亦不足以害我矣，以其無死地也。故曰夫惟不厭，是以不厭。
    =厭，棄也。
H4  =故聖人自知尊性，而不見生之可養。自愛遺形，而不見身之可貴。此聖人之所獨知，世人之所不知也。
    =故去彼衆人之所知，取彼所不知，以為道之要妙耳。
    :以此足見世人之所知者，皆病也。聖人病之而不取，故不病也。
    +後三章互相發明此章之旨。

X1  =民無智慧，不畏入世、出世之法，則災難至矣，或為自然，或為王難。
X2  =在上者不當輕慢民之居、民之存，蓋民亦法天地而見也。
X3  =若上不厭民，民自歸矣。又若不厭民，則民本不可厭，則平等心現前。
    =厭，棄也。
X4  =故聖人自知尊性，而不見生之可養。自愛遺形，而不見身之可貴。此聖人之所獨知，世人之所不知也。
    =故去彼衆人之所知，取彼所不知，以為道之要妙耳。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§73 勇於不敢

1 勇於敢 則殺
2 勇於不敢 則活
3 此兩者 或利或害|天之所惡[wù] 孰知其故
4 是以聖人猶難之
5 天之道 不爭善勝
6 不言而善應
7 不召而自來
8 繟[chǎn]然而善謀
9 天網恢恢 疏而不失

L1  =敢、果敢也。勇於敢。謂血氣剛強。欲行則行。有進無退。而無一毫懼怯於人。是謂之勇於敢者也。殺、
    =言必為人所殺也。蓋硜硜之行。如以木擊石。有損而無疑也。況勇者多驕。每造犯上悖理之行其干於法律死者。
    =往往然也。
L2  =勇於不敢。謂性雖剛強。而有涵容之德。怒不見於色。慮勝而後會。是以猶可全其身命也。
L3  =此兩者。卽指勇於敢。勇於不敢者而言。謂一則喪命。一則全身。二者之或利或害。人當以當何如也。
    =利、吉也。害、凶也。言勇於敢者。大傷天地之和。故天乃惡之。是以遭其殺戮也。誰人可得而知乎。
L4  =聖人、道全德備者也。猶難之者。恐躁氣之難化。心性之難純。而必兢兢焉不敢輕忽也。
L5  =天道高明。照臨於下。萬物被其長養。而天不與物爭。故能克勝萬物也。欲體天道者。必去其爭競之心。
    =乃能善於取勝也。
L6  =不言、謂天本無言也。善應、謂善於應事也。言天道之發洩者。本無言可相通。而四時行焉。百物生焉。
    =其與不相應者。莫不皆善也。
L7  =不召、謂道雖玄遠。不待求之也。自來者、各充足於身。如物之來而得之者然也。
L8  =繟然、猶闇然幽深也。善謀、謂所為天下萬姓謀者。無不善也。
L9  =天網、言天道福善禍淫。如法網之大彰也。恢恢、溥徧無遺。鑒靈不爽也。失、遺漏也。疎者則易於遺漏。
    =而天網雖疏。其於作惡之人。必降以殃。而莫可逃脫也。此言天道之發見也如此。蓋福善禍淫。本無差錯。
    =惟天佑于一德。為人君者。不可不體此也。 

H1  +此言天命可畏，報應昭然，教人不可輕忽也。
    =勇者，決定之志也。敢者，不計利害而決於為也。殺活，死生也。
    =謂凡世人作事，不顧利害，不怕死生，而敢為之。
    =然敢乃必死之地。故曰勇於敢則殺。
H2  =若用志於不敢為，是足以保身全生。故曰勇於不敢則活。
    :此天道必然之理也。
H3  =且此二者，亦有敢而生，不敢而死者。至若顏子夭，而盜蹠壽，此乃當害而利，當利而反害者，何耶。
    =況天道好謙而惡盈，與善而惡惡。是則為惡者，當惡而不惡，斯豈報應差舛耶。世皆疑之。
    =故解之曰，天之所惡，孰能知其故。故，所以然也。
    :孔子曰，無求生以害仁，有殺身以成仁。由此觀之，生存而仁害，雖生亦死。身滅而仁成，雖死亦生。
    :斯則蹠非壽，顏非夭矣。
    :此乃天道所以然之妙，而非世人所易知。
H4  =是以聖人於此猶難之，不敢輕忽，而敬畏之。所謂畏天之威，於時保之也。故下文歷示天道之所以。
H5  =逆天者亡，故不爭而善勝。
H6  =感應冥符，故不言而善應。
H7  =吉凶禍福如影響，故不召而自來。
H8  =然報愈遲，而惡愈深，禍愈慘，故繟然而善謀。以報速者有所警，報緩則不及悔，必至盡絕而後已。
    =此所謂善謀也。
H9  =是則天道昭昭在上，如網之四張，雖恢恢廣大，似乎疏闊。其實善惡感應，毫髮不遺。此所謂疏而不失也。
    =世人不知天命之如此，乃以敢以強以爭競於名利之場。將謂一身之謀，不顧利害死生而為之，自謂智力以致之。
    =蓋不知命之過，皆取死之道也。可不畏哉。

X1  =勇者，決定之志也。敢者，不計利害而決於為也。然敢乃必死之地。
X2  =若用志而慎為，是足以保身全生。
X3  =且此二者，亦有敢而生，不敢而死者。
    =天道好謙而惡盈，與善而惡惡。或有為惡者，當惡而不惡，斯豈報應差舛耶。世皆疑之。故解之曰，天之所惡，
    =孰能知其故。
X4  =是以聖人於此猶難之，不敢輕忽，而敬畏之。所謂畏天之威，於時保之也。
X5  =逆天者亡，故不爭而善勝。
X6  =感應冥符，故不言而善應。
X7  =吉凶禍福如影響，故不召而自來。
X8  =繟然，闇然幽深也。
    =然報愈遲，而惡愈深，禍愈慘，故天之道，繟然而善謀。以報速者有所警，報緩則不及悔，必至盡絕而後已。
X9  =是則天道昭昭在上，如網之四張，雖恢恢廣大，似乎疏闊。其實善惡感應，毫髮不遺。此所謂疏而不失也。
    :世人不知天命之如此，乃以敢以強以爭競於名利之場。將謂一身之謀，不顧利害死生而為之，自謂智力以致之。
    :蓋不知命之過，皆取死之道也。可不畏哉。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§74 代斫傷手

1 民不畏死 奈何以死懼之
2 若使民常畏死|而為奇者 吾將執而殺之|孰敢
3 常有司殺者殺
4 夫代司殺者殺|是謂代大匠斲[zhuó]|夫代大匠斲者|希有不傷手矣

L1  =民不畏死。言百姓之心。不以死為可畏也。以死懼之。謂法律森嚴以恐懼之也。蓋治民者。道以德。
    =又齊以禮則心自生慚愧。而有畏懼也。若以刑律懼之。則身至於死。而無羞愧之心。是不畏死也。
    =今之長民者。奈何徒示威於百姓乎。
L2  =奇、異端也。言非聖人之道。而能使天下之人。皆知畏死而不為非者。老子言吾將以道為虛假。亦橫行於天下。
    =執人而殺之也。何須以道為哉。孰敢言殺人者無赦。孰敢為殺人之事也。
L3  =常有司殺者。言亦有常為有司所殺之人也。有司卽理刑官。言人雖不可殺而頑梗之徒。亦法律所應誅者也。
L4  =代司殺者、言無殺人之權。而為殺人之事也。大匠、木工也。斲、伐木也。大匠習其業。能堅操其柄。
    =乃不至於自傷。若未習其事。而卽代大匠以斲木。有不傷其手者乎。此節。言治國之不可殺人。必教之有素。
    =而奸頑罹法。有司乃得而誅之若或不然。而亂施殺戮。則必自喪其身。如代斲者之傷手者然也。 

H1  +此承上章天道無言，而賞罰不遺，以明治天下者當敬天保民，不可有心尚殺以傷慈也。
    +治天下者，不知天道，動尚刑威，是以死懼民也。
    =老子因而欺之曰，民不畏死，奈何以死懼之耶。以愚民無知，但為養生口體之故。
    =或因利而行劫奪，或貪欲而嗜酒色。明知曰蹈死亡，而安心為之，是不畏死也。如此者衆，豈得人人而盡殺之耶。
H2  =若民果有畏死之心，但凡有為奇詭之行者，吾執一人而殺之，則足以禁天下之暴矣。如此，誰又敢為不法耶。
    =民旣不畏死，殺之無益，適足以傷慈耳。夫天之生民，必有以養之。
H3  =而人不知天，不安命，橫肆貪欲以養生。甚至不顧利害，而無忌憚以作惡，是乃不畏天威。
    =天道昭昭，必將有以殺之矣。
    =是居常自有司殺者殺，無庸有心以殺之也。所謂天生天殺，道之理也。
H4  =今夫人主，操生殺之權，乃代天之威以保民者。
    =若民惡貫盈，天必殺之。人主代天以行殺，故云代司殺者殺，如代大匠斲也。且天鑑昭明，毫髮不爽。
    =其於殺也，運無心以合度，揮神斤以巧裁。不疾不徐，故如大匠之斲，運斤成風而不傷鋒犯手。
    =至若代大匠斲者，希有不傷手矣。何也。夫有心之殺，乃嗜殺也。嗜殺傷慈。且天之司殺，實為好生。
    =然天好生，而人好殺，是不畏天而悖之，反取其殃。此所以為自傷其手也。
    :孟子曰，不嗜殺人者能一之，此語深得老子之餘意。故軻力排楊墨，而不及老莊，良有以焉。至哉仁人之言也。

X1  =若民不畏死，如此者衆，奈何以死懼之，豈得人人盡殺耶。
X2  =若民果有畏死之心，但凡有為奇詭之行者，吾執一人而殺之，則足以禁天下之暴矣。
    =民旣不畏死，殺之無益，徒傷慈耳。
X3  =而人不知天，不安命，橫肆貪欲以養生。甚至不顧利害，而無忌憚以作惡，是乃不畏天威。
    =天道昭昭，必將有以殺之矣。所謂天生天殺，道之理也。
    =是居常自有司殺者殺，無庸有心以殺之也。
X4  =今夫人主，操生殺之權，乃代天之威以保民者。
    =若民惡貫盈，天必殺之。人主代天以行殺，故云代司殺者殺，如代大匠斲也。且天鑑昭明，毫髮不爽。
    =其於殺也，運無心以合度，揮神斤以巧裁。不疾不徐，故如大匠之斲，運斤成風而不傷鋒犯手。
    =至若代大匠斲者，則為有心之殺。嗜殺傷慈。且天之司殺，實為好生。
    =然天好生，而人好殺，是為悖之，反取其殃。故自傷其手也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§75 賢於貴生

1 民之飢|以其上食稅之多|是以飢
2 民之難治|以其上之有為|是以難治
3 民之輕死|以其求生之厚|是以輕死
4 惟無以生為者|是賢於貴生

L1  =飢、餓也。食稅之多。言在上者食用耗繁。所稅斂於民者多。是以民窮國病。餓莩滿於道路也。
L2  =難治、謂難以化民成俗。而天下太平也。難治之由。其故何哉。蓋在上者常有所為。或皆廢時失業。
    =勞民傷財之事。是以民多謗讟。而不服其命令。故難治也。
L3  =輕死、不以身命為重也。好生惡死。人之恆情。而民乃以死為輕者。以其求生於世。而暴虐者厚。
    =是以甯死而不求生也。
L4  =唯、獨也。無以生為者。言民之在世。無以擾其生也。賢於貴生。謂民安其生。則以生為貴也。 

H1  +此釋上章民不畏死之所以，教治天下者當以淡泊無欲為本也。
    =凡厥有生，以食為命。故無君子莫治野人，無野人莫養君子，是則上下同一命根也。然在上之食，必取稅下民。
    =一夫之耕，不足以養父母妻子。若取之有制，猶可免於飢寒。若取之太多，則奪民之食以自奉，使民不免於死亡。
H2  =凡賊盜起於飢寒也，民旣飢矣，求生不得，而必至於奸盜詐偽，無不敢為之者。雖有大威，亦不畏之矣。
    =是則民之為盜，由上有以驅之也。旣驅民以致盜，然後用智術法以治之。故法令茲彰，盜賊多有，此民所以愈難治。
H3  =雖有斧銊之誅，民將輕死而犯之矣。由是推之，民之輕死，良由在上求生之厚以致之，非別故也。厚，重也。
    :此句彰前當有一上字，方盡其妙。
H4  =然重於求生，以但知生之可貴，而以養生為事，不知有生之主。苟知養生之主，則自不見有身之可愛，有生之可貴。
    +欲自消而心自靜，天下治矣。所謂我無為而民自化，我好靜而民自正，我無事而民自富，我無欲而民自樸。
    +故曰夫惟無以生為者，是賢於貴生。賢，猶勝也。此中妙處，難盡形容。當熟讀莊子養生主，馬蹄胠篋諸篇，
    +便是注解。又當通前四章反復參玩，方見老子喫緊處。

X1  =凡厥有生，以食為命。故無君子莫治野人，無野人莫養君子，是則上下同一命根也。然在上之食，必取稅下民。
    =一夫之耕，不足以養父母妻子。若取之有制，猶可免於飢寒。若取之太多，則奪民之食以自奉，使民不免於死亡。
X2  =凡賊盜起於飢寒也，民旣飢矣，求生不得，而必至於奸盜詐偽，無不敢為之者。雖有大威，亦不畏之矣。
    =是則民之為盜，由上有以驅之也。旣驅民以致盜，然後用智術法以治之。故法令茲彰，盜賊多有，此民所以愈難治。
X3  =雖有斧銊之誅，民將輕死而犯之矣。由是推之，民之輕死，良由在上求生之厚以致之，非別故也。厚，重也。
    :此句彰前當有一上字，方盡其妙。
X4  =然重於求生，以但知生之可貴，而以養生為事，不知有生之主。苟知養生之主，則自不見有身之可愛，有生之可貴。
    +欲自消而心自靜，天下治矣。所謂我無為而民自化，我好靜而民自正，我無事而民自富，我無欲而民自樸。
    +故曰夫惟無以生為者，是賢於貴生。賢，猶勝也。此中妙處，難盡形容。當熟讀莊子養生主，馬蹄胠篋諸篇，
    +便是注解。又當通前四章反復參玩，方見老子喫緊處。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§76 尚柔斥剛

1 人之生也柔弱|其死也堅強|萬物草木之生也柔脆|其死也枯槁
2 故堅強者 死之徒|柔弱者 生之徒
3 是以|兵強則不勝 木強則共
4 強大處下 柔弱處上

L1  =生、謂稟天命而生。柔弱者。初成形而受氣。手不能舉。足不能行故也。幼而壯。壯而老。其筋骨至於堅強。
    =則死也。萬物草木之生也。柔脆。其死也枯槁。萬物、兼萬類而言。草木、地土之所長。柔脆、言生之時。
    =柔而且弱也。枯槁、乾焦也。物老而衰。以至於枯槁乾焦之時。則死也。
L2  =故堅強者死之徒。柔弱者生之徒。
L3  :此二句。承上文而言。謂生於柔弱。而死於堅強。可見人之宜柔而不宜剛也。
L4  =是以兵強則不勝。木強則共。強大處下。柔弱處上。
    :兵之強者必輕敵。故不能取勝。而反以取敗也。木之強大者。則共推其強大。而有斧斤之伐也。
    :大處下、如木之大者。必生於原隰之下。乃能成大也。
    :其生於上者。則必小而難大。此喻強者則不能取勝。居下者乃能成大。
    :言人之不可自高自強也。

H1  +此章傷世人之難化，欲在上者當先自化，而後可以化民也。結句乃本意，上文皆借喻以明之耳。
    :經曰，此土衆生，其性剛強，難調難化。
    =故老子專以虛心無為不敢，為立教之本。全篇上下，專尚柔弱而斥剛強。
H2  =故此云，堅強者死之徒，柔弱者生之徒，乃借人物草木為喻。
H3  =是以兵喻戒懼，木喻心虛。言兵若臨事而懼，不敢輕敵，故能全師以自勝。是以全生為上，而多死為下也。
    :木之枝條，以沖氣為和。故欣欣向榮，而生意自見。
H4  =是以虛心柔弱在上。若成拱把，則麤幹堅強者在下矣。以此足知戒懼虛心，柔弱翕受者，方可處於民上也。
    :若夫堅強自用，敢於好為，則終無有生意矣。此語大可畏哉。

X1  =生，謂稟天命而生。柔弱者，初成形而受氣，手不能舉，足不能行故也。
    =幼而壯，壯而老。其筋骨至於堅強，則死也。
    =萬物草木之生也，柔脆。其死也枯槁，乾焦也。
X2  =堅強者，死之相。柔弱者，生之相。
X3  =兵愈強，則謀愈大，離道則遠。兵強不過天，故不勝。木強則伐，豬肥則殺。
X4  =真強在下不在上。柔弱在上不在下。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§77 為而不恃

1 天之道 其猶張弓乎
2 高者抑之 下者舉之
3 有餘者損之|不足者補之
4 天之道|損有餘而補不足
5 人之道則不然|損不足以奉有餘
6 孰能有餘 以奉天下|唯有道者
7 是以聖人 為而不恃
8 功成而不處|其不欲見[xiàn]賢耶

L1  =張、設也。弓、所以射者也。言天道如弓之張而不弛也。
L2  =太高者。必抑而下之。太下者必舉而上之。
L3  =損、虧之也。與、益之也。
    =盈者必虧。故損其有餘。虛而必盈故增益其不足。以此觀之。
L4  =抑、下之也。舉、上之也。
    =可見天道循環。損其有餘。以補其不足。使人同歸於中道也。
L5  =人道。謂世俗所行者。損不足。如民之饑饉相因。而在上之暴斂頻施也。奉有餘者。倉廩實。府庫充。
    =而猶朘於民以自奉也。
L6  =今世之人誰能以有餘之財。而給天下不足之萬姓也。唯、獨也。言獨有道者。乃能以有餘而補天下之不足也。
L7  =為而不恃言聖人之所為。皆有益於天下之事。而不自恃其功也。
L8  =功成謂治國之功已成也。而不處者。聖人不居其功也。不欲、謂心所不願也。
    =見賢、謂以賢士之名。見稱於天下也。

H1  +此言天道之妙，以明聖人法天以制用也。
    =弓之為物，本弣高而有餘，弰下而不足，乃弛而不用也。
H2  =及張而用之，則抑高舉下，
H3  =損弣有餘之力，以補弰之不足。上下均停，然後巧於中的。否則由基逢蒙，無所施其巧矣。
H4  =天之道亦猶是也。以其但施而不受，皆損一氣之有餘，以補萬物之不足，均調適可，故各遂其生。
H5  =人道但受而不施，故人主以天下奉一己。皆損百姓之不足，以補一人之有餘，裒寡益多，故民不堪其命。
H6  =誰能損有餘以奉天下哉。唯有道者，達性分之至足，一身之外皆餘物也。
    :故堯舜有天下而不與，卽以所養而養民，乃能以有餘奉不足也。是以聖人與道為一，與天為徒。
H7  =故法天制用，雖為而不恃其能，
H8  =雖成而不居其功，此損之至也。損之至，故天下樂推而不厭。雖不欲見賢，不可得也。
    :其不欲見賢耶一句，謂我心本不欲見賢，而人自以我為賢矣。此益也，由損而至。
    :故唯天為大，唯堯則之，此之謂也。

X1  =天知道，如張弓射擊之理論。
X2  =居高下射則抑之力，居下舉射則增其功。
X3  =有餘者損之，不足者補之，張弓之道也。
X4  =天之道也，亦復如是。
X5  =人道而反之。
X6  =以其有餘以奉天下者，為替天行道者也。
X7  =為而不恃言聖人之所為。皆有益於天下之事。而不自恃其功也。
X8  =利益天下而不居其功，心量廣大不欲現賢德，是真德也。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§78 柔弱勝強

1 天下莫柔弱於水|而攻堅強者 莫之能先
2 以其無以易之也|故柔之勝剛
3 弱之勝強|天下莫不知|莫能行
4 是以聖人云|受國之垢 是謂社稷主
5 受國之不祥|是謂天下王
6 正言若反

L1  =天下之物五行統之。水屬陰而秉乎柔。故為至柔者也。攻、攻取也。言堅強者非所易取。而以柔攻之。
    =未有知其能勝乎強也。
L2  =無以易之。言皆以為難而無以為易也。
L3  =弱之勝強。柔之勝剛。天下莫不知。莫能行。
　  +上二句。言弱者必勝。強者必敗。柔者必成。剛者必折。故弱可以勝強。柔可以勝剛。理當然耳。天下萬姓。
    +誰不知之乎。然人竟無有能行此道者也。
L4  =聖人云。此老子引上古聖人之語。垢、塵垢也。受國之垢。言受命於天而得國。
    =而國中塵垢不潔之事。推之於我。我亦受之而不辭。故能為社稷之主也。
L5  =不祥、凶事也。言國中災異不祥之事。而能以身受之。不使遺害於萬姓。故能為天下之王也。
L6  =正言、承上受國之垢與不祥。而反為社稷之主。天下之王而言。蓋言雖出於正理。而其詞若與事相反也。

H1  +此結通篇柔弱之意，欲人知而能行也。無以易之。易，輕易也。卽左傳訓師無易敵之易。
    =謂師之柔弱，則敵人有以料而易之以取勝。至若水之柔弱，則人莫能料。
    =莫能料，故無以易之，而卒莫能以取勝。
    =此所以攻堅強者莫之能先。
H2  =莫能先，謂無有過於此也。世人皆以柔弱為不足取，率輕易之。
H3  =故天下皆知之而莫能行，以柔弱為垢辱不美之稱故也。
H4  =祥，猶嘉美也。是以凡稱人君，則曰乾剛能斷有為，遂以為明君。若夫無為，則國人皆以柔弱為恥辱而不美矣。
    :故聖人云，果能以柔弱處上，恬澹無為，能受一國之恥垢者，則為社稷真主。
H5  =能受一國不美之名者，則為天下明王矣。
    :如堯之垂拱無為，則野老謳曰，帝力何有於我哉。此受國之垢也。
H6  =然柔弱無為，乃合道之正言，但世俗以為反耳。

X1  =天下之柔弱莫過於水，然攻堅強者無以爭先，蓋彼之剛強無以用，而柔弱之勢無以防。
X2  =以其至柔而無以能敵，故柔勝剛。
X3  =是以柔勝剛，弱勝強，得天道也。天下雖知，終莫能行，乏聖人之智也。
X4  =故上古聖人語，受國中塵垢不潔之事者，實為社稷之主也。
X5  =受國中不詳之事者，實為天下之王也。
X6  =世俗無智，以真理為反言。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§79 天常與善

1 和大怨 必有餘怨|安可以為善
2 是以聖人|執左契而不責於人
3 有德司契 無德司徹
4 天道無親 常與善人

L1  =和大怨。謂和好之極。久則必疎。疎則相結仇怨。而大生嫌隙也。餘怨。謂念念不忘。常存恨怨於心也。
    =為善者。必有容人之量。乃至於搆怨。如此。則怨欲常存。焉可以為善哉。
L2  =契、記也。左契、言立監於左。以記其言行也。聖人責己厚而薄責於人。故能遠怨也。
L3  =有德、謂所行合於德也。司契、有可記之於書也。無德、謂所行不合於德。徹、去也。言聖人若有失德之行。
    =司契者。乃告之聖人而去之也。
L4  =親、愛也。與、受也。言天本無偏受於人。天之所受者。惟積善之人而已。

H1  +此言聖人無心之恩，但施而不責報，此為當時計利者發也。然恩生於怨，怨生於恩。
    +當時諸侯兩相搆怨，霸者主盟而為和之。
    =大怨旣和，而必責報。報之不至，而怨亦隨之，是有餘怨也。莊子云，賊莫大於德有心。故曰安可以為善。
H2  =是以聖人無心之德，但施而不責報。故如貸之執左契，雖有而若無也。契，貸物之符券也。
    =合同剖之，而有左右。貸者執右，物主執左，所以責其報也。
H3  =有德司契，但與而不取，徒存虛契。無德司徹，不計彼之有無，必征其餘，如賦徹耳。徹，周之賦法。
    :謂時至必取於民，而無一毫假借之意。然上責報而下計利，將謂與而不取，為失利也。
H4  =殊不知失於人，而得於天。故曰天道無親，常與善人。且施而不取，我旣善矣。
    :人不與而天必與之，所謂自天佑之，吉無不利。豈常人所易知哉。
 
X1  =大怨旣和，而必責報。報之不至，怨則隨之，終有餘怨也。
    :莊子云，賊莫大於德有心。
    =故善安難求。
X2  =聖人無心之德，但施而不責報。如貸之執左契，雖有而若無也。
X3  =有德司契，但與而不取，徒存虛契。無德司徹，不計彼之有無，必征其餘，如賦徹耳。徹，周之賦法。
X4  =天道不偏不袒，然常與善人。法爾如是。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§80 國泰民安

1 小國寡民|使有什伯[bǎi]人之器而不用
2 使民重[zhòng]死而不遠徙[xí]
3 雖有舟輿無所乘之
4 雖有甲兵無所陳之
5 使民復結繩而用之
6 甘其食 美其服|安其居 樂其俗
7 鄰國相望|雞狗之聲相聞|民至老死不相往來

L1  =小國、地弱政繁故民少也。十人為什。百人為伯。什伯人之器。言器具足以供衆人之用也。而不用者。
    =謂使其用之不窮也。
L2  =重死者。言一國之民。德以懷之。仁以播之。義以安之。禮以成之。信以孚之。則民皆服於教化。
    =甯死以守國也。徙、遷也。謂不以征戰之勞。遂流離於他國也。
L3  =舟、水行者。輿、陸行者。舟車之利。而無所乘之者。謂民安於無事。不待跋涉之勞也。
L4  =雖有甲兵。無所陳之。甲、皮革也。兵、戈矛也。陳、設也。言雖有甲兵之器亦無所用也。
    =此言治天下不以兵車之意。
L5  =結繩、上古之世也。言使民復歸於樸。如上古之民。結繩而治也。
L6  =甘其食。謂民享富足。所食者。皆美味也。美其服。謂種桑養蠶。繅絲織帛。以為衣服。民之所著者皆華美。
    =而無寒冷之患也。安其居。謂上下相安於無事。得其居處也。樂其俗。謂風俗醇美。上下相為樂也。
L7  =望、守望也。言交於鄰國有道。而兵戈不作。相為守望也。雞犬之聲相聞。言如此治國。雖國小民寡。
    =而近說遠來。士者立於其朝。耕者耕於其野。人烟驟密。比閭相接。雞鳴犬吠。互相聞其聲也。
    =禮尚往來此言不相往來者。謂各守其業。無奪無爭。不以寃仇往來報復也。

H1  +此結通篇無為之益，施於治道，可復太古之化也。
    =什伯之器，並十曰什，兼百曰伯。器，材也。
    :老子自謂以我無為之治，試於小國。縱使有兼十夫百夫之材者，亦無所用之，以民淳而無事故也。
H2  =若國多事，煩擾於民。或窮兵致亂，重賦致饑。民不安其居，則輕死而去之。今一切無之，故使民重死，而不遠徙。
H3  =舟輿，水陸之具。不遠徙，故雖有舟車無所用。
H4  =不尚爭，故雖有甲兵無所陳。陳，列也。
H5  =不用智，故可使結繩而用之如太古矣。
H6  =民各自足其足，絕無外慕之心。不事口體，故以尋常衣食為甘美，以平居里俗為安樂。
H7  =曰與鄰國雞狗相聞。至近之地，民至老死而不相往來。如此，則淳樸之至，乃太古之化也。
    +老子所言，疾當時之弊，皆有為用智剛強，好爭尚利，自私奉己，而不恤於民。故國亂民貧，而愈難治。
    +所以治推上古，道合無為，全篇所論，不出乎此，蓋立言之本旨也。故終篇以此，請試而行之，
    +可以頓見太古鴻荒之化。言取效之速如此也。所謂一日克己復禮，天下歸仁，深有味乎此言也。
    +老氏之學，豈矯世絕俗之謂哉。

X1  =最佳政體，以國小民孤為上。大器惟大國所用。棄而不用，國不做大。
X2  =令民寧死不遷，忠於本土。
X3  =縱有舟輿，非為遠行。
X4  =雖有甲兵，太平安樂，刀戈無用。
X5  =使民復古，清心寡欲。
X6  =安居滿足，以平居里俗為安樂。
X7  =各家各國好自為之，鄰國人民不相往來。蓋有往來，既有攀緣、攀比之心。心將不安，終釀禍事。

//  =〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇
§81 聖道不爭

1 信言不美 美言不信
2 善者不辯 辯者不善
3 知[zhì]者不博 博者不知[zhì]
4 聖人不積
5 旣已為人 己愈有
6 旣已與人 己愈多
7 天之道 利而不害
8 聖人之道 為而不爭

L1  =美、美好也。言之有信者。多直。直則無阿譽之容。故言不中聽。而不見其美好也。美言、巧言也。
    =言之巧者。徒取悅於人。而與行相違。故不合於信也。
L2  =善者、有德之人。不辯、謂不恃其善也。凡有德者。則欲訥於言。而不為謄口之說。囂囂辯論也。
    =辯者多言之士。如戰國湻于髠之徒。舌陣縱橫。隨機應答。而考其實。則非善者也。
L3  =博、多見多聞也。知者以心會道。而不外求。故不徒以見聞也。博者謂記問之學。徒見多而聞廣。
    =不求體會於心。故學無益。而竟不知乎道也。
L4  =聖人明夫道。故積於中。必發於外。不徒積於身也。
L5  =為人、謂將以治人也。言推此道及於天下萬姓。而聖人亦無所虧、道愈增其高大也。
L6  =與人、謂以道授之於人也。言以道授之於人。而己之德業愈多也。
L7  =天之道、卽陰陽五行之理。利而不害。言有利於萬物。而無害於萬物也。
L8  =聖人之道、卽虛無自然之理。為、謂施於天下也。而不爭者。言聖人一無所爭。而民亦莫與之爭也。
    +經大旨。以無為為道。清靜為德。全篇首領。俱在於此。讀者其玩索而得焉。長生立命。治國安邦。
    +莫不在是也。尚其欽哉。

H1  +此結通篇立言之旨，以明老氏立教之宗也。信言不美者，斯乃釋疑之辭。以明道本無言，因言顯道之意也。
    +首章云，道可道，非常道。以可道之道，乃言說也。老子自謂道若可言，卽非真道矣。
    +今上下五千餘字，豈非言耶。旣已有言，則道非真矣。因於終篇以自解之，以釋後世之疑耳。
    =然信，舊注實也。謂真實之言，卽由衷之言也。美言，華美之言，乃巧言也。
    :老子意謂道本無言，因言以顯。但我所言者，字字皆從真實理中流出，第藉之以彰道妙，故信實而不美。
    :非若世人誇誕浮辭，雖美而不信也。
H2  :且世衰道微，人心不古。當時學者不達無言之旨，乃嘵嘵好辯尚博，各擅專門。如楊朱墨翟御寇公孫之徒，祖述相傳，
    :以辯博為宗，自以為善。殊不知以多歧亡羊，多方喪真，去道轉遠。老子因而斥之曰，孰知不言之教，不辯之辯哉。
    =以彼辯者，則不善於道。果善於道，則自不辯矣。
H3  =且道本無言，乃至約也。但了悟於心，可目擊而喻，妙契無言，自不容聲矣，何事於博哉。故曰知者不博。
    =時人不知出此，徒事多聞，增益知見，以博為知，其實不知多言數窮。故曰博者不知。
H4  =以彼不知大道體虛，運而不積。而彼以積為務，故愈增障礙。
H5  =殊不知有積則有散，有散則有窮。無積則無散，無散則無窮。由聖人體虛合道，忘言任真，了無所積。
H6  =由其不積，則不窮。所謂虛而不屈，動而愈出。如樞得環中，以應無窮。故旣已為人己愈有，旣已與人己愈多也。
H7  =且天乃無言之聖，聖乃有言之天。以天道不積，其體至虛。故四時運而不竭，利盡萬物而不傷其體。
    =故曰天之道利而不害。害，非害物之害。乃不傷己之意。
H8  =聖人法天利用，故終日運用，為物作則，而了然無物可當於情。故曰為而不爭。爭，謂與物競也。斯蓋虛心遊世，
    =超然獨立於萬物之上矣。老子學問工夫，真實直捷處，盡在於此。
    +故結全書立言之旨，妙盡於是矣。學者勉哉。

X1  =實言雖中聽，終得善利；巧語順耳，無有利益。
X2  =善者，有德之人。不辯，謂不恃其善也。凡有德者，則欲訥於言。
    =好辯多言之士，為求勝辯，語未全真，非善者也。
    :多歧亡羊，多方喪真，去道轉遠。
X3  =般若無知，無所不知，是真智也，真博者也。有知，即有不知，無以博也。世智聰辯而已。
X4  =至聖之人，無所以積。蓋大道無量，有積則有限量。
X5  =常為人者，福報自滿。
X6  =常施人者，自得愈多。
X7  =天乃無言之聖，聖乃有言之天。以天道不積，其體至虛。
    =天人同一，無有彼此，故惟利而不害。
X8  =聖人法天利用，故終日運用，為物作則，而了然無物可當於情，何爭只有？何有可爭？
`;


class DDJCommentaryIntro {
  constructor(ttl, txt) {
    this.title = ttl;
    this.txt = txt;
    this.parts = [];
    this._parse();
  }
  isTitle(ttl) { return this.title == ttl; }
  _parse() {
    var pts = this.parts, curpart;
    var a = this.txt.split('\n');
    for (var i in a) {
      var ln = a[i].trim();
      if (!ln) continue;
      if (ln[0] == '#') pts.push( curpart = [ ln.substring(1) ] );
      else curpart.push(ln);
    }
  }
  render(n) {
    var buf = new Buffer('<table width="900px"><tr><td><hr>');
    var len = this.parts.length, i = n ? (n-1) : 0;
    for (; i<len; ++i) {
      var curpart = this.parts[i];
      buf.w('<p class="caption">', curpart[0], '</p>');
      for (var j=1; j<curpart.length; ++j) {
        var ln = curpart[j];
        var cls = ln[0] == '@' ? 'footnote' : '';
        if (cls) ln = ln.substring(1);
        buf.w(`<p class="${cls}">${ln}</p>`);
      }
      if (n) break;
    }
    buf.w('<hr></td></tr></table>',
          '<a href="javascript:clear(true)">返回</a>');

    buf.render('stg');
  }
  renderHeader(n) {
    var buf = new Buffer();
    buf.w('<h1>', this.title, '</h1><table><tr>')
    for (var i=0; i<this.parts.length; ++i) {
      if (i>0 && i%4 == 0) buf.w('</tr><tr>');
      var styl = '';
      if (i == n-1) styl = ' style="background-color:#ff9"';
      buf.w(`<td width="25%"${styl}><a href="javascript:writeIntro(${i+1})">${this.parts[i][0]}</a>&nbsp;</td>`);
    }
    buf.w('</tr></table>');
    buf.render('toc');
  }

} // DDJCommentaryIntro.

const titleHS = '《老子道德經憨山註<sup class="docorig"><a href="https://book.bfnn.org/books2/1731.htm">出處</a></sup>》引言部分';
const introHS = `
#敘意
西域諸祖造論以破外道之執、須善自他宗。此方從古經論諸師、未有不善自他宗者。吾宗末學、安於孤陋、昧於同體、視為異物。不能融通教觀、難於利俗。其有初信之士、不能深窮教典。苦於名相支離、難於理會。至於酷嗜老莊為文章淵藪、及其論指歸、莫不望洋而歎也。迨觀諸家註釋、各徇所見、難以折衷。及見口義副墨、深引佛經、每一言有當、且謂一大藏經皆從此出。而惑者以為必當、深有慨焉。余居海上枯坐之餘、因閱楞嚴法華次、有請益老莊之旨者、遂蔓衍及此以自決。非敢求知於真人、以為必當之論也。且慨從古原教破敵者、發藥居多、而啟膏肓之疾者少。非不妙投、第未診其病源耳。是故余以唯心識觀而印決之。如摩尼圓照、五色相鮮、空谷傳聲、眾響斯應。苟唯心識而觀諸法、則彼自不出影響間也。故以名論。

#論教源
嘗觀世之百工技藝之精、而造乎妙者、不可以言傳。效之者、亦不可以言得。況大道之妙、可以口耳授受、語言文字而致哉。蓋在心悟之妙耳。是則不獨參禪、貴在妙悟。即世智辯聰治世語言、資生之業、無有一法不悟而得其妙者。妙則非言可及也。故吾佛聖人說法華、則純譚實相。乃至妙法、則未措一詞。但云如是而已。至若悟妙法者、但云善說法者。治世語言資生業等、皆順正法。而華嚴五地聖人、善能通達世間之學。至於陰陽術數、圖書印璽、醫方辭賦、靡不該練、然後可以涉俗利生。故等覺大士、現十界形。應以何身何法得度、即現何身何法而度脫之。由是觀之、佛法豈絕無世諦、而世諦豈盡非佛法哉。由人不悟大道之妙、而自畫於內外之差耳。道豈然乎。竊觀古今衛道藩籬者、在此、則曰彼外道耳。在彼、則曰此異端也。大而觀之、其猶貴賤偶人、經界太虛、是非日月之光也。是皆不悟自心之妙而增益其戲論耳。蓋古之聖人無他、特悟心之妙者、一切言教、皆從妙悟心中流出、應機而示淺深者也、故曰無不從此法界流、無不還此法界。是故吾人不悟自心、不知聖人之心。不知聖人之心、而擬聖人之言者、譬夫場人之欣戚、雖樂不樂、雖哀不哀、哀樂原不出於己有也。哀樂不出於己、而以己為有者、吾於釋聖人之言者見之。

#論心法
余幼師孔不知孔。師老不知老。既壯、師佛不知佛。退而入於深山大澤、習靜以觀心焉。由是而知三界唯心、萬法唯識。既唯心識觀。則一切形、心之影也。一切聲、心之響也。是則一切聖人、乃影之端者。一切言教、乃響之順者。由萬法唯心所現。故治世語言資生業等、皆順正法。以心外無法、故法法皆真、迷者執之而不妙。若悟自心、則法無不妙。心法俱妙、唯聖者能之。
 
#論去取
吾佛經盡出自西域、皆從翻譯。然經之來始於漢。至西晉方大盛。晉之譯師、獨稱羅什為最。而什之徒生肇融叡四公、僧之麟鳳也。而什得執役。然什於肇亦曰。余解不謝子、文當相揖耳。蓋肇尤善老莊焉。然佛經皆出金口所宣。而至此方、則語多不類。一經而數譯者有之。以致淺識之疑。殊不知理實不差。文、在譯人之巧拙耳。故藏經凡出什之手者、文皆雅致。以有四哲左右焉。故法華理深辭密曲盡其妙不在言。而維摩文勢宛莊、語其理自昭著。至於肇四論、則渾然無隙。非具正法眼者、斷斷難明。故惑者非之。以空宗莊老孟浪之談宜矣。清涼觀國師、華嚴菩薩也。至疏華嚴、每引肇論、必曰肇公、尊之也。嘗竊論之。藉使肇見不正、則什何容在座。什眼不明、則譯何以稱尊。若肇論不經、則觀又何容口。古今質疑頗多、而概不及此、何哉。至觀華嚴疏、每引老莊語甚夥。則曰取其文不取其意。圭峰則謂二氏不能原人。宗鏡闢之尤著。然上諸師、皆應身大士、建大法幢者、何去取相左如此。嘗試論之。抑各有所主也。蓋西域之語、質直無文、且多重複。而譯師之學、不善兩方者、則文多鄙野、大為理累。蓋中國聖人之言、除五經束於世教、此外載道之言者、唯老一書而已。然老言古簡、深隱難明。發揮老氏之道者、唯莊一人而已。筆乘有言。老之有莊、猶孔之有孟。斯言信之。然孔稱老氏猶龍。假孟而見莊豈不北面耶。間嘗私謂中國去聖人、即上下千古負超世之見者、去老唯莊一人而已。載道之言廣大自在、除佛經、即諸子百氏究天人之學者、唯莊一書而已。藉令中國無此人、萬世之下不知有真人。中國無此書、萬世之下不知有妙論。蓋吾佛法廣大微妙。譯者險辭以濟之、理必沈隱。如楞伽是已。是故什之所譯稱最者、以有四哲為之輔佐故耳。觀師有言。取其文不取其意。斯言有由矣。設或此方有過老莊之言者。肇必捨此而不顧矣。由是觀之。肇之經論用其文者。蓋肇宗法華。所謂善說法者、世諦語言資生業等、皆順正法。乃深造實相者之所為也。圭峰少而宗鏡遠之者。孔子作春秋、假天王之令而行賞罰。二師其操法王之權而行褒貶歟。清涼則渾融法界、無可無不可者。故取而不取。是各有所主也。故余於法華見觀音三十二應。則曰應以婆羅門身得度、即現其身而為說法。至於妙莊嚴二子則曰汝父信受外道、深著婆羅門法。且二子亦悔生此邪見之家。蓋此方老莊、即西域婆羅門類也。然此剛為現身說法、旋即斥為外道邪見、何也。蓋在著與不著耳。由觀音圓通無礙、則不妨現身說法。由妙莊深生執著、故為外道邪見。是以聖人教人、但破其執、不破其法。是凡執著音聲色相者非正見也。

#論學問
余每見學者披閱經疏、忽撞引及子史之言者、如攔路虎、必驚怖不前。及教之親習。則曰彼外家言耳。掉頭弗顧。抑嘗見士君子為莊子語者、必引佛語為證。或一言有當。且曰佛一大藏盡出於此。嗟乎。是豈通達之謂耶。質斯二者。學佛而不通百氏。不但不知世法。而亦不知佛法。解莊而謂盡佛經。不但不知佛意。而亦不知莊意。此其所以難明也。故曰自大視細者不盡。自細視大者不明。余嘗以三事自勖曰。不知春秋、不能涉世。不知老莊、不能忘世。不參禪、不能出世。知此、可與言學矣。

#論教乘
或問。三教聖人本來一理、是果然乎。曰。若以三界唯心、萬法唯識而觀、不獨三教本來一理。無有一事一法、不從此心之所建立。若以平等法界而觀、不獨三聖本來一體。無有一人一物、不是毗盧遮那海印三昧威神所現。故曰不壞相而緣起、染淨恆殊。不捨緣而即真、聖凡平等。但所施設、有圓融行布、人法權實之異耳。圓融者。一切諸法、但是一心。染淨融通、無障無礙。行布者。十界五乘五教理事因果淺深不同。所言十界謂四聖六凡也。所言五教謂小始終頓圓也。所言五乘、謂人天聲聞緣覺菩薩也。佛則最上一乘矣。然此五乘、各有修進、因果階差、條然不紊。所言人者、即蓋載兩間、四海之內、君長所統者是已。原其所修、以五戒為本。所言天者、即欲界諸天、帝釋所統。原其所修、以上品十善為本。色界諸天、梵王所統。無色界諸天、空定所持。原其所修、上品十善、以有漏禪九次第定為本。此二乃界內之因果也。所言聲聞所修、以四諦為本。緣覺所修、以十二因緣為本。菩薩所修、以六度為本。此三乃界外之因果也。佛則圓悟一心、妙契三德。攝而為一、故曰圓融。散而為五、故曰行布。然此理趣、諸經備載。由是觀之。則五乘之法、皆是佛法。五乘之行、皆是佛行。良由眾生根器大小不同、故聖人設教淺深不一。無非應機施設、所謂教不躐等之意也。由是證知孔子、人乘之聖也。故奉天以治人。老子、天乘之聖也。故清淨無欲、離人而入天。聲聞緣覺、超人天之聖也。故高超三界、遠越四生、棄人天而不入。菩薩、超二乘之聖也。出人天而入人天。故往來三界、救度四生、出真而入俗。佛則超聖凡之聖也。故能聖能凡、在天而天、在人而人。乃至異類分形、無往而不入。且夫能聖能凡者、豈聖凡所能哉。據實而觀、則一切無非佛法、三教無非聖人。若人若法、統屬一心。若事若理、無障無礙。是名為佛。故圓融不礙行布、十界森然。行布不礙圓融、一際平等。又何彼此之分、是非之辯哉。故曰、或邊地語說四諦。或隨俗語說四諦。蓋人天隨俗而說四諦者也。原彼二聖、豈非吾佛密遣二人而為佛法前導者耶。斯則人法皆權耳。良由建化門頭、不壞因果之相。三教之學皆防學者之心。緣淺以及深、由近以至遠、是以孔子欲人不為虎狼禽獸之行也。故以仁義禮智授之。姑使捨惡以從善、由物而入人。修先王之教、明賞罰之權。作春秋以明治亂之跡。正人心、定上下、以立君臣父子之分。以定人倫之節。其法嚴、其教切、近人情而易行。但當人欲橫流之際、故在彼汲汲猶難之。吾意中國非孔氏、而人不為禽獸者幾希矣。雖然、孔氏之跡固然耳。其心豈盡然耶。況彼明言之曰、毋意毋必毋固毋我。觀其濟世之心豈非據菩薩乘、而說治世之法者耶。經稱儒童、良有以也。而學者不見聖人之心將謂其道如此而已矣。故執先王之跡以挂功名、堅固我執。肆貪欲而為生累。至操仁義而為盜賊之資、啟攻鬥之禍者有之矣。故老氏愍之曰、斯尊聖用智之過也。若絕聖棄智、則民利百倍。剖斗折衡、則民不爭矣。甚矣、貪欲之害也。故曰不見可欲使心不亂。故其為教也、離欲清淨。以靜定持心、不事於物。澹泊無為、此天之行也。使人學此、離人而入於天。由其言深沈、學者難明。故得莊子起而大發揚之。因人之固執也深、故其言之也切。至於誹堯舜、薄湯武、非大言也。絕聖棄智之謂也。治推上古、道越羲皇、非漫談也。甚言有為之害也。詆訾孔子、非詆孔子、詆學孔子之跡者也。且非實言、乃破執之言也。故曰寓言十九、重言十七、訶教勸離、隳形泯智。意使離人入天、去貪欲之累故耳。至若精研世故、曲盡人情、破我執之牢關、去生人之大累。寓言曼衍、比事類辭、精切著明、微妙玄通工、深不不可識。此其說人天法、而具無礙之辯者也。非夫現婆羅門身而說法者耶。何其遊戲廣大之若此也。枇糠塵世、幻化死生、解脫物累、逍遙自在、其超世之量何如哉。嘗謂五伯僭竊之餘、處士橫議、充塞仁義之途。若非孟氏起而大闢之。吾意天下後世難言矣。況當群雄吞噬之劇。舉世顛瞑、亡生於物欲、火馳而不返者眾矣。若非此老崛起、攘臂其間。後世縱有高潔之士、將亦不知軒冕為桎梏矣。均之濟世之功、又何如耶。然其工夫由靜定而入、其文字從三昧而出。後人以一曲之見而窺其人、以濁亂之心而讀其書、茫然不知所歸趣。苟不見其心而觀其言、宜乎驚怖而不入也。且彼亦曰、萬世之後、而一遇大聖知其解者、是旦暮遇之也。然彼所求之大聖、非佛而又其誰耶。吾意彼為吾佛破執之前矛、斯言信之矣。世人於彼尚不入、安能入於佛法乎。

#論工夫
吾教五乘進修工夫、雖各事行不同。然其修心、皆以止觀為本。故吾教止觀、有大乘、有小乘、有人天乘、四禪八定、九通明禪。孔氏亦曰、知止而後有定。又曰、自誠明。此人乘止觀也。老子曰、常無欲以觀其妙、常有欲以觀其徼。又曰、萬物並作、吾以觀其復。莊子亦曰、莫若以明。又曰聖人不由而照之於天。又曰、人莫鑑於流水、而鑑於止水。惟止、能止眾止也。又曰、大定持之。至若百骸九竅、賅而存焉。吾誰與為親。又曰、咸其自取。怒者其誰耶。至若黃帝之退居、顏子之心齋、文人承蜩之喻、仲尼夢覺之論。此其靜定工夫。舉皆釋形去智、離欲清淨。所謂厭下苦麤障、欣上淨妙離。冀去人而入天。按教所明、乃捨欲界生、而生初禪者。故曰、宇泰定者、發乎天光。此天乘止觀也。首楞嚴曰、一切世間所修心人、愛染不生、無留欲界。是人應念身為梵侶。又曰、欲習既除、離欲心現。是人應時能行梵德、名為梵輔。又曰、清淨禁戒、加以明悟。是人應時能統梵眾、為大梵王。又曰、此三勝流、一切煩惱所不能逼。雖非正修真三摩地。清淨心中、諸漏不動、名為初禪。至於澄心不動、湛寂生光、倍倍增勝、以歷二三四禪。精見現前、陶鑄無礙。以至究竟群幾、窮色性性、入無邊際、名色究竟天。此其證也。由是觀之、老氏之學、若謂大患莫若於有身、故滅身以歸無。勞形莫先於有智、故釋智以淪虛。此則有似二乘。且出無佛世、觀化知無、有似獨覺。原其所宗、虛無自然、即屬外道。觀其慈悲救世之心、人天交歸、有無雙照、又似菩薩。蓋以權論。正所謂現婆羅門身而說法者。據實判之、乃人天乘精修梵行而入空定者也。所以能濟世者、以大梵天王為娑婆主、統領世界、說十善法、救度眾生。據華嚴地上菩薩為大梵王。至其梵眾、皆實行天人、由人乘而修天行者、此其類也無疑矣。吾故曰、莊語純究天人之際、非孟浪之談也。

#論行本
原夫即一心而現十界之像。是則四聖六凡、皆一心之影響也。豈獨人天為然哉。究論修進階差、實自人乘而立。是知人為凡聖之本也。故裴休有言曰、鬼神沈幽愁之苦。鳥獸懷獝狖之悲。脩羅方瞋。諸天耽樂。可以整心慮、趣菩提、唯人道為能耳。由是觀之、捨人道無以立佛法、非佛法無以盡一心。是則佛法以人道為鎡基、人道以佛法為究竟。故曰、菩提所緣、緣苦眾生。若無眾生、則無菩提。此之謂也。所言人道者、乃君臣父子夫婦之間、民生日用之常也。假而君君臣臣父父子子、不識不知、無貪無競、如幻化人。是為諸上善人俱會一處。即此世界為樂之國矣。又何庸夫聖人哉。奈何人者、因愛欲而生、愛欲而死。其生死愛欲者、財色名食睡耳。由此五者、起貪愛之心、搆攻鬥之禍。以致君不君、臣不臣、父不父、子不子。雖先王之賞罰、不足以禁其心。適一己無厭之欲、以結未來無量之苦。是以吾佛愍之曰、諸苦所因貪欲為本。若滅貪欲、無所依止。故現身三界、與民同患。乃說離欲出苦之要道耳。且不居天上而乃生於人間者、正示十界因果之相、皆從人道建立也。然既處人道、不可不知人道也。故吾佛聖人不從空生、而以淨梵為父摩耶為母者、示有君親也。以耶輸為妻、示有夫婦也。以羅侯為子、示有父子也。且必捨父母而出家、非無君親也、割君親之愛也。棄國榮而不顧、示名利為累也。擲妻子而遠之、示貪欲之害也。入深山而苦修、示離欲之行也。先習外道四遍處定、示離人而入天也。捨此而證正遍正覺之道者、示人天之行不足貴也。成佛之後、入王宮而舁父棺、上忉利而為母說法、示佛道不捨孝道也。依人間而說法、示人道揚趣菩提也。假王臣為外護、示處世不越世法也。此吾大師示現度生之楷模、垂誡後世之弘範也。嗟乎、吾人為佛弟子、不知吾佛之心。處人間世、不知人倫之事。與之論佛法、則儱侗真如、瞞頇佛性。與之論世法、則觸事面牆、幾如檮昧、與之論教乘、則曰枝葉耳、不足尚也。與之言六度、則曰菩薩之行、非吾所敢為也。與之言四諦、則曰彼小乘耳、不足為也。與之言四禪八定、則曰彼外道所習耳、何足齒也。與之言人道、則茫不知君臣父子之分、仁義禮智之行也。嗟乎、吾人不知何物也。然而好高慕遠、動以口耳為借資。竟不知吾佛教人出世、以離欲之行為第一也。故曰離欲寂靜、最為第一。以余生人道、不越人乘、故幼師孔子。以知人欲為諸苦本、志離欲行、故少師老莊。以觀三界唯心、萬法唯識、知十界唯心之影響也、故皈命佛。

#論宗趣
老氏所宗虛無大道。即楞嚴所謂晦昧為空、八識精明之體也。然吾人迷此妙明一心而為第八阿賴耶識。依此而有七識為生死之根。六識為造業之本。變起根身器界生死之相。是則十界聖凡、統皆不離此識。但有執破染淨之異耳。以欲界凡夫、不知六塵五欲境界、唯識所變。乃因六識分別、起貪愛心、固執不捨。造種種業、受種種苦。所謂人欲橫流。故孔子設仁義禮智教化為隄防、使思無邪、姑捨惡而從善。至於定名分、正上下、然其道未離分別。即所言靜定工夫。以唯識證之。斯乃斷前六識分別邪妄之思、以袪鬥諍之害。而要歸所謂妙道者、乃以七識為指歸之地。所謂生機道原。故曰生生之謂易是也。至若老氏以虛無為妙道、則曰谷神不死。又曰死而不亡者壽。又曰生生者不生。且其教以絕聖棄智忘形去欲為行、以無為為宗極、斯比孔則又進。觀生機深脈、破前六識分別之執。伏前七識生滅之機。而認八識精明之體、即楞嚴所謂罔象虛無微細精想者、以為妙道之源耳。故曰、惚兮恍、其中有象。恍兮惚、其中有物。以其此識乃全體無明、觀之不透。故曰、杳杳冥冥、其中有精。以其識體不思議熏不思議變。故曰玄之又玄。而稱之曰妙道。以天地萬物皆從此中變現。故曰、天地之根、眾妙之門。不知其所以然而然、故莊稱自然。且老乃中國之人也。未見佛法、而深觀至此、可謂捷疾利根矣。借使一見吾佛而印決之、豈不頓證真無生耶。吾意西涉流沙、豈無謂哉。大段此識、深隱難測。當佛未出世時、西域九十六種、以六師為宗。其所立論百什、至於得神通者甚多、其書又不止此方之老莊也。洎乎吾佛出世、靈山一會、英傑之士、皆彼六師之徒。且其見佛、不一言而悟。如良馬見鞭影而行、豈非昔之工夫有在。但邪執之心未忘、故令見佛、只在點化之間以破其執耳。故佛說法原無贅語、但就眾生所執之情、隨宜而擊破之。所謂以楔出楔者、本無實法與人也。至於楞嚴會上、微細披剝、次第徵辯、以破因緣自然之執、以斷凡夫外道二乘之疑。而看教者不審乎此、但云彼西域之人耳、此東土之人也。人有彼此、而佛性豈有二耶。且吾佛為三界之師、四生之父。豈其說法、止為彼方之人、而此十萬里外、則絕無分耶。然而一切眾生、皆依八識而有生死。堅固我執之情者、豈只彼方眾生有執、而此方眾生無之耶。是則此第八識、彼外道者、或執之為冥諦、或執之為自然、或執之為因緣、或執之為神我。即以定修心生於梵天、而執之為五現涅槃。或窮空不歸、而入無色界天。伏前七識生機不動。進觀識性、至空無邊處、無所有處、以極非非想處。此乃界內修心、而未離識性者。故曰、學道之人不識真、只為從前認識神、無量劫來生死本、癡人認作本來人者、是也。至於界外聲聞、已滅三界見思之惑、已斷三界生死之苦、已證無為寂滅之樂。八識名字尚不知、而亦認為涅槃、將謂究竟歸寧之地。且又親從佛教得度、猶費吾佛四十年彈訶淘汰之功。至於法華會上、猶懷疑佛之意、謂以小乘而見濟度。雖地上菩薩、登七地已、方捨此識、而猶異熟未空。由是觀之、八識為生死根本、豈淺淺哉。故曰、一切世間諸修行人、不能得成無上菩提。乃至別成聲聞緣覺、及成外道、諸天魔王、及魔眷屬、皆由不知二種根本。一者無始生死根本、則汝今者與諸眾生、用攀緣心為自性者。二者無始涅槃元清淨體、則汝今者識精元明、能生諸緣、緣所遺者。正此之謂也。噫、老氏生人間世、出無佛世、而能窮造化之原、深觀至此。即其精進工夫、誠不易易。但未打破生死窠窟耳。古德嘗言、孔助於戒、以其嚴於治身。老助於定、以其精於忘我。二聖之學、與佛相須而為用、豈徒然哉。據實而論、執孔者、涉因緣、執老者、墮自然。要皆未離識性、不能究竟一心故也。佛則離心意識、故曰、本非因緣、非自然性、方徹一心之源耳。此其世出世法之分也。故佛所破、正不止此。即出世三乘、而亦皆在其中矣。世人但見莊子誹堯舜薄湯武、詆訾孔子之徒、以為驚異。若聞世尊訶斥二乘以為焦芽敗種悲重菩薩以為佛法闡提、又將何如耶。然而佛訶二乘、非訶二乘、訶執二乘之跡者、欲其捨小趣大也。所謂莊詆孔子、非詆孔子、詆學孔子之跡者、欲其絕聖棄智也。要皆遣情破執之謂也。若果情忘執謝、其將把臂而遊妙道之鄉矣。方且歡忻至樂之不暇、又何庸夫憒憒哉。此其華嚴地上菩薩、而於塗炭事火臥棘投鍼之儔、靡不現身其中、與之而作師長也。苟非佛法、又何令彼入佛法哉。故彼六師之執幟、非佛不足以拔之。吾意老莊之大言、非佛法不足以證嚮之。信乎遊戲之談、雖老師宿學、不能自解免耳。今以唯心識觀、皆不出乎響矣。
此論刱意、蓋予居海上時、萬歷戊子冬、乞食王城、嘗與洞觀居士夜談所及、居士大為撫掌。庚寅夏日、始命筆焉。藏之既久、向未拈出。甲午冬、隨緣王城、擬請益於弱侯焦太史、不果。明年乙未春、以弘法罹難、其草業己遺之海上矣。仍遣侍者往殘簡中搜得之。秋蒙恩遣雷陽、達觀禪師、由匡廬杖策候予於江上。冬十一月、予方渡江、晤師於旅泊庵、夜坐出此、師一讀三歎曰、是足以袪長迷也。即命弟子如奇、刻之以廣法施。予固止之。戊戍夏、予寓五羊時、與諸弟子結制壘壁間、為眾演楞嚴宗旨、門人寶貴、見而歎喜、願竭力成之、以卒業焉。噫、欲識佛性義、當觀時節因緣。此區區片語、誠不足為法門重輕。刱意於十年之前、而克成於十年之後、作之於東海之東、而行之於南海之南。豈機緣偶會而然耶。道與時也、庸可強乎。然此、蓋因觀老莊而作也、故以名論。
@萬歷戊戍除日憨山道人清書於楞伽室。 
病後俗冗、近始讀大製曹谿通志、及觀老莊影響論等書、深為歎服。所謂不知春秋。不能涉世。不知老莊、不能忘世。不參禪、不能出世。及孔子人乘之聖。老子天乘之聖。佛能聖能凡能人能天之聖。如此之類、百世不易之論也。起原再稽顙。
 
#註道德經序
予少喜讀老莊、苦不解義。惟所領會處、想見其精神命脈、故略得離言之旨。及搜諸家註釋則多以己意為文、若與之角、則義愈晦。及熟玩莊語、則於老恍有得焉。因謂註乃人人之老莊、非老莊之老莊也。以老文簡古而旨幽玄、則莊實為之註疏。苟能懸解、則思過半矣。空山禪暇、細玩沈思、言有會心、即託之筆。必得義遺言、因言以見義。或經旬而得一語、或經年而得一章。始於東海、以至南粵、自壬辰以至丙午、周十五年乃能卒業。是知古人立言之不易也。以文太簡、故不厭貫通、要非枝也。嘗謂儒宗堯舜、以名為教、故宗於仁義。老宗軒黃、道重無為、如云失道德而後仁義。此立言之本也。故莊之誹薄、殊非大言、以超俗之論則駭俗、故為放而不收也。當仲尼問禮、則歎為猶龍、聖不自聖、豈無謂哉。故老以無用為大用、苟以之經世、則化理治平、如指諸掌。尤以無為為宗極、性命為真修。即遠世遺榮、殆非矯矯。苟得其要、則真妄之途、雲泥自別。所謂真以治身、緒餘以為天下國家、信非誣矣。或曰、子之禪、貴忘言、乃嘵嘵於世諦、何所取大耶。予曰、不然。鴉鳴鵲噪、咸自天機。蟻聚蜂遊、都歸神理。是則何語非禪、何法非道。況釋智忘懷之談、詎非入禪初地乎。且禪以我蔽、故破我以達禪、老則先登矣。若夫玩世蜉蝣、尤當以此為樂土矣。註成、始刻於嶺南。重刻於五雲南岳與金陵。今則再刻於吳門。以尚之者眾、故施不厭普矣。

#老子傳
按史記、老子者、楚苦（音怙）縣厲（音賴）鄉曲仁里人也。姓李氏、名耳、字伯陽、諡曰聃。周守藏室之史也。（亦云柱下史）孔子適周、將問禮於老子。老子曰、子所言者、其人與骨皆已朽矣。獨其言在耳。君子得其時則駕。不得其時、則蓬累而行。（蓬累、篛笠也。首戴之而行、言無車蓋也。）吾聞之、良賈深藏若虛。君子盛德、容貌若愚。去子之驕氣與多欲、態色與淫志、是皆無益於子之身。吾所以告子者、若是而已。孔子去、謂弟子曰、鳥、吾知其能飛。魚、吾知其能遊。獸、吾知其能走。走者可以為網。遊者可以為綸。飛者可以為矰。至於龍、吾不能知其乘風雲而上天。吾今見老子、其猶龍耶。老子修道德、其學以自隱無名為務。居周久之、見周之衰、迺遂去。至關、關令尹喜曰、子將隱矣、強為我著書。於是老子遂著書上下篇、言道德之意五千餘言、而去、莫知所終。老子生周定王三年。母孕八十年而生。生而皓首、故稱老子。

#發明宗旨
老氏所宗、以虛無自然為妙道。此即楞嚴所謂分別都無、非色非空、拘舍離等，昧為冥諦者、是已。此正所云八識空昧之體也。以其此識、最極幽深、微妙難測、非佛不足以盡之。轉此則為大圓鏡智矣。菩薩知此、以止觀而破之、尚有分證。至若聲聞不知、則取之為涅槃。西域外道梵志不知、則執之為冥諦。此則以為虛無自然妙道也。故經曰、諸修行人、不能得成無上菩提。乃至別成聲聞緣覺、諸天外道魔王、及魔眷屬、皆由不知二種根本。錯亂修習、猶如煮沙欲成佳饌、縱經塵劫終不能得。云何二種、一者無始生死根本、則汝今者與諸眾生、用攀緣心為自性者。二者無始涅槃元清淨體、則汝今者識精元明、能生諸緣、緣所遺者。此言識精元明、即老子之妙道也。故曰、杳杳冥冥、其中有精、其精甚真。由其此體至虛至大、故非色。以能生諸緣、故非空。不知天地萬物皆從此識變現、乃謂之自然。由不思議熏、不思議變、故謂之妙。至精不雜、故謂之真。天地壞而此體不壞、人身滅而此性常存、故謂之常。萬物變化、皆出於此、謂之天地之根、眾妙之門。凡遇書中所稱真常玄妙、虛無大道等語、皆以此印證之、則自有歸趣。不然、則茫若捕風捉影矣。故先示於此。臨文不煩重出。

#發明趣向
愚謂看老莊者、先要熟覽教乘、精透楞嚴。融會吾佛破執之論、則不被他文字所惑。然後精修靜定、工夫純熟、用心微細、方知此老工夫苦切。然要真真實實看得身為苦本、智為累根、自能隳形釋智。方知此老真實受用至樂處。更須將世事一一看破、人情一一覷透、虛懷處世、目前無有絲毫障礙。方見此老真實逍遙快活、廣大自在、儼然一無事道人。然後不得已而應世、則不費一點氣力端然無為而治。觀所以教孔子之言、可知已。莊子一書、乃老子之注疏。故愚所謂老之有莊、如孔之有孟。是知二子所言、皆真實話、非大言也。故曰、吾言甚易知、甚易行、天下莫能知、莫能行。而世之談二子者、全不在自己工夫體會。只以語言文字之乎者也而擬之、故大不相及。要且學疏狂之態者有之、而未見有以靜定工夫而入者。此其所謂知我者希矣。冀親二子者當作如是觀。

#發明工夫
老子一書、向來解者例以虛無為宗。及至求其入道工夫、茫然不知下手處。故予於首篇、將觀無觀有一觀字、為入道之要、使學者易入。然觀照之功最大、三教聖人皆以此示人。孔子則曰、知止而后有定。又曰、明明德。然知明、即了悟之意。佛言止觀、則有三乘止觀、人天止觀、淺深之不同。若孔子、乃人乘止觀也。老子、乃天乘止觀也。然雖三教止觀淺深不同、要其所治之病、俱以先破我執為第一步工夫。以其世人盡以我之一字為病根。即智愚賢不肖、汲汲功名利祿之場、圖為百世子孫之計、用盡機智總之皆為一身之謀。如佛言諸苦所因、貪欲為本、皆為我故。老子亦曰、貴大患若身。以孔聖為名教宗主、故對中下學人、不敢輕言破我執。唯對顏子、則曰克己。其餘但言正心誠意修身而已。然心既正、意既誠、身既修、以此施於君臣父子之間、各盡其誠、即此是道、所謂為名教設也。至若絕聖棄智、無我之旨、乃自受用地、亦不敢輕易舉以於人。唯引而不發、所謂若聖與仁、則吾豈敢。又曰、吾有知乎哉、無知也、有鄙夫問於我、空空如也。至若極力為人處、則曰、克己。則曰、毋意、毋必、毋固、毋我。此四言者、肝膽畢露。然己者、我私。意者、生心。必者、待心。固者、執心。我者、我心。克者、盡絕。毋者、禁絕之辭。教人盡絕此意必固我四者之病也。以聖人虛懷遊世寂然不動、物來順應、感而遂通。用心如鏡、不將不迎、來無所粘、去無蹤跡。身心兩忘、與物無競、此聖人之心也。世人所以不能如聖人者、但有意必固我四者之病、故不自在、動即是苦。孔子觀見世人病根在此、故使痛絕之。即此之教、便是佛老以無我為宗也。且毋字便是斬截工夫、下手最毒。即如法家禁令之言毋得者、使其絕不可有犯、一犯便罪不容赦、只是學者不知耳。至若吾佛說法、雖浩瀚廣大。要之不出破眾生麤細我法二執而已。二執既破、便登佛地。即三藏經文、皆是破此二執之具。所破之執、即孔子之四病、尚乃麤執耳。世人不知、將謂別有玄妙也。若夫老子超出世人一步、故專以破執立言、要人釋智遺形、離欲清淨。然所釋之智、乃私智、即意必也。所遺之形、即固我也。所離之欲、即己私也。清淨則廓然無礙、如太虛空、即孔子之大公也。是知孔老心法未嘗不符、第門庭施設、藩衛世教、不得不爾。以孔子專於經世。老子專於忘世。佛專於出世。然究竟雖不同、其實最初一步、皆以破我執為主。工夫皆由止觀而入。

#發明體用
或曰、三教聖人教人、俱要先破我執。是則無我之體同矣。奈何其用、有經世、忘世、出世之不同耶。答曰、體用皆同、但有淺深小大之不同耳。假若孔子果有我、是但為一己之私、何以經世。佛老果絕世、是為自度、又何以利生。是知由無我方能經世、由利生方見無我、其實一也。若孔子曰、寂然不動、感而遂通天下之故、用也。明則誠、體也。誠則形、用也。心正意誠、體也。身修家齊國治天下平、用也。老子無名、體也。無為而為、用也。孔子曰、惟天惟大、唯堯則之、蕩蕩乎民無能名焉。又曰、無為而治者、其舜也歟。且經世以堯舜為祖、此豈有名有為者耶。由無我方視天下皆我、故曰、堯舜與人同耳。以人皆同體、所不同者、但有我私為障礙耳。由人心同此心、心同則無形礙。故汲汲為之教化、以經濟之。此所以由無我而經世也。老子則曰、常善教人、故無棄人。無棄人、則人皆可以為堯舜。是由無我方能利生也。若夫一書所言為而不宰、功成不居等語。皆以無為為經世之大用、又何嘗忘世哉。至若佛、則體包虛空。用周沙界。隨類現身。乃曰、我於一切眾生身中成等正覺。又曰、度盡眾生、方成佛道。又曰、若能使一眾生發菩提心、寧使我身受地獄苦、亦不疲厭。然所化眾生、豈不在世間耶。既涉世度生、非經世而何。且為一人而不厭地獄之苦、豈非汲汲耶。若無一類而不現身、豈有一定之名耶。列子嘗云、西方有大聖人、不言而信、無為而化、是豈有心要為耶。是知三聖無我之體、利生之用、皆同。但用處大小不同耳。以孔子匡持世道、姑從一身以及家國、後及天下、故化止於中國。且要人人皆做堯舜、以所祖者堯舜也。老子因見當時人心澆薄、故思復太古、以所祖者軒黃也。故件件說話、不同尋常、因見得道大難容、故遠去流沙。若佛則教被三千世界、至廣至大、無所揀擇矣。若子思所讚聖人、乃曰、凡有血氣者、莫不尊親。是知孔子體用、未嘗不大、但局時勢耳。正是隨機之法、故切近人情、此體用之辯也。惜乎後世學者、各束於教。習儒者拘。習老者狂。學佛者隘。此學者之弊、皆執我之害也。果能力破我執、則剖破藩籬、即大家矣。

#發明歸趣
愚嘗竊謂孔聖若不知老子、決不快活。若不知佛、決不柰煩。老子若不知孔、決不口口說無為而治。若不知佛、決不能以慈悲為寶。佛若不經世、決不在世間教化眾生。愚意孔老、即佛之化身也。後世學佛之徒、若不知老、則直管往虛空裏看將去。目前法法都是障礙、事事不得解脫。若不知孔子、單單將佛法去涉世、決不知世道人情、逢人便說玄妙。如賣死貓頭、一毫沒用處。故祖師亦云、說法不投機、終是閒言語。所以華嚴經云或邊地語說四諦、此佛說法未嘗單誇玄妙也。然隨俗以度生、豈非孔子經世之心乎。又經云、五地聖人。涉世度生、世間一切經書技藝、醫方雜論、圖書印璽種種諸法、靡不該練、方能隨機。故曰、世諦語言資生之業、皆順正法。故儒以仁為本、釋以戒為本。若曰、孝悌為仁之本、與佛孝名為戒。其實一也。以此觀之佛豈絕無經世之法乎。由孔子攘夷狄、故教獨行於中國。佛隨邊地語說四諦、故夷狄皆從其化。此所以用有大小不同耳。是知三教聖人所同者心、所異者跡也。以跡求心、則如蠡測海。以心融跡、則似芥含空。心跡相忘、則萬派朝宗、百川一味。
`;

// 道德經註釋（出續道藏）
// 純陽呂仙衍義本
const titleLU = '《道德經註釋（出續道藏）純陽呂仙衍義本<sup class="docorig"><a href="https://taolibrary.com/category/category86/c86118.htm">出處</a></sup>》引言部分';
const introLU = `
#道德經序
粵自玄元未判。太極初張。渾然有炁。寂爾無光。陰偶陽奇。始正乾坤之位。上蟠下際。初開離坎之方。惟茲大化流行。發生萬象賴此至誠不息。克振三綱。溯道之由。自先天而蘊積。著經之始。獨老氏而宣揚。言有五千。發明道德。文成一冊洩盡陰陽。玄遠幽深。造化之神功悉見。精微奧妙。混元之妙諦攸彰。厯萬世以至於今。誰能增減。亘千秋而思往古。孰測精詳。今有　呂祖。道號純陽。粵稽五帝厯考三皇。參玄門之妙旨。解道祖之靈章。安邦定國之文。微而益顯養性修真之理。隱而彌彰。昨日功曹。向文華而問序。今朝生等。開幽閣以焚香。竊思抹犬塗鴉。宜藏大絀。轉念飛龍舞鳳。足見餘光。因降香壇。信筆而書俚韻。聊為寶懺。片言以發幽芳。序始末於靈文。大彰六合。闡古今之妙理。廣潘八方。曾聞昔日。傳是經於函谷關中。飛昇尹嘉。應識今時。解斯訓於迎仙閣內。欲度愚盲。道域宏開。自是幽玄之象。德門大展。堪瞻清淨之光。紫氣滿於天堂。祥徵太極。清風流於世宙。瑞獻當陽。老子玄文。固已彌加珍重。呂仙註釋。豈云出自荒唐。宜速付於棗梨。欽遵毋忽。當頒行於天壤。佩服莫忘。是序。
@太極天宮文華殿內左相臣頻子淵謹譔

#老子源流(史記)
老子者。楚苦縣。厲鄉曲仁里人也。姓李氏。名耳。字伯陽。謚曰耼。周守藏室之史也，孔子適周。將問禮於老子。老子曰。子所言者。其人與骨皆已朽矣。獨其言在耳。且君子得其時則駕。不得其時。則蓬累而行。吾聞之。良賈深藏若虛。君子盛德。容貎若愚。去子之驕氣與多慾。態色與淫志。是皆無益於子之身。吾所以告子。若是而已。孔子去。謂弟子曰。鳥吾知其能飛。魚吾知其能游。獸吾知其能走。走者可以為罔。游者可以為綸。飛者可以為燴。至於龍。吾不能知其乘風雲而上天。吾今日見老子。其猶龍耶。老子脩道德。其學以自隱無名為務。居周久之。見周之衰。乃遂去。至鬬。關令尹喜曰。子將隱矣。強為我著書，於是老子乃。著書上下篇。言道德之意。五千餘言而去。莫知其。所終。或曰。老萊子。亦楚人也。著書十五篇。言道家之用。與孔子同時云。蓋老子百有六十餘歲。或言二百餘歲。以其脩道而養壽也。自孔子死之後。百二十九年。而史記周太史儋。見秦獻公日。始秦與周合而離。離五百歲而復合。合七十歲而霸王者。出馬。或曰。儋即老子或曰。非也。世。莫知其然否老子隱。君子也。世之學老子者。則絀儒學。儒學亦絀老子。道不同不相為謀。豈謂是耶。李耳無為自化。清靜自正。

#附錄神仙傳
老子者。名重耳。其母感大流星而有娠。雖受氣於天。然見於李家。猶以李為姓。或云。老子先天地生。或云。天之精魂。蓋神靈之屬。或云母懷之七十二年乃生。生時。剖母左腋而出。生而首白。故謂之老子。或云。其母無夫。老子是母家之姓。或云。老子之母。適至李樹下而生。老子生而能言。指李樹曰以此為我姓。或云。上三皇時。為玄中法師。下三皇時。為金闕帝君。伏羲時為鬱華子。神農時為九靈老子。祝融時為廣壽子。黃帝時為廣成子。顓頊時為赤精子。帝嚳時為祿圖子。堯時為務成子。舜時為尹壽子。夏禹時為真行子。殷湯時為錫則子。文王時為文吧先生。一云守藏史。或云。在越為范蠡。在齊為鴟夷子。在吳為陶朱公。或云老子騎青牛。西度函谷關。關令尹喜。望氣先知焉。乃掃道四十里見老子至從而問道。老子驚怪故吐舌耼然。遂有老耼之號。老子黃白色。美目廣顙。長耳大目。疎齒。方口厚唇。額有三五達理。日角月懸。鼻純骨雙柱。耳有三漏門。足踏二五。手把十文。周文王時為守藏史。至武王時為柱下史。時俗見其久壽。故號之為老子。老子恬淡無欲。專以長生為務者。故在周雖久。而名位不遷者。蓋欲和光同塵。內實自然。道成乃去。蓋仙人也。老子將去。而西出關。以昇崑崙。老子有客徐甲。少賃於老子。約日顧百錢。計久甲七百二十萬錢。甲見老子出關遊行。速索償。不可得。乃倩人作辭。詣關令以言。老子而為作辭者。亦不知。甲已隨老子二百餘年矣。惟計甲所應得直之多。許以女嫁甲。甲見女美。尤喜。遂通辭於尹。喜得辭大驚。乃見老子。老子問甲日。汝久應死。吾昔責汝。為官卑家貧無有使役。故以太玄清生符與汝。所以至今日。汝何以言汝。吾語汝。到安息國。固當以黃金計直還汝。汝何以不能忍。乃使甲張口向地。其太玄真符。立出於地。丹書文字如新。甲成一聚枯骨矣。喜知老子神人。能復使甲生。乃為甲叩頭請命。乞為老子出錢還之。老子復以太玄符投之。甲立更生。喜即以錢二百萬與甲。遣之而去。并執弟子之禮。且以長生之事授喜。喜又請教誡。老子語之五千言。喜退。名曰道德經焉。尹喜行其道亦得仙。

#附錄拾遺記
老耼在周之末。居反景日室之山。與世人絶跡。惟有黃髮老叟五人。或乘鴻鶴。或衣羽毛。耳出於頂。瞳子皆方。而色玉潔。手握青筠之杖。與耼共談天地之數。及耼退跡。為柱下史。求天下服道之術。四海名士。莫不爭至。五老。即五方之精也。
`;

//  ddj = new DDJCommentaryIntro(titleLU, introLU);
//  ddj = new DDJCommentaryIntro(titleHS, introHS);
