class Story {
  constructor(firstln) {
    var ln = firstln;
    if (ln[0] == '#') {
      if (ln[1] != '*')
        ln = ln.substring(1);
      else {
        ln = ln.substring(2);
        this.ignoreAnchor = true;
      }
    }
    var a = ln.split('\|');
    this.num = unznum(a[0]);
    this.ttl = a[1];
    this.incarnation = a[2];
    if (!this.num || !this.ttl || !this.incarnation)
      throw `Bad story line: ${firstln}`;
    this.parseState = 'prolog';
    this.prologue = [];
    this.main = [];
    this.epilogue = [];
  }
  add(ln) { // true meaning done.
    if (ln.startsWith('----')) {
      switch (this.parseState) {
      case 'prolog': this.parseState = 'main';   return false;
      case 'main':   this.parseState = 'epilog'; return false;
      default:       throw `Invalid ----: current state is "${this.parseState}".`;
      }
    }
    if (ln.startsWith('====')) {
      this.parseState = null;
      return true;
    }
    switch (this.parseState) {
    case 'prolog': this.prologue.push(ln); break;
    case 'epilog': this.epilogue.push(ln); break;
    case 'main':   this.main.push(ln);     break;
    }
    return false;
  }

  render(buf) {
    var anch = '';
    if (!this.ignoreAnchor) {
      anch = `:s${to3d(this.num)}`;
      console.log('Anchored at', anch);
    }
    buf.w(`/SECTION${anch}/${znum(this.num)}　${this.ttl}\n`,
          `/R/（菩薩＝<c339>${this.incarnation}</c339>）\n/KEPAN/序分\n\n`)
       .join(this.prologue, '\n')
       .w('\n\n/KEPAN/主分\n\n')
       .join(this.main, '\n')
       .wIf(this.epilogue.length, '\n\n/KEPAN/結分\n\n')
       .join(this.epilogue, '\n')
       .w(`\n\n/END/${znum(this.num)}　${this.ttl}\n`);
    return this;
  }
}
function parseStories(lines) {
  var a = lines.split('\n'), buf = new Buffer(), story;
  for (var i=0; i<a.length; ++i) {
    var ln = a[i];
    if (story) {
      if (story.add(ln)) { // done
        story.render(buf);
        story = null;
      }
    }
    else if (ln[0] == '#') {
      story = new Story(ln);
    }
    else {
      buf.w(ln, '\n');
    }
  }
  return buf.render();
}

// ===============  above deprecated  ===============

class 品 {
  constructor(name,vol,firstNum,stories) {
    Object.assign(this,{ name,vol,firstNum,stories });
    this.firstNum = parseInt(firstNum);
  }
  renderTD(buf) {
    if (this.name) buf.w('<td>', this.name, '</td><td>');
    else buf.w('<td colspan=2>');
    for (var i=0; i<this.stories.length; ++i) {
      var n = this.firstNum + i, ndisp = toW(n, 3, '<inv>0</inv>');
      buf.w(`　<a href="?vol=${this.vol}&loc=s${to3d(n)}" title="${this.stories[i]}">${ndisp}</a>`);
    }
    buf.w('</td>');
  }
}

class 篇 {
  constructor(num) {
    this.num = num;
    this.pins = []; // 品；可以是無名者。
  }
  add(pin) { this.pins.push(pin); return this; }
} // end of 篇.

class 本生經 {
  constructor(num) {
    this.parts = [];
    for (var i=1; i<=26; ++i) this.parts[i] = new 篇(i);
  }

  renderTRs(buf) {
    var len = this.parts.length, prevPart, prevVol;
    for (var i=1; i<len; ++i) {
      var pt = this.parts[i], pins = pt.pins;
      for (var j=0; j<pins.length; ++j) {
        var p = pins[j];
        buf.w('<tr>');
        if (p.vol == prevVol) buf.w('<td></td>');
        else buf.w(`<td><a href="?vol=${p.vol}">卷${zNumber(prevVol = p.vol)}</a>&nbsp;</td>`);
        if (pt.num == prevPart) buf.w('<td></td>');
        else buf.w('<td>第', zNumber(prevPart = pt.num), '篇</td>');
        p.renderTD(buf);
        buf.w('</tr>');
      }
    }
    return this;
  }

} // end of 本生經.

var SUTRA = new 本生經();

(() => {
  var stories = 
`1|無戲論品      | 2|  1
 1|戒行品        | 2| 11
 1|羚羊品        | 2| 21
 1|雛鳥品        | 2| 31
 1|利愛品        | 2| 41
 1|願望品        | 3| 51
 1|婦女品        | 3| 61
 1|婆那樹品      | 3| 71
 1|飲酒品        | 3| 81
 1|塗毒品        | 3| 91
 1|超百品        | 3|101
 1|設問品        | 3|111
 1|吉祥草品      | 3|121
 1|不與品        | 3|131
 1|變色蜥蜴品    | 3|141
 2|剛強品        | 4|151
 2|親交品        | 4|161
 2|善法品        | 4|171
 2|無雙品        | 4|181
 2|魯哈迦品      | 4|191
 2|那塔木達魯哈品| 4|201
 2|香草叢品      | 4|211
 2|袈裟品        | 4|221
 2|革履品        | 4|231
 2|豺品          | 4|241
 3|思惟品        | 5|251
 3|梟品          | 5|261
 3|森林品        | 5|271
 3|正中品        | 5|281
 3|瓶品          | 5|291
 4|開門品        | 6|301
 4|絍婆樹品      | 6|311
 4|毀屋品        | 6|321
 4|時鳥品        | 6|331
 4|小郭公品      | 6|341
 5|摩尼耳環品    | 7|351
 5|色高品        | 7|361
 5|半品          | 7|371
 6|阿瓦利耶品    | 8|376
 6|賽那迦品      | 8|386
 7|尺度品        | 9|396
 7|健陀羅品      | 9|406
 8|迦旃延品      |10|417
 9|              |11|427
10|              |12|439
11|              |13|455
12|              |14|464
13|              |15|474
14|              |16|484
15|              |17|497
16|              |18|511
17|              |19|521
18|              |20|526
19|              |21|529
20|              |22|531
21|              |23|533
22|              |24|538
22|              |25|540
22|              |26|546`;

var storyTexts =
` 1#無戲論本生譚,砂道本生譚,貪慾商人本生譚,周羅財官本生譚,稻稈本生譚,天法本生譚,採薪女本生譚,首領王本生譚,摩迦王本生譚,樂住本生譚
 11#瑞相鹿本生譚,榕樹鹿本生譚,結節本生譚,風鹿本生譚,訶羅第雅鹿本生譚,三臥鹿本生譚,風本生譚,死者供物本生譚,祈願供養本生譚,蘆飲本生譚
 21#羚羊本生譚,犬本生譚,駿馬本生譚,良馬本生譚,沐浴場本生譚,女顏象本生譚,常習本生譚,觀喜滿牛本生譚,黑牛本生譚,姆尼迦豚本生譚
 31#雛鳥本生譚,舞踊本生譚,和合本生譚,魚本生譚,鶉本生譚,鳥本生譚,鷓鴣本生譚,青鷺本生譚,難陀本生譚,迦提羅樹炭火本生譚
 41#羅沙伽長老本生譚,鳩本生譚,竹蛇本生譚,蚊本生譚,赤牛女本生譚,毀園本生譚,酒本生譚,智雲咒文本生譚,星宿本生譚,無智本生譚
 51#大具戒王本生譚,小伽那迦王本生譚,滿瓶本生譚,果實本生譚,五武器太子,金塊本生譚,猿王本生譚,三法本生譚,打鼓本生譚,吹螺本生譚
 61#嫌惡聖典本生譚,生卵本生譚,棗椰子本生譚,難知本生譚,懊惱本生譚,優相本生譚,膝本生譚,娑祇多城本生譚,吐毒本生譚,鋤賢人本生譚
 71#婆那樹本生譚,有德象王本生譚,真實語本生譚,樹法本生譚,魚族本生譚,無憂本生譚,大夢本生譚,伊利薩長者本生譚,騷音本生譚,畢摩塞那職人本生譚
 81#飲酒本生譚,知友本生譚,不運者本生譚,利益門本生譚,有毒果本生譚,驗德本生譚,吉凶本生譚,薩蘭巴牛本生譚,詐欺本生譚,忘恩本生譚
 91#塗毒本生譚,大精本生譚,信食本生譚,怖畏本生譚,大善見王本生譚,油鉢本生譚,依名得運本生譚,邪商本生譚,超千本生譚,嫌惡色本生譚
101#超百本生譚,鮮菜果店本生譚,仇敵本生譚,知友比丘本生譚,弱樹本生譚,釣瓶女本生譚,投擲術本生譚,田舍女本生譚,粉菓子本生譚,全總括問
111#驢馬問,不死皇后問,豺本生譚,中思魚本生譚,警告者本生譚,背教者本生譚,鷓鴣本生譚,鶉本生譚,非時叫喚者本生譚,解縛本生譚
121#吉祥草本生譚,愚者本生譚,鍬柄本生譚,菴羅果本生譚,伽他哈迦奴隸本生譚,劍相師本生譚,伽藍杜迦奴隸本生譚,貓本生譚,火種本生譚,拘舍女本生譚
131#不與本生譚,五師本生譚,火焰本生譚,禪定清淨本生譚,月光本生譚,金色鵝鳥本生譚,貓本生譚,蜥蜴本生譚,二重失敗本生譚,烏本生譚
141#蜥蜴本生譚,豺本生譚,威光本生譚,象尾本生譚,拉達鸚鵡本生譚,烏本生譚,花祭本生譚,豺本生譚,一葉本生譚,等活本生譚
151#王訓本生譚,豺本生譚,野豬本生譚,龍本生譚,伽伽婆羅門本生譚,無私心本生譚,有德本生譚,善頰本生譚,孔雀本生譚,紺青鴉本生譚
161#因陀羅同姓本生譚,親交本生譚,須師摩王本生譚,鷲本生譚,鼬本生譚,烏婆沙魯哈婆羅門本生譚,完美本生譚,鷹本生譚,阿邏迦仙本生譚,伽美雷翁本生譚
171#善法本生譚,達陀羅山本生譚,猿猴本生譚,叛逆猿猴本生譚,日輪供養本生譚,一握豌豆本生譚,鎮頭迦樹本生譚,龜本生譚,正法婆羅門本生譚,難施本生譚
181#無雙王子本生譚,戰場住居本生譚,濾水本生譚,山牙本生譚,不喜本生譚,凝乳運搬王本生譚,四美本生譚,獅子豺本生譚,獅子皮本生譚,戒德利益本生譚
191#魯哈迦婆羅門本生譚,吉祥黑耳本生譚,小蓮華王本生譚,寶珠竊盜本生譚,山麓本生譚,雲馬本生譚,怨親本生譚,羅陀鸚鵡本生譚,家長本生譚,善戒本生譚
201#獄舍本生譚,耽戲本生譚,犍度本生譚,維拉迦烏本生譚,恒伽魚本生譚,羚羊本生譚,阿薩迦王本生譚,鰐本生譚,鷓鴣本生譚,堪達伽羅迦啄木鳥本生譚
211#蘇摩達陀婆羅門子本生譚,殘食本生譚,巴魯王本生譚,河水滿本生譚,龜本生譚,魚本生譚,塞句女本生譚,詐騙商人本生譚,誹謗本生譚,法幢本生譚
221#袈裟本生譚,小難提耶猿本生譚,囊食本生譚,鰐本生譚,堪忍禮讚者本生譚,梟本生譚,糞食蟲本生譚,迦瑪尼他婆羅門本生譚,逃亡本生譚,第二逃亡本生譚
231#革履本生譚,琵琶竿本生譚,鐖箭本生譚,阿西達布妃本生譚,越闍那迦遊行者本生譚,青鷺本生譚,娑祇多婆羅門本生譚,一句本生譚,綠母本生譚,大黃王本生譚
241#一切牙豺本生譚,犬本生譚,古提拉音樂本生譚,離欲本生譚,根本方便本生譚,油教訓本生譚,帕丹迦利王子本生譚,緊祝迦喻本生譚,薩羅迦猿本生譚,猿本生譚
251#思惟本生譚,一握胡麻本生譚,寶珠頸龍王本生譚,糠腹辛頭馬本生譚,鸚鵡本生譚,古井本生譚,哥瑪尼闡陀農夫本生譚,曼陀多王本生譚,提利達瓦奢仙本生譚,使者本生譚
261#蓮華本生譚,柔軟手本生譚,小誘惑本生譚,摩訶波羅那王本生譚,箭本生譚,疾風辛頭馬本生譚,蟹本生譚,毀園本生譚,善生女本生譚,梟本生譚
271#泉井污濁本生譚,虎本生譚,龜本生譚,貪欲本生譚,美麗本生譚,拘樓國法本生譚,羽毛本生譚,水牛本生譚,鶴本生譚,毀籠本生譚
281#正中本生譚,善人本生譚,工匠養豬本生譚,吉祥本生譚,寶珠野豬本生譚,睡蓮根豚本生譚,利得輕侮本生譚,魚羣本生譚,諸種願望本生譚,驗德本生譚
291#寶瓶本生譚,美翼烏王本生譚,身體厭離本生譚,閻浮果實本生譚,下賤者本生譚,海本生譚,愛慾悲嘆本生譚,優曇婆羅本生譚,寇瑪耶普陀婆羅門本生譚,狼本生譚
301#小迦陵誐王女本生譚,大騎手本生譚,一王本生譚,達陀羅龍本生譚,驗德本生譚,善生妃本生譚,簇葉樹本生譚,速疾鳥本生譚,屍漢本生譚,薩維哈大臣本生譚
311#絍婆樹本生譚,迦葉愚鈍本生譚,堪忍宗本生譚,鐵鼎本生譚,肉本生譚,兔本生譚,死者哀悼本生譚,夾竹桃華本生譚,鷓鴣本生譚,喜捨本生譚
321#毀屋本生譚,墮落音本生譚,梵與王本生譚,皮衣普行者本生譚,蜥蜴本生譚,天華樹華本生譚,伽伽蒂妃本生譚,不可悲本生譚,黑腕猿本生譚,驗德本生譚
331#拘迦利比丘本生譚,車鞭本生譚,蜥蜴本生譚,王訓本生譚,豺本生譚,大傘蓋王子本生譚,座席本生譚,稃本生譚,巴威路國本生譚,維薩易哈長者本生譚
341#健達利王本生譚,猿本生譚,穀祿鳥本生譚,菴羅果盜本生譚,龜本生譚,啟娑瓦行者本生譚,鐵槌本生譚,森林本生譚,破和睦本生譚,天神所問本生譚
351#摩尼耳環本生譚,善生居士子本生譚,張枝本生譚,蛇本生譚,蘇油王子本生譚,伽藍第雅青年本生譚,鶉本生譚,小護法王子本生譚,金鹿本生譚,須遜第妃本生譚
361#色高本生譚,驗德本生譚,慚本生譚,螢本生譚,蛇使本生譚,棍比耶夜叉本生譚,九官鳥本生譚,竹銬本生譚,知友本生譚,蘇芳樹本生譚
371#長災拘薩羅王本生譚,鹿兒本生譚,鼠本生譚,小弓術師本生譚,鳩本生譚
376#渡守本生譚,白旗婆羅門本生譚,達利穆迦辟支佛本生譚,呢魯黃金山本生譚,疑姬本生譚,米伽羅巴兀鷹本生譚,吉祥黑耳本生譚,鷄本生譚,法幢本生譚,難提鹿王本生譚
386#驢馬子本生譚,縫針本生譚,鼻豚本生譚,金色蟹本生譚,我有鳥本生譚,害魔法本生譚,蓮花本生譚,殘滓本生譚,鶉本生譚,烏本生譚
396#尺度本生譚,意生獅子本生譚,須達那青年本生譚,兀鷹本生譚,沓婆草花本生譚,達桑那國製劍本生譚,菓子袋本生譚,阿提闍那婆羅門本生譚,猿本生譚,婆迦梵王本生譚
406#健陀羅王本生譚,大猿本生譚,陶師本生譚,堅法本生譚,蘇摩達多象本生譚,須尸摩王本生譚,綿樹頂本生譚,都瑪伽利牧羊者本生譚,不眠班本生譚,酢味粥食本生譚,巴藍塔婆從僕本生譚
417#迦旃延本生譚,八聲本生譚,美女蘇拉薩本生譚,善吉祥本生譚,理髮師甘伽瑪拉本生譚,支提本生譚,根本生譚,燃燒本生譚,非處本生譚,豹本生譚
427#鷹本生譚,憍賞彌本生譚,大鸚鵡本生譚,小鸚鵡本生譚,哈利達仙本生譚,足跡善知童子本生譚,多毛迦葉本生譚,鴛鴦本生譚,散亂本生譚,箱本生譚,腐肉豺本生譚,鷓鴣本生譚
439#四門本生譚,黑賢者本生譚,四布薩誓願本生譚,桑伽婆羅門本生譚,小菩提童子本生譚,康哈提帕耶那道士本生譚,尼拘律童子本生譚,球莖本生譚,大護法本生譚,雄雞本生譚,輝煌耳環本生譚,布施比丘本生譚,鴛鴦本生譚,布利般哈本生譚,大吉兆本生譚,迦達賢者本生譚
455#養母象本生譚,月光王本生譚,法天子本生譚,優陀耶王子本生譚,水本生譚,優萬伽王子本生譚,十車王本生譚,防護童子本生譚,蘇婆羅迦賢者本生譚
464#小郭公本生譚,跋陀娑羅樹神本生譚,海商本生譚,欲愛本生譚,闍那散陀王本生譚,大黑犬本生譚,拘私夜長者本生譚,牡羊本生譚,大蓮華王子本生譚,真友非友本生譚
474#菴羅果本生譚,攀達納樹本生譚,敏捷鵞本生譚,小那羅陀苦行者本生譚,使者本生譚,迦陵誐王菩提樹供養本生譚,阿吉提婆羅門本生譚,陀伽利耶青年本生譚,盧盧鹿本生譚,舍羅婆鹿本生譚
484#稻田本生譚,月緊那羅本生譚,大鶚本生譚,鬱陀羅迦苦行者本生譚,蓮根本生譚,善喜王本生譚,五者布薩會本生譚,大孔雀王本生譚,木工養豬本生譚,大商人本生譚,娑提那王本生譚,十婆羅門本生譚,次第供養本生譚
497#摩登伽本生譚,質多、三浮陀本生譚,尸毘王本生譚,榮者之愚本生譚,魯般達鹿本生譚,白鳥本生譚,薩提坤巴（槍羣）妥鸚鵡本生譚,巴拉提雅本生譚,蘇馬拿薩王子本生譚,羌培耶本生譚,大誘惑本生譚,五賢人本生譚,護象本生譚,鐵屋本生譚
511#何欲本生譚,瓶本生譚,伏敵本生譚,六色牙象本生譚,三婆婆本生譚,大猿本生譚,水羅剎本生譚,槃達羅龍王本生譚,山布拉妃本生譚,結節鎮頭迦樹神本生譚
521#三鳥本生譚,娑羅槃迦仙本生譚,阿蘭布薩天女本生譚,護螺龍王本生譚,小須陀蘇摩王本生譚
526#那利妮伽王女本生譚,溫瑪丹提女本生譚,大菩提普行沙門本生譚
529#須那迦辟支佛本生譚,珊乞闍仙本生譚
531#姑尸王本生譚,數那難陀仙本生譚
533#小鵞本生譚,大鵞本生譚,天食本生譚,鳩那羅本生譚,大須陀須摩本生譚
538#啞躄本生譚,摩訶伽那迦本生譚
540#睒摩賢者本生譚,尼彌王本生譚,康達哈羅司祭官本生譚,槃達龍本生譚,大那羅陀迦葉梵天本生譚,比豆梨賢者本生譚
546#大隧道本生譚,毘輸安呾囉王子本生史譚`;

  function storyList(unit, vol, n1, txt) {
    var a = txt.split('\|'), wrap = unit[0] == '第';
    var ret = !wrap ? `${unit}： ` : `<tr><td valign=top>${unit}<td>`, n = n1;
    for (var i=0; i<a.length; ++i) {
      var ttl = a[i], lnk = `?vol=${vol}&loc=s${to3d(n)}`;
      ret += `<a href="${lnk}" title="${ttl}">${n}</a>　`;
      ++n;
    }
    if (wrap) ret += '</td></tr>';
    return ret;
  }

  var a = storyTexts.split('\n');
  storyTexts = {};
  for (var i in a) {
    var b = a[i].split('#');
    storyTexts[b[0].trim()] = b[1].trim().split(',');
  }
  a = stories.split('\n');
  for (var i in a) {
    var b = a[i].split('|'),
        part = b[0].trim(),
        pin  = b[1].trim(),
        vol  = b[2].trim(),
        fnum = b[3].trim();
    b = new 品(pin, vol, fnum, storyTexts[fnum]);
    SUTRA.parts[part].add(b);
  }

})();
