// Recognized PI values: [a], [x]

const DOC = new ChapterDoc('佛說大乘無量壽莊嚴清淨平等覺經', `

>>>([] 1) 法會聖眾第一
如是我聞一時佛在王舍城耆闍崛山中
與大比丘眾萬二千人俱
一切大聖神通已達其名曰尊者憍陳如
尊者舍利弗 尊者大目犍連 尊者迦葉
尊者阿難　等而為上首
又有普賢菩薩 文殊師利菩薩 彌勒菩
薩 及賢劫中一切菩薩　皆來集會

>>>([] 2) 德遵普賢第二
又 賢護 等十六正士所謂
善思惟菩薩 慧辯才菩薩 觀無住菩薩
神通華菩薩　 光英菩薩　 寶幢菩薩
　智上菩薩　 寂根菩薩　 信慧菩薩
　願慧菩薩　 香象菩薩　 寶英菩薩
　中住菩薩　 制行菩薩　 解脫菩薩
而為上首
<>
咸共遵修普賢大士之德具足無量行願
安住一切功德法中遊步十方行權方便
入佛法藏究竟彼岸
願於無量世界成等正覺
捨兜率降王宮棄位出家苦行學道
作斯示現順世間故
以定慧力降伏魔怨得微妙法成最正覺
<>
天人歸仰請轉法輪常以法音覺諸世間
破煩惱城壞諸欲塹洗濯垢污顯明清白
調眾生宣妙理貯功德示福田
以諸法藥救療三苦升灌頂階授菩提記
為教菩薩作阿闍黎常習相應無邊諸行
成熟菩薩無邊善根無量諸佛咸共護念
諸佛剎中皆能示現譬善幻師現眾異相
<>
於彼相中實無可得此諸菩薩亦復如是
通諸法性達眾生相供養諸佛開導群生
化現其身猶如電光裂魔見網解諸纏縛
遠超聲聞辟支佛地入空無相無願法門
善立方便顯示三乘於此中下而現滅度
得無生無滅諸三摩地
及得一切陀羅尼門
<>
-
隨時悟入華嚴三昧具足總持百千三昧
住深禪定悉睹無量諸佛
於一念頃徧遊一切佛土
得佛辯才住普賢行善能分別眾生語言
開化顯示真實之際超過世間諸所有法
<>
心常諦住度世之道
於一切萬物隨意自在
為諸庶類作不請之友
受持如來甚深法藏護佛種性常使不絕
興大悲愍有情演慈辯
授法眼杜惡趣開善門
於諸眾生視若自己拯濟負荷皆度彼岸
悉獲諸佛無量功德智慧聖明不可思議
<>
-
如是等諸大菩薩無量無邊一時來集
-
又有比丘尼五百人
清信士七千人清信女五百人
欲界天色界天諸天梵眾悉共大會

>>>([] 3) 大教緣起第三
爾時世尊威光赫奕如融金聚
又如明鏡影暢表裏現大光明數千百變
尊者阿難即自思惟 今日世尊
色身諸根悅豫清淨光顏巍巍寶剎莊嚴
從昔以來所未曾見喜得瞻仰生希有心
即從座起偏袒右肩長跪合掌而白佛言
<>
世尊今日入大寂定住奇特法
住諸佛所住導師之行最勝之道
去來現在佛佛相念
為念過去未來諸佛耶
為念現在他方諸佛耶
何故威神顯耀光瑞殊妙乃爾
願為宣說
<>
於是世尊告阿難言 善哉善哉
汝為哀愍利樂諸眾生故能問如是
微妙之義汝今斯問勝於供養一天下
阿羅漢辟支佛布施累劫諸天人民
蜎飛蠕動之類功德百千萬倍
何以故 當來諸天人民一切含靈
皆因汝問而得度脫故
<>
阿難
如來以無盡大悲矜哀三界
所以出興於世
光闡道教欲拯群萌惠以真實之利
難值難見如優曇花希有出現
汝今所問多所饒益
<>
阿難當知
如來正覺其智難量無有障礙
能於念頃住無量億劫
身及諸根無有增減 所以者何
如來定慧究暢無極
於一切法而得最勝自在故
阿難諦聽善思念之吾當為汝分別解說

>>>([] 4) 法藏因地第四
佛告阿難
過去無量不可思議無央數劫
有佛出世名世間自在王如來
應供 等正覺 明行足 善逝 世間解
無上士 調御丈夫 天人師 佛 世尊
在世教授四十二劫
時為諸天及世人民說經講道
<>
有大國主名世饒王聞佛說法歡喜開解
尋發無上真正道意棄國捐王行作沙門
號曰法藏修菩薩道高才勇哲與世超異
信解明記悉皆第一又有殊勝行願及
念慧力增上其心堅固不動修行精進
無能踰者
<>
往詣佛所頂禮長跪向佛合掌
即以伽他讚佛發廣大願頌曰
-
 如來微妙色端嚴 一切世間無有等
 光明無量照十方 日月火珠皆匿曜
 世尊能演一音聲 有情各各隨類解
 又能現一妙色身 普使眾生隨類見
<>
-
 願我得佛清淨聲 法音普及無邊界
 宣揚戒定精進門 通達甚深微妙法
 智慧廣大深如海 內心清淨絕塵勞
 超過無邊惡趣門 速到菩提究竟岸
 無明貪瞋皆永無 惑盡過亡三昧力
<>
-
 亦如過去無量佛 為彼群生大導師
 能救一切諸世間 生老病死眾苦惱
 常行布施及戒忍 精進定慧六波羅
 未度有情令得度 已度之者使成佛
 假令供養恆沙聖 不如堅勇求正覺
<>
 願當安住三摩地 恆放光明照一切
 感得廣大清淨居 殊勝莊嚴無等倫
 輪迴諸趣眾生類 速生我剎受安樂
 常運慈心拔有情 度盡無邊苦眾生
-
 我行決定堅固力 唯佛聖智能證知
 縱使身止諸苦中 如是願心永不退

>>>([] 5) 至心精進第五
-
法藏比丘說此偈已而白佛言
我今為菩薩道已發無上正覺之心
取願作佛悉令如佛
願佛為我廣宣經法我當奉持如法修行
拔諸勤苦生死根本速成無上正等正覺
<>
-
欲令我作佛時智慧光明
所居國土教授名字皆聞十方
諸天人民及蜎蠕類來生我國悉作菩薩
我立是願都勝無數諸佛國者
甯可得不
<>
世間自在王佛即為法藏而說經言
譬如大海一人斗量經歷劫數尚可窮底
人有至心求道精進不止會當剋果
何願不得
汝自思惟修何方便而能成就佛剎莊嚴
如所修行汝自當知清淨佛國汝應自攝
<>
法藏白言 斯義宏深非我境界
惟願如來應正遍知廣演諸佛無量妙剎
若我得聞如是等法思惟修習誓滿所願
世間自在王佛知其高明志願深廣
即為宣說二百一十億諸佛剎土
功德嚴淨廣大圓滿之相
應其心願悉現與之說是法時經千億歲
<>
爾時法藏聞佛所說皆悉覩見
起發無上殊勝之願
於彼天人善惡國土麤妙思惟究竟
便一其心選擇所欲結得大願精勤求索
恭慎保持修習功德滿足五劫
於彼二十一俱胝佛土功德莊嚴之事
明了通達如一佛剎所攝佛國超過於彼
<>
既攝受已復詣世自在王如來所
稽首禮足繞佛三匝合掌而住白言
世尊我已成就莊嚴佛土清淨之行
佛言 善哉
今正是時汝應具說令眾歡喜
亦令大眾聞是法已得大善利
能於佛剎修習攝受滿足無量大願

>>>([] 6) 發大誓願第六
-
法藏白言 唯願世尊大慈聽察
-
我若證得無上菩提成正覺已
所居佛剎具足無量不可思議功德莊嚴
<>
無有地獄餓鬼禽獸蜎飛蠕動之類
所有一切眾生以及焰摩羅界三惡道中
來生我剎
受我法化悉成阿耨多羅三藐三菩提
不復更墮惡趣
得是願乃作佛
不得是願不取無上正覺　
<>
-
我作佛時十方世界所有眾生令生我剎
皆具紫磨真金色身三十二種大丈夫相
端正淨潔悉同一類
若形貌差別有好醜者
不取正覺　
<>
-
我作佛時所有眾生生我國者
自知無量劫時宿命所作善惡
皆能洞視徹聽知十方去來現在之事
不得是願不取正覺　
<>
-
我作佛時所有眾生生我國者
皆得他心智通
若不悉知億那由他百千佛剎
眾生心念者
不取正覺　
<>
-
我作佛時所有眾生生我國者
皆得神通自在波羅蜜多
於一念頃不能超過億那由他百千佛剎
周徧巡歷供養諸佛者
不取正覺
<>
-
我作佛時所有眾生生我國者
遠離分別諸根寂靜
若不決定成等正覺證大涅槃者
不取正覺　
<>
-
我作佛時光明無量普照十方絕勝諸佛
勝於日月之明千萬億倍
若有眾生見我光明照觸其身莫不安樂
慈心作善來生我國
若不爾者不取正覺　
<>
我作佛時壽命無量
國中聲聞天人無數壽命亦皆無量
假令三千大千世界眾生悉成緣覺
於百千劫悉共計校
若能知其量數者
不取正覺　
<>
-
-
我作佛時十方世界無量剎中無數諸佛
若不共稱歎我名說我功德國土之善者
不取正覺　
<>
-
我作佛時十方眾生聞我名號
至心信樂所有善根心心回向
願生我國乃至十念
若不生者不取正覺
唯除五逆誹謗正法
<>
我作佛時十方眾生聞我名號
發菩提心修諸功德奉行六波羅蜜
堅固不退復以善根迴向願生我國
一心念我晝夜不斷
臨壽終時我與諸菩薩眾迎現其前
經須臾間即生我剎作阿惟越致菩薩
不得是願不取正覺　
<>
我作佛時十方眾生聞我名號
繫念我國發菩提心堅固不退
植眾德本至心迴向欲生極樂無不遂者
若有宿惡聞我名字即自悔過為道作善
便持經戒願生我剎
命終不復更三惡道即生我國
若不爾者不取正覺　
<>
我作佛時國無婦女
若有女人聞我名字得清淨信發菩提心
厭患女身願生我國
命終即化男子來我剎土
十方世界諸眾生類生我國者
皆於七寶池蓮華中化生
若不爾者不取正覺　
<>
我作佛時十方眾生
聞我名字歡喜信樂禮拜歸命
以清淨心修菩薩行
諸天世人莫不致敬
若聞我名壽終之後生尊貴家
諸根無缺常修殊勝梵行
若不爾者不取正覺　
<>
我作佛時國中無不善名
所有眾生生我國者
皆同一心住於定聚
永離熱惱心得清涼
所受快樂猶如漏盡比丘
若起想念貪計身者
不取正覺　
<>
我作佛時生我國者善根無量
皆得金剛那羅延身堅固之力
身頂皆有光明照耀成就一切智慧
獲得無邊辯才善談諸法秘要
說經行道語如鐘聲
若不爾者不取正覺　
<>
我作佛時所有眾生生我國者
究竟必至一生補處除其本願為眾生故
被弘誓鎧教化一切有情
皆發信心修菩提行行普賢道
雖生他方世界永離惡趣
或樂說法或樂聽法或現神足隨意修習
無不圓滿 若不爾者不取正覺　
<>
-
我作佛時生我國者
所須飲食衣服種種供具
隨意即至無不滿願
十方諸佛應念受其供養
若不爾者不取正覺　
<>
-
我作佛時國中萬物
嚴淨光麗形色殊特窮微極妙無能稱量
其諸眾生雖具天眼
有能辨其形色光相名數及總宣說者
不取正覺　
<>
我作佛時國中
無量色樹高或百千由旬
道場樹高四百萬里
諸菩薩中雖有善根劣者亦能了知
欲見諸佛淨國莊嚴悉於寶樹間見
猶如明鏡睹其面像
若不爾者不取正覺　
<>
-
我作佛時所居佛剎
廣博嚴淨光瑩如鏡
徹照十方無量無數不可思議
諸佛世界眾生睹者生希有心
若不爾者不取正覺　
<>
我作佛時下從地際上至虛空
宮殿樓觀池流華樹國土
所有一切萬物皆以無量寶香合成
其香普熏十方世界
眾生聞者皆修佛行
若不爾者不取正覺　
<>
-
我作佛時十方佛剎諸菩薩眾
聞我名已皆悉逮得清淨解脫普等三昧
諸深總持住三摩地至於成佛
定中常供無量無邊一切諸佛不失定意
若不爾者不取正覺　
<>
我作佛時他方世界諸菩薩眾
聞我名者證離生法獲陀羅尼清淨歡喜
得平等住修菩薩行具足德本
應時不獲一二三忍
於諸佛法不能現證不退轉者
不取正覺　

>>>([] 7) 必成正覺第七
佛告阿難 爾時法藏比丘說此願已
以偈頌曰
　我建超世志 必至無上道
　斯願不滿足 誓不成等覺
　復為大施主 普濟諸窮苦
　令彼諸群生 長夜無憂惱
　出生眾善根 成就菩提果
<>
-
　我若成正覺 立名無量壽
　眾生聞此號 俱來我剎中
　如佛金色身 妙相悉圓滿
　亦以大悲心 利益諸群品
　離欲深正念 淨慧修梵行
<>
-
　願我智慧光 普照十方剎
　消除三垢冥 明濟眾厄難
　悉捨三途苦 滅諸煩惱暗
　開彼智慧眼 獲得光明身
　閉塞諸惡道 通達善趣門
<>
-
　為眾開法藏 廣施功德寶　
　如佛無礙智 所行慈愍行
　常作天人師 得為三界雄
　說法師子吼 廣度諸有情
　圓滿昔所願 一切皆成佛

<>
-
　斯願若尅果 大千應感動
　虛空諸天神 當雨珍妙華　
-
佛告阿難 法藏比丘說此頌已
應時普地六種震動天雨妙華以散其上
自然音樂空中讚言決定必成無上正覺

>>>([] 8) 積功累德第八
阿難 法藏比丘於世自在王如來前及
諸天人大眾之中發斯弘誓願已
住真實慧勇猛精進一向專志莊嚴妙土
所修佛國
開廓廣大超勝獨妙建立常然無衰無變
於無量劫積植德行
<>
不起貪瞋癡欲諸想不著色聲香味觸法
但樂憶念過去諸佛所修善根
行寂靜行遠離虛妄依真諦門植眾德本
不計眾苦少欲知足專求白法惠利群生
志願無倦忍力成就
於諸有情常懷慈忍和顏愛語勸諭策進
<>
-
恭敬三寶奉事師長無有虛偽諂曲之心
莊嚴眾行軌範具足觀法如化三昧常寂
善護口業不譏他過
善護身業不失律儀
善護意業清淨無染
<>
-
所有國城聚落眷屬珍寶都無所著
恆以布施持戒忍辱精進禪定智慧
六度之行教化安立眾生
住於無上真正之道
<>
由成如是諸善根故
所生之處無量寶藏自然發應
或為長者居士豪姓尊貴
或為剎利國王轉輪聖帝
或為六欲天主乃至梵王
於諸佛所尊重供養未曾間斷
如是功德說不能盡
<>
身口常出無量妙香猶如栴檀優缽羅華
其香普熏無量世界
隨所生處色相端嚴三十二相八十種好
悉皆具足手中常出無盡之寶莊嚴之具
一切所須最上之物利樂有情
由是因緣能令無量眾生
皆發阿耨多羅三藐三菩提心

>>>([] 9) 圓滿成就第九
佛告阿難
法藏比丘修菩薩行積功累德無量無邊
於一切法而得自在
非是語言分別之所能知
所發誓願圓滿成就
如實安住具足莊嚴威德廣大清淨佛土
<>
阿難聞佛所說白世尊言
法藏菩薩成菩提者
為是過去佛耶未來佛耶
為今現在他方世界耶
世尊告言 彼佛如來
來無所來去無所去
無生無滅非過現未來
<>
但以酬願度生現在西方去閻浮提百千
俱胝那由他佛剎有世界名曰極樂
法藏成佛號阿彌陀
成佛以來於今十劫
今現在說法
有無量無數菩薩聲聞之眾恭敬圍繞

>>>([] 10) 皆願作佛第十
-
佛說阿彌陀佛為菩薩求得是願時
阿闍王子與五百大長者聞之皆大歡喜
各持一金華蓋俱到佛前作禮
以華蓋上佛已卻坐一面聽經心中願言
令我等作佛時皆如阿彌陀佛
<>
佛即知之告諸比丘是王子等後當作佛
彼於前世住菩薩道
無數劫來供養四百億佛
迦葉佛時彼等為我弟子
今供養我復相值也
時諸比丘聞佛言者莫不代之歡喜

>>>([] 11) 國界嚴淨第十一
佛語阿難彼極樂界無量功德具足莊嚴
永無眾苦諸難惡趣魔惱之名
亦無四時寒暑雨冥之異
復無大小江海丘陵坑坎荊棘沙礫鐵圍
須彌土石等山惟以自然七寶黃金為地
寬廣平正不可限極微妙奇麗清淨莊嚴
超逾十方一切世界
<>
阿難聞已白世尊言
若彼國土無須彌山
其四天王天及忉利天依何而住
佛告阿難 夜摩兜率乃至色無色界
一切諸天依何而住
阿難白言 不可思議業力所致
<>
佛語阿難 不思議業汝可知耶
汝身果報不可思議
眾生業報亦不可思議
眾生善根不可思議
諸佛聖力諸佛世界亦不可思議
其國眾生功德善力住行業地及佛神力
故能爾耳
<>
-
-
阿難白言
業因果報不可思議我於此法實無所惑
但為將來眾生破除疑網故發斯問

>>>([] 12) 光明遍照第十二
佛告阿難
阿彌陀佛威神光明最尊第一
十方諸佛所不能及遍照東方恆沙佛剎
南西北方四維上下亦復如是
若化頂上圓光
或一二三四由旬或百千萬億由旬
諸佛光明或照一二佛剎或照百千佛剎
<>
惟 
阿彌陀佛光明普照無量無邊無數佛剎
諸佛光明所照遠近本其前世求道
所願功德大小不同至作佛時各自得之
自在所作不為預計
阿彌陀佛光明善好
勝於日月之明千億萬倍
光中極尊佛中之王
<>
是故無量壽佛
亦號無量光佛
亦號無邊光佛 無礙光佛 無等光佛
亦號智慧光　 常照光　 清淨光
　　歡喜光　 解脫光　 安隱光
　　超日月光 不思議光
<>
如是光明普照十方一切世界
其有眾生遇斯光者垢滅善生身意柔軟
若在三途極苦之處見此光明皆得休息
命終皆得解脫
若有眾生聞其光明威神功德日夜稱說
至心不斷隨意所願得生其國

>>>([] 13) 壽眾無量第十三
-
佛語阿難
無量壽佛壽命長久不可稱計
又有無數聲聞之眾神智洞達威力自在
能於掌中持一切世界
<>
我弟子中大目犍連神通第一
三千大千世界所有一切星宿眾生
於一晝夜悉知其數
假使十方眾生悉成緣覺
一一緣覺壽萬億歲神通皆如大目犍連
盡其壽命竭其智力悉共推算彼佛會中
聲聞之數千萬分中不及一分
<>
譬如大海深廣無邊
設取一毛析為百分碎如微塵
以一毛塵沾海一滴此毛塵水比海孰多
阿難 彼目犍連等所知數者如毛塵水
　　 所未知者如大海水
彼佛壽量及諸菩薩聲聞天人壽量亦爾
非以算計譬喻之所能知

>>>([] 14) 寶樹遍國第十四
彼如來國多諸寶樹
或純金樹 純白銀樹 琉璃樹 水晶樹
　琥珀樹 美玉樹　 瑪瑙樹
唯一寶成不雜餘寶
或有二寶三寶乃至七寶轉共合成
根莖枝幹此寶所成華葉果實他寶化作
或有寶樹黃金為根白銀為身琉璃為枝
<>
水晶為梢琥珀為葉美玉為華瑪瑙為果
其餘諸樹復有七寶互為根幹枝葉華果
種種共成
各自異行行行相值莖莖相望枝葉相向
華實相當榮色光曜不可勝視
清風時發出五音聲微妙宮商自然相和
是諸寶樹周遍其國

>>>([] 15) 菩提道場第十五
-
又其道場有菩提樹高四百萬里
其本周圍五千由旬枝葉四布二十萬里
一切眾寶自然合成華果敷榮光暉遍照
復有紅綠青白諸摩尼寶
眾寶之王以為瓔珞
<>
雲聚寶鏁飾諸寶柱金珠鈴鐸周匝條間
珍妙寶網羅覆其上百千萬色互相映飾
無量光炎照耀無極一切莊嚴隨應而現
微風徐動吹諸枝葉演出無量妙法音聲
其聲流布遍諸佛國清暢哀亮微妙和雅
十方世界音聲之中最為第一
<>
若有眾生覩菩提樹
聞聲嗅香嘗其果味觸其光影
念樹功德皆得六根清徹無諸惱患
住不退轉至成佛道
復由見彼樹故獲三種忍
一音響忍 二柔順忍 三者無生法忍
<>
佛告阿難
如是佛剎華果樹木與諸眾生而作佛事
此皆無量壽佛威神力故
　　　　　　本願力故
　　　　　　滿足願故
　　　　　　明了堅固究竟願故

>>>([] 16) 堂舍樓觀第十六
又無量壽佛講堂精舍樓觀欄楯
亦皆七寶自然化成
復有白珠摩尼以為交絡明妙無比
諸菩薩眾所居宮殿亦復如是
中有在地講經誦經者
有在地受經聽經者
有在地經行者思道及坐禪者
<>
有在虛空講誦受聽者經行思道及
坐禪者
或得須陀洹或得斯陀含
或得阿那含阿羅漢
未得阿惟越致者則得阿惟越致
各自念道說道行道莫不歡喜

>>>([] 17) 泉池功德第十七
又其講堂左右泉池交流縱廣深淺皆各
一等或十由旬二十由旬乃至百千由旬
湛然香潔具八功德
岸邊無數旃檀香樹吉祥果樹華果恆芳
光明照耀修條密葉交覆於池出種種香
世無能喻
隨風散馥沿水流芬
<>
-
-
又復池飾七寶地布金沙
優鉢羅華鉢曇摩華拘牟頭華芬陀利華
雜色光茂彌覆水上
<>
若彼眾生過浴此水欲至足者欲至膝者
欲至腰腋欲至頸者或欲灌身
或欲冷者溫者急流者緩流者
其水一一隨眾生意開神悅體淨若無形
寶沙映澈無深不照微瀾徐廻轉相灌注
波揚無量微妙音聲
或聞佛法僧聲 波羅蜜聲
<>
止息寂靜聲 無生無滅聲 十力無畏聲
或聞無性無作無我聲
大慈大悲喜捨聲 甘露灌頂受位聲
得聞如是種種聲已其心清淨無諸分別
正直平等成熟善根隨其所聞與法相應
其願聞者輒獨聞之所不欲聞了無所聞
永不退於阿耨多羅三藐三菩提心
<>
十方世界諸往生者
皆於七寶池蓮華中自然化生
悉受清虛之身無極之體
不聞三途惡惱苦難之名
尚無假設何況實苦
但有自然快樂之音
是故彼國名為極樂

>>>([] 18) 超世希有第十八
彼極樂國所有眾生容色微妙超世希有
咸同一類無差別相
但因順餘方俗故有天人之名
佛告阿難譬如世間貧苦乞人在帝王邊
面貌形狀寧可類乎帝王若比轉輪聖王
則為鄙陋猶彼乞人在帝王邊也轉輪聖
王威相第一比之忉利天王又復醜劣
<>
假令帝釋比第六天雖百千倍不相類也
第六天王若比極樂國中菩薩聲聞
光顏容色雖萬億倍不相及逮
所處宮殿衣服飲食猶如他化自在天王
至於威德階位神通變化
一切天人不可為比百千萬億不可計倍
<>
-
-
阿難應知
無量壽佛極樂國土
如是功德莊嚴不可思議

>>>([] 19) 受用具足第十九
復次極樂世界所有眾生
或已生或現生或當生
皆得如是諸妙色身形貌端嚴福德無量
智慧明了神通自在受用種種一切豐足
宮殿服飾香花幡蓋莊嚴之具
隨意所須悉皆如念
<>
若欲食時
七寶鉢器自然在前
百味飲食自然盈滿
雖有此食實無食者
但見色聞香以意為食
色力增長而無便穢
身心柔軟無所味著
事已化去時至復現
<>
復有眾寶妙衣冠帶瓔珞
無量光明百千妙色悉皆具足自然在身
所居舍宅稱其形色寶網彌覆懸諸寶鈴
奇妙珍異周遍校飾光色晃曜盡極嚴麗
樓觀欄楯堂宇房閣廣狹方圓
或大或小或在虛空或在平地
清淨安隱微妙快樂應念現前無不具足

>>>([] 20) 德風華雨第二十
其佛國土每於食時自然德風徐起
吹諸羅網及眾寶樹出微妙音
演說苦空無常無我諸波羅蜜
流布萬種溫雅德香
其有聞者塵勞垢習自然不起
風觸其身安和調適
猶如比丘得滅盡定
<>
復吹七寶林樹飄華成聚
種種色光遍滿佛土隨色次第而不雜亂
柔軟光潔如兜羅緜
足履其上沒深四指隨足舉已還復如初
過食時後其華自沒大地清淨更雨新華
隨其時節還復周遍與前無異
如是六反

>>>([] 21) 寶蓮佛光第二十一
又眾寶蓮華周滿世界
一一寶華百千億葉其華光明無量種色
青色青光白色白光玄黃朱紫光色亦然
復有無量妙寶百千摩尼
映飾珍奇明曜日月
彼蓮華量或半由旬或一二三四
乃至百千由旬
<>
一一華中出三十六百千億光
一一光中出三十六百千億佛
身色紫金相好殊特
一一諸佛又放百千光明
普為十方說微妙法
如是諸佛各各安立無量眾生於佛正道

>>>([] 22) 決證極果第二十二
復次阿難 彼佛國土
無有昏闇火光日月星曜晝夜之象
亦無歲月劫數之名
復無住著家室
於一切處既無標式名號
亦無取捨分別
唯受清淨最上快樂
<>
若有善男子善女人若已生若當生
皆悉住於正定之聚
決定證於阿耨多羅三藐三菩提
何以故
若邪定聚及不定聚
不能了知建立彼因故

>>>([] 23) 十方佛讚第二十三
復次阿難
東方恆河沙數世界一一界中
如恆沙佛各出廣長舌相
放無量光說誠實言
稱讚無量壽佛不可思議功德
南西北方恆沙世界諸佛稱讚亦復如是
四維上下恆沙世界諸佛稱讚亦復如是
<>
何以故
欲令他方所有眾生聞彼佛名
發清淨心憶念受持歸依供養
乃至能發一念淨信所有善根至心迴向
願生彼國隨願皆生
得不退轉乃至無上正等菩提

>>>([] 24) 三輩往生第二十四
-
-
佛告阿難
十方世界諸天人民其有至心願生彼國
凡有三輩
<>
其上輩者 捨家棄欲而作沙門
發菩提心一向專念阿彌陀佛
修諸功德願生彼國
此等眾生臨壽終時阿彌陀佛與諸聖眾
現在其前經須臾間即隨彼佛往生其國
便於七寶華中自然化生
智慧勇猛神通自在
<>
是故阿難
其有眾生欲於今世見阿彌陀佛者
應發無上菩提之心
復當專念極樂國土積集善根應持迴向
由此見佛生彼國中
得不退轉乃至無上菩提
<>
其中輩者 雖不能行作沙門大修功德
當發無上菩提之心一向專念阿彌陀佛
隨己修行諸善功德奉持齋戒起立塔像
飯食沙門懸繒然燈散華燒香
以此迴向願生彼國
其人臨終阿彌陀佛化現其身
光明相好具如真佛
<>
與諸大眾前後圍繞現其人前攝受導引
即隨化佛往生其國住不退轉無上菩提
功德智慧次如上輩者也
<>
-
其下輩者 假使不能作諸功德
當發無上菩提之心一向專念阿彌陀佛
歡喜信樂不生疑惑以至誠心願生其國
此人臨終夢見彼佛亦得往生
功德智慧次如中輩者也
<>
-
若有眾生住大乘者以清淨心向無量壽
乃至十念願生其國聞甚深法即生信解
乃至獲得一念淨心發一念心念於彼佛
此人臨命終時如在夢中見阿彌陀佛
定生彼國得不退轉無上菩提

>>>([] 25) 往生正因第二十五
復次阿難 若有善男子善女人
聞此經典受持讀誦書寫供養晝夜相續
求生彼剎發菩提心持諸禁戒堅守不犯
饒益有情所作善根悉施與之令得安樂
憶念西方阿彌陀佛及彼國土
是人命終如佛色相種種莊嚴生寶剎中
速得聞法永不退轉
<>
復次阿難 若有眾生欲生彼國雖不能
大精進禪定盡持經戒要當作善所謂
-
　一不殺生　四不妄言　八不貪
　二不偷盜　五不綺語　九不瞋
　三不淫欲　六不惡口　十不癡
　　　　　　七不兩舌
`
+
/*
`　一不殺生 二不偷盜 三不淫欲
　四不妄言 五不綺語
　六不惡口 七不兩舌
　八不貪　 九不瞋　 十不癡
` +
*/
`<>
-
如是晝夜思惟極樂世界阿彌陀佛
種種功德種種莊嚴
志心歸依頂禮供養
是人臨終不驚不怖心不顛倒
即得往生彼佛國土
<>
若多事物不能離家不暇大修齋戒
一心清淨
有空閒時端正身心絕欲去憂慈心精進
不當瞋怒嫉妒不得貪餮慳惜
不得中悔不得狐疑
要當孝順至誠忠信
當信佛經語深當信作善得福
<>
奉持如是等法不得虧失
思惟熟計欲得度脫
晝夜常念願欲往生阿彌陀佛清淨佛國
十日十夜乃至一日一夜不斷絕者
壽終皆得往生其國行菩薩道諸往生者
皆得阿惟越致皆具金色三十二相
皆當作佛欲於何方佛國作佛從心所願
<>
隨其精進早晚求道不休
會當得之不失其所願也
-
阿難 以此義利故
無量無數不可思議
無有等等無邊世界諸佛如來
皆共稱讚無量壽佛所有功德

>>>([] 26) 禮供聽法第二十六
復次阿難 十方世界諸菩薩眾
為欲瞻禮極樂世界無量壽佛
各以香華幢幡寶蓋往詣佛所
恭敬供養聽受經法宣布道化
稱讚佛土功德莊嚴
-
爾時世尊即說頌曰
<>
-
　東方諸佛剎 數如恆河沙
　恆沙菩薩眾 往禮無量壽
　南西北四維 上下亦復然
　咸以尊重心 奉諸珍妙供　
<>
　暢發和雅音 歌歎最勝尊
　究達神通慧 遊入深法門
　聞佛聖德名 安隱得大利
　種種供養中 勤修無懈倦
　觀彼殊勝剎 微妙難思議
　功德普莊嚴 諸佛國難比
　因發無上心 願速成菩提 
<>
-
　應時無量尊 微笑現金容
　光明從口出 遍照十方國
　迴光還繞佛 三匝從頂入
　菩薩見此光 即證不退位
　時會一切眾 互慶生歡喜　
<>
　佛語梵雷震 八音暢妙聲
　十方來正士 吾悉知彼願
　志求嚴淨土 受記當作佛
　覺了一切法 猶如夢幻響
　滿足諸妙願 必成如是剎
　知土如影像 恆發弘誓心
　究竟菩薩道 具諸功德本 
<>
　修勝菩提行 受記當作佛
　通達諸法性 一切空無我
　專求淨佛土 必成如是剎　
-
　聞法樂受行 得至清淨處
　必於無量尊 受記成等覺　
<>
　無邊殊勝剎 其佛本願力
　聞名欲往生 自致不退轉
　菩薩興至願 願己國無異
　普念度一切 各發菩提心
　捨彼輪迴身 俱令登彼岸　
　奉事萬億佛 飛化遍諸剎
　恭敬歡喜去 還到安養國

>>>([] 27) 歌歎佛德第二十七
佛語阿難 彼國菩薩承佛威神
於一食頃復往十方無邊淨剎供養諸佛
華香幢幡供養之具應念即至皆現手中
珍妙殊特非世所有以奉諸佛及菩薩眾
其所散華即於空中合為一華華皆向下
端圓周匝化成華蓋百千光色色色異香
香氣普薰
<>
蓋之小者滿十由旬如是轉倍乃至遍覆
三千大千世界隨其前後以次化沒
若不更以新華重散前所散華終不復落
於虛空中共奏天樂以微妙音歌歎佛德
經須臾間還其本國都悉集會七寶講堂
無量壽佛則為廣宣大教演暢妙法
莫不歡喜心解得道
<>
-
即時香風吹七寶樹出五音聲
無量妙華隨風四散自然供養如是不絕
一切諸天皆齎百千華香萬種伎樂
供養彼佛及諸菩薩聲聞之眾
前後往來熙怡快樂
<>
-
此皆無量壽佛本願加威
及曾供養如來善根相續
無缺減故 善修習故
善攝取故 善成就故

>>>([] 28) 大士神光第二十八
佛告阿難 彼佛國中諸菩薩眾
悉皆洞視徹聽八方上下去來現在之事
諸天人民以及蜎飛蠕動之類
心意善惡口所欲言何時度脫得道往生
皆豫知之
<>
又彼佛剎諸聲聞眾身光一尋
菩薩光明照百由旬
有二菩薩最尊第一
威神光明普照三千大千世界
-
阿難白佛 彼二菩薩其號云何
<>
佛言 一名觀世音 一名大勢至
此二菩薩於娑婆界修菩薩行
往生彼國常在阿彌陀佛左右
欲至十方無量佛所隨心則到
現居此界作大利樂
世間善男子善女人若有急難恐怖
但自歸命觀世音菩薩無不得解脫者

>>>([] 29) 願力宏深第二十九
復次阿難
彼佛剎中所有現在未來一切菩薩
皆當究竟一生補處
唯除大願入生死界為度群生作師子吼
擐大甲胄以宏誓功德而自莊嚴
雖生五濁惡世示現同彼直至成佛
不受惡趣生生之處常識宿命
<>
無量壽佛意欲度脫十方世界諸眾生類
皆使往生其國悉令得泥洹道
作菩薩者令悉作佛
既作佛已轉相教授轉相度脫
如是輾轉不可復計
十方世界聲聞菩薩諸眾生類生彼佛國
得泥洹道當作佛者不可勝數
<>
彼佛國中常如一法不為增多
所以者何 猶如大海為水中王
諸水流行都入海中是大海水寧為增減
八方上下佛國無數阿彌陀國長久廣大
明好快樂最為獨勝本其為菩薩時
求道所願累德所致無量壽佛恩德布施
八方上下無窮無極深大無量不可勝言

>>>([] 30) 菩薩修持第三十
復次阿難 彼佛剎中一切菩薩
禪定智慧神通威德無不圓滿
諸佛密藏究竟明了調伏諸根身心柔軟
深入正慧無復餘習依佛所行七覺聖道
修行五眼照真達俗
肉眼簡擇 天眼通達 法眼清淨
慧眼見真 佛眼具足 覺了法性
<>
辯才總持自在無礙善解世間無邊方便
所言誠諦深入義味度諸有情演說正法
無相無為無縛無脫無諸分別遠離顛倒
於所受用皆無攝取遍遊佛剎無愛無厭
亦無希求不希求想亦無彼我違怨之想
何以故 彼諸菩薩於一切眾生
　　　 有大慈悲利益心故
<>
捨離一切執著成就無量功德
以無礙慧解法如如善知集滅音聲方便
不欣世語樂在正論知一切法悉皆空寂
生身煩惱二餘俱盡於三界中平等勤修
究竟一乘至於彼岸決斷疑網證無所得
以方便智增長了知從本以來安住神通
得一乘道不由他悟

>>>([] 31) 真實功德第三十一
其智宏深譬如巨海菩提高廣喻若須彌
自身威光超於日月其心潔白猶如雪山
忍辱如地一切平等清淨如水洗諸塵垢
熾盛如火燒煩惱薪不著如風無諸障礙
法音雷震覺未覺故雨甘露法潤眾生故
曠若虛空大慈等故如淨蓮華離染污故
如尼拘樹覆蔭大故如金剛杵破邪執故
<>
如鐵圍山眾魔外道不能動故
其心正直善巧決定論法無厭求法不倦
戒若琉璃內外明潔其所言說令眾悅服
擊法鼓 建法幢 曜慧日 破癡闇
淳淨溫和寂定明察為大導師調伏自他
引導群生捨諸愛著永離三垢遊戲神通
因緣願力出生善根摧伏一切魔軍
<>
尊重奉事諸佛為世明燈最勝福田
殊勝吉祥堪受供養赫奕歡喜雄猛無畏
身色相好功德辯才具足莊嚴無與等者
常為諸佛所共稱讚
究竟菩薩諸波羅蜜
而常安住不生不滅諸三摩地
行遍道場遠二乘境
<>
-
-
阿難 我今略說彼極樂界所生菩薩
真實功德悉皆如是
若廣說者百千萬劫不能窮盡

>>>([] 32) 壽樂無極第三十二
-
佛告彌勒菩薩諸天人等
無量壽國聲聞菩薩功德智慧不可稱說
又其國土微妙安樂清淨若此
何不力為善念道之自然
<>
出入供養觀經行道喜樂久習
才猛智慧心不中迴意無懈時
外若遲緩內獨駛急容容虛空適得其中
中表相應自然嚴整檢斂端直
身心潔淨無有愛貪志願安定無增缺減
求道和正不誤傾邪隨經約令不敢蹉跌
若於繩墨咸為道慕曠無他念無有憂思
<>
自然無為虛空無立淡安無欲
作得善願盡心求索含哀慈愍禮義都合
苞羅表裏過度解脫
自然保守真真潔白志願無上淨定安樂
一旦開達明徹
自然中自然相 自然之有根本
自然光色參迴轉變最勝
<>
　鬱單成七寶 橫攬成萬物
　光精明俱出 善好殊無比
　著於無上下 洞達無邊際
　宜各勤精進 努力自求之
　必得超絕去 往生無量清淨
　　　　　　　　 阿彌陀佛國
<>
　橫截於五趣 惡道自閉塞
　無極之勝道 易往而無人
　其國不逆違 自然所牽隨
　捐志若虛空 勤行求道德
　可得極長生 壽樂無有極
　何為著世事 譊譊憂無常

>>>([] 33) 勸諭策進第三十三
-
-
世人共爭不急之務
-
於此劇惡極苦之中勤身營務以自給濟
<>
尊卑貧富少長男女累念積慮為心走使
無田憂田無宅憂宅眷屬財物有無同憂
有一少一思欲齊等適小具有又憂非常
水火盜賊怨家債主焚漂劫奪消散磨滅
心慳意固無能縱捨命終棄捐莫誰隨者
貧富同然憂苦萬端
<>
-
世間人民 父子兄弟夫婦親屬
當相敬愛無相憎嫉有無相通無得貪惜
言色常和莫相違戾
或時心諍有所恚怒後世轉劇至成大怨
世間之事更相患害雖不臨時應急想破
<>
-
人在愛欲之中
獨生獨死獨去獨來苦樂自當無有代者
善惡變化追逐所生道路不同會見無期
何不於強健時努力修善欲何待乎
<>
-
世人善惡自不能見吉凶禍福競各作之
身愚神闇轉受餘教顛倒相續無常根本
蒙冥抵突不信經法心無遠慮各欲快意
迷於瞋恚貪於財色終不休止哀哉可傷
<>
先人不善不識道德無有語者殊無怪也
死生之趣善惡之道都不之信謂無有是
更相瞻視且自見之或父哭子或子哭父
兄弟夫婦更相哭泣一死一生迭相顧戀
憂愛結縛無有解時思想恩好不離情欲
不能深思熟計專精行道
年壽旋盡無可奈何
<>
-
-
惑道者眾悟道者少各懷殺毒惡氣冥冥
為妄興事違逆天地恣意罪極頓奪其壽
下入惡道無有出期
<>
-
若曹當熟思計
遠離眾惡擇其善者勤而行之
愛欲榮華不可常保皆當別離無可樂者
當勤精進生安樂國智慧明達功德殊勝
勿得隨心所欲虧負經戒在人後也

>>>([] 34) 心得開明第三十四
彌勒白言
佛語教戒甚深甚善皆蒙慈恩解脫憂苦
佛為法王尊超群聖光明徹照洞達無極
普為一切天人之師
今得值佛復聞無量壽聲
靡不歡喜心得開明
<>
-
佛告彌勒
敬於佛者是為大善
實當念佛截斷狐疑拔諸愛欲杜眾惡源
遊步三界無所挂礙開示正道度未度者
<>
-
若曹當知
十方人民永劫以來輾轉五道憂苦不絕
生時苦痛老亦苦痛病極苦痛死極苦痛
惡臭不淨無可樂者
<>
-
宜自決斷洗除心垢言行忠信表裏相應
人能自度轉相拯濟至心求願積累善本
雖一世精進勤苦須臾間耳
後生無量壽國快樂無極永拔生死之本
無復苦惱之患壽千萬劫自在隨意
<>
-
宜各精進求心所願無得疑悔自為過咎
生彼邊地七寶城中於五百歲受諸厄也
-
彌勒白言
受佛明誨專精修學如教奉行不敢有疑

>>>([] 35) 濁世惡苦第三十五
佛告彌勒 汝等能於此世
端心正意不為眾惡甚為大德
所以者何十方世界善多惡少易可開化
唯此五惡世間最為劇苦
我今於此作佛教化群生
令捨五惡去五痛離五燒降化其意
令持五善獲其福德　何等為五
<>
其一者 世間諸眾生類欲為眾惡
強者伏弱轉相尅賊殘害殺傷迭相吞噉
不知為善後受殃罰
故有窮乞孤獨聾盲瘖瘂癡惡尪狂
皆因前世不信道德不肯為善
<>
其有尊貴豪富賢明長者智勇才達
皆由宿世慈孝修善積德所致
世間有此目前現事壽終之後
入其幽冥轉生受身改形易道
故有泥犁禽獸蜎飛蠕動之屬
<>
譬如世法牢獄劇苦極刑魂神命精
隨罪趣向所受壽命或長或短相從共生
更相報償殃惡未盡終不得離輾轉其中
累劫難出難得解脫痛不可言
-
天地之間自然有是
雖不即時暴應善惡會當歸之
<>
其二者 世間人民不順法度
奢淫驕縱任心自恣
居上不明在位不正陷人冤枉損害忠良
心口各異機偽多端尊卑中外更相欺誑
瞋恚愚癡欲自厚己欲貪多有利害勝負
結忿成讐破家亡身不顧前後
<>
富有慳惜不肯施與愛保貪重心勞身苦
如是至竟無一隨者善惡禍福追命所生
或在樂處或入苦毒
又或見善憎謗不思慕及
常懷盜心悕望他利用自供給消散復取
神明尅識終入惡道自有三途
無量苦惱輾轉其中累劫難出痛不可言
<>
其三者 世間人民相因寄生壽命幾何
不良之人身心不正常懷邪惡常念婬妷
煩滿胸中邪態外逸
費損家財事為非法所當求者而不肯為
又或交結聚會興兵相伐攻劫殺戮
強奪迫脅歸給妻子極身作樂
<>
-
-
眾共憎厭患而苦之如是之惡著於人鬼
神明記識自入三途
無量苦惱輾轉其中累劫難出痛不可言
<>
其四者 世間人民不念修善
兩舌惡口妄言綺語憎嫉善人敗壞賢明
不孝父母輕慢師長朋友無信難得誠實
尊貴自大謂己有道橫行威勢侵易於人
欲人畏敬不自慚懼難可降化常懷驕慢
賴其前世福德營護今世為惡福德盡滅
壽命終盡諸惡繞歸
<>
-
-
又其名籍記在神明殃咎牽引無從捨離
但得前行入於火鑊身心摧碎神形苦極
當斯之時悔復何及
<>
其五者 世間人民徙倚懈怠
不肯作善治身修業
父母教誨違戾反逆譬如怨家不如無子
負恩違義無有報償放恣遊散耽酒嗜美
魯扈抵突不識人情無義無禮不可諫曉
六親眷屬資用有無不能憂念
不惟父母之恩不存師友之義
<>
意念身口曾無一善
不信諸佛經法不信生死善惡
欲害真人鬥亂僧眾
愚癡蒙昧自為智慧
不知生所從來死所趣向
不仁不順希望長生
<>
-
慈心教誨而不肯信苦口與語無益其人
心中閉塞意不開解大命將終悔懼交至
不豫修善臨時乃悔
悔之於後將何及乎
<>
天地之間五道分明
善惡報應禍福相承身自當之無誰代者
善人行善從樂入樂從明入明
惡人行惡從苦入苦從冥入冥
誰能知者獨佛知耳教語開示信行者少
生死不休惡道不絕如是世人難可具盡
故有自然三途無量苦惱輾轉其中
世世累劫無有出期難得解脫痛不可言
<>
-
如是五惡五痛五燒譬如大火焚燒人身
若能自於其中一心制意端身正念
言行相副所作至誠獨作諸善不為眾惡
身獨度脫獲其福德可得長壽泥洹之道
是為五大善也

>>>([] 36) 重重誨勉第三十六
-
佛告彌勒 吾語汝等
如是五惡五痛五燒輾轉相生
敢有犯此當歷惡趣
或其今世先被病殃死生不得示眾見之
或於壽終入三惡道愁痛酷毒自相燋然
<>
共其怨家更相殺傷從小微起成大困劇
皆由貪著財色不肯施惠各欲自快
無復曲直癡欲所迫厚己爭利
富貴榮華當時快意不能忍辱不務修善
威勢無幾隨以磨滅天道施張自然糺舉
煢煢忪忪當入其中古今有是痛哉可傷
<>
汝等
得佛經語熟思惟之
各自端守終身不怠
尊聖敬善仁慈博愛
當求度世拔斷生死眾惡之本
當離三塗憂怖苦痛之道
<>
-
若曹作善云何第一
當自端心當自端身耳目口鼻皆當自端
身心淨潔與善相應勿隨嗜欲不犯諸惡
言色當和身行當專動作瞻視安定徐為
作事倉卒敗悔在後為之不諦亡其功夫

>>>([] 37) 如貧得寶第三十七
汝等廣植德本勿犯道禁忍辱精進
慈心專一齋戒清淨一日一夜勝在無量
壽國為善百歲所以者何彼佛國土皆積
德眾善無毫髮之惡於此修善十日十夜
勝於他方諸佛國中為善千歲所以者何
他方佛國福德自然無造惡之地唯此世
間善少惡多飲苦食毒未嘗寧息
<>
吾哀汝等
苦心誨喻授與經法悉持思之悉奉行之
尊卑男女眷屬朋友轉相教語自相約檢
和順義理歡樂慈孝所作如犯則自悔過
去惡就善朝聞夕改奉持經戒如貧得寶
改往修來洒心易行自然感降所願輒得
<>
-
佛所行處
國邑丘聚靡不蒙化天下和順日月清明
風雨以時災厲不起國豐民安兵戈無用
崇德興仁務修禮讓國無盜賊無有怨枉
強不凌弱各得其所
<>
我哀汝等甚於父母念子我於此世作佛
以善攻惡拔生死之苦
令獲五德升無為之安
-
吾般泥洹經道漸滅人民諂偽復為眾惡
五燒五痛久後轉劇
汝等轉相教誡如佛經法無得犯也
<>
-
彌勒菩薩合掌白言
世人惡苦如是如是
佛皆慈哀悉度脫之
受佛重誨不敢違失

>>>([] 38) 禮佛現光第三十八
佛告阿難 若曹欲見無量清淨平等覺
及諸菩薩阿羅漢等所居國土應起西向
當日沒處恭敬頂禮稱念南無阿彌陀佛
-
阿難即從座起面西合掌頂禮白言
我今願見極樂世界阿彌陀佛
供養奉事種諸善根
<>
-
頂禮之間忽見阿彌陀佛
容顏廣大色相端嚴
如黃金山高出一切諸世界上
又聞十方世界諸佛如來稱揚讚歎
阿彌陀佛種種功德無礙無斷
<>
阿難白言
彼佛淨剎得未曾有我亦願樂生於彼土
世尊告言 其中生者
已曾親近無量諸佛植眾德本
汝欲生彼應當一心歸依瞻仰
作是語時阿彌陀佛即於掌中
放無量光普照一切諸佛世界
時諸佛國皆悉明現如處一尋
<>
以阿彌陀佛殊勝光明極清淨故
於此世界所有黑山雪山金剛鐵圍
大小諸山江河叢林天人宮殿
一切境界無不照見譬如日出明照世間
乃至泥犁溪谷幽冥之處悉大開闢
皆同一色猶如劫水彌滿世界
其中萬物沉沒不現滉瀁浩汗唯見大水
<>
-
彼佛光明亦復如是
聲聞菩薩一切光明悉皆隱蔽
唯見佛光明耀顯赫
此會四眾天龍八部人非人等
皆見極樂世界種種莊嚴
<>
阿彌陀佛於彼高座威德巍巍相好光明
聲聞菩薩圍繞恭敬
譬如須彌山王出於海面
明現照耀清淨平正無有雜穢及異形類
唯是眾寶莊嚴聖賢共住
阿難及諸菩薩眾等皆大歡喜踊躍作禮
以頭著地稱念南無阿彌陀三藐三佛陀
<>
諸天人民以至蜎飛蠕動睹斯光者
所有疾苦莫不休止一切憂惱莫不解脫
悉皆慈心作善歡喜快樂
鐘磬琴瑟箜篌樂器不鼓自然皆作五音
諸佛國中諸天人民各持花香來於虛空
散作供養
<>
-
爾時極樂世界
過於西方百千俱胝那由他國
以佛威力如對目前如淨天眼觀一尋地
彼見此土亦復如是 悉睹娑婆世界
釋迦如來及比丘眾圍繞說法

>>>([] 39) 慈氏述見第三十九
爾時佛告阿難及慈氏菩薩
汝見極樂世界宮殿樓閣泉池林樹
具足微妙清淨莊嚴不
汝見欲界諸天上至色究竟天
雨諸香華遍佛剎不
阿難對曰 唯然已見
<>
汝聞阿彌陀佛大音宣布一切世界
化眾生不 阿難對曰 唯然已聞
佛言 汝見彼國淨行之眾遊處虛空
宮殿隨身無所障礙遍至十方供養
諸佛不 及見彼等念佛相續不
復有眾鳥住虛空界出種種音皆是化作
汝悉見不
<>
慈氏白言 如佛所說一一皆見
-
佛告彌勒彼國人民有胎生者汝復見不
彌勒白言世尊我見極樂世界人住胎者
如夜摩天處於宮殿
又見眾生於蓮華內結跏趺坐自然化生
何因緣故彼國人民有胎生者有化生者

>>>([] 40) 邊地疑城第四十
佛告慈氏
若有眾生以疑惑心修諸功德願生彼國
不了 佛智 不思議智 不可稱智
　　 大乘廣智 無等無倫最上勝智
於此諸智疑惑不信
猶信罪福修習善本願生其國
<>
復有眾生積集善根希求 佛智 普遍智
無等智 威德廣大不思議智
於自善根不能生信
故於往生清淨佛國意志猶豫無所專據
然猶續念不絕結其善願為本續得往生
是諸人等以此因緣雖生彼國不能前至
無量壽所道止佛國界邊七寶城中
<>
佛不使爾身行所作心自趣向
亦有寶池蓮華自然受身
飲食快樂如忉利天於其城中不能得出
所居舍宅在地不能隨意高大於五百歲
常不見佛不聞經法不見菩薩聲聞聖眾
其人智慧不明知經復少心不開解
意不歡樂是故於彼謂之胎生
<>
-
若有眾生明信佛智乃至勝智
斷除疑惑信己善根作諸功德至心迴向
皆於七寶華中自然化生跏趺而坐
須臾之頃身相光明智慧功德如諸菩薩
具足成就
<>
-
彌勒當知 彼化生者智慧勝故
其胎生者五百歲中不見三寶
不知菩薩法式不得修習功德
無因奉事無量壽佛
當知此人宿世之時無有智慧疑惑所致

>>>([] 41) 惑盡見佛第四十一
譬如轉輪聖王有七寶獄
王子得罪禁閉其中層樓綺殿寶帳金床
欄窗榻座妙飾奇珍飲食衣服如轉輪王
而以金鏁繫其兩足諸小王子寧樂此不
慈氏白言不也世尊彼幽縶時心不自在
但以種種方便欲求出離求諸近臣
終不從心輪王歡喜方得解脫
<>
佛告彌勒 此諸眾生亦復如是
若有墮於疑悔希求佛智至廣大智
於自善根不能生信由聞佛名起信心故
雖生彼國於蓮華中不得出現
彼處華胎猶如園苑宮殿之想
何以故
<>
-
彼中清淨無諸穢惡
然於五百歲中不見三寶
不得供養奉事諸佛遠離一切殊勝善根
以此為苦不生欣樂
<>
若此眾生識其罪本深自悔責求離彼處
往昔世中過失盡已然後乃出即得往詣
無量壽所聽聞經法久久亦當開解歡喜
亦得遍供無數無量諸佛修諸功德
-
汝阿逸多當知疑惑於諸菩薩為大損害
為失大利是故應當明信諸佛無上智慧
<>
慈氏白言 云何此界一類眾生
雖亦修善而不求生
佛告慈氏 此等眾生智慧微淺
分別西方不及天界是以非樂不求生彼
慈氏白言 此等眾生
虛妄分別不求佛剎何免輪迴
<>
佛言彼等所種善根不能離相不求佛慧
深著世樂人間福報雖復修福求人天果
得報之時一切豐足而未能出三界獄中
假使父母妻子男女眷屬欲相救免
邪見業王未能捨離常處輪迴而不自在
汝見愚癡之人不種善根但以世智聰辯
增益邪心云何出離生死大難
<>
復有眾生雖種善根作大福田
取相分別情執深重求出輪迴終不能得
-
若以無相智慧植眾德本
身心清淨遠離分別
求生淨剎趣佛菩提
當生佛剎永得解脫

>>>([] 42) 菩薩往生第四十二
彌勒菩薩白佛言 今此娑婆世界及諸
佛剎不退菩薩當生極樂國者其數幾何
佛告彌勒 於此世界
有七百二十億菩薩已曾供養
無數諸佛植眾德本當生彼國
諸小行菩薩修習功德當往生者
不可稱計
<>
不但我剎諸菩薩等往生彼國
他方佛土亦復如是
從遠照佛剎有十八俱胝那由他菩薩
摩訶薩生彼國土
東北方寶藏佛剎有九十億不退菩薩
當生彼國
<>
-
從無量音佛剎光明佛剎龍天佛剎
勝力佛剎師子佛剎離塵佛剎
德首佛剎仁王佛剎華幢佛剎
不退菩薩當往生者或數十百億或
數百千億乃至萬億
<>
-
其第十二佛名無上華彼有無數
諸菩薩眾皆不退轉智慧勇猛
已曾供養無量諸佛具大精進發趣一乘
於七日中即能攝取百千億劫大士
所修堅固之法斯等菩薩皆當往生
<>
-
其第十三佛名曰無畏
彼有七百九十億大菩薩眾
諸小菩薩及比丘等不可稱計
皆當往生十方世界諸佛名號及菩薩眾
當往生者但說其名窮劫不盡

>>>([] 43) 非是小乘第四十三
佛告慈氏 汝觀彼諸菩薩摩訶薩
善獲利益　若有善男子善女人
得聞阿彌陀佛名號能生一念喜愛之心
歸依瞻禮如說修行當知此人為得大利
當獲如上所說功德心無下劣亦不貢高
成就善根悉皆增上當知此人非是小乘
於我法中得名第一弟子
<>
-
是故告汝天人世間阿修羅等 應當
愛樂修習生希有心於此經中生導師想
欲令無量眾生速疾安住得不退轉及
欲見彼廣大莊嚴攝受殊勝佛剎圓滿功
德者當起精進聽此法門
<>
為求法故不生退屈諂偽之心
設入大火不應疑悔　何以故
彼無量億諸菩薩等皆悉求此微妙法門
尊重聽聞不生違背
多有菩薩欲聞此經而不能得
是故汝等應求此法

>>>([] 44) 受菩提記第四十四
若於來世乃至正法滅時
當有眾生植諸善本已曾供養無量諸佛
由彼如來加威力故能得如是廣大法門
攝取受持當獲廣大一切智智
於彼法中廣大勝解獲大歡喜
廣為他說常樂修行
諸善男子及善女人 能於是法
<>
若已求現求當求者皆獲善利
汝等應當安住無疑種諸善本應常修習
使無疑滯不入一切種類珍寶成就牢獄
-
阿逸多 如是等類大威德者
能生佛法廣大異門由於此法不聽聞故
有一億菩薩退轉阿耨多羅三藐三菩提
<>
若有眾生於此經典書寫供養受持讀誦
於須臾頃為他演說勸令聽聞不生憂惱
乃至晝夜思惟彼剎及佛功德於無上道
終不退轉彼人臨終假使三千大千世界
滿中大火亦能超過生彼國土
是人已曾值過去佛受菩提記一切如來
同所稱讚是故應當專心信受持誦說行

>>>([] 45) 獨留此經第四十五
吾今為諸眾生說此經法
令見無量壽佛及其國土一切所有
所當為者皆可求之
無得以我滅度之後復生疑惑
當來之世經道滅盡
我以慈悲哀愍特留此經止住百歲
其有眾生值斯經者隨意所願皆可得度
<>
-
如來興世難值難見諸佛經道難得難聞
-
遇善知識聞法能行此亦為難
-
若聞斯經信樂受持難中之難無過此難
<>
若有眾生得聞佛聲
慈心清淨踊躍歡喜衣毛為起或淚出者
皆由前世曾作佛道故非凡人
-
若聞佛號心中狐疑於佛經語都無所信
皆從惡道中來宿殃未盡未當度脫
故心狐疑不信向耳

>>>([] 46) 勤修堅持第四十六
佛告彌勒 諸佛如來無上之法
十力無畏無礙無著甚深之法
及波羅蜜等菩薩之法
非易可遇
能說法人亦難開示堅固深信時亦難遭
我今如理宣說如是廣大微妙法門
一切諸佛之所稱讚
<>
咐囑汝等作大守護為諸有情長夜利益
莫令眾生淪墮五趣備受危苦
應勤修行隨順我教當孝於佛常念師恩
當令是法久住不滅當堅持之無得毀失
無得為妄增減經法常念不絕則得道捷
我法如是作如是說如來所行亦應隨行
種修福善求生淨剎

>>>([] 47) 福慧始聞第四十七
爾時世尊而說頌曰
-
 若不往昔修福慧 於此正法不能聞
 已曾供養諸如來 則能歡喜信此事
 惡驕懈怠及邪見 難信如來微妙法
 譬如盲人恆處闇 不能開導於他路
<>
-
 唯曾於佛植眾善 救世之行方能修
 聞已受持及書寫 讀誦讚演并供養
 如是一心求淨方 決定往生極樂國
 假使大火滿三千 乘佛威德悉能超
<>
-
 如來深廣智慧海 唯佛與佛乃能知
 聲聞億劫思佛智 盡其神力莫能測
 如來功德佛自知 唯有世尊能開示
 人身難得佛難值 信慧聞法難中難
<>
-
 若諸有情當作佛 行超普賢登彼岸
 是故博聞諸智士 應信我教如實言
 如是妙法幸聽聞 應常念佛而生喜
 受持廣度生死流 佛說此人真善友

>>>([] 48) 聞經獲益第四十八
爾時世尊說此經法
天人世間有萬二千那由他億眾生
遠離塵垢得法眼淨
二十億眾生得阿那含果
六千八百比丘諸漏已盡心得解脫
四十億菩薩於無上菩提住不退轉
以弘誓功德而自莊嚴
<>
-
二十五億眾生得不退忍
四萬億那由他百千眾生於無上菩提
未曾發意今始初發種諸善根願生極樂
見阿彌陀佛皆當往生彼如來土
各於異方次第成佛同名妙音如來
<>
-
復有十方佛剎若現在生及未來生
見阿彌陀佛者各有八萬俱胝那由他人
得授記法忍成無上菩提
彼諸有情皆是阿彌陀佛宿願因緣
俱得往生極樂世界
<>
爾時三千大千世界六種震動
并現種種希有神變放大光明普照十方
復有諸天於虛空中作妙音樂出隨喜聲
乃至色界諸天悉皆得聞歎未曾有
無量妙花紛紛而降　尊者阿難
彌勒菩薩及諸菩薩聲聞天龍八部
一切大眾聞佛所說皆大歡喜信受奉行

`).setShortTitle('無量壽經');

DOC.printStats();
