SC.volTitle = '菩薩藏會第十二';
SC.volNum = 0;
SC.text = nVolsTOC('菩薩藏會第十二', `
35 : 1:35#開化長者品
36 : 2:36#金毘羅天受記品
   : 3:36,p03#試驗菩薩品
37 : 4:37#如來不思議性品:一
38 :  :38#如來不思議性品:二
39 :  :39#如來不思議性品:三
40 :  :40#如來不思議性品:四
41 : 5:41#無量品
   : 6:41,p06#陀那波羅蜜多品
42 : 7:42#尸波羅蜜品:一
43 :  :43#尸波羅蜜品:二
44 :  :44#尸波羅蜜品:三
===
45 : 8:45#羼底波羅蜜多品
   : 9:45,p09#毘利耶波羅蜜多品:一
46 :  :46#毘利耶波羅蜜多品:二
47 :  :47#毘利耶波羅蜜多品:三
48 :  :48#毘利耶波羅蜜多品:四
49 :10:49#靜慮波羅蜜多品:一
50 :  :50#靜慮波羅蜜多品:二
   :11:50,p11#般若波羅蜜多品:一
51 :  :51#般若波羅蜜多品:二
52 :  :52#般若波羅蜜多品:三
53 :  :53#般若波羅蜜多品:四
54 :12:54#大自在天授記品`, 50);
