SC.volTitle = '菩薩見實會第十六';
SC.volNum = 0;
SC.text = nVolsTOC('菩薩見實會第十六', `
61 : 1:61#序品
62 : 2:62#淨飯王詣佛品
   : 3:62,p03#阿修羅王授記品
63 : 4:63#本事品
   : 5:63,p05#伽樓羅王授記品
   : 6:63,p06#龍女授記品
64 : 7:64#龍王授記品
   : 8:64,p08#鳩槃茶授記品
   : 9:64,p09#乾闥婆授記品
65 :10:65#夜叉授記品
   :11:65,p11#緊那羅授記品
66 :12:66#虛空行天授記品
   :13:66,p13#四天王授記品
   :14:66,p14#三十三天授記品
   :15:66,p15#夜摩天授記品
===
67 :16:67#兜率陀天授記品
   :17:67,p17#化樂天授記品
   :18:67,p18#他化自在天授記品
   :19:67,p19#諸梵天等授記品
68 :20:68#光音天得授記品
   :21:68,p21#遍淨天授記品
69 :22:69#廣果天授記品
70 :23:70#淨居天子讚偈品:一
71 :  :71#淨居天子讚偈品:二
72 :24:72#遮羅迦波利婆羅闍迦外道品
73 :25:73#六界差別品:一
74 :  :74#六界差別品:二
75 :  :75#六界差別品:三
   :26:75,p26#四轉輪王品:一
76 :  :76#四轉輪王品:二`, 50);
