const this_book = new MyBookInfo('三十七道品偈誦', '證嚴法師')
.addContent(`

chapter#三十七道品內容
#<em>四念住</em>　觀身不淨　觀受是苦　觀心無常　觀法無我/
#<em>四正勤</em>　已生惡令斷　未生惡不生/
#　　　　未生善令生　已生善令增/
#<em>四神足</em>　慾如意足　念如意足　進如意足　慧如意足/
#<em>五根</em>　　信根　精進根　念根　定根　慧根/
#<em>五力</em>　　信力　精進力　念力　定力　慧力/
#<em>七覺支</em>　擇法覺支　精進覺支　喜覺支　輕安覺支/
#　　　　捨覺支　定覺支　念覺支/
#<em>八正道</em>　正見　正思惟　正語　正業/
#　　　　正命　正精進　正念　正定

chapter#四念住　四念處

#觀身不淨　人生在世幾十年　何必斤斤來計較/
#　　　　　了解自我入經藏　天堂地獄在瞬間/
#　　　　　九孔常流不淨物　色身猶為載道器/
#　　　　　身懷寶藏不相識　轉污染為清淨身
#觀受是苦　人生嘆苦苦何在　親身入苦去感受/
#　　　　　用心來觀受是苦　才能了解何謂苦/
#　　　　　浮生如夢可成真　苦樂憂欣總是幻/
#　　　　　情與無情同有受　無不在於感受中
#觀心無常　心念所生稱為生　心念執著就是住/
#　　　　　反恩為仇稱為異　善念滅除就是滅/
#　　　　　觀心無常有四相　專一心思來觀察/
#　　　　　了解人性入經藏　生住異滅在其中
#觀法無我　有色無色皆是法　眾生皆為法所困/
#　　　　　六根六塵蔽真心　莫使無明驢亂意/
#　　　　　磨磚焉能做明鏡　自家寶藏善珍攝/
#　　　　　透徹宇宙萬物理　觀法無我唯心造　

chapter#四正勤　四正斷
（精進的重點在於行善去惡）

#四正勤　　恆持剎那四正勤　勤須不偏道乃行/
#　　　　　一勤已生惡念斷　二勤未生惡不生/
#　　　　　三勤未生善令生　四勤已生善令增/
#　　　　　正能破邪力萬鈞　勤可助道展鵬程/
#　　　　　害人之心不能有　知罪肯懺可重生/
#　　　　　行善之念不可無　從來善道在助人/
#　　　　　無緣大慈平等愛　同體大悲智慧心/
#　　　　　紅塵自古苦偏多　四勤拂拭莫染塵

chapter#四神足　四神足
#四神足　　欲念進慧四如意　具足圓滿道葉立/
#　　　　　慾如意足貴發願　願大志堅菩提現/
#　　　　　念如意足在誠正　誠正信實道可證/
#　　　　　進如意足當正勤　拔苦與樂重力行/
#　　　　　慧如意足濟蒼生　慈悲喜捨放長情/
#　　　　　四如意足係一心　心淨一切國土淨/
#　　　　　煩惱一念動三千　三千一念由心牽/
#　　　　　毫釐之差謬千里　體解大道無量義

chapter#五根
（修習佛法的根本所在）
#信根　　　信為道源功德母　長養一切諸善根/
#信力　　　正確信仰根必在　稍有偏差誤前程/
#　　　　　無相之相是實相　無所求心是道心/
#　　　　　信解行證不偏離　成佛之道方可期
#精進根　　我修行是我所得　你用心是你所得/
#精進力　　行茲在茲一念心　把握時間正道行/
#　　　　　凡夫地到佛境界　努力精進不停歇/
#　　　　　有信更要求精進　用心用心再用心
#念根　　　一切舉動一念心　治心守意於未萌/
#念力　　　度人先從救心起　培養一分仁德心/
#　　　　　一念含融三千界　守住最初一念心/
#　　　　　萬法皆處於一念　多向正道念力行
#定根　　　專一心思求正道　心不散亂就是定/
#定力　　　念茲行茲戒定慧　堅固一念初發心/
#　　　　　挑柴運水無非道　行住坐臥皆是禪/
#　　　　　若將佛法生活化　歷歷昭然心目間
#慧根　　　智為分明知解心　世間色法分得清/
#慧力　　　慧光遍徹天與地　平等大愛眾生心/
#　　　　　人人與佛皆平等　佛在自心不遠求/
#　　　　　智慧根源四念處　處處當念福慧修

chapter#五力
（由五根產生的五種力量。偈同五根）

chapter#七覺支　七覺分　七覺意
（修習止觀的注意事項和感受）

#擇法覺支　觀察諸法用智慧　選擇教法來修行/
#　　　　　大乘三法善抉擇　上求佛道化眾生/
#　　　　　學佛要求於內心　分辨是真或是偽/
#　　　　　學習佛陀大悲心　修得七覺正道行
#精進覺支　心若專一無雜念　力行正道不間歇/
#　　　　　名利地位都虛幻　善能覺了修道法/
#　　　　　有情眾生煩惱多　情難斷而愛難捨/
#　　　　　四無量心無間斷　分分秒秒精進中
#喜覺支　　有理有道是真法　心得善法生歡喜/
#　　　　　為佛教而為眾生　終此生而志不忘/
#　　　　　慈濟精神古來有　復古佛陀再世時/
#　　　　　親身力行佛真理　體悟真法得歡喜
#輕安覺支　有形無形都煩惱　起心動念也煩惱/
#　　　　　患得患失來罣礙　千頭萬緒總煩惱/
#　　　　　心專意解除煩惱　心若能定則輕安/
#　　　　　斷除諸見煩惱時　上乘佛界沒煩惱
#捨覺支　　日常生活執著心　捨離所見念著境/
#　　　　　心病還需心藥解　把握現在是道心/
#　　　　　人生猶如走繩索　甘願來做歡喜受/
#　　　　　看得開來想得遠　專心一意向前行
#定覺支　　心住一境不散亂　歡喜自在心能定/
#　　　　　諸禪不生煩惱念　禪在生活日用間/
#　　　　　慈濟世界感恩心　愛為天下眾生生/
#　　　　　全力奉獻無所求　堅定心意道中行
#念覺支　　一念之心動三千　起心動念剎那間/
#　　　　　相入於心想生思　慈濟世界為眾生/
#　　　　　但願眾生得離苦　大愛包容地球村/
#　　　　　把握因緣種福田　修成正果在眼前

chapter#八正道　八聖道　八道諦

#正見　　　心正行正修行人　修行要修無漏道/
#　　　　　心境佛境合為一　真空妙有無上道/
#　　　　　一勤天下無難事　貢高我慢煩惱生/
#　　　　　苦集滅道四諦法　真正寧靜是涅槃
#正思惟　　四諦十二因緣法　三無漏學戒定慧/
#　　　　　用心力行聞思修　累積福緣與慧業/
#　　　　　人在六道中受苦　反覆輪迴無明起/
#　　　　　如是因緣如是果　日常生活正思惟
#正語　　　最易造業因是口　開口動舌都是業/
#　　　　　遠離虛妄不實語　缺角杯子視為圓/
#　　　　　心存道念智慧生　最終目標是修行/
#　　　　　一句戲言種因果　無漏智慧攝口業
#正業　　　修生陽性來學佛　培養耐心與耐性/
#　　　　　心正念正見解正　無漏智慧修攝為/
#　　　　　道業常在正道中　斷除一切邪妄行/
#　　　　　回復清淨的本性　娑婆世界好修行
#正命　　　修學佛法要正命　守本分抱歡喜心/
#　　　　　有緣感觸求真理　回歸本性見十相/
#　　　　　學佛要去妄回想　一理通則萬理通/
#　　　　　出自內心本分事　正命慧命自然現
#正精進　　戒中修定定成慧　專心一意在成佛/
#　　　　　道心不可來間斷　發心力行有恆心/
#　　　　　禪在日常生活中　走入眾生群中去/
#　　　　　一勤天下無難事　守志奉道正精進
#正念　　　多散眾生數息觀　多貪眾生不淨觀/
#　　　　　多瞋眾生慈悲觀　愚癡眾生因緣觀/
#　　　　　多障眾生念佛觀　基礎在於戒定慧/
#　　　　　請轉逆緣為善緣　行茲在茲有正念
#正定　　　攝諸心念正定發　心不移動能靜定/
#　　　　　心靜定則道能通　正信才能夠正定/
#　　　　　萬法本來無所住　正住真空道理中/
#　　　　　動靜皆寂為賢相　正確修行菩薩是

`);
