// 採自 http://www.fodizi.tw/fojing/other/10412.html

new MyBookInfo('般舟三昧經‧菩薩四事', '後漢月支三藏支婁迦讖譯')
.set('paraPrefix', '')
.addContent(
`
chapter#問事品第一

「一法行常當習持常當守，不復隨餘法，諸功德中最第一。何等為第一法行？是三昧名為現在佛悉在前立三昧。」

chapter#行品第二

「持是行法故，致三昧便得三昧，現在諸佛悉在前立。何因致現在諸佛悉在前立三昧？如是，跋陀惒，其有比丘、比丘尼、優婆塞、優婆夷，持戒完具，獨一處止，心念西方阿彌陀佛。今現在隨所聞當念，去是間千億萬佛剎，其國名須摩提，在眾菩薩中央說經，一切常念阿彌陀佛。」

chapter#四事品第三

「菩薩有四法，疾逮得是三昧。何等為四？/
　一者、所信無有能壞者，/
　二者、精進無有能逮者，/
　三者、所入智慧無有能及者，/
　四者、常與善師從事。　是為四。/
/
菩薩復有四事，疾得是三昧。何等為四？/
　一者、不得有世間思想，如指相彈頃三月；/
　二者、不得臥出，三月如指相彈頃。/
　三者、經行不得休息，不得坐三月，除其飯食左右；/
　四者、為人說經，不得望人衣服飲食。　是為四。/
/
菩薩復有四事，疾得是三昧。何等為四？/
　一者、合會人至佛所，/
　二者、合會人使聽經，/
　三者、不嫉妬，/
　四者、教人學佛道。　是為四。/
/
菩薩復有四事，疾得是三昧。何等為四？/
　一者、作佛形像若作畫，用是三昧故；/
　二者、用是三昧故，持好疋素令人寫是三昧；/
　三者、教自貢高人內佛道中；/
　四者、常護佛法。　是為四。」

chapter#譬喻品第四

佛言：「如菩薩持是三昧，受信者便隨行，四面皆擁護無所畏，持禁戒完具為得高明，黠慧深入為他人說之。菩薩當持是三昧分佈語人，展轉相傳，令是三昧久在。」

`);
