const DDJ_TEXT =
`#1
xgP:〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:道可道非常道名可名非常名無名天地之始有名萬物之母故常無欲以觀其妙常有欲以觀其徼此兩者同出而異名同謂之玄玄之又玄衆妙之門
hsg:道可道非常道名可名非常名無名天地之始有名萬物之母故常無欲以觀其妙常有欲以觀其徼此兩者同出而異名同謂之玄玄之又玄衆妙之門
hs:道可道非常(恆？)道名可名非常(恆？)名無名天地之始有名萬物之母故常(恆？)無欲以觀其妙(眇？本意為盲，用作閉眼。作密觀。？)常有欲以觀其徼此兩者同出而異名同謂之玄玄之又玄衆妙(眇？)之門
zmf:道可道非常道名可名非常名無名天地之始有名萬物之母故常無欲以觀其妙常有欲以觀其徼此兩者同出而異名同謂之玄玄之又玄衆妙之門

#2
xgP:〇〇〇〇〇〇〇。〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。
 XG:天下皆知美之為美斯惡已皆知善之為善斯弗善已故有無　相生難易　相成長短　相形高下　相傾音聲　相和前後　相隨是以聖人處無為之事行弗言之教萬物作焉而弗辭生而弗有為而弗恃功成而弗居夫唯弗居是以弗去
hsg:天下皆知美之為美斯惡已皆知善之為善斯弗善已故有無　相生難易　相成長短　相形高下　相傾音聲　相和前後　相隨是以聖人處無為之事行弗言之教萬物作焉而弗辭生而弗有為而弗恃功成而弗居夫唯弗居是以弗去
 hs:天下皆知美之為美斯惡已皆知善之為善斯不善已故有無　相生難易　相成長短　相形高下　相傾音聲　相和前後　相隨是以聖人處無為(zsq：通違)之事行不言之教萬物作焉而不辭生而不有為而不恃功成而不居夫惟不居是以不去(zsq:離開，朽)
zmf:天下皆知美之為美斯惡已皆知善之為善斯不善已故有無之相生難易之相成長短之相形高下之相傾音聲之相和前後之相隨是以聖人處無為之事行不言之教萬物作　而不辭生而不有為而不恃功成而不居夫惟不居是以不去

#3
xgP:〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇。〇〇〇。
 XG:不尚賢使民不爭不貴難得之貨使民不為盜不見可欲使心不亂是以聖人之治　虛其心實其腹弱其志強其骨常使民無知無欲使夫知者不敢為也為無為則無不治
hsg:不尚賢使民不爭不貴難得之貨使民不為盜不見可欲使心不亂是以聖人　治　虛其心實其腹弱其志強其骨常使民無知無欲使夫知者不敢為也為無為則無不治
 hs:不尚賢使民不爭(zsq:使不求名)不貴難得之貨使民不為盜(zsq:使不求利)不見(現)可欲使心不亂(zsq:使不求欲；欲，是基本需要之外所欲)是以聖人之治　虛其心(zsq:心能欲、心能知)實其腹弱其志強其骨常使民無知(zsq:巧偽)無欲使夫知者不敢為也為無為則無不治
zmf:不尚賢使民不爭不貴難得之貨使民不為盜不見可欲使心不亂是以聖人之治也虛其心實其腹弱其志強其骨常使民無知無欲使夫智者不敢為也為無為則無不治

#4
xgP:〇。〇〇〇〇〇。〇。〇〇〇〇。〇〇。〇〇。〇〇。〇〇。〇。〇〇。〇〇〇〇〇〇。〇〇〇。
 XG:道沖而用之或不盈淵兮似萬物之宗挫其銳解其紛和其光同其塵湛兮似若存吾不知　誰之子象帝之先
hsg:道沖而用之或不盈淵兮似萬物之宗挫其銳解其紛和其光同其塵湛兮似若存吾不知　誰之子象帝之先
 hs:道沖(zsq:使之虛)而用之或不盈淵(深水)兮似萬物之宗挫其銳解其紛和其光同其塵湛兮似或存吾不知　誰之子象(zsq:卦象)帝(zsq:太極。一劃開天者，有之始也)之先(先於象者，道也，無也)
zmf:道沖而用之或不盈淵乎似萬物之宗挫其銳解其紛和其光同其塵湛兮似若存吾不知其誰之子象帝之先

#5
xgP:〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:天地不仁以萬物為芻狗聖人不仁以百姓為芻狗天地之間其猶橐籥乎虛而不屈動而愈出多言數窮不如守中
hsg:天地不仁以萬物為芻狗聖人不仁以百姓為芻狗天地之間其猶橐籥乎虛而不屈動而愈出多言數窮不如守中
 hs:天地不仁以萬物為芻狗(zsq:自生自滅)聖人不仁以百姓為芻狗天地之間其猶橐籥(tuó yuè)乎虛而不屈(zsq:窮竭)動而愈出(zsq:道沖)多言數窮(zsq:絕，把話講絕)不如守中(zsq:沖，少私寡欲)
zmf:天地不仁以萬物　蒭狗聖人不仁以百姓為蒭狗天地之間其猶橐籥乎虛而不屈動而愈出多言數窮不如守中

#6
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。
 XG:谷神不死是謂玄牝玄牝之門是謂天地根綿綿若存用之不勤
hsg:谷神不死是謂玄牝玄牝之門是謂天地根綿綿若存用之不勤
 hs:谷神不死是謂玄牝玄牝之門是謂天地根綿綿若存用之不勤(zsq:窮盡)
zmf:谷神不死是謂玄牝玄牝之門是謂天地根緜緜若存用之不勤

#7
xgP:〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇。
 XG:天長地久天地所以能長且久者以其不自生故能長生是以聖人後其身而身先外其身而身存非以其無私邪故能成其私
hsg:天長地久天地所以能長且久者以其不自生故能長生是以聖人後其身而身先外其身而身存非以其無私邪故能成其私
 hs:天長地久天地所以　長且久者以其不自生故能長生是以聖人後其身而身先外其身而身存非以其無私耶故能成其私(人不為（作為）己，天誅地滅；人當做人，狗當做夠，是為人不為己。為之，則成其人，狗而成其狗。)
zmf:天長地久天地所以能長且久者以其不自生故能長生是以聖人後其身而身先外其身而身存非以其無私耶故能成其私

#8
xgP:〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇。
 XG:上善若水水善利萬物而不爭處衆人之所惡故幾於道　居善地心善淵與善仁言善信政善治事善能動善時夫唯不爭故無尤
hsg:上善若水水善利萬物而不爭處衆人之所惡故幾於道　居善地心善淵與善仁言善信政善治事善能動善時夫唯不爭故無尤
 hs:上善若水水善利萬物而不爭處衆人之所惡故幾於道矣居善地心善淵與(zsq:給予)善仁言善信政善治事善能動善時夫惟不爭故無尤(怨尤)
zmf:上善若水水善利萬物而不爭處衆人之所惡故幾於道　居善地心善淵與善仁言善信政善治事善能動善時夫惟不爭故無尤

#9
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。
 XG:持而盈之不如其已揣而銳之不可長保金玉滿堂莫之能守富貴而驕自遺其咎功成名遂身退天之道也載
hsg:持而盈之不如其已揣而銳之不可長保金玉滿堂莫之能守富貴而驕自遺其咎功成名遂身退天之道
 hs:持而盈之不如其已(停止)揣(捶擊)而銳之不可長保金玉滿堂莫之能守富貴而驕自遺其咎功成名遂身退天之道
zmf:持而盈之不如其已揣而銳之不可長保金玉滿堂莫之能守富貴而驕自遺其咎功成名遂身退天之道
zsq:持而盈之不如其已揣而銳之不可長保金玉滿堂莫之能守富貴而驕自遺其咎功成名遂身退天之道也載

#10
xgP:〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:　營魄抱一能無離乎專氣致柔能如嬰兒乎滌除玄覽能無疵乎愛民治國能無為　乎天門開闔能無雌乎明白四達能無知乎生之畜之生而不有為而不恃長而不宰是謂玄德
hsg:載營魄抱一能無離　專氣致柔能如嬰兒　滌除玄覽能無疵　愛民治國能無　知　天門開闔能無雌　明白四達能無知　生之畜之生而不有為而不恃長而不宰是謂玄德
 hs:載營(zsq:靈魂)魄(zsq:身體)抱一能無離乎專氣致柔能如嬰兒乎滌除玄覽能無疵乎愛民治國能無為　乎天門開闔能無雌乎明白四達能無知乎生之畜之生而不有為而不恃長而不宰是謂玄德
zmf:載營魄抱一能無離乎專氣致柔能　嬰兒乎滌除玄覽能無疵乎愛民治國能無為知乎天門開闔能無雌乎明白四達能無知乎生之畜之生而不有為而不恃長而不宰是謂玄德
zsq:　營魄抱一能無離乎專氣致柔能如嬰兒乎滌除玄覽能如疵乎愛民治國能無為　乎天門開闔能為雌乎明白四達能無知乎生之畜之生而不有為而不恃長而不宰是謂玄德

#11
xgP:〇〇〇〇〇。〇〇。〇〇〇。〇〇〇〇。〇〇。〇〇〇。〇〇〇〇〇。〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。
 XG:三十輻共一轂當其無有車之用埏埴以為器當其無有器之用鑿戶牖以為室當其無有室之用故有之以為利無之以為用
hsg:三十輻共一轂當其無有車之用埏埴以為器當其無有器之用鑿戶牖以為室當其無有室之用故有之以為利無之以為用
 hs:三十輻共一轂當其無有車之用埏(shān)埴以為器當其無有器之用鑿戶牖以為室當其無有室之用故有之以為利無之以為用
zmf:三十輻共一轂當其無有車之用埏埴以為器當其無有器之用鑿戶牖以為室當其無有室之用故有之以為利無之以為用

#12
xgP:〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。
 XG:五色令人目盲五音令人耳聾五味令人口爽馳騁田獵令人心發狂難得之貨令人行妨是以聖人為腹不為目故去彼取此
hsg:五色令人目盲五音令人耳聾五味令人口爽馳騁田獵令人心發狂難得之貨令人行妨是以聖人為腹不為目故去彼取此
 hs:五色令人目盲五音令人耳聾五味令人口爽馳騁田獵令人心發狂難得之貨令人行妨是以聖人為腹不為目故去彼取此
zmf:五色令人目盲五音令人耳聾五味令人口爽馳騁田獵令人心發狂難得之貨令人行妨是以聖人為腹不為目故去彼取此

#13
xgP:〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。
 XG:寵辱若驚貴大患若身何謂寵辱若驚寵為上辱為下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者為吾有身及吾無身吾有何患故貴以身為天下則可寄於天下愛以身為天下乃可　託於天下
hsg:寵辱若驚貴大患若身何謂寵辱　　　　　辱為下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者為吾有身及吾無身吾有何患故貴以身為天下則可寄於天下愛以身為天下乃可以託於天下
 hs:寵辱若驚貴大患若身何謂寵辱若驚寵　　　為下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者為吾有身及吾無身吾有何患故貴以身為天下則可寄於天下愛以身為天下乃可　託於天下
zmf:寵辱若驚貴大患若身何謂寵辱若驚寵　　　為下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者為吾有身及吾無身吾有何患故貴以身為天下若可寄　天下愛以身為天下若可　　　天下
zsq:寵辱若驚貴大患若身何謂寵辱若驚寵　　　為下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者為吾有身及吾無身吾有何患故貴以身為天下則可寄於天下愛以身為天下若可　託　天下

#14
xgP:〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。
 XG:視之不見名曰夷聽之不聞名曰希搏之不得名曰微此三者不可致詰故混而為一其上不皦其下不昧繩繩　不可名復歸於無物是謂　無狀之狀無象之象是謂忽恍迎之不見其首隨之不見其後執古之道以御今之有能知古始是謂道紀
hsg:視之不見名曰夷聽之不聞名曰希搏之不得名曰微此三者不可致詰故混而為一其上不皦其下不昧繩繩　不可名復歸於無物是謂　無狀之狀無象之象是謂忽恍迎之不見其首隨之不見其後執古之道以御今之有以知古始是謂道紀
 hs:視之不見名曰夷聽之不聞名曰希搏之不得名曰微此三者不可致詰(問)故混而為一其上不皦(亮)其下不昧(暗)繩繩(mǐn mǐn形容接连不断)兮不可名復歸於無物是謂為無狀之狀無象之象是謂惚恍迎之不見其首隨之不見其後執古之道以御今之有能知古始是謂道紀
zmf:視之不見名曰夷聽之不聞名曰希搏之不得名曰微此三者不可致詰故混而為一其上不皦其下不昧繩繩　不可名復歸於無物是謂　無狀之狀無物之象是謂忽恍迎之不見其首隨之不見其後執古之道以御今之有能知古始是謂道紀

#15
xgP:〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇。〇〇〇。〇。〇〇〇。〇。〇〇。〇。〇〇〇〇〇。〇。〇〇。〇。〇〇。〇。〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇〇〇。
 XG:古之善為士者微妙玄通深不可識夫唯不可識故強為之容與兮若冬涉川猶兮若畏四鄰儼兮其若客渙兮　若冰之將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以　靜之徐清孰能安以久動之徐生保此道者不欲盈夫唯不盈故能蔽不新成
hsg:古之善為士者微妙玄通深不可識夫唯不可識故強為之容與兮若冬涉川猶兮若畏四鄰儼兮　若客渙兮　若冰之將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以　靜之徐清孰能安以久　之徐生保此道者不欲盈夫唯不盈故能蔽不新成
 hs:古之善為士者微妙玄通深不可識夫惟不可識故強為之容豫　若冬涉川猶　若畏四鄰儼　　若客渙　　若冰　將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以　靜之徐清孰能安以久　之徐生保此道者不欲盈夫惟不盈故能敝不新成
zmf:古之善為士者微妙玄通深不可識夫惟不可識故強為之容豫兮若冬涉川猶兮若畏四鄰儼兮其若客渙兮　若冰　將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以　靜之徐清孰能安以　動之徐生保此道者不欲盈夫惟不盈故能蔽不新成
zsq:古之善為道者微妙玄通深不可識夫惟不可識故強為之容豫　若冬涉川猶兮若畏四鄰儼兮其若客渙兮其若冰　將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以　靜之徐清孰能安以　動之徐生保此道者不欲盈夫惟不盈故能敝不新成

#16
xgP:〇〇。〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇。
 XG:至虛極守靜篤萬物並作吾以觀其復夫物芸芸各復歸其根歸根曰靜靜曰　　復命復命曰常知常曰明不知常萎作凶知常容容乃公公乃王王乃天天乃道道乃久沒身不殆
hsg:至虛極守靜篤萬物並作吾以觀其復夫物芸芸各復歸其根歸根曰靜靜曰是謂復命復命曰常知常曰明不知常萎作凶知常容容乃公公乃王王乃天天乃道道乃久沒身不殆
 hs:致虛極守靜篤萬物並作吾以觀其復夫物芸芸各　歸其根歸根曰靜靜曰　　復命復命曰常知常曰明不知常妄作凶知常容容乃公(公正)公乃王王乃天天乃道道乃久沒身不殆
zmf:致虛極守靜篤萬物並作吾以觀其復夫物芸芸各　歸其根歸根曰靜靜曰　謂復命復命曰常知常曰明不知常妄作凶知常容容乃公公乃王王乃天天乃道道乃久沒身不殆
zsq:致虛極守靜篤萬物並作吾以觀其復夫物芸芸各　歸其根歸根曰靜靜曰　　復命復命曰常知常曰明不知常妄作凶知常容容乃公公乃全全乃天天乃道道乃久沒身不殆

#17
xgP:〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇。〇〇。〇〇〇。〇〇〇〇〇〇。
 XG:太上下知有之其次親之譽之其次畏之其次侮之故信不足焉有不信焉猶兮其貴言功成事遂百姓皆謂我自然
hsg:太上下知有之其次親之譽之其次畏之其次侮之　信不足焉　　　　猶兮其貴言功成事遂百姓皆謂我自然
 hs:太上下知有之其次親之譽之其次畏之其次侮之故信不足焉有不信　猶兮其貴言功成事遂百姓皆曰我自然
zmf:太上下知有之其次親之譽之其次畏之　　侮之故信不足焉有不信　猶兮其貴言功成事遂百姓皆謂我自然

#18
xgP:〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇。〇〇〇。〇〇。
 XG:大道廢有仁義智慧出有大偽六親不和有孝慈國家昏亂有忠臣
hsg:大道廢有仁義智慧出有大偽六親不和有孝慈國家昏亂有忠臣
 hs:大道廢有仁義智慧出有大偽六親不和有孝慈國家昏亂有忠臣
zmf:大道廢有仁義智惠出有大偽六親不和有孝慈國家昏亂有忠臣

#19
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄利盜賊無有此三者以為文不足故令有所屬見素抱樸少思寡欲絕學無憂
hsg:絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄利盜賊無有此三者以為文不足故令有所屬見素抱樸少思寡欲
 hs:絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄智盜賊無有此三者以為文不足故令有所屬見素(純淨本質)抱樸少思寡欲
zmf:絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄利盜賊無有此三者以為文不足故令有所屬見素抱樸少私寡欲
zsq:絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄利盜賊無有此三者以為文不足故令有所屬見素抱樸少思寡欲

#20
xgP:〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。
 XG:　　　　唯之與阿相去幾何善之與惡相去何若人之所畏不可不畏荒兮其未央哉衆人熙熙如享太牢如春登臺我獨怕兮其未兆如嬰兒之未孩乗乗兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨若昏俗人察察我獨悶悶澹兮其若海漂兮若無所止衆人皆有以而我獨頑似鄙我獨異於人而貴　食　母
hsg:絕學無憂唯之與阿相去幾何善之與惡相去何若人之所畏不可不畏荒兮其未央哉衆人熙熙如享太牢如春登臺我獨怕兮其未兆如嬰兒之未孩乗乗兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨若昏俗人察察我獨悶悶忽兮　若海漂兮若無所止衆人皆有以而我獨頑似鄙我獨異於人而貴　食　母
 hs:絕學無憂唯之與阿相去幾何善之與惡相去何若人之所畏不可不畏荒(廣大)兮其未央哉衆人熙熙如享太牢如登春臺我獨泊(淡泊恬靜)兮其未兆如嬰兒之未孩乘乘兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨昏昏俗人察察我獨悶悶澹(dān)兮其若海飂(liáo，風的聲音)兮似無所止(超出了任何慾望)衆人皆有以(有用)　我獨頑且鄙我獨異於人而貴求食於母
zmf:絕學無憂惟之與阿相去幾何善之與惡相去何若人之所畏不可不畏荒兮其未央哉衆人熙熙如享太牢如登春臺我獨泊兮其未兆若嬰兒之未孩乗乗兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨若昏俗人察察我獨悶悶澹兮其若海飂兮若無　止衆人皆有以而我獨頑似鄙我獨異於人而貴求食於母
zsq:絕學無憂唯之與阿相去幾何善之與惡相去何若人之所畏不可不畏荒兮其未央哉衆人熙熙如享太牢如登春臺我獨泊兮其未兆如嬰兒之未孩儡儡(lěi lěi，羸弱)兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨昏昏俗人察察我獨悶悶澹兮其若海飂(liáo，風的聲音)兮似無所止衆人皆有以　我獨頑且鄙我獨異於人而貴　食　母

#21
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇。
 XG:孔德之容惟道是從道之為物惟恍惟忽忽兮恍兮其中有像恍兮忽兮其中有物窈兮冥兮其中有精其精甚真其中有信自古及今其名不去以閱衆甫吾何以知衆甫之狀哉以此
hsg:孔德之容惟道是從道之為物惟恍惟忽忽兮恍　其中有像恍兮忽兮其中有物窈兮冥兮其中有精其精甚真其中有信自古及今其名不去以閱衆甫吾何以知衆甫之然哉以此
 hs:孔德(大德，玄德)之容惟道是從道之為物惟恍惟惚惚兮恍　其中有象恍兮惚　其中有物窈(微不可見)兮冥(深不可測)　其中有精其精甚真其中有信自古及今其名不去以閱衆甫吾何以知衆甫之然哉以此
zmf:孔德之容惟道是從道之為物惟恍惟忽忽兮恍　其中有象恍兮忽　其中有物窈兮冥兮其中有精其精甚真其中有信自古及今其名不去以閱衆甫吾何以知衆甫之然哉以此
zsq:孔德之容惟道是從道之為物惟恍惟惚惚兮恍兮其中有象恍兮惚兮其中有物窈兮冥兮其中有精其精甚真其中有信自今及古其名不去以閱衆甫吾何以知衆甫之狀哉以此

#22
xgP:〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇〇〇〇〇。〇〇。〇。〇〇。〇。〇〇。〇〇。〇〇。〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇。
 XG:曲則全枉則直窪則盈弊則新少則得多則惑是以聖人抱一為天下式不自見故明不自是故彰不自伐故有功不自矜故長夫唯不爭故天下莫能與之爭古之所謂曲則全者豈虛言哉誠全而歸之
hsg:曲則全枉則直窪則盈弊則新少則得多則惑是以聖人抱一為天下式不自見故明不自是故彰不自伐故有功不自矜故長夫唯不爭故天下莫能與之爭古之所謂曲則全者豈虛言哉誠全而歸之
 hs:曲則全(周到全面)枉(不直)則直窪則盈敝則新少則得多則惑是以聖人抱一為天下式不自見故明不自是故彰不自伐(自誇)故有功不自矜(自負)故長夫惟不爭故天下篡能與之爭古之所謂曲則全者豈虛言哉誠全而歸之
zmf:曲則全枉則直窪則盈敝則新少則得多則惑是以聖人抱一為天下式不自見故明不自是故彰不自伐故有功不自矜故長夫惟不爭故天下莫能與之爭古之所謂曲則全者豈虛言哉誠全而歸之
zsq:曲則全枉則直窪則盈敝則新少則得多則惑是以聖人抱一為天下式不自見故明不自是故彰不自伐故有功不自矜故長夫惟不爭故天下莫能與之爭古之所謂曲則全者豈虛言哉誠全而歸之

#23
xgP:〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。
 XG:希言自然飄風不終朝驟雨不終日孰為此者天地天地尚不能　久而況於人乎故從事於道者　　同於道德者同於德失者同於失同於道者道亦樂得之同於德者德亦樂得之同於失者失亦樂得之信不足焉有不信焉
hsg:希言自然飄風不終朝驟雨不終日孰為此者天地天地尚不能　久而況於人乎故從事於道者道者同於道德者同於德失者同於失同於道者道亦樂得之同於德者德亦樂得之同於失者失亦樂得之信不足焉有不信焉
 hs:希(稀少)言自然(言自然：自然之言、天語)飄風不終朝驟雨不終日孰為此者天地天地尚不能　　而況於人乎故從事於道者道者同於道德者同於德失者同於失同於道者道亦樂得之同於德者德亦樂得之同於失者失亦樂得之信不足　有不信
zmf:希言自然飄風不終朝驟雨不終日孰為此者天地天地尚不能　久而況於人乎故從事於道者　　同於道德者同於德失者同於失同於道者道亦　得之同於德者德亦　得之同於失者失亦　得之信不足焉有不信焉
zsq:希言自然飄風不終朝驟雨不終日孰為此者天地天地尚不能長久而況於人乎故從事於道者道者同於道德者同於德失者同於失同於道者道亦樂得之同於德者德亦樂得之同於失者失亦樂得之信不足焉有不信焉

#24
xgP:〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇。
 XG:跂者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其在道也曰餘食贅行物或惡之故有道者不處
hsg:跂者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其於道也曰餘食贅行物或惡之故有道者不處也
 hs:跂者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其在道也曰餘食贅行(行作形)物或惡之故有道者不處也
zmf:跂者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其於道也曰餘食贅行物或惡之故有道者不處也
zsq:企(踮起腳)者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其在道也曰餘食贅行物或惡之故有道者不處也

#25
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇。〇〇。〇〇。〇〇〇。
 XG:有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以為天下母吾不知其名　字之曰道強為之名曰大大曰逝逝曰遠遠曰反故道大天大地大　王亦大域中有四大而王居其一焉人法地地法天天法道道法自然
hsg:有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以為天下母吾不知其名　字之曰道強為之名曰大大曰逝逝曰遠遠曰反故道大天大地大　王亦大域中有四大而王居其一焉人法地地法天天法道道法自然
 hs:有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以為天下母吾不知其名　字之曰道強為之名曰大大曰逝(行動)逝曰遠遠曰反故道大天大地大　王亦大域中有四大而王處　一焉人法地地法天天法道道法自然
zmf:有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以為天下母吾不知其名　字之曰道強為之名曰大大曰逝逝曰遠遠曰返故道大天大地大人王亦大域中有四大而王居　一焉人法地地法天天法道道法自然
zsq:有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以為天下母吾不知其名強字之曰道強為之名曰大大曰逝逝曰遠遠曰反故道大天大地大　王也大域中有四大而王居其一焉人法地地法天天法道道法自然

#26
xgP:〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。
 XG:重為輕根靜為躁君是以聖人終日行不離輜重雖有榮觀燕處超然奈何萬乗之主而以身輕天下輕則失臣躁則失君
hsg:重為輕根靜為躁君是以聖人終日行不離輜重雖有榮觀燕處超然奈何萬乗之主而以身輕天下輕則失臣躁則失君
 hs:重為輕根靜為躁君(能約束的力量)是以聖人終日行不離輜重(德行、道)雖有榮觀燕處超然奈何萬乘之主而以身輕天下輕則失根躁則失君
zmf:重為輕根靜為躁君是以聖人終日行不離輜重雖有榮觀燕處超然奈何萬乗之主而以身輕天下輕則失臣躁則失君
zsq:重為輕根靜為躁君是以君子終日行不離輜重雖有榮觀燕處超然奈何萬乘之主而以身輕天下輕則失根躁則失君

#27
xgP:〇。〇〇。〇。〇〇。〇。〇〇〇。〇。〇〇〇〇〇〇。〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:善行無轍跡善言無瑕謫善數不用籌策善閉無關楗而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲明故善人者不善人之師不善人者善人之資不貴其師不愛其資雖智大迷是謂要妙
hsg:善行無轍跡善言無瑕謫善計不用籌策善閉無關楗而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲明故善人者不善人之師不善人者善人之資不貴其師不愛其資雖智大迷是謂要妙
 hs:善(善於)行無轍跡善言無瑕謫善計不用籌策善閉無關鍵而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲明故善人者不善人之師不善人者善人之資不貴其師不愛其資雖智大迷是謂要妙
zmf:善行無轍跡善言無瑕讁善計不用籌策善閉無關楗而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲明故善人者不善人之師不善人　善人之資不貴其師不愛其資雖智大迷是謂要妙
zsq:善行無轍跡善言無瑕謫善數不用籌策善閉無關楗而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲(承襲)明(常道)故善人者不善人之師不善人者善人之資不貴其師不愛其資雖智大迷是謂要妙

#28
xgP:〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。
 XG:知其雄守其雌為天下谿為天下谿常德不離復歸於嬰兒知其白守其黑為天下式為天下式常德不忒復歸於無極知其榮守其辱為天下谷為天下谷常德乃足復歸於樸樸散則為器聖人用之則為官長故大制不割
hsg:知其雄守其雌為天下谿為天下谿常德不離復歸於嬰兒知其白守其黑為天下式為天下式常德不忒復歸於無極知其榮守其辱為天下谷為天下谷常德乃足復歸於樸樸散則為器聖人用之則為官長故大制不割
 hs:知其雄守其雌為天下谿為天下谿常德不離復歸於嬰兒知其白守其黑為天下式為天下式常德不忒(差錯)復歸於無極知其榮守其辱為天下谷為天下谷常德乃足復歸於樸樸散則為器聖人用之則為官長故大制不割(治標不治本)
zmf:知其雄守其雌為天下谿為天下谿常德不離復歸於嬰兒知其白守其黑為天下式為天下式常德不忒復歸於無極知其榮守其辱為天下谷為天下谷常德乃足復歸於樸樸散則為器聖人用之則為官長故大制不割

#29
xgP:〇〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇。〇。
 XG:將欲取天下而為之　吾見其不得已天下神器不可為也為者敗之執者失之故物或行或隨或歔或吹或強或羸或載或隳是以聖人去甚去奢去泰
hsg:將欲取天下而為之　吾見其不得已天下神器不可為也為者敗之執者失之故物或行或隨或呴或吹或強或羸或載或隳是以聖人去甚去奢去泰
 hs:將欲取天下而為之　吾見其不得已天下神(無形無方)器不可為也為者敗之執者失之故物或行或隨或呴或吹或強或羸或載(安)或隳(huī，危)是以聖人去甚去奢去泰
zmf:將欲取天下而為之者吾見其不得已天下神器不可為也為者敗之執者失之故物或行或隨或歔或吹或強或羸或載或隳是以聖人去甚去奢去泰
zsq:將欲取天下而為之　吾見其不得已天下神器不可為也為者敗之執者失之故物或行或隨或歔或吹或強或羸或載或隳是以聖人去甚去奢去泰

#30
xgP:〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:以道佐人主者不以兵強天下其事好還師之所處荊棘生焉大軍之後必有凶年善者果而已不敢以取強　果而勿矜果而勿伐果而勿驕果而不得已果而勿強物壯則老是謂不道不道早已
hsg:以道佐人主者不以兵強天下其事好還師之所處荊棘生焉大軍之後必有凶年善者果而已不敢以取強　果而勿矜果而勿伐果而勿驕果而不得已果而勿強物壯則老是謂不道不道早已
 hs:以道佐人主者不以兵強天下其事好　師之所處荊棘生焉大軍之後必有凶年善者果而已不敢以取強　果而勿矜果而勿伐果而勿驕果而不得已果而勿強炒壯則老是謂不道不道早已
zmf:以道佐人主者不以兵強天下其事好還師之所處荊棘生焉大軍之後必有凶年善者果而已不敢以取強焉果而勿矜果而勿伐果而勿驕果而不得已果而勿強物壯則老是謂不道不道早已
zsq:以道佐人主者不以兵強天下其事好還師之所處荊棘生焉大軍之後必有凶年善有果而已不敢以取強　果而勿矜果而勿伐果而勿驕果而不得已果而勿強炒壯則老是謂不道不道早已

#31
xgP:〇〇〇。〇〇〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇。〇〇〇〇〇。
 XG:夫佳兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬惔為上勝而不美而美之者是樂殺人夫樂殺人者則不可以得志於天下矣吉事尚左凶事尚右　　偏將軍居左上將軍居右言居上勢則以喪禮處之殺人之衆以悲哀泣之戰勝　以喪禮處之
hsg:夫佳兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬惔為上勝而不美而美之者是樂殺人夫樂殺人者則不可以得志於天下矣吉事尚左凶事尚右　　偏將軍居左上將軍居右言　　　　以喪禮處之殺人之衆以悲哀泣之戰勝　以喪禮處之
 hs:夫佳兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬淡為上勝而不美而美之者是樂殺人夫樂殺人者　不可以得志於天下矣吉事尚左凶事尚右　　偏將軍居左上將軍居右言居上勢則以喪禮處之殺人衆多以悲哀泣之戰勝　以喪禮處之
zmf:夫佳兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬惔為上勝而不美而美之者是樂殺人夫樂殺人者則不可　得志於天下矣吉事尚左凶事尚右是以偏將軍處左上將軍處右言居上勢則以喪禮處之殺人衆則以悲哀泣之戰勝則以喪禮處之
zsq:夫　兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬淡為上勝而不美而美之者是樂殺人夫樂殺人者　不可　得志於天下矣吉事尚左凶事尚右　　偏將軍居左上將軍居右言居上勢言以喪禮處之殺人衆多以悲哀泣之戰勝　以喪禮處之

#32
xgP:〇〇〇。〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。
 XG:道常無名樸雖小天下莫能臣侯王若能守之萬物將自賓天地相合以降甘露民莫之令而自均始制有名名亦既有天亦將知止知止所以不殆譬道之在天下猶川谷之於江海
hsg:道常無名樸雖小天下不敢臣侯王若能守之萬物將自賓天地相合以降甘露民莫之令而自均始制有名名亦既有天亦將知止知止所以不殆譬道之在天下猶川谷之於江海
 hs:道常(道常：常道)無名樸雖小天下不敢臣侯王若能守　萬物將自賓天地相合以降甘露民莫之令而自均始制有名名亦既有夫亦將知止知止所以不殆(避免凶險)譬道之在天下猶川谷之於江海也
zmf:道常無名樸雖小天下莫能臣侯王若能守　萬物將自賓天地相合以降甘露人莫之令而自均始制有名名亦既有夫亦將知止知止所以不殆譬道之在天下猶川谷之與江海也
zsq:道常無名樸雖小天下莫能臣侯王若能守之萬物將自賓天地相合以降甘露民莫之令而自均始制有名名亦既有夫亦將知止知止所以不殆譬道之在天下猶川谷之於江海也

#33
xgP:〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。
 XG:知人者智自知者明勝人者有力自勝者強知足者富強行者有志不失其所者久死而不亡者壽
hsg:知人者智自知者明勝人者有力自勝者強知足者富強行者有志不失其所者久死而不亡者壽
 hs:知人者智自知者明勝人者有力自勝者強(適當)知足者富強行者有志(意志力)不失其所者久死而不亡者壽(全人類的壽)
zmf:知人者智自知者明勝人者有力自勝者強知足者富強行者有志不失其所者久死而不亡者壽

#34
xgP:〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇。〇〇〇〇。
 XG:大道汎兮其可左右萬物恃之以生而不辭功成不名有衣養萬物而不為主　常無欲可名於小　萬物歸焉而不為主可名為大　是以聖人　　　　　　　終不　為大故能成其大
hsg:大道氾兮其可左右萬物恃之以生而不辭功成不名有愛養萬物而不為主　常無欲可名於小　萬物歸焉而不為主可名為大　是以聖人　　　　　　　終不　為大故能成其大
 hs:大道氾兮其可左右萬物恃之以生而不辭功成不名有愛養萬物而不為主　常無欲可名於小　萬物歸焉而不為主可名為大　是以聖人　　　　　　　終不　為大故能成其大
zmf:大道汎兮其可左右萬物恃之而生而不辭功成不居　衣被萬物而不為主故常無欲可名於小矣萬物歸焉而不為主可名於大矣是以聖人能成其大也以其　不自為大故能成其大
zsq:大道泛兮其可左右萬物恃之以生而不辭功成不名有衣養萬物而不為主　常無欲可名於小　萬物歸焉而不為主可名為大　是以聖人　　　　　　　終不自為大故能成其大

#35
xgP:〇〇。〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。
 XG:執大象天下往往而不害安平太樂與餌過客止道之出口淡乎其無味視之不足見聽之不足聞用之不可既
hsg:執大象天下往往而不害安平太樂與餌過客止道之出口淡乎其無味視之不足見聽之不足聞用之不可既
 hs:執大象(生生不息之大道)天下往往而不害安平泰樂與餌(美食)過客止道之出口淡乎其無味視之不足見聽之不足聞用之不可既(窮盡)
zmf:執大象天下往往而不害安平太樂與餌過客止道之出口淡乎其無味視之不足見聽之不足聞用之不足既
zsq:執大象天下往往而不害安平太樂與餌過客止道之出口淡乎其無味視之不足見聽之不足聞用之不足既

#36
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。
 XG:將欲歙之必固張之將欲弱之必固強之將欲廢之必固興之將欲奪之必固與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人
hsg:將欲噏之必固張之將欲弱之必固強之將欲廢之必固興之將欲奪之必固與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人
 hs:將欲翕之必固張之將欲弱之必固強之將欲廢之必固興之將欲奪之必固與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人
zmf:將欲歙之必固張之將欲弱之必固強之將欲廢之必固興之將欲奪之必固與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人
zsq:將欲歙(收縮)之必故張之將欲弱之必故強之將欲廢之必故舉之將欲奪之必故與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人

#37
xgP:〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇。
 XG:道常無為而無不為侯王若能守萬物將自化化而欲作吾將鎮之以無名之樸無名之樸　亦將不欲不欲以靜天下將自　定
hsg:道常無為而無不為侯王若能守萬物將自化化而欲作吾將鎮之以無名之樸無名之樸　亦將不欲不欲以靜天下將自　定
 hs:道常無為而無不為侯王若能守萬物將自化化而欲作吾將鎮之以無名之樸無名之樸　亦將不欲不欲以靜天下將自正
zmf:道常無為而無不為侯王若能守萬物將自化化而欲作吾將鎮之以無名之樸無名之樸夫亦將不欲不欲以靜天下將自正
zsq:道常無為而無不為侯王若能守萬物將自化化而欲作吾將鎮之以無名之樸無名之樸夫亦將不欲不欲以靜天下將自正定

#38
xgP:〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇。〇〇〇〇〇〇〇〇。〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇〇〇。
 XG:上德不德是以有德下德不失德是以無德上德無為而無以為下德為之而有以為上仁為之而無以為上義為之而有以為上禮為之而莫之應則攘臂而仍之故失道而後德失德而後仁失仁而後義失義而後禮夫禮者忠信之薄而亂之首　前識者道之華而愚之始　是以大丈夫處其厚不居其薄處其實不居其華故去彼取此
hsg:上德不德是以有德下德不失德是以無德上德無為而無以為下德為之而有以為上仁為之而無以為上義為之而有以為上禮為之而莫之應則攘臂而仍之故失道而後德失德而後仁失仁而後義失義而後禮夫禮者忠信之薄而亂之首　前識者道之華而愚之始　是以大丈夫處其厚不居其薄處其實不居其華故去彼取此
 hs:上德不德是以有德下德不失德是以無德上德無為而無以為下德為之而有以為上仁為之而無以為上義為之而有以為上禮為之而莫之應則攘臂而仍之故失道而後德失德而後仁失仁而後義失義而後禮夫禮者忠信之薄而亂之首也前識者道之華而愚之始　是以大丈夫處其厚不居其薄處其實不居其華故去彼取此
zmf:上德不德是以有德下德不失德是以無德上德無為而無以為下德為之而有以為上仁為之而無以為上義為之而有以為上禮為之而莫之應則攘臂而仍之故失道而後德失德而後仁失仁而後義失義而後禮夫禮者忠信之薄而亂之首也前識者道之華而愚之始也是以大丈夫處其厚不處其薄處其實不居其華故去彼取此

#39
xgP:〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇。〇〇〇。〇〇。〇〇〇。〇〇。〇〇〇〇。〇〇。〇〇〇〇〇〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇〇〇〇。〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。
 XG:昔之得一者天得一以清地得一以寧神得一以靈谷得一以盈萬物得一以生侯王得一以為天下　正其致之　也天無以清將恐裂地無以寧將恐發神無以靈將恐歇谷無以盈將恐竭萬物無以生將恐滅侯王無以　　　貴高將恐蹶故貴以賤為本高以下為基是以侯王自謂孤寡不穀此非以賤為本耶非乎故至　譽無譽不欲碌碌如玉落落如石
hsg:昔之得一者天得一以清地得一以寧神得一以靈谷得一以盈萬物得一以生侯王得一以為天下為正其致之　　天無以清將恐裂地無以寧將恐發神無以靈將恐歇谷無以盈將恐竭萬物無以生將恐滅侯王無以　　　貴高將恐蹶故貴以賤為本高以下為基是以侯王自謂孤寡不穀此非以賤為本耶非乎故致數車無車不欲碌碌如玉落落如石
 hs:昔之得一者天得一以清地得一以寧神得一以靈谷得一以盈萬物得一以生侯王得一以為天下　正其致之一也天無以清將恐裂地無以寧將恐發神無以靈將恐歇谷無以盈將恐竭萬物無以生將恐滅侯王無以　正而貴高將恐蹶故貴以賤為本高以下為基是以侯王自謂孤寡不穀此其以賤為本耶非乎故致數車無車不欲碌碌如玉落落如石
zmf:昔之得一者天得一以清地得一以寧神得一以靈谷得一以盈萬物得一以生侯王得一以為天下　貞其致之　也天無以清將恐裂地無以寧將恐廢神無以靈將恐歇谷無以盈將恐竭萬物無以生將恐滅侯王無以為貞而貴高將恐蹶故貴以賤為本高以下為基是以侯王自謂孤寡不榖此其以賤為本耶非乎故至數譽無譽不欲琭琭如玉落落如石

#40
xgP:〇。〇〇。〇。〇〇。〇〇〇〇〇〇。〇〇〇。
 XG:反者道之動弱者道之用天下之物生於有有生於無
hsg:反者道之動弱者道之用天下之物生於有有生於無
 hs:反者道之動弱者道之用天下之物生於有有生於無
zmf:反者道之動弱者道之用天下萬之生於有有生於無

#41
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇。
 XG:上士聞道勤而行之中士聞道若存若亡下士聞道大笑之不笑不足以為道故建言有之明道若昧進道若退夷道若類上德若谷大白若辱廣德若不足建德若偷質真若渝大方無隅大器晚成大音希聲大象無形道隱無名夫唯道善貸且成
hsg:上士聞道勤而行之中士聞道若存若亡下士聞道大笑之不笑不足以為道故建言有之明道若昧進道若退夷道若類上德若谷大白若辱廣德若不足建德若偷質真若渝大方無隅大器晚成大音希聲大象無形道隱無名夫唯道善貸且成
 hs:上士聞道勤而行之中士聞道若存若亡下士聞道大笑之不笑不足以為道故建言有之明道若昧進道若退夷道若類上德若谷大白若辱廣德若不足建德若偷質貞若渝大方無隅大器晚成大音希聲大象無形道隱無名夫惟道善貸且成
zmf:上士聞道勤而行之中士聞道若存若亡下士聞道大笑之不笑不足以為道故建言有之明道若昧進道若退夷道若類上德若谷大白若辱廣德若不足建德若偷質真若渝大方無隅大器晚成大音希聲大象無形道隱無名夫惟道善貸且成

#42
xgP:〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。
 XG:道生一一生二二生三三生萬物萬物負陰而抱陽沖氣以為和人之所惡唯孤寡不穀而王公以為稱故物或損之而益或益之而損人之所教我亦教之強梁者不得其死吾將以為教父
hsg:道生一一生二二生三三生萬物萬物負陰而抱陽沖氣以為和人之所惡唯孤寡不穀而王公以為稱故物或損之而益或益之而損人之所教我亦教之強梁者不得其死吾將以為教父
 hs:道生一一生二二生三三生萬物萬物負陰而抱陽沖氣以為和人之所惡唯孤寡不穀而王公以為稱故物或損之而益或盜之而損人之所教我亦教之強梁者不得其死吾將以為教父
zmf:道生一一生二二生三三生萬物萬物負陰而抱陽沖氣以為和人之所惡惟孤寡不榖而王公以為稱故物或損之而益或益之而損人之所教我義教之強梁者不得其死吾將以為教父

#43
xgP:〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。
 XG:天下之至柔馳騁天下之至堅無有入　無間吾是以知無為之有益不言之教無為之益天下希及之
hsg:天下之至柔馳騁天下之至堅無有入　無間吾是以知無為之有益不言之教無為之益天下希及之
 hs:天下　至柔馳騁天下之至堅無有入　無間吾是以知無為之有益不言之教無為之益天下希及之
zmf:天下之至柔馳騁天下之至堅無有入於無間吾是以知無為之有益不言之教無為之益天下希及之

#44
xgP:〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:名與身孰親身與貨孰多得與亡孰病　　甚愛必大費多藏必厚亡知足不辱知止不殆可以長久
hsg:名與身孰親身與貨孰多得與亡孰病　　甚愛必大費多藏必厚亡知足不辱知止不殆可以長久
 hs:名與身孰親身與貨孰多得與亡孰病　　甚愛必大費多藏必厚亡知足不辱知止不殆可以長久
zmf:名與身孰親身與貨孰多得與亡孰病是故甚愛必大費多藏必厚亡知足不辱知止不殆可以長久

#45
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇〇〇〇。
 XG:大成若缺其用不弊大盈若沖其用不窮大直若屈大巧若拙大辯若訥躁勝寒靜勝熱清淨為天下正
hsg:大成若缺其用不弊大盈若沖其用不窮大直若屈大巧若拙大辯若訥躁勝寒靜勝熱清淨為天下正
 hs:大成若缺其用不敝大盈若沖其用不窮大直若屈大巧若拙大辯若訥躁勝寒靜勝熱清淨為天下正
zmf:大成若缺其用不弊大盈若沖其用不窮大直若屈大巧若拙大辯若訥躁勝寒靜勝熱清靜為天下正

#46
xgP:〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇。
 XG:天下有道卻走馬以糞天下無道戎馬生於郊罪莫大於可欲禍莫大於不知足咎莫大於欲得故知足之足常足
hsg:天下有道卻走馬以糞天下無道戎馬生於郊罪莫大於可欲禍莫大於不知足咎莫大於欲得故知足之足常足
 hs:天下有道卻走馬以糞天下無道戎馬生於郊罪莫大於可欲禍莫大於不知足咎莫大於欲得故知足之足常足
zmf:天下有道卻走馬以糞天下無道戎馬生於郊罪莫大於可欲禍莫大於不知足咎莫大於欲得故知足之足常足

#47
xgP:〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇。
 XG:不出戶知天下不窺牖見天道其出彌遠其知彌少是以聖人不行而知不見而名無為而成
hsg:不出戶知天下不窺牖見天道其出彌遠其知彌少是以聖人不行而知不見而名無為而成
 hs:不出戶知天下不窺牖見天道其出彌遠其知彌少是以聖人不行而知不見而名不為而成
zmf:不出戶知天下不窺牖見天道其出彌遠其知彌少是以聖人不行而知不見而名無為而成

#48
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇。
 XG:為學日益為道日損損之又損以至於無為無為而無不為　　取天下常以無事乃其有事不足以取天下
hsg:為學日益為道日損損之又損以至於無為無為而無不為　　取天下常以無事乃其有事不足以取天下
 hs:為學日益為道日損損之又損以至於無為無為而無不為　故取天下常以無事乃其有事不足以取天下
zmf:為學日益為道日損損之又損以至於無為無為而無不為矣故取天下常以無事及其有事不足以取天下

#49
xgP:〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇。〇。〇。〇〇。〇〇。〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇。〇〇〇〇〇〇。〇〇〇〇。
 XG:聖人無常心以百姓心為心善者吾善之不善者吾亦善之德善　信者吾信之不信者吾亦信之德信矣聖人之在天下歙歙　為天下渾其心百姓皆注其耳目聖人皆孩之
hsg:聖人無常心以百姓心為心善者吾善之不善者吾亦善之德善　信者吾信之不信者吾亦信之德信　聖人之在天下怵怵　為天下渾其心百姓皆注其耳目聖人皆孩之
 hs:聖人無常心以百姓心為心善者吾善之不善者吾亦善之德善矣信者吾信之不信者吾亦信之德信矣聖人之在天下惵惵(dié dié，恐惧；害怕)　為天下渾其心百姓皆注其耳目聖人皆孩之
zmf:聖人無常心以百姓心為心善者吾善之不善者吾亦善之德善矣信者吾信之不信者吾亦信之德信矣聖人　在天下歙歙(xī xī，無所偏执的样子)焉為天下渾其心百姓皆注其耳目聖人皆孩之

#50
xgP:〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇。〇〇〇〇〇〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇。〇〇〇〇。
 XG:出生入死生之徒十有三死之徒十有三人之生動之死地　　十有三夫何故以其生生之厚蓋聞善攝生者陸行不遇兕虎入軍不避甲兵兕無所投其角虎無所措　爪兵無所容其刃夫何故以其無死地
hsg:出生入死生之徒十有三死之徒十有三人之生動之死地　　十有三夫何故以其生生之厚蓋聞善攝生者陸行不遇兕虎入軍不避甲兵兕無所投其角虎無所措　爪兵無所容其刃夫何故以其無死地
 hs:出生入死生之徒十有三死之徒十有三人之生動之死地者亦十有三夫何故以其生生之厚蓋聞善攝生者陸行不遇兕虎入軍不避甲兵兕無所投其角虎無所措其爪兵無所容其刃夫何故以其無死地
zmf:出生入死生之徒十有三死之徒十有三人之生動之死地　亦十有三夫何故以其生生之厚蓋聞善攝生者陸行不遇兕虎入軍不避甲兵兕無所投其角虎無所措其爪兵無所容其刃夫何故以其無死地

#51
xgP:〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇〇〇〇〇〇。〇〇。〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:道生之德畜之物形之勢成之是以萬物莫不尊道而貴德道之尊德之貴夫莫之爵而常自然故道生之德畜之長之育之成之熟之養之覆之生而不有為而不恃長而不宰是謂玄德
hsg:道生之德畜之物形之勢成之是以萬物莫不尊道而貴德道之尊德之貴夫莫之命而常自然故道生之德畜之長之育之成之熟之養之覆之生而不有為而不恃長而不宰是謂玄德
 hs:道生之德畜之物形之勢成之是以萬物莫不尊道而貴德道之尊德之貴夫莫之命而常自然故道生之　畜之長之育之成之熟之養之覆之生而不有為而不恃長而不宰是謂玄德
zmf:道生之德畜之物形之勢成之是以萬物莫不尊道而貴德道之尊德之貴夫莫之爵而常自然故道生之　畜之長之育之成之熟之養之覆之生而不有為而不恃長而不宰是謂玄德

#52
xgP:〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:天下有始以為天下母既知其母復知其子既知其子復守其母沒身不殆塞其兌閉其門終身不勤開其兌濟其事終身不救見小曰明守柔曰強用其光復歸其明無遺身殃是謂習常
hsg:天下有始以為天下母既知其母復知其子既知其子復守其母沒身不殆塞其兌閉其門終身不勤開其兌濟其事終身不救見小曰明守柔曰強用其光復歸其明無遺身殃是謂習常
 hs:天下有始以為天下母既知其母復知其子既知其子復守其母沒身不殆塞其兌閉其門終身不勤開其兌濟其事終身不救見小曰明守柔曰強用其光復歸其明無遺身殃是謂襲常
zmf:天下有始以為天下母既得其母以知其子既知其子復守其母沒身不殆塞其兌閉其門終身不勤開其兌濟其事終身不救見小曰明守柔曰強用其光復歸其明無遺身殃是謂襲常

#53
xgP:〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:使我介然有知行於大道唯施是畏大道甚夷而民好徑朝甚除田甚蕪倉甚虛服文綵帶利劍厭飲食財貨有餘是為盜夸非道也哉
hsg:使我介然有知行於大道唯施是畏大道甚夷而民好徑朝甚除田甚蕪倉甚虛服文綵帶利劍厭飲食財貨有餘是為盜夸非道　哉
 hs:使我介然有知行於大道唯施是畏大道甚夷而民好徑朝甚除田甚蕪倉甚虛服文采帶利劍厭飲食財貨有餘是為盜夸(韓非本作竽)非道　哉
zmf:使我介然有知行於大道惟施是畏大道甚夷而民好徑朝甚除田甚蕪倉甚虛服文綵帶利劍厭飲食資財有餘是謂盜夸非道也哉

#54
xgP:〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇。
 XG:善建者不拔善抱者不脫子孫祭祀不輟修之於身其德乃真修之於家其德乃餘修之於鄉其德乃長修之於國其德乃豐修之於天下其德乃普故以身觀身以家觀家以鄉觀鄉以國觀國以天下觀天下吾何以知天下之然哉以此
hsg:善建者不拔善抱者不脫子孫祭祀不輟修之於身其德乃真修之於家其德乃餘修之於鄉其德乃長修之於國其德乃豐修之於天下其德乃普故以身觀身以家觀家以鄉觀鄉以國觀國以天下觀天下吾何以知天下之然哉以此
 hs:善建者不拔善抱者不脫子孫祭祀不輟修之於身其德乃真修之於家其德乃餘修之於鄉其德乃長修之於國其德乃豐修之於天下其德乃普故以身觀身以家觀家以鄉觀鄉以國觀國以天下觀天下吾何以知天下　然哉以此
zmf:善建者不拔善抱者不脫子孫祭祀不輟脩之於身其德乃真脩之於家其德乃餘脩之於鄉其德乃長脩之於邦其德乃豐脩之於天下其德乃普故以身觀身以家觀家以鄉觀鄉以國觀國以天下觀天下吾何以知天下　然哉以此

#55
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:含德之厚比於赤子毒蟲不螫猛獸不據玃鳥不搏骨弱筋柔而握固未知牝牡之合而䘒作精之至也終日號而　不啞和之至也知和曰常知常曰明益生曰祥心使氣曰強物壯將老謂之不道不道早已
hsg:含德之厚比於赤子毒蟲不螫猛獸不據玃鳥不搏骨弱筋柔而握固未知牝牡之合而䘒(zuī)作精之至也終日號而　不啞和之至也知和曰常知常曰明益生曰祥心使氣曰強物壯將老謂之不道不道早已
 hs:含德之厚比於赤子毒蟲不螫(以尾毒傷物曰螫)猛獸不據(以爪按物曰據)攫鳥不搏(以翅擊物曰搏)骨弱筋柔而握固未知牝牡之合而脧(zuī)作精之至也終日號而嗌不嗄和之至也知和曰常知常曰明益生曰祥心使氣曰強物壯則老謂之不道不道早已
zmf:含德之厚比於赤子毒蟲不螫猛獸不據攫鳥不搏骨弱筋柔而握固未知牝牡之合而朘作精之至也終日號而　不嗄和之至也知和曰常知常曰明益生曰祥心使氣曰強物壯則老是謂不道不道早已

#56
xgP:〇〇〇。〇〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。
 XG:知者不言言者不知塞其兌閉其門挫其銳解其紛和其光同其塵是謂玄同故不可得而親不可得而疏不可得而利亦不可得而害不可得而貴亦不可得而賤故為天下貴
hsg:知者不言言者不知塞其兌閉其門挫其銳解其紛和其光同其塵是謂玄同故不可得而親不可得而踈不可得而利亦不可得而害不可得而貴亦不可得而賤故為天下貴
 hs:知者不言言者不知塞其兌閉其門挫其銳解其紛和其光同其塵是謂玄同故不可得而親不可得而疏不可得而利　不可得而害不可得而貴　不可得而賤故為天下貴
zmf:知者不言言者不知塞其兌閉其門挫其銳解其紛和其光同其塵是謂玄同故不可得而親不可得而踈不可得而利　不可得而害　　　　　　不可得而賤故為天下貴

#57
xgP:〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。
 XG:以正治國以奇用兵以無事取天下吾何以知其然哉以此天下多忌諱而民彌貧民多利器國家滋昏人多伎巧奇物滋起法物滋彰盜賊多有故聖人云我無為而民自化我好靜而民自正我無事而民自富我無欲而民自樸
hsg:以正治國以奇用兵以無事取天下吾何以知其然哉以此天下多忌諱而民彌貧民多利器國家滋昏人多伎巧奇物滋起法物滋彰盜賊多有故聖人云我無為而民自化我好靜而民自正我無事而民自富我無欲而民自樸
 hs:以正治國以奇用兵以無事取天下吾何以知其然哉以此天下多忌諱而民彌貧民多利器國家滋昏人多技巧奇物滋起法令滋彰盜賊多有故聖人云我無為而民自化我好靜而民自正我無事而民自富我無欲而民自樸
zmf:以正治國以奇用兵以無事取天下吾何以知其然哉以此天下多忌諱而民彌貧民多利器國家滋昏人多伎巧奇物滋起法令滋彰盜賊多有故聖人云我無為而民自化我好靜而民自正我無事而民自富我無欲而民自清

#58
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:其政悶悶其民醇醇其政察察其民缺缺禍兮福之所倚福兮禍之所伏孰知其極其無正耶正復為奇善復為訞人之迷其日固久　是以聖人方而不割廉而不劌直而不肆光而不耀
hsg:其政悶悶其民醇醇其政察察其民缺缺禍兮福之所倚福兮禍之所伏孰知其極其無正　正復為奇善復為訞人之迷其日固久　是以聖人方而不割廉而不劌直而不肆光而不矅
 hs:其政悶悶其民醇醇其政察察其民缺缺禍兮福　所倚福兮禍　所伏孰知其極其無正耶正復為奇善復為妖人之迷其日固久　是以聖人方而不割廉而不劌直而不肆光而不耀
zmf:其政悶悶其民淳淳其政察察其民缺缺禍兮福之所倚福兮禍之所伏孰知其極其無正邪正復為奇善復為妖民之迷其日固久矣是以聖人方而不割廉而不劌直而不肆光而不燿

#59
xgP:〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。
 XG:治人事天莫若嗇夫唯嗇是謂早服早服謂之重積德重積德則無不剋無不剋則莫知其極莫知其極可以有國有國之母可以長久是謂深根固蒂長生久視之道
hsg:治人事天莫若嗇夫唯嗇是謂早服早服謂之重積德重積德則無不剋無不剋則莫知其極莫知其極可以有國有國之母可以長久是謂深根固蒂長生久視之道
 hs:治人事天莫若嗇夫惟嗇是謂早復早復謂之重積德重積德則無不克無不克則莫知其極莫知其極可以有國有國之母可以長久是謂深根固蒂長生久視之道
zmf:治人事天莫若嗇夫　　是謂早復早復謂之重積德重積德則無不克無不克則莫知其極莫知其極可以　　有國之母可以長久是謂深根固蒂長生久視之道

#60
xgP:〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。
 XG:治大國若烹小鮮以道蒞天下其鬼不神非其鬼不神其神不傷人非其神不傷人聖人亦不傷　夫兩不相傷故其德交歸焉
hsg:治大國若烹小鮮以道蒞天下其鬼不神非其鬼不神其神不傷人非其神不傷人聖人亦不傷　夫兩不相傷故其德交歸焉
 hs:治大國若烹小鮮以道蒞天下其鬼不神非其鬼不神其神不傷人非其神不傷人聖人亦不傷人夫兩不相傷故其德交歸焉
zmf:治大國若烹小鮮以道蒞天下其鬼不神非其鬼不神其神不傷人非其神不傷人聖人亦不傷人夫兩不相傷故　德交歸焉

#61
xgP:〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇。
 XG:大國者下流天下之交天下之牝牝常以靜勝牡以靜為下故大國以下小國則取小國小國以下大國則取大國故或下以取或下而取大國不過欲兼畜人小國不過欲入事人夫兩者各得其所欲　大者宜為下
hsg:大國者下流天下之交天下之牝牝常以靜勝牡以靜為下故大國以下小國則取小國小國以下大國則取大國故或下以取或下而取大國不過欲兼畜人小國不過欲入事人夫兩者各得其所欲　大者宜為下
 hs:大國者下流天下之交天下之牝牝常以靜勝牡以靜為下故大國以下小國則取小國小國以下大國則取大國故或下以取或下而取大國不過欲兼畜人小國不過欲入事人夫兩者各得其　欲故大者宜為下
zmf:大國者下流天下之交天下之交牝常以靜勝牡以靜為下故大國以下小國則取小國小國以下大國則取大國故或下以取或下而取大國不過欲兼畜人小國不過欲入事人　兩者各得其所欲故大者宜為下

#62
xgP:〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇。〇〇。〇〇〇〇。〇〇〇〇。
 XG:道者萬物之奧善人之寶不善人之所保美言可以市尊行可以加人人之不善何棄之有故立天子置三公雖有拱璧以先駟馬不如坐進此道古之所以貴此道者何　不曰以求得有罪以免耶故為天下貴
hsg:道者萬物之奧善人之寶不善人之所保美言可以市尊行可以加人人之不善何棄之有故立天子置三公雖有拱璧以先駟馬不如坐進此道古之所以貴此道者何　不曰以求得有罪以免耶故為天下貴
 hs:道者萬物之奧善人之寶不善人之所保美言可以市尊行可以加人人之不善何棄之有故立天子置三公雖有拱璧以先駟馬不如坐進此道古之所以貴此道者何　不曰求以得有罪以免耶故為天下貴
zmf:道者萬物之奧善人之寶不善人之所保美言可以市尊行可以加人人之不善何棄之有故立天子置三公雖有拱璧以先駟馬不如坐進此道古之所以貴此道者何也不曰求以得有罪以免耶故為天下貴

#63
xgP:〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。
 XG:為無為事無事味無味大小多少報怨以德圖難於其易為大於其細天下　難事必作於易天下　大事必作於細是以聖人終不為大故能成其大夫輕諾必寡信多易必多難是以聖人猶難之故終無難
hsg:為無為事無事味無味大小多少報怨以德圖難於其易為大於其細天下　難事必作於易天下　大事必作於細是以聖人終不為大故能成其大夫輕諾必寡信多易必多難是以聖人猶難之故終無難
 hs:為無為事無事味無味大小多少報怨以德圖難於其易為大於其細天下　難事必作於易天下　大事必作於細是以聖人終不為大故能成其大夫輕諾必寡信多易必多難是以聖人猶難之故終無難
zmf:為無為事無事味無味大小多少報怨以德圖難於其易為大於其細天下之難事必作於易天下之大事必作於細是以聖人終不為大故能成其大夫輕諾必寡信多易　多難是以聖人由難之故終無難矣

#64
xgP:〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇〇〇。
 XG:其安易持其未兆易謀其脆易泮其微易散為之於未有治之於未亂合抱之木生於毫末九層之臺起於累土千里之行始於足下為者敗之執者失之是以聖人無為故無敗無執故無失民之從事常於幾成而敗之慎終如始則無敗事是以聖人欲不欲不貴難得之貨學不學復衆人之所過以輔萬物之自然而不敢為
hsg:其安易持其未兆易謀其脆易破其微易散為之於未有治之於未亂合抱之木生於毫末九層之臺起於累土千里之行始於足下為者敗之執者失之　　聖人無為故無敗無執故無失民之從事常於幾成而敗之慎終如始則無敗事是以聖人欲不欲不貴難得之貨學不學復衆人之所過以輔萬物之自然而不敢為
 hs:其安易持其未兆易謀其脆易破其微易散為之於未有治之於未亂合抱之木生於毫末九層之臺起於累土千里之行始於足下為者敗之執者失之　　聖人無為故無敗無執故無失民之從事常於幾成而敗之慎終如始則無敗事是以聖人欲不欲不貴難得之貨學不學復衆人之所過以輔萬物之自然而不敢為
zmf:其安易持其未兆易謀其脆易泮其微易散為之於未有治之於未亂合抱之木生於毫末九層之臺起於累土千里之行始於足下為者敗之執者失之是以聖人無為故無敗無執故無失民之從事常於幾成而敗之慎終如始則無敗事是以聖人欲不欲不貴難得之貨學不學復衆人之所過以輔萬物之自然而不敢為

#65
xgP:〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇。〇〇〇〇。〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇。〇〇〇。〇〇〇〇〇〇。
 XG:古之善為道者非以明民將以愚之民之難治以其智多故以智治國國之賊不以智治國國之福知此兩者亦稽式常知稽式是謂玄德玄德深矣遠矣與物反矣然後乃至　大順
hsg:古之善為道者非以明民將以愚之民之難治以其智多　以智治國國之賊不以智治國國之福知此兩者亦楷式常知楷式是謂玄德玄德深矣遠矣與物反矣　　乃至於大順
 hs:古之善為道者非以明民將以愚之民之難治以其智多　以智治國國之賊不以智治國國之福知此兩者亦楷式能知楷式是謂玄德玄德深矣遠矣與物反矣　　乃至於大順
zmf:古之善為道者非以明民將以愚之民之難治以其智多故以智治國國之賊不以智治國國之福知此兩者亦楷式能知楷式是謂玄德玄德深矣遠矣與物反矣然後乃至　大順

#66
xgP:〇〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇。
 XG:江海所以能為百谷王者以其善下之　故能為百谷王是以聖人欲上民必以言下之欲先民必以　身後之是以聖人處上而民不重處前而民不害是以天下樂推而不厭以其不爭故天下莫能與之爭
hsg:江海所以能為百谷王者以其善下之　故能為百谷王是以聖人欲上民必以言下之欲先民必以　身後之是以聖人處上而民不重處前而民不害是以天下樂推而不厭以其不爭故天下莫能與之爭
 hs:江海所以能為百谷王者以其善下之　故能為百谷王是以聖人欲上民必以言下之欲先民必以　身後之是以聖人處上而民不重處前而民不害是以天下樂推而不厭以其不爭故天下莫能與之爭
zmf:江海所以能為百谷王者以其善下之也故能為百谷王是以聖人欲上民必以言下之欲先人　以其身下之是以聖人處上而民不重處前而人不害是以天下樂推而不厭以其不爭故天下莫能與之爭

#67
xgP:〇〇〇〇〇〇。〇〇。〇〇。〇〇〇。〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇。〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:天下皆謂我道大似不肖夫唯大故似不肖若肖久矣其細　夫我有三寶持而寶之一曰慈二曰儉三曰不敢為天下先慈故能勇儉故能廣不敢為天下先故能成器長今捨　慈且勇捨儉且廣捨　後且先死矣夫慈以戰則勝以守則固天將救之以慈衛之
hsg:天下皆謂我道大似不肖夫唯大故似不肖若肖久矣其細　夫我有三寶持而寶之一曰慈二曰儉三曰不敢為天下先慈故能勇儉故能廣不敢為天下先故能成器長今捨　慈且勇捨儉且廣捨　後且先死矣夫慈以戰則勝以守則固天將救之以慈衛之
 hs:天下皆謂我道大似不肖夫惟大故似不肖若肖久矣其細　　我有三寶持而寶之一曰慈二曰儉三曰不敢為天下先慈故能勇儉故能廣不敢為天下先故能成器長今捨　慈且勇捨儉且廣捨　後且先死矣夫慈以戰則勝以守則固天將救之以慈衛之
zmf:天下皆謂我道大似不肖夫惟大故似不肖若肖久矣其細矣夫我有三寶持而保之一曰慈二曰儉三曰不敢為天下先慈故能勇儉故能廣不敢為天下先故能成器長今捨其慈且勇舍儉且廣捨其後且先死矣夫慈以戰則勝以守則固天將救之以慈衛之

#68
xgP:〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。
 XG:善為士者不武善戰者不怒善勝敵者不爭善用人者為之下是謂不爭之德是謂用人之力是謂配天古之極
hsg:善為士者不武善戰者不怒善勝敵者不爭善用人者為之下是謂不爭之德是謂用人之力是謂配天古之極
 hs:善為士者不武善戰者不怒善勝敵者不爭善用人者為之下是謂不爭之德是謂用人之力是謂配天古之極
zmf:善為士者不武善戰者不怒善勝敵者不爭善用人者為之下是謂不爭之德是謂用人之力是謂配天古之極

#69
xgP:〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇。〇〇。〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇。
 XG:用兵有言吾不敢為主而為客不敢進寸而退尺是謂行無行攘無臂仍無敵執無兵禍莫大於輕敵輕敵幾喪吾寶故抗兵相若哀者勝矣
hsg:用兵有言吾不敢為主而為客不敢進寸而退尺是謂行無行攘無臂仍無敵執無兵禍莫大於輕敵輕敵幾喪吾寶故抗兵相加哀者勝矣
 hs:用兵有言吾不敢為主而為客不敢進寸而退尺是謂行無行(音杭戶剛反)攘無臂仍無敵執無兵(兵者五兵器械謂戈矛殳戟干也)禍莫大於輕敵輕敵幾喪吾寶故抗兵相加哀者勝矣
zmf:用兵有言吾不敢為主而為客不敢進寸而退尺是謂行無行攘無臂仍無敵執無兵禍莫大於輕敵輕敵幾喪吾寶故抗兵　加哀者勝矣

#70
xgP:〇〇〇〇。〇〇。〇〇〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。
 XG:吾言甚易知甚易行天下莫能知莫能行言有宗事有君夫唯無知是以不我知　知我者希則我者貴　是以聖人彼褐懷玉
hsg:吾言甚易知甚易行天下莫能知莫能行言有宗事有君夫唯無知是以不我知　知我者希則我者貴　是以聖人彼褐懷玉
 hs:吾言甚易知　易行天下莫能知莫能行言有宗事有君夫惟無知是以不我知　知我者希則我者貴　是以聖人彼褐懷玉
zmf:吾言甚易知甚易行天下莫能知莫能行言有宗事有君夫惟無知是以不我知也知我者希則我　貴矣是以聖人被褐懷玉

#71
xgP:〇〇。〇〇〇。〇。〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:知不知上不知知病夫唯病病是以不病聖人不病以其病病是以不病
hsg:知不知上不知知病夫唯病病是以不病聖人不病以其病病是以不病
 hs:知不知上不知知病夫惟病病是以不病聖人不病以其病病是以不病
zmf:知不知上不知知病夫惟病病是以不病聖人不病以其病病是以不病

#72
xgP:〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇。
 XG:民不畏威　大威至矣無狎其所居無厭其所生夫唯不厭是以不厭是以聖人自知不自見自愛不自貴故去彼取此
hsg:民不畏威　大威至矣無狹其所居無厭其所生夫唯不厭是以不厭是以聖人自知不自見自愛不自貴故去彼取此
 hs:民不畏威　大威至矣無狹其所居無厭(平聲)其所生夫惟不厭是以不厭(去聲)是以聖人自知不自見自愛不自貴故去彼取此
zmf:民不畏威而大威至矣無狹其所居無厭其所生夫惟不厭是以不厭是以聖人自知不自見自愛不自貴故去彼取此

#73
xgP:〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。
 XG:勇於敢則殺勇於不敢則活此兩者或利或害天之所惡孰知其故是以聖人猶難之天之道不爭而善勝不言而善應不召而自來繟然而善謀天網恢恢疏而不失
hsg:勇於敢則殺勇於不敢則活此兩者或利或害天之所惡孰知其故是以聖人猶難之天之道不爭而善勝不言而善應不召而自來繟然而善謀天網恢恢踈而不失
 hs:勇於敢則殺勇於不敢則活此兩者或利或害天之所惡孰知其故是以聖人猶難之天之道不爭　善勝不言而善應不召而自來繟(chǎn，舒緩)然而善謀天網恢恢疏而不失
zmf:勇於敢則殺勇於不敢則活此兩者或利或害天之所惡孰知其故是以聖人猶難之天之道不爭而善勝不言而善應不召而自來繟然而善謀天網恢恢踈而不失

#74
xgP:〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇〇。〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。
 XG:民　不畏死奈何以死懼之若使民常畏死而為奇者吾得執而殺之孰敢常有司殺者　夫代司殺者殺是謂代大匠斲夫代大匠斲者希有不傷　手矣
hsg:民　不畏死奈何以死懼之若使民常畏死而為奇者吾得執而殺之孰敢常有司殺者　夫代司殺者殺是謂代大匠斲夫代大匠斲者希有不傷　手矣
 hs:民　不畏死奈何以死懼之若使民常畏死而為奇者吾將執而殺之孰敢常有司殺者殺夫代司殺者殺是謂代大匠斲夫代大匠斲者希有不傷　手矣
zmf:民常不畏死奈何以死懼之若使民常畏死而為奇者吾得執而殺之孰敢常有司殺者殺而代司殺者殺是謂代大匠斲夫代大匠斲者希有不傷其手矣

#75
xgP:〇〇。〇〇〇〇〇〇。〇〇。〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇〇〇〇〇。
 XG:民之飢以其上食稅之多是以飢民之難治以其上之有為是以難治民之輕死以其　求生之厚是以輕死夫唯無以生為。是賢於貴生
hsg:民之飢以其上食稅之多是以飢民之難治以其上之有為是以難治民之輕死以其　求生之厚是以輕死夫唯無以生為者是賢於貴生
 hs:民之飢以其上食稅之多是以飢民之難治以其上之有為是以難治民之輕死以其　求生之厚是以輕死夫惟無以生為者是賢於貴生
zmf:民之饑以其上食稅之多是以饑民之難治以其上之有為是以難治民之輕死以其上求生之厚是以輕死夫惟無以生為者是賢於貴生

#76
xgP:〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:人之生也柔弱其死也堅強　　草木之生也柔脆其死也枯槁故堅強者死之徒柔弱者生之徒是以兵強則不勝木強則共強大處下柔弱處上
hsg:人之生也柔弱其死也堅強萬物草木之生也柔脆其死也枯槁故堅強者死之徒柔弱者生之徒是以兵強則不勝木強則共強大處下柔弱處上
 hs:人之生也柔弱其死也堅強萬物草木之生也柔脆其死也枯槁故堅強者死之徒柔弱者生之徒是以兵強則不勝木強則共(音拱兩手合圍也)強大處下柔弱處上
zmf:人之生也柔弱其死也堅強　　草木之生也柔脆其死也枯槁故堅強者死之徒柔弱者生之徒是以兵強則不勝木強則共堅強處下柔弱處上

#77
xgP:〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇。〇〇〇〇。〇〇。〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇〇〇〇〇〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇〇〇。〇〇〇〇。
 XG:天之道其猶張弓乎高者抑之下者舉之有餘者損之不足者補之天之道損有餘而補不足人之道則不然損不足以奉有餘孰能　有餘以奉　　　天下唯有道者是以聖人為而不恃功成而不處其不欲見賢
hsg:天之道其猶張弓乎高者抑之下者舉之有餘者損之不足者補之天之道損有餘而補不足人之道則不然損不足以奉有餘孰能　有餘以奉　　　天下唯有道者是以聖人為而不恃功成而不處其不欲見賢
 hs:天之道其猶張弓乎高者抑之下者舉之有餘者損之不足者補之天之道損有餘而補不足人之道則不然損不足以奉有餘孰能　有餘以奉　　　天下唯有道者是以聖人為而不恃功成而不處其不欲見賢耶
zmf:天之道其猶張弓乎高者抑之下者舉之有餘者損之不足者補之天之道損有餘而補不足人之道則不然損不足以奉有餘孰能損有餘以奉不足於天下惟有道者是以聖人為而不恃功成而不處其不欲見賢耶

#78
xgP:〇〇〇〇〇〇〇。〇〇〇〇〇〇〇〇。〇〇〇〇〇。〇〇〇〇〇。〇〇〇。〇〇〇〇。〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇。〇〇〇〇。
 XG:天下莫柔弱過於水而攻堅強者莫之能勝以其無以易之　　柔之勝剛弱之勝強天下莫不知莫能行是以聖人云受國之垢是謂社稷主受國之不祥是謂天下王正言若反
hsg:天下莫柔弱過於水而攻堅強者莫之能勝以其無以易之　　柔之勝剛弱之勝強天下莫不知莫能行故　聖人云受國之垢是謂社稷主受國之不祥是謂天下王正言若反
 hs:天下莫柔弱　於水而攻堅強者莫之能先以其無以易之也故柔之勝剛弱之勝強天下莫不知莫能行是以聖人云受國之垢是謂社稷主受國之不祥是謂天下王正言若反
zmf:天下莫柔弱　於水而攻堅強者莫之能勝以其無以易之　故柔　勝剛弱　勝強天下莫不知莫能行是以聖人云受國之垢是謂社稷主受國　不祥是謂天下王正言若反

#79
xgP:〇〇。〇〇〇。〇〇〇〇。〇〇〇〇〇〇。〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:和大怨必有餘怨安可以為善是以聖人執左契而不責於人有德司契無德司徹天道無親常與善人
hsg:和大怨必有餘怨安可以為善是以聖人執左契而不責於人有德司契無德司徹天道無親常與善人
 hs:和大怨必有餘怨安可以為善是以聖人執左契而不責於人有德司契無德司徹天道無親常與善人
zmf:和大怨必有餘怨安可以為善是以聖人執左契而不責於人有德司契無德司徹天道無親常與善人

#80
xgP:〇〇〇。〇〇〇〇〇〇〇〇〇。〇〇〇〇〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇〇〇〇〇。〇〇。〇〇。〇〇。〇〇。〇〇〇。〇〇〇〇〇。〇〇〇〇〇〇〇。
 XG:小國寡民使有什伯　之器而不用使民重死而不遠徙雖有舟轝無所乗之雖有甲兵無所陳之使民復結繩而用之甘其食美其服安其居樂其俗鄰國相望雞狗之聲相聞民至老　不相往來
hsg:小國寡民使有什伯人之器而不用使民重死而不遠徙雖有舟轝(yú)無所乗之雖有甲兵無所陳之使民復結繩而用之甘其食美其服安其居樂其俗鄰國相望雞狗之聲相聞民至老　不相往來
 hs:小國寡民使有什伯人之器而不用使民重死而不遠徙雖有舟輿(yú)無所乘之雖有甲兵無所陳之使民復結繩而用之甘其食美其服安其居樂其俗鄰國相望雞狗之聲相聞民至老死不相往來
zmf:小國寡民使有什伯　之器而不用使民重死而不遠徙雖有舟車無所乗之雖有甲兵無所陳之使民復結繩而用之甘其食美其服安其居樂其俗鄰國相望雞犬之聲相聞民至老死不相往來

#81
xgP:〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇〇。〇〇。〇〇〇。〇〇。〇〇。〇〇〇。〇〇〇。〇〇〇。
 XG:信言不美美言不信善者不辯辯者不善知者不博博者不知聖人不積既已為人己愈有既已與人己愈多天之道利而不害聖人之道為而不爭
hsg:信言不美美言不信善者不辯辯者不善知者不博博者不知聖人不積既已為人己愈有既已與人己愈多天之道利而不害聖人之道為而不爭
 hs:信言不美美言不信善者不辯辯者不善知者不博博者不知聖人不積既已為人己愈有既已與人己愈多天之道利而不害聖人之道為而不爭
zmf:信言不美美言不信善者不辯辯者不善知者不博博者不知聖人不積既以為人己愈有既以與人己愈多天之道利而不害　人之道為而不爭
`;

var ddjTitles = // 曾仕强
`天地之始 功成不居 無為而治 和光同尘 天地不仁 谷神不死 天長地久 上善若水 功遂身退 修身之法 無的大用 杜外養中 寵辱若驚 執古御今 微妙玄通 致虚守静 道政合一 道废仁出 見素抱樸 絕学無憂 惟道是從 抱一守中 希言自然 修道四要 道法自然 道重身輕 善行無跡 大道無分 無為無执 物壮則老 不战而勝 萬物自賓 自知自强 道蘊萬物 往而不害 以柔克剛 道常無為 上德不德 賤為貴本 無中生有 大器免成 三生萬物 無為之益 知足不辱 大成若缺 知足常足 不行而知 為道日損 聖無常心 出生入死 尊道貴德 没身不殆 大道甚夷 以身觀身 含德之厚 知者不言 治國之道 福禍相依 治人事天 道莅天下 大者為下 善人之寶 报怨以德 未兆易謀 將以愚之 不爭之爭 我有三寶 不爭之德 哀兵必勝 被褐懷玉 病病不病 民不畏威 天網恢恢 民不畏死 無以生為 兵强則滅 為而不恃 正言若反 天道無親 小國寡民 利而不害`
.split(' ');

ddjTitles = // 河上公
`體道 養身 安民 無源 虛用 成象 韜光 易性 運夷 能為 無用 檢欲 猒恥 賛玄 顯德 歸根 淳風 俗薄 還淳 異俗 虛心 益謙 虛無 苦恩 象元 重德 巧用 反樸 無為 儉武 偃武 聖德 辯德 任成 仁德 微明 為政 論德 法本 去用 同異 道化 徧用 立戒 洪德 儉欲 鑒遠 忘知 任德 貴生 養德 歸元 益證 修觀 玄符 玄德 淳風 順化 守道 居位 謙德 為道 恩始 守微 淳德 後已 三寶 配天 玄用 知難 知病 愛己 任為 制感 貪損 戒強 天道 任信 任契 獨立 顯質`.split(' ');

var synonyms = {};
var ddjText = [];

function areSynons(a,b) {
  if (!a && !b) return false;
  if (a == b) return true;
  var asyn = synonyms[a];
  return asyn && (asyn == synonyms[b]);
}

(function() {
  function procText(cur, key, ln) {
    if (key === 'xgP') {
      cur.xgP = [];
      for (var i=0; i<ln.length; ++i) {
        switch (ln[i]) {
        case '：':
        case '。': cur.xgP.push(i); break;
        }
      }
      return;
    }

    var plain = '', anno = {};
    while (true) {
      var idx = ln.indexOf('('), idx1 = -1;
      if (idx > 0) idx1 = ln.indexOf(')', idx);
      if (idx < 0 || idx1 < 0) { plain += ln; break; }
      var extra = ln.substring(idx+1,idx1).trim();
      var sz = extra.split(' ').length;
      plain += ln.substring(0, idx-sz) + ln.substring(idx-sz,idx);
      for (var j=0; j<sz; ++j) anno[plain.length-j-1] = extra;
      if (idx1 === ln.length-1) break;
      ln = ln.substring(idx1+1);
    }
    cur[key] = { plain, anno };
  }

  var cur = {};
  var a = DDJ_TEXT.split('\n');
  for (var i in a) {
    var ln = a[i];
    if (ln.startsWith('#')) continue;
    var idx = ln.indexOf(':');
    if (idx > 0) {
      procText(cur, ln.substring(0,idx).trim(), ln.substring(idx+1));
    } else {
      ddjText.push(cur);
      cur = {};
    }
  }

  var allSynons = [
    '蒭芻', '綿緜', '唯惟', '謫讁', '修脩', '乘乗', '飢饑', '穀榖', '忽惚', 
    '像象', '惔淡', '醇淳', '捨舍', '啞嗄', '碌琭', '剋克', '踈疏', '轝輿',
    '弗不', '邪耶',
    '蔽敝弊', '矅燿耀', '噏翕歙', '䘒朘脧',
  ];
  function addSyn(zis) {
    var sense, i;
    for (i=0; i<zis.length; ++i) {
      sense = synonyms[zis[i]];
      if (sense) break;
    }
    if (!sense) sense = zis;
    for (i=0; i<zis.length; ++i)
      synonyms[zis[i]] = sense;
  }

  for (var i in allSynons) {
    var zis = allSynons[i];
    for (var j=0; j<zis.length; ++j) {
      var c = zis[j];
      if (!synonyms[c]) synonyms[c] = zis; // zis is just a token here.
    }
  }
})();

var versions = {
  'hsg': '河上公版',
   'hs': '憨山版',
  'zmf': '趙孟頫版',
  'zsq': '曾仕强版',
  'XG':  '信裹會集版'
};
