new GDHReader('地藏菩薩本願經',
`#1 忉利天宮神通品第一

如是我聞。一時佛在忉利天為母說法。爾時十方無量世界不可說不可說一切諸佛及大菩薩摩訶薩皆來集會。讚歎釋迦牟尼佛能於五濁惡世現不可思議大智慧神通之力，調伏剛強衆生知苦[樂|ngaau]法，各遣侍者問訊世尊。

@lnbk
是時如來含笑放百千萬億大光明雲，所謂
大圓滿光明雲、大慈悲光明雲、大智慧光明雲、大般若光明雲、大三昧光明雲、
大吉祥光明雲、大福德光明雲、大功德光明雲、大歸依光明雲、大讚歎光明雲。
@/lnbk

@lnbk
放如是等不可說光明雲已又出種種微妙之音，所謂
檀波羅蜜音、尸波羅蜜音、羼提波羅密音、毗離耶波羅蜜音、禪波羅蜜音、般若波羅蜜音、
慈悲音、喜捨音、解脫音、無漏音、智慧音、大智慧音、師子吼音、大師子吼音、雲雷音、大雲雷音。
@/lnbk

@lnbk
出如是等不可說不可說音已，娑婆世界及他方國土有無量億天龍鬼神亦集到忉利天宮，所謂
四天王天、忉利天、須燄摩天、兜率陀天、化樂天、他化自在天、
梵衆天、梵輔天、大梵天、
少光天、無量光天、光音天、
少淨天、無量淨天、遍淨天、
福生天、福愛天、廣果天、無想天、無煩天、無熱天、善見天、善現天、色究竟天、摩醯首羅天、
乃至非想非非想處天，
一切天衆龍衆鬼神等衆悉來集會。
@/lnbk

@lnbk
復有他方國土及娑婆世界，
海神、江神、河神、樹神、山神、地神、川澤神、苗稼神、
晝神、夜神、空神、天神、飲食神、草木神，
如是等神皆來集會。
@/lnbk

@lnbk
復有他方國土及娑婆世界諸大鬼王，所謂
惡目鬼王、噉血鬼王、噉精氣鬼王、噉胎卵鬼王、
行病鬼王、攝毒鬼王、慈心鬼王、福利鬼王、大愛敬鬼王，
如是等鬼王，皆來集會。
@/lnbk

爾時，釋迦牟尼佛告文殊師利法王子菩薩摩訶薩：汝觀是一切諸佛菩薩及天龍鬼神，此世界他世界、此國土他國土，如是今來集會到忉利天者，汝知數不？

文殊師利白佛言：世尊，若以我神力千劫測度不能得知。

佛告文殊師利：吾以佛眼觀故猶不盡數。此皆是地藏菩薩久遠劫來已度當度未度、已成就當成就未成就。

文殊師利白佛言：世尊，我已過去久修善根證無礙智。聞佛所言即當信受。小果聲聞天龍八部及未來世諸衆生等，雖聞如來誠實之語必懷疑惑，設使頂受未免興謗。唯願世尊廣說地藏菩薩摩訶薩因地作何行立何願，而能成就不思議事。

佛告文殊師利：譬如三千大千世界所有草木叢林、稻麻竹葦、山石微塵，一物一數作一恆河；一恆河沙，一沙一界；一界之內一塵一劫，一劫之內所積塵數盡充為劫，地藏菩薩證十地果位以來千倍多於上喻。何況地藏菩薩在聲聞辟支佛地。文殊師利，此菩薩威神誓願不可思議。

若未來世有善男子善女人聞是菩薩名字，或讚歎或瞻禮或稱名或供養乃至彩畫刻鏤塑漆形像，是人當得百返生於三十三天永不墮惡道。

文殊師利，是地藏菩薩摩訶薩於過去久遠不可說不可說劫前身為大長者子。時世有佛號曰師子奮迅具足萬行如來。時長者子見佛相好千福莊嚴，因問彼佛：作何行願而得此相？時師子奮迅具足萬行如來告長者子：欲證此身，當須久遠度脫一切受苦衆生。文殊師利，時長者子因發願言：我今盡未來際不可計劫為是罪苦六道衆生廣設方便盡令解脫，而我自身方成佛道。以是於彼佛前立斯大願，於今百千萬億那由他不可說劫尚為菩薩。

又於過去不可思議阿僧祇劫，時世有佛號曰覺華定自在王如來，彼佛壽命四百千萬億阿僧祇劫。像法之中有一婆羅門女宿福深厚衆所欽敬，行住坐臥諸天衛護。其母信邪常輕三寶。是時聖女廣設方便勸誘其母令生正見，而此女母未全生信。不久命終魂神墮在無間地獄。時婆羅門女知母在世不信因果計當隨業必生惡趣。遂賣家宅廣求香華及諸供具，於先佛塔寺大興供養。見覺華定自在王如來其形像在一寺中塑畫威容端嚴畢備。

時婆羅門女瞻禮尊容倍生敬仰私自念言：佛名大覺具一切智。若在世時，我母死後儻來問佛必知處所。時婆羅門女垂泣良久瞻戀如來。忽聞空中聲曰：泣者聖女勿至悲哀，我今示汝母之去處。婆羅門女合掌向空而白空曰：是何神德寬我憂慮。我自失母以來晝夜憶戀，無處可問知母生界。時空中有聲再報女曰：我是汝所瞻禮者過去覺華定自在王如來，見汝憶母倍於常情衆生之分故來告示。婆羅門女聞此聲已舉身自撲肢節皆損，左右扶侍良久方蘇而白空曰：願佛慈愍速說我母生界，我今身心將死不久。時覺華定自在王如來告聖女曰：汝供養畢但早返舍，端坐思惟吾之名號，即當知母所生去處。

時婆羅門女尋禮佛已即歸其舍。以憶母故端坐念覺華定自在王如來。經一日一夜忽見自身到一海邊。其水涌沸多諸惡獸盡復鐵身，飛走海上東西馳逐。見諸男子女人百千萬數出沒海中被諸惡獸爭取食噉。又見夜叉其形各異，或多手多眼多足多頭、口牙外出利刃如劍。驅諸罪人使近惡獸，復自搏攫頭足相就。其形萬類不敢久視。時婆羅門女以念佛力故自然無懼。

有一鬼王名曰無毒稽首來迎白聖女曰：善哉菩薩，何緣來此？時婆羅門女問鬼王曰：此是何處？無毒答曰：此是大鐵圍山西面第一重海。聖女問曰：我聞鐵圍之內地獄在中，是事實不？無毒答曰：實有地獄。聖女問曰：我今云何得到獄所？無毒答曰：若非威神即須業力，非此二事終不能到。聖女又問：此水何緣而乃涌沸、多諸罪人及以惡獸？無毒答曰：此是閻浮提造惡衆生新死之者經四十九日後無人繼嗣為作功德救拔苦難，生時又無善因。當據本業所感地獄自然先渡此海。海東十萬由旬又有一海其苦倍此。彼海之東又有一海其苦復倍。三業惡因之所招感共號業海其處是也。聖女又問鬼王無毒曰：地獄何在？無毒答曰：三海之內是大地獄，其數百千各各差別。所謂大者具有十八。次有五百苦毒無量。次有千百亦無量苦。

聖女又問大鬼王曰：我母死來未久不知魂神當至何趣？鬼王問聖女曰：菩薩之母在生習何行業？聖女答曰：我母邪見譏毀三寶，設或暫信旋又不敬，死雖日淺未知生處。無毒問曰：菩薩之母姓氏何等？聖女答曰：我父我母俱婆羅門種，父號尸羅善現，母號悅帝利。無毒合掌啟菩薩曰：願聖者卻返本處無至憂憶悲戀。悅帝利罪女生天以來經今三日。云承孝順之子為母設供修福布施覺華定自在王如來塔寺。非唯菩薩之母得脫地獄，應是無間罪人此日悉得受樂俱同生訖。鬼王言畢合掌而退。

婆羅門女尋如夢歸。悟此事已便於覺華定自在王如來塔像之前立弘誓願：願我盡未來劫應有罪苦衆生廣設方便使令解脫。

佛告文殊師利：時鬼王無毒者當今財首菩薩是。婆羅門女者即地藏菩薩是。

#2 分身集會品第二

爾時，百千萬億不可思不可議不可量不可說無量阿僧祇世界所有地獄處分身地藏菩薩俱來集在忉利天宮。以如來神力故各以方面與諸得解脫從業道出者，亦各有千萬億那由他數，共持香華來供養佛。彼諸同來等輩皆因地藏菩薩教化永不退轉於阿耨多羅三藐三菩提。是諸衆等久遠劫來流浪生死六道受苦暫無休息，以地藏菩薩廣大慈悲深誓願故各獲果證。既至忉利心懷踴躍瞻仰如來目不暫捨。

爾時，世尊舒金色臂摩百千萬億不可思不可議不可量不可說無量阿僧祇世界諸分身地藏菩薩摩訶薩頂而作是言：吾於五濁惡世教化如是剛強衆生令心調伏捨邪歸正，十有一二尚惡習在。吾亦分身千百億廣設方便。或有利根聞即信受；或有善果勤勸成就；或有暗鈍久化方歸；或有業重不生敬仰。如是等輩衆生各各差別分身度脫。或現男子身、或現女人身、或現天龍身、或現神鬼身、或現山林川原河池泉井利及於人悉皆度脫。或現天帝身、或現梵王身、或現轉輪王身、或現居士身、或現國王身、或現宰輔身、或現官屬身、或現比丘比丘尼優婆塞優婆夷身，乃至聲聞羅漢辟支佛菩薩等身而以化度，非但佛身獨現其前。汝觀吾累劫勤苦度脫如是等難化剛強罪苦衆生。其有未調伏者隨業報應。若墮惡趣受大苦時，汝當憶念吾在忉利天宮慇懃付囑，令娑婆世界至彌勒出世已來衆生悉使解脫，永離諸苦，遇佛授記。

爾時，諸世界分身地藏菩薩共復一形涕淚哀戀白其佛言：我從久遠劫來蒙佛接引使獲不可思議神力具大智慧。我所分身遍滿百千萬億恆河沙世界，每一世界化百千萬億身，每一身度百千萬億人，令歸敬三寶永離生死至涅槃樂。但於佛法中所為善事一毛一渧一沙一塵或毫髮許，我漸度脫使獲大利。唯願世尊不以後世惡業衆生為慮。如是三白佛言：唯願世尊不以後世惡業衆生為慮。

爾時，佛讚地藏菩薩言：善哉，善哉！吾助汝喜。汝能成就久遠劫來發弘誓願，廣度將畢即證菩提。

#3 觀衆生業緣品第三

爾時，佛母摩耶夫人恭敬合掌問地藏菩薩言：聖者，閻浮衆生造業差別所受報應其事云何？

地藏答言：千萬世界乃及國土，或有地獄或無地獄；或有女人或無女人；或有佛法或無佛法，乃至聲聞辟支佛亦復如是，非但地獄罪報一等。

摩耶夫人重白菩薩：且願聞於閻浮罪報所感惡趣。地藏答言：聖母，唯願聽受我粗說之。佛母白言：願聖者說。

爾時，地藏菩薩白聖母言：南閻浮提罪報名號如是。

若有衆生不孝父母或至殺害，當墮無間地獄，千萬億劫求出無期。

若有衆生出佛身血，毀謗三寶不敬尊經，亦當墮於無間地獄，千萬億劫求出無期。

若有衆生侵損常住玷污僧尼，或伽藍內恣行婬欲，或殺或害，如是等輩當墮無間地獄，千萬億劫求出無期。

若有衆生偽作沙門心非沙門，破用常住欺誑白衣，違背戒律種種造惡，如是等輩當墮無間地獄，千萬億劫求出無期。

若有衆生偷竊常住財物穀米飲食衣服乃至一物不與取者，當墮無間地獄，千萬億劫求出無期。

地藏白言：聖母，若有衆生作如是罪，當墮五無間地獄求暫停苦一念不得。

摩耶夫人重白地藏菩薩言：云何名為無間地獄？

地藏白言：聖母，諸有地獄在大鐵圍山之內，其大地獄有一十八所，次有五百名號各別，次有千百名字亦別。無間獄者其獄城周匝八萬餘里，其城純鐵高一萬里，城上火聚少有空缺。其獄城中諸獄相連名號各別。獨有一獄名曰無間，其獄周匝萬八千里，獄牆高一千里悉是鐵圍，上火徹下下火徹上。鐵蛇鐵狗吐火馳逐獄牆之上東西而走。獄中有床遍滿萬里。一人受罪自見其身遍臥滿床。千萬人受罪亦各自見身滿床上。衆業所感獲報如是。

又諸罪人備受衆苦。千百夜叉及以惡鬼口牙如劍眼如電光手復銅爪拖拽罪人。復有夜叉執大鐵戟中罪人身，或中口鼻或中腹背。拋空翻接或置床上。復有鐵鷹啗罪人目。復有鐵蛇絞罪人頸。百肢節內悉下長釘，拔舌耕犁抽腸剉斬烊銅灌口熱鐵纏身。萬死千生業感如是。動經億劫求出無期。此界壞時寄生他界，他界次壞轉寄他方，他方壞時輾轉相寄，此界成後還復而來。無間罪報其事如是。

又五事業感故稱無間。何等為五？

@lnbk
一者、日夜受罪以至劫數無時間絕，故稱無間。
二者、一人亦滿多人亦滿，故稱無間。
三者、罪器叉棒鷹蛇狼犬、碓磨鋸鑿剉斫鑊湯、鐵網鐵繩鐵驢鐵馬、生革絡首熱鐵澆身、飢吞鐵丸渴飲鐵汁，從年竟劫數那由他苦楚相連更無間斷，故稱無間。
四者、不問男子女人羌胡夷狄老幼貴賤，或龍或神或天或鬼，罪行業感悉同受之，故稱無間。
五者、若墮此獄，從初入時至百千劫一日一夜萬死萬生求一念間暫住不得，除非業盡方得受生，以此連綿，故稱無間。
@/lnbk

地藏菩薩白聖母言：無間地獄粗說如是。若廣說地獄罪器等名及諸苦事一劫之中求說不盡。摩耶夫人聞已愁憂合掌頂禮而退。

#4 閻浮衆生業感品第四

爾時，地藏菩薩摩訶薩白佛言：世尊，我承佛如來威神力故遍百千萬億世界分是身形救拔一切業報衆生。若非如來大慈力故即不能作如是變化。我今又蒙佛付囑至阿逸多成佛以來六道衆生遣令度脫。唯然世尊願不有慮。

爾時，佛告地藏菩薩：一切衆生未解脫者性識無定，惡習結業善習結果。為善為惡逐境而生。輪轉五道暫無休息，動經塵劫迷惑障難。如魚游網將是長流，脫入暫出又復遭網。以是等輩吾當憂念。汝既畢是往願累劫重誓廣度罪輩，吾復何慮。

說是語時，會中有一菩薩摩訶薩名定自在王白佛言：世尊，地藏菩薩累劫以來各發何願，今蒙世尊慇懃讚歎。唯願世尊略而說之。

爾時，世尊告定自在王菩薩：諦聽，諦聽！善思念之！吾當為汝分別解說。

乃往過去無量阿僧祇那由他不可說劫，爾時有佛號一切智成就如來，應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，其佛壽命六萬劫。未出家時為小國王，與一鄰國王為友，同行十善饒益衆生。其鄰國內所有人民多造衆惡。二王議計廣設方便。一王發願早成佛道當度是輩令使無餘。一王發願若不先度罪苦令是安樂得至菩提我終未願成佛。

佛告定自在王菩薩：一王發願早成佛者即一切智成就如來是。一王發願永度罪苦衆生未願成佛者即地藏菩薩是。

復於過去無量阿僧祇劫有佛出世名清淨蓮華目如來，其佛壽命四十劫。像法之中有一羅漢福度衆生。因次教化，遇一女人字曰光目設食供養。羅漢問之：欲願何等？光目答曰：我以母亡之日資福救拔，未知我母生處何趣？羅漢愍之為入定觀，見光目女母墮在惡趣受極大苦。羅漢問光目言：汝母在生作何行業？今在惡趣受極大苦。光目答言：我母所習唯好食噉魚鱉之屬。所食魚鱉多食其子，或炒或煮恣情食噉計其命數千萬復倍。尊者慈愍，如何哀救？

羅漢愍之為作方便勸光目言：汝可志誠念清淨蓮華目如來，兼塑畫形像存亡獲報。光目聞已即捨所愛，尋畫佛像而供養之，復恭敬心悲泣瞻禮。忽於夜後夢見佛身金色晃耀如須彌山放大光明而告光目：汝母不久當生汝家，纔覺飢寒即當言說。其後家內婢生一子，未滿三日而乃言說。稽首悲泣告於光目：生死業緣果報自受，吾是汝母久處暗冥。自別汝來累墮大地獄。蒙汝福力方得受生為下賤人。又復短命壽年十三更落惡道。汝有何計令吾脫免？光目聞說知母無疑，哽咽悲啼而白婢子：既是我母合知本罪作何行業墮於惡道。婢子答言：以殺害毀罵二業受報。若非蒙福救拔吾難以是業故未合解脫。光目問言：地獄罪報其事云何？婢子答言：罪苦之事不忍稱說百千歲中卒白難竟。

光目聞已啼淚號泣而白空界：願我之母永脫地獄畢十三歲更無重罪及歷惡道。十方諸佛慈哀愍我，聽我為母所發廣大誓願。若得我母永離三途及斯下賤乃至女人之身永劫不受者，願我自今日後對清淨蓮華目如來像前，卻後百千萬億劫中應有世界所有地獄及三惡道諸罪苦衆生，誓願救拔令離地獄惡趣畜生餓鬼等，如是罪報等人盡成佛竟我然後方成正覺。發誓願已具聞清淨蓮華目如來而告之曰：光目，汝大慈愍善能為母發如是大願。吾觀汝母十三歲畢捨此報已生為梵志壽年百歲。過是報後當生無憂國土壽命不可計劫。後成佛果廣度人天數如恆河沙。

佛告定自在王：爾時羅漢福度光目者即無盡意菩薩是。光目母者即解脫菩薩是，光目女者即地藏菩薩是。

過去久遠劫中如是慈愍發恆河沙願廣度衆生。未來世中若有男子女人不行善者行惡者乃至不信因果者、邪婬妄語者、兩舌惡口者、毀謗大乘者，如是諸業衆生必墮惡趣。若遇善知識勸令一彈指間歸依地藏菩薩，是諸衆生即得解脫三惡道報。若能志心歸敬及瞻禮讚歎、香華衣服種種珍寶或復飲食如是奉事者，未來百千萬億劫中常在諸天受勝妙樂。若天福盡下生人間猶百千劫常為帝王，能憶宿命因果本末。

定自在王！如是地藏菩薩有如此不可思議大威神力廣利衆生，汝等諸菩薩當記是經廣宣流布。

定自在王白佛言：世尊，願不有慮。我等千萬億菩薩摩訶薩必能承佛威神廣演是經於閻浮提利益衆生。

定自在王菩薩白世尊已，合掌恭敬作禮而退。

爾時，四方天王俱從座起合掌恭敬白佛言：世尊，地藏菩薩於久遠劫來發如是大願，云何至今猶度未絕更發廣大誓言。唯願世尊為我等說。

佛告四天王：善哉，善哉！吾今為汝及未來現在天人衆等廣利益故說地藏菩薩於娑婆世界閻浮提內生死道中慈哀救拔度脫一切罪苦衆生方便之事。四天王言：唯然世尊，願[樂|ngaau]欲聞。

佛告四天王：地藏菩薩久遠劫來迄至於今度脫衆生猶未畢願慈愍此世罪苦衆生。復觀未來無量劫中因蔓不斷，以是之故又發重願。如是菩薩於娑婆世界閻浮提中百千萬億方便而為教化。

@lnbk
四天王，地藏菩薩
若遇殺生者，說宿殃短命報。
若遇竊盜者，說貧窮苦楚報。
若遇邪婬者，說雀鴿鴛鴦報。
若遇惡口者，說眷屬鬥諍報。
若遇毀謗者，說無舌瘡口報。
若遇瞋恚者，說醜陋癃殘報。
若遇慳吝者，說所求違願報。
若遇飲食無度者，說飢渴咽病報。
若遇畋獵恣情者，說驚狂喪命報。
若遇悖逆父母者，說天地災殺報。
若遇燒山林木者，說狂迷取死報。
若遇前後父母惡毒者，說返生鞭撻現受報。
若遇網捕生雛者，說骨肉分離報。
若遇毀謗三寶者，說盲聾瘖啞報。
若遇輕法慢教者，說永處惡道報。
若遇破用常住者，說億劫輪迴地獄報。
若遇污梵誣僧者，說永在畜生報。
若遇湯火斬斫傷生者，說輪迴遞償報。
若遇破戒犯齋者，說禽獸飢餓報。
若遇非理毀用者，說所求闕絕報。
若遇吾我貢高者，說卑使下賤報。
若遇兩舌鬥亂者，說無舌百舌報。
若遇邪見者，說邊地受生報。
@/lnbk

如是等閻浮提衆生身口意業惡習結果百千報應今粗略說。如是等閻浮提衆生業感差別地藏菩薩百千方便而教化之。是諸衆生先受如是等報後墮地獄動經劫數無有出期。是故汝等護人護國無令是諸衆業迷惑衆生。

四天王聞已涕淚悲歎合掌而退。

#5 地獄名號品第五

爾時，普賢菩薩摩訶薩白地藏菩薩言：仁者，願為天龍四衆及未來現在一切衆生說娑婆世界及閻浮提罪苦衆生所受報處、地獄名號及惡報等事，使未來世末法衆生知是果報。

地藏答言：仁者，我今承佛威神及大士之力略說地獄名號及罪報惡報之事。

@lnbk
仁者，閻浮提東方有山號曰鐵圍，其山黑邃無日月光。
有大地獄號極無間，又有地獄名大阿鼻。復有地獄名曰四角；復有地獄名曰飛刀；
復有地獄名曰火箭；復有地獄名曰夾山；復有地獄名曰通槍；復有地獄名曰鐵車；
復有地獄名曰鐵床；復有地獄名曰鐵牛；復有地獄名曰鐵衣；復有地獄名曰千刃；
復有地獄名曰鐵驢；復有地獄名曰烊銅；復有地獄名曰抱柱；復有地獄名曰流火；
復有地獄名曰耕舌；復有地獄名曰剉首；復有地獄名曰燒腳；復有地獄名曰啗眼；
復有地獄名曰鐵丸；復有地獄名曰諍論；復有地獄名曰鐵鈇；復有地獄名曰多瞋。
@/lnbk

@lnbk
地藏白言：仁者，鐵圍之內有如是等地獄其數無限。更有
叫喚地獄，拔舌地獄，糞尿地獄，銅鎖地獄，火象地獄，火狗地獄，火馬地獄，火牛地獄，
火山地獄，火石地獄，火床地獄，火梁地獄，火鷹地獄，鋸牙地獄，剝皮地獄，飲血地獄，
燒手地獄，燒腳地獄，倒刺地獄，火屋地獄，鐵屋地獄，火狼地獄。
如是等地獄。其中各各復有諸小地獄，或一或二或三或四乃至百千，其中名號各各不同。
@/lnbk

地藏菩薩告普賢菩薩言：仁者，此者皆是南閻浮提行惡衆生業感如是。業力甚大，能敵須彌、能深巨海、能障聖道。是故衆生莫輕小惡以為無罪，死後有報纖毫受之。父子至親歧路各別縱然相逢無肯代受。我今承佛威力略說地獄罪報之事，唯願仁者暫聽是言。

普賢答言：吾已久知三惡道報望仁者說，令後世末法一切惡行衆生聞仁者說使令歸佛。

@lnbk
地藏白言：仁者，地獄罪報其事如是。
或有地獄取罪人舌使牛耕之。
或有地獄取罪人心夜叉食之。
或有地獄鑊湯盛沸煮罪人身。
或有地獄赤燒銅柱使罪人抱。
或有地獄使諸火燒趁及罪人。
或有地獄一向寒冰。或有地獄無限糞尿。或有地獄純飛鈒鑗。
或有地獄多攢火槍。或有地獄唯撞胸背。或有地獄但燒手足。
或有地獄盤繳鐵蛇。或有地獄驅逐鐵狗。或有地獄盡駕鐵騾。
@/lnbk

仁者，如是等報各各獄中有百千種業道之器，無非是銅是鐵是石是火，此四種物衆業行感。若廣說地獄罪報等事一一獄中更有百千種苦楚，何況多獄。我今承佛威神及仁者問略說如是，若廣解說窮劫不盡。

#6 如來讚歎品第六

爾時，世尊舉身放大光明遍照百千萬億恆河沙等諸佛世界，出大音聲普告諸佛世界一切諸菩薩摩訶薩及天龍鬼神人非人等。聽吾今日稱揚讚歎地藏菩薩摩訶薩於十方世界現大不可思議威神慈悲之力救護一切罪苦之事。吾滅度後，汝等諸菩薩大士及天龍鬼神等廣作方便衛護是經，令一切衆生證涅槃樂。

說是語已，會中有一菩薩名曰普廣合掌恭敬而白佛言：今見世尊讚歎地藏菩薩有如是不可思議大威神德，唯願世尊為未來世末法衆生宣說地藏菩薩利益人天因果等事，使諸天龍八部及未來世衆生頂受佛語。

爾時，世尊告普廣菩薩及四衆等：諦聽，諦聽！吾當為汝略說地藏菩薩利益人天福德之事。普廣白言：唯然世尊，願[樂|ngaau]欲聞。

佛告普廣菩薩：未來世中若有善男子善女人聞是地藏菩薩摩訶薩名者，或合掌者、讚歎者、作禮者、戀慕者，是人超越三十劫罪。

普廣，若有善男子善女人或彩畫形像或土石膠漆金銀銅鐵作此菩薩一瞻一禮者，是人百返生於三十三天永不墮於惡道。假如天福盡故下生人間猶為國王不失大利。

若有女人厭女人身，盡心供養地藏菩薩畫像及土石膠漆銅鐵等像如是日日不退，常以華香飲食衣服繒綵幢旛錢寶物等供養。是善女人盡此一報女身百千萬劫更不生有女人世界，何況復受。除非慈願力故要受女身度脫衆生，承斯供養地藏力故及功德力百千萬劫不受女身。

復次普廣，若有女人厭是醜陋多疾病者但於地藏像前志心瞻禮，食頃之間是人千萬劫中所受生身相貌圓滿。是醜陋女人如不厭女身，即百千萬億生中常為王女乃及王妃、宰輔大姓、大長者女，端正受生諸相圓滿。由志心故瞻禮地藏菩薩獲福如是。

復次普廣，若有善男子善女人能對菩薩像前作諸伎[樂|ngo]及歌詠讚歎香華供養，乃至勸於一人多人。如是等輩現在世中及未來世常得百千鬼神日夜衛護，不令惡事輒聞其耳何況親受諸橫。

復次普廣，未來世中若有惡人及惡神惡鬼見有善男子善女人歸敬供養讚歎瞻禮地藏菩薩形像，或妄生譏毀謗無功德及利益事，或露齒笑或背面非，或勸人共非，或一人非或多人非，乃至一念生譏毀者。如是之人賢劫千佛滅度，譏毀之報尚在阿鼻地獄受極重罪。過是劫已方受餓鬼。又經千劫復受畜生。又經千劫方得人身。縱受人身，貧窮下賤諸根不具多被惡業來結其心，不久之間復墮惡道。是故普廣，譏毀他人供養尚獲此報，何況別生惡見毀滅。

復次普廣，若未來世有男子女人久處床枕求生求死了不可得、或夜夢惡鬼乃及家親、或遊險道或多魘寐共鬼神遊、日月歲深轉復尪瘵、眠中叫苦慘悽不樂者，此皆是業道論對未定輕重或難捨壽或不得癒。男女俗眼不辨是事。但當對諸佛菩薩像前高聲轉讀此經一遍。或取病人可愛之物，或衣服寶貝莊園舍宅，對病人前高聲唱言：我某甲等為是病人對經像前捨諸等物，或供養經像或造佛菩薩形像或造塔寺或然油燈或施常住。如是三白病人遣令聞知。

假令諸識分散至氣盡者乃至一日二日三日四日至七日以來但高聲白高聲讀經。是人命終之後宿殃重罪至於五無間罪永得解脫，所受生處常知宿命。何況善男子善女人自書此經或教人書、或自塑畫菩薩形像乃至教人塑畫，所受果報必獲大利。

是故普廣，若見有人讀誦是經乃至一念讚歎是經或恭敬者，汝須百千方便勸是等人懃心莫退，能得未來現在千萬億不可思議功德。

復次普廣，若未來世諸衆生等或夢或寐見諸鬼神乃及諸形，或悲或啼或愁或嘆或恐或怖。此皆是一生十生百生千生過去父母男女弟妹夫妻眷屬在於惡趣未得出離無處希望福力救拔，當告宿世骨肉使作方便願離惡道。普廣，汝以神力遣是眷屬令對諸佛菩薩像前志心自讀此經或請人讀其數三遍或七遍。如是惡道眷屬經聲畢是遍數當得解脫，乃至夢寐之中永不復見。

復次普廣，若未來世有諸下賤等人或奴或婢乃至諸不自由之人覺知宿業要懺悔者。志心瞻禮地藏菩薩形像乃至一七日中念菩薩名可滿萬遍。如是等人盡此報後千萬生中常生尊貴更不經三惡道苦。

復次普廣，若未來世中閻浮提內剎利婆羅門長者居士一切人等及異姓種族有新產者，或男或女，七日之中早與讀誦此不可思議經典，更為念菩薩名可滿萬遍。是新生子，或男或女宿有殃報，便得解脫安樂易養壽命增長。若是承福生者轉增安樂及與壽命。

復次普廣，若未來世衆生於月一日八日十四日十五日十八日二十三、二十四、二十八、二十九日乃至三十日是諸日等諸罪結集定其輕重。南閻浮提衆生舉止動念無不是業無不是罪，何況恣情殺害竊盜邪婬妄語百千罪狀。能於是十齋日對佛菩薩諸賢聖像前讀是經一遍，東西南北百由旬內無諸災難。當此居家若長若幼現在未來百千歲中永離惡趣。能於十齋日每轉一遍，現世令此居家無諸橫病衣食豐溢。是故普廣，當知地藏菩薩有如是等不可說百千萬億大威神力利益之事。

閻浮衆生於此大士有大因緣。是諸衆生聞菩薩名見菩薩像乃至聞是經三字五字或一偈一句者現在殊妙安樂，未來之世百千萬生常得端正生尊貴家。

爾時，普廣菩薩聞佛如來稱揚讚歎地藏菩薩已胡跪合掌復白佛言：世尊，我久知是大士有如此不可思議神力及大誓願力，為未來衆生遣知利益故問如來唯然頂受。世尊，當何名此經使我云何流布？佛告普廣：此經有三名：一名地藏本願，亦名地藏本行，亦名地藏本誓力經。緣此菩薩久遠劫來發大重願利益衆生，是故汝等依願流布。

普廣聞已，合掌恭敬作禮而退。

#7 利益存亡品第七

爾時，地藏菩薩摩訶薩白佛言：世尊，我觀是閻浮衆生舉心動念無非是罪。脫獲善利多退初心。若遇惡緣念念增益。是等輩人如履泥塗負於重石漸困漸重足步深邃。若得遇知識替與減負或全與負。是知識有大力故復相扶助勸令牢腳，若達平地須省惡路無再經歷。

世尊，習惡衆生從纖毫間便至無量。是諸衆生有如此習，臨命終時父母眷屬宜為設福以資前路。或懸旛蓋及然油燈或轉讀尊經或供養佛像及諸聖像乃至念佛菩薩及辟支佛名字一名一號歷臨終人耳根或聞在本識。是諸衆生所造惡業計其感果必墮惡趣，緣是眷屬為臨終人修此聖因如是衆罪悉皆銷滅。若能更為身死之後七七日內廣造衆善，能使是諸衆生永離惡趣得生人天受勝妙樂，現在眷屬利益無量。

是故我今對佛世尊及天龍八部人非人等勸於閻浮提衆生臨終之日慎勿殺害及造惡緣、拜祭鬼神求諸魍魎。何以故？爾所殺害乃至拜祭無纖毫之力利益亡人，但結罪緣轉增深重。假使來世或現在生得獲聖分生人天中，緣是臨終被諸眷屬造是惡因亦令是命終人殃累對辯晚生善處。何況臨命終人在生未曾有少善根各據本業自受惡趣，何忍眷屬更為增業。譬如有人從遠地來絕糧三日所負擔物強過百斤，忽遇鄰人更附少物以是之故轉復困重。

世尊，我觀閻浮衆生但能於諸佛教中乃至善事一毛一渧一沙一塵如是利益悉皆自得。

說是語時會中有一長者名曰大辯，是長者久證無生化度十方現長者身，合掌恭敬問地藏菩薩言：大士，是南閻浮提衆生命終之後小大眷屬為修功德乃至設齋造衆善因，是命終人得大利益及解脫不？

地藏答言：長者，我今為未來現在一切衆生承佛威力略說是事。長者，未來現在諸衆生等臨命終日得聞一佛名一菩薩名一辟支佛名，不問有罪無罪悉得解脫。

若有男子女人在生不修善因多造衆罪，命終之後眷屬小大為造福利一切聖事七分之中而乃獲一、六分功德生者自利。以是之故未來現在善男女等聞健自修分分己獲。無常大鬼不期而到，冥冥遊神未知罪福。七七日內如癡如聾，或在諸司辯論業果，審定之後據業受生。未測之間千萬愁苦，何況墮於諸惡趣等。

是命終人未得受生，在七七日內念念之間望諸骨肉眷屬與造福力救拔；過是日後隨業受報。若是罪人動經千百歲中無解脫日。若是五無間罪墮大地獄，千劫萬劫永受衆苦。

復次長者，如是罪業衆生命終之後眷屬骨肉為修營齋資助業道，未齋食竟及營齋之次米泔菜葉不棄於地乃至諸食未獻佛僧勿得先食。如有違食及不精懃是命終人了不得力。如精懃護淨奉獻佛僧是命終人七分獲一。是故長者，閻浮衆生若能為其父母乃至眷屬命終之後設齋供養志心懃懇，如是之人存亡獲利。

說是語時，忉利天宮有千萬億那由他閻浮鬼神悉發無量菩提之心。大辯長者作禮而退。

#8 閻羅王衆讚歎品第八

@lnbk
爾時，鐵圍山內有無量鬼王與閻羅天子俱詣忉利來到佛所。所謂
惡毒鬼王、多惡鬼王、大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、散殃鬼王、
飛身鬼王、電光鬼王、狼牙鬼王、千眼鬼王、噉獸鬼王、負石鬼王、主耗鬼王、
主禍鬼王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、主獸鬼王、主魅鬼王、
主產鬼王、主命鬼王、主疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目鬼王、
祁利失王、大祁利失王、祁利叉王、大祁利叉王、阿那吒王、大阿那吒王，
如是等大鬼王各各與百千諸小鬼王盡居閻浮提各有所執各有所主。是諸鬼王與閻羅天子承佛威神及地藏菩薩摩訶薩力俱詣忉利在一面立。
@/lnbk

爾時，閻羅天子胡跪合掌白佛言：世尊，我等今者與諸鬼王承佛威神及地藏菩薩摩訶薩力方得詣此忉利大會，亦是我等獲善利故。我今有小疑事敢問世尊。唯願世尊慈悲宣說。

佛告閻羅天子：恣汝所問吾為汝說。

是時閻羅天子瞻禮世尊及迴視地藏菩薩而白佛言：世尊，我觀地藏菩薩在六道中百千方便而度罪苦衆生不辭疲倦。是大菩薩有如是不可思議神通之事，然諸衆生獲脫罪報未久之間又墮惡道。世尊，是地藏菩薩既有如是不可思議神力，云何衆生而不依止善道永取解脫？唯願世尊為我解說。

佛告閻羅天子：南閻浮提衆生其性剛強難調難伏。是大菩薩於百千劫頭頭救拔如是衆生早令解脫。是罪報人乃至墮大惡趣菩薩以方便力拔出根本業緣而遣悟宿世之事。自是閻浮提衆生結惡習重旋出旋入勞斯菩薩久經劫數而作度脫。

譬如有人迷失本家誤入險道，其險道中多諸夜叉及虎狼獅子蚖蛇蝮蠍。如是迷人在險道中須臾之間即遭諸毒。有一知識多解大術善禁是毒乃及夜叉諸惡毒等。忽逢迷人欲進險道而語之言：咄哉男子，為何事故而入此路，有何異術能制諸毒。是迷路人忽聞是語方知險道，即便退步求出此路。是善知識提攜接手引出險道免諸惡毒，至於好道令得安樂。而語之言：咄哉迷人，自今已後勿履是道。此路入者卒難得出復損性命。是迷路人亦生感重。臨別之時知識又言：若見親知及諸路人若男若女，言於此路多諸毒惡喪失性命，無令是衆自取其死。

是故地藏菩薩俱大慈悲救拔罪苦衆生生人天中令受妙樂。是諸罪衆知業道苦，脫得出離永不再歷，如迷路人誤入險道遇善知識引接令出永不復入。逢見他人復勸莫入，自言因是迷故得解脫竟更不復入。若再履踐猶尚迷誤不覺舊曾所落險道或致失命如墮惡趣，地藏菩薩方便力故使令解脫生人天中。旋又再入，若業結重永處地獄無解脫時。

爾時，惡毒鬼王合掌恭敬白佛言：世尊，我等諸鬼王其數無量，在閻浮提或利益人或損害人各各不同。然是業報使我眷屬遊行世界多惡少善。過人家庭或城邑聚落莊園房舍，或有男子女人修毛髮善事乃至懸一旛一蓋少香少華供養佛像及菩薩像，或轉讀尊經燒香供養一句一偈，我等鬼王敬禮是人，如過去現在未來諸佛敕諸小鬼各有大力及土地分便令衛護，不令惡事橫事惡病橫病乃至不如意事近於此舍等處，何況入門。佛讚鬼王：善哉，善哉！汝等及與閻羅能如是擁護善男女等，吾亦告梵王帝釋令衛護汝。

說是語時會中有一鬼王名曰主命白佛言：世尊，我本業緣主閻浮人命生時死時我皆主之，在我本願甚欲利益。自是衆生不會我意致令生死俱不得安。何以故？是閻浮提人初生之時不問男女，或欲生時但作善事增益宅舍，自令土地無量歡喜擁護子母得大安樂利益眷屬。或已生下慎勿殺害取諸鮮味供給產母及廣聚眷屬飲酒食肉歌[樂|ngo]絃管，能令子母不得安樂。何以故？是產難時有無數惡鬼及魍魎精魅欲食腥血。是我早令舍宅土地靈祇荷護子母使令安樂而得利益。如是之人見安樂故便合設福答諸土地翻為殺害聚集眷屬。以是之故犯殃自受子母俱損。

又閻浮提臨命終人，不問善惡，我欲令是命終之人不落惡道，何況自修善根增我力故。是閻浮提行善之人臨命終時亦有百千惡道鬼神或變作父母乃至諸眷屬引接亡人令落惡道，何況本造惡者。世尊，如是閻浮提男子女人臨命終時神識惛昧不辨善惡乃至眼耳更無見聞。是諸眷屬當須設大供養，轉讀尊經念佛菩薩名號。如是善緣能令亡者離諸惡道、諸魔鬼神悉皆退散。世尊，一切衆生臨命終時若得聞一佛名一菩薩名或大乘經典一句一偈。我觀如是輩人，除五無間殺害之罪，小小惡業合墮惡趣者尋即解脫。

佛告主命鬼王：汝大慈故能發如是大願於生死中護諸衆生。若未來世中有男子女人至生死時汝莫退是願總令解脫永得安樂。鬼王白佛言：願不有慮。我畢是形念念擁護閻浮衆生生時死時俱得安樂。但願諸衆生於生死時信受我語無不解脫獲大利益。

爾時，佛告地藏菩薩：是大鬼王主命者已曾經百千生作大鬼王於生死中擁護衆生。是大士慈悲願故現大鬼身實非鬼也。卻後過一百七十劫當得成佛號曰無相如來，劫名安樂，世界名淨住，其佛壽命不可計劫。地藏，是大鬼王其事如是不可思議，所度人天亦不可限量。

#9 稱佛名號品第九

爾時，地藏菩薩摩訶薩白佛言：世尊，我今為未來衆生演利益事於生死中得大利益，唯願世尊聽我說之。

佛告地藏菩薩：汝今欲興慈悲救拔一切罪苦六道衆生演不思議事，今正是時唯當速說。吾即涅槃使汝早畢是願，吾亦無憂現在未來一切衆生。

地藏菩薩白佛言：世尊，過去無量阿僧祇劫有佛出世號無邊身如來。若有男子女人聞是佛名暫生恭敬，即得超越四十劫生死重罪。何況塑畫形像供養讚歎，其人獲福無量無邊。

又於過去恆河沙劫有佛出世號寶性如來。若有男子女人聞是佛名一彈指頃發心歸依，是人於無上道永不退轉。

又於過去有佛出世號波頭摩勝如來。若有男子女人聞是佛名歷於耳根，是人當得千返生於六欲天中，何況志心稱念。

又於過去不可說不可說阿僧祇劫有佛出世號師子吼如來。若有男子女人聞是佛名一念歸依，是人得遇無量諸佛摩頂授記。

又於過去有佛出世號拘留孫佛。若有男子女人聞是佛名志心瞻禮或復讚歎，是人於賢劫千佛會中為大梵王得授上記。

又於過去有佛出世號毘婆尸佛。若有男子女人聞是佛名，永不墮惡道，常生人天受勝妙樂。

又於過去無量無數恆河沙劫有佛出世號寶勝如來。若有男子女人聞是佛名，畢竟不墮惡道，常在天上受勝妙樂。

又於過去有佛出世號寶相如來。若有男子女人聞是佛名生恭敬心，是人不久得阿羅漢果。

又於過去無量阿僧祇劫有佛出世號袈裟幢如來。若有男子女人聞是佛名者，超一百大劫生死之罪。

又於過去有佛出世號大通山王如來。若有男子女人聞是佛名者，是人得遇恆河沙佛廣為說法必成菩提。

又於過去有淨月佛、山王佛、智勝佛、淨名王佛、智成就佛、無上佛、妙聲佛、滿月佛、月面佛，有如是等不可說佛。世尊，現在未來一切衆生若天若人若男若女但念得一佛名號功德無量，何況多名。

是衆生等生時死時自得大利終不墮惡道。若有臨命終人家中眷屬乃至一人為是病人高聲念一佛名，是命終人，除五無間罪，餘業報等悉得銷滅。是五無間罪雖至極重動經億劫了不得出，承斯臨命終時他人為其稱念佛名於是罪中亦漸銷滅。何況衆生自稱自念獲福無量滅無量罪。

#10 校量布施功德緣品第十

爾時，地藏菩薩摩訶薩承佛威神從座而起胡跪合掌白佛言：世尊，我觀業道衆生校量布施有輕有重，有一生受福有十生受福，有百生千生受大福利者。是事云何，唯願世尊為我說之。

爾時，佛告地藏菩薩：吾今於忉利天宮一切衆會說閻浮提布施較量功德輕重，汝當諦聽吾為汝說。地藏白佛言：我疑是事，願[樂|ngaau]欲聞。

佛告地藏菩薩：南閻浮提有諸國王宰輔大臣大長者大剎利大婆羅門等，若遇最下貧窮乃至癃殘瘖啞、聾癡無目如是種種不完具者。是大國王等欲布施時若能具大慈悲下心含笑親手遍布施或使人施，軟言慰喻，是國王等所獲福利如布施百恆河沙佛功德之利。何以故？緣是國王等於是最貧賤輩及不完具者發大慈心，是故福利有如此報。百千生中常得七寶具足，何況衣食受用。

復次地藏，若未來世有諸國王至婆羅門等遇佛塔寺或佛形像乃至菩薩聲聞辟支佛像躬自營辦供養布施。是國王等當得三劫為帝釋身受勝妙樂。若能以此布施福利迴向法界是大國王等於十劫中常為大梵天王。

復次地藏，若未來世有諸國王至婆羅門等遇先佛塔廟或至經像毀壞破落乃能發心修補。是國王等或自營辦或勸他人乃至百千人等布施結緣，是國王等百千生中常為轉輪王身。如是他人同布施者百千生中常為小國王身。更能於塔廟前發迴向心，如是國王乃及諸人盡成佛道，以此果報無量無邊。

復次地藏，未來世中有諸國王及婆羅門等見諸老病及生產婦女若一念間具大慈心布施醫藥飲食臥具使令安樂，如是福利最不思議，一百劫中常為淨居天主，二百劫中常為六欲天主，畢竟成佛永不墮惡道，乃至百千生中耳不聞苦聲。

復次地藏，若未來世中有諸國王及婆羅門等能作如是布施獲福無量。更能迴向，不問多少畢竟成佛，何況帝釋、梵、轉輪之報。是故地藏，普勸衆生當如是學。

復次地藏，未來世中若善男子善女人於佛法中種少善根毛髮沙塵等許所受福利不可為喻。

復次地藏，未來世中若有善男子善女人遇佛形像菩薩形像辟支佛形像轉輪王形像布施供養得無量福，常在人天受勝妙樂。若能迴向法界是人福利不可為喻。

復次地藏，未來世中若有善男子善女人遇大乘經典或聽聞一偈一句發慇重心讚歎恭敬布施供養。是人獲大果報無量無邊。若能迴向法界其福不可為喻。

復次地藏，若未來世中有善男子善女人遇佛塔寺大乘經典，新者布施供養瞻禮讚歎恭敬合掌。若遇故者或毀壞者修補營理，或獨發心或勸多人同共發心。如是等輩三十生中常為諸小國王，檀越之人常為輪王，還以善法教化諸小國王。

復次地藏，未來世中若有善男子善女人於佛法中所種善根，或布施供養或修補塔寺或裝理經典乃至一毛一塵一沙一渧，如是善事但能迴向法界是人功德百千生中受上妙樂。如但迴向自家眷屬或自身利益，如是之果即三生受樂捨一得萬報。是故地藏，布施因緣其事如是。

#11 地神護法品第十一

爾時，堅牢地神白佛言：世尊，我從昔來瞻視頂禮無量菩薩摩訶薩皆是大不可思議神通智慧廣度衆生。是地藏菩薩摩訶薩於諸菩薩誓願深重。世尊，是地藏菩薩於閻浮提有大因緣。如文殊普賢觀音彌勒亦化百千身形度於六道其願尚有畢竟。是地藏菩薩教化六道一切衆生所發誓願劫數如千百億恆河沙。

@lnbk
世尊，我觀未來及現在衆生於所住處於南方清潔之地以土石竹木作其龕室，是中能塑畫乃至金銀銅鐵作地藏形像燒香供養瞻禮讚歎。是人居處即得十種利益。何等為十：
　一者土地豐壤；二者家宅永安；三者先亡生天；四者現存益壽；五者所求遂意；
　六者無水火災；七者虛耗辟除；八者杜絕惡夢；九者出入神護；十者多遇聖因。
@/lnbk

世尊，未來世中及現在衆生若能於所住處方面作如是供養得如是利益。

復白佛言：世尊，未來世中若有善男子善女人於所住處有此經典及菩薩像，是人更能轉讀經典供養菩薩，我常日夜以本神力衛護是人乃至水火盜賊大橫小橫一切惡事悉皆銷滅。

佛告堅牢地神：汝大神力諸神少及。何以故？閻浮土地悉蒙汝護，乃至草木沙石、稻麻竹葦、穀米寶貝從地而有皆因汝力。又常稱揚地藏菩薩利益之事。汝之功德及以神通百千倍於常分地神。若未來世中有善男子善女人供養菩薩及轉讀是經但依地藏本願經一事修行者，汝以本神力而擁護之，勿令一切災害及不如意事輒聞於耳，何況令受。非但汝獨護是人故，亦有釋梵眷屬諸天眷屬擁護是人。何故得如是聖賢擁護？皆由瞻禮地藏形像及轉讀是本願經故自然畢竟出離苦海證涅槃樂。以是之故得大擁護。

#12 見聞利益品第十二

@lnbk
爾時，世尊從頂門上放百千萬億大毫相光，所謂
白毫相光、大白毫相光、瑞毫相光、大瑞毫相光、玉毫相光、大玉毫相光、
紫毫相光、大紫毫相光、青毫相光、大青毫相光、碧毫相光、大碧毫相光、
紅毫相光、大紅毫相光、綠毫相光、大綠毫相光、金毫相光、大金毫相光、
慶雲毫相光、大慶雲毫相光、
千輪毫光、大千輪毫光、寶輪毫光、大寶輪毫光、日輪毫光、大日輪毫光、
月輪毫光、大月輪毫光、宮殿毫光、大宮殿毫光、海雲毫光、大海雲毫光。
@/lnbk

於頂門上放如是等毫相光已，出微妙音告諸大衆天龍八部人非人等：聽吾今日於忉利天宮稱揚讚歎地藏菩薩於人天中利益等事、不思議事、超聖因事、證十地事、畢竟不退阿耨多羅三藐三菩提事。

說是語時會中有一菩薩摩訶薩名觀世音從座而起胡跪合掌白佛言：世尊，是地藏菩薩摩訶薩具大慈悲憐愍罪苦衆生，於千萬億世界化千萬億身。所有功德及不思議威神之力，我聞世尊與十方無量諸佛異口同音讚歎地藏菩薩云：正使過去現在未來諸佛說其功德猶不能盡。向者又蒙世尊普告大衆欲稱揚地藏利益等事。唯願世尊為現在未來一切衆生稱揚地藏不思議事令天龍八部瞻禮獲福。

佛告觀世音菩薩：汝於娑婆世界有大因緣。若天若龍若男若女若神若鬼乃至六道罪苦衆生聞汝名者、見汝形者、戀慕汝者、讚歎汝者，是諸衆生於無上道必不退轉，常生人天具受妙樂，因果將熟遇佛受記。汝今具大慈悲憐愍衆生及天龍八部，聽吾宣說地藏菩薩不思議利益之事。汝當諦聽吾今說之。觀世音言：唯然世尊，願[樂|ngaau]欲聞！

佛告觀世音菩薩：未來現在諸世界中有天人受天福盡有五衰相現或有墮於惡道之者。如是天人若男若女當現相時或見地藏菩薩形像或聞地藏菩薩名一瞻一禮。是諸天人轉增天福受大快樂永不墮三惡道報。何況見聞菩薩以諸香華衣服飲食寶貝瓔珞布施供養所獲功德福利無量無邊。

復次觀世音，若未來現在諸世界中六道衆生臨命終時得聞地藏菩薩名一聲歷耳根者是諸衆生永不歷三惡道苦。何況臨命終時父母眷屬將是命終人舍宅財物寶貝衣服塑畫地藏形像，或使病人未終之時眼耳見聞，知道眷屬將舍宅寶貝等為其自身塑畫地藏菩薩形像。是人若是業報合受重病者承斯功德尋即除愈壽命增益。是人若是業報命盡應有一切罪障業障合墮惡趣者承斯功德命終之後即生人天受勝妙樂，一切罪障皆悉銷滅。

復次觀世音菩薩，若未來世有男子女人或乳哺時或三歲五歲十歲以下亡失父母乃及亡失兄弟姐妹，是人年既長大思憶父母及諸眷屬不知落在何趣生何世界生何天中。是人若能塑畫地藏菩薩形像乃至聞名一瞻一禮一日至七日莫退初心聞名見形瞻禮供養。是人眷屬，假因業故墮惡趣者計當劫數，承斯男女兄弟姊妹塑畫地藏形像瞻禮功德尋即解脫生人天中受勝妙樂。是人眷屬如有福力已生人天受勝妙樂者即承斯功德轉增聖因受無量樂。

是人更能三七日中一心瞻禮地藏形像念其名字滿於萬遍當得菩薩現無邊身具告是人眷屬生界。或於夢中菩薩現大神力親領是人於諸世界見諸眷屬。更能每日念菩薩名千遍至於千日是人當得菩薩遣所在土地鬼神終身衛護，現世衣食豐溢無諸疾苦乃至橫事不入其門，何況及身。是人畢竟得菩薩摩頂授記。

復次觀世音菩薩，若未來世有善男子善女人欲發廣大慈心救度一切衆生者，欲修無上菩提者，欲出離三界者。是諸人等見地藏形像及聞名者至心歸依，或以香華衣服寶貝飲食供養瞻禮。是善男女等所願速成永無障礙。

復次觀世音，若未來世有善男子善女人欲求現在未來百千萬億等願、百千萬億等事，但當歸依瞻禮供養讚歎地藏菩薩形像，如是所願所求悉皆成就。復願地藏菩薩具大慈悲永擁護我是人於睡夢中即得菩薩摩頂授記。

復次觀世音菩薩，若未來世善男子善女人於大乘經典深生珍重發不思議心欲讀欲誦。縱遇明師教視令熟旋得旋忘動經年月不能讀誦。是善男子等有宿業障未得消除故於大乘經典無讀誦性。如是之人聞地藏菩薩名見地藏菩薩像，具以本心恭敬陳白，更以香華衣服飲食一切玩具供養菩薩。以淨水一盞經一日一夜安菩薩前，然後合掌請服回首向南，臨入口時至心鄭重。服水既畢慎五辛酒肉邪婬妄語及諸殺害一七日或三七日。是善男子善女人於睡夢中具見地藏菩薩現無邊身於是人處授灌頂水。其人夢覺即獲聰明，應是經典一歷耳根即當永記更不忘失一句一偈。

復次觀世音菩薩，若未來世有諸人等衣食不足、求者乖願、或多病疾、或多凶衰、家宅不安、眷屬分散，或諸橫事多來忤身、睡夢之間多有驚怖。如是人等聞地藏名見地藏形至心恭敬念滿萬遍，是諸不如意事漸漸銷滅、即得安樂、衣食豐溢，乃至於睡夢中悉皆安樂。

復次觀世音菩薩，若未來世有善男子善女人或因治生、或因公私、或因生死、或因急事入山林中、過渡河海、乃及大水或經險道。是人先當念地藏菩薩名萬遍，所過土地鬼神衛護，行住坐臥永保安樂乃至逢於虎狼師子一切毒害不能損之。

佛告觀世音菩薩：是地藏菩薩於閻浮提有大因緣，若說於諸衆生見聞利益等事百千劫中說不能盡。是故觀世音，汝以神力流布是經令娑婆世界衆生百千萬劫永受安樂。

爾時世尊而說偈言：

@4
　吾觀地藏威神力，|恆河沙劫說難盡，|見聞瞻禮一念間，|利益人天無量事。
　若男若女若龍神，|報盡應當墮惡道，|至心歸依大士身，|壽命轉增除罪障。
-
　少失父母恩愛者，|未知魂神在何趣，|兄弟姊妹及諸親，|生長以來皆不識。
　或塑或畫大士身，|悲戀瞻禮不暫捨，|三七日中念其名，|菩薩當現無邊體，
　示其眷屬所生界，|縱墮惡趣尋出離。|若能不退是初心，|即獲摩頂受聖記。
-
　欲修無上菩提者，|乃至出離三界苦。|是人既發大悲心，|先當瞻禮大士像，
　一切諸願速成就，|永無業障能遮止。
-
　有人發心念經典，|欲度群迷超彼岸，|雖立是願不思議，|旋讀旋忘多廢失，
　斯人有業障惑故，|於大乘經不能記。|供養地藏以香華，|衣服飲食諸玩具，
　以淨水安大士前，|一日一夜求服之，|發慇重心慎五辛，|酒肉邪婬及妄語，
　三七日內勿殺害，|至心思念大士名。|即於夢中見無邊，|覺來便得利根耳，
　應是經教歷耳聞，|千萬生中永不忘。|以是大士不思議，|能使斯人獲此慧。
-
　貧窮衆生及疾病，|家宅凶衰眷屬離。|睡夢之中悉不安，|求者乖違無稱遂。
　至心瞻禮地藏像，|一切惡事皆銷滅。|至於夢中盡得安，|衣食豐饒神鬼護。
-
　欲入山林及渡海，|毒惡禽獸及惡人，|惡神惡鬼并惡風，|一切諸難諸苦惱。
　但當瞻禮及供養，|地藏菩薩大士像，|如是山林大海中，|應是諸惡皆銷滅。
-
　觀音至心聽吾說，|地藏無盡不思議，|百千萬劫說不周，|廣宣大士如是力。
　地藏名字人若聞，|乃至見像瞻禮者，|香華衣服飲食奉，|供養百千受妙樂。
　若能以此迴法界，|畢竟成佛超生死。|是故觀音汝當知，|普告恆沙諸國土。
@/

#13 囑累人天品第十三

爾時，世尊舉金色臂又摩地藏菩薩摩訶薩頂而作是言：地藏，地藏，汝之神力不可思議、汝之慈悲不可思議、汝之智慧不可思議、汝之辯才不可思議。正使十方諸佛讚歎宣說汝之不思議事千萬劫中不能得盡。

地藏、地藏，記吾今日在忉利天中於百千萬億不可說不可說一切諸佛菩薩天龍八部大會之中，再以人天諸衆生等未出三界在火宅中者付囑於汝。無令是諸衆生墮惡趣中一日一夜，何況更落五無間及阿鼻地獄，動經千萬億劫無有出期。

地藏，是南閻浮提衆生志性無定習惡者多，縱發善心須臾即退，若遇惡緣念念增長。以是之故吾分是形百千億化度隨其根性而度脫之。

地藏，吾今慇懃以天人衆付囑於汝。未來之世若有天人及善男子善女人於佛法中種少善根一毛一塵一沙一渧，汝以道力擁護是人漸修無上勿令退失。

復次地藏，未來世中若天若人隨業報應落在惡趣，臨墮趣中或至門首，是諸衆生若能念得一佛名一菩薩名一句一偈大乘經典，是諸衆生汝以神力方便救拔，於是人所現無邊身為碎地獄遣令生天受勝妙樂。

@lnbk
爾時世尊而說偈言：
　現在未來天人衆，吾今慇懃付囑汝，以大神通方便度，勿令墮在諸惡趣。
@/lnbk

爾時，地藏菩薩摩訶薩胡跪合掌白佛言：世尊，唯願世尊不以為慮。未來世中若有善男子善女人於佛法中一念恭敬，我亦百千方便度脫是人於生死中速得解脫。何況聞諸善事念念修行自然於無上道永不退轉。

說是語時會中有一菩薩名虛空藏白佛言：世尊，我自至忉利聞於如來讚歎地藏菩薩威神勢力不可思議。未來世中若有善男子善女人乃及一切天龍聞此經典及地藏名字或瞻禮形像，得幾種福利？唯願世尊為未來現在一切衆等略而說之。

佛告虛空藏菩薩：諦聽，諦聽！吾當為汝分別說之。若未來世有善男子善女人見地藏形像及聞此經乃至讀誦，香華飲食衣服珍寶布施供養讚歎瞻禮，得二十八種利益：

@4
一者天龍護念，|二者善果日增，|三者集聖上因，|四者菩提不退，
五者衣食豐足，|六者疾疫不臨，|七者離水火災，|八者無盜賊厄，
九者人見欽敬，|十者神鬼助持，|十一者女轉男身，|十二者為王臣女，
十三者端正相好，|十四者多生天上，|十五者或為帝王，|十六者宿智命通，
十七者有求皆從，|十八者眷屬歡樂，|十九者諸橫銷滅，|二十者業道永除，
二十一者去處盡通，|二十二者夜夢安樂，|二十三者先亡離苦，|二十四者宿福受生，
二十五者諸聖讚歎，|二十六者聰明利根，|二十七者饒慈愍心，|二十八者畢竟成佛。
@/

復次虛空藏菩薩，若現在未來天龍鬼神聞地藏名禮地藏形或聞地藏本願事行讚歎瞻禮，得七種利益：

@4
一者速超聖地，|二者惡業銷滅，|三者諸佛護臨，|四者菩提不退，
五者增長本力，|六者宿命皆通，|七者畢竟成佛。
@/

爾時，十方一切諸來不可說不可說諸佛如來及大菩薩天龍八部聞釋迦牟尼佛稱揚讚歎地藏菩薩大威神力不可思議，歎未曾有。

是時，忉利天雨無量香華天衣珠瓔供養釋迦牟尼佛及地藏菩薩已，一切衆會俱復瞻禮，合掌而退。`,

[ '忉利天宮神通品第一',
  '分身集會品第二',
  '觀衆生業緣品第三',
  '閻浮衆生業感品第四',
  '地獄名號品第五',
  '如來讚歎品第六',
  '利益存亡品第七',
  '閻羅王衆讚歎品第八',
  '稱佛名號品第九',
  '校量布施功德緣品第十',
  '地神護法品第十一',
  '見聞利益品第十二',
  '囑累人天品第十三'
]).setTOCBreak(5);
