new GDHReader('各種短文',
`
#= 供養
一切佛法僧寶，體常徧滿，無所不在。
▹ 願令以此香華，等同法性，普熏一切諸佛剎土，施作佛事。
十方一切供具，無時不有，我今當以十方所有一切種種香華瓔珞、
　　幢幡寶蓋、諸珍妙飾、種種音[樂|ngo]、燈明燭火、飲食衣服、
　　臥具湯藥，乃至盡十方所有一切種種莊嚴供養之具。
憶想遙擬，普共衆生奉獻供養。
一切世界中有脩供養者，我今隨喜。
若未脩供養者，願得開導令脩供養。

#= 香讚
爐香乍熱　法界蒙熏　諸佛海會悉遙聞
隨處結祥雲　誠意方殷　諸佛現全身
南無　香雲蓋菩薩摩訶薩

#= 南無三寶
南無十方一切諸佛
南無十方一切法藏
南無十方一切賢聖

#= 南無釋迦牟尼佛
南無　娑婆世界　三界導師
四生慈父　人天教主　三類化身
本師釋迦牟尼佛

#= 開經偈
無上甚深微妙法
百千萬劫難遭遇
我今見聞得受持
願解如來真實義

#= 蓮池讚
蓮池海會　彌陀如來　觀音勢至坐蓮臺
接引上金階　大誓弘開　普願離塵埃
南無蓮池海會佛菩薩（三稱）

#= 阿彌陀佛身金色偈
@2
阿彌陀佛身金色|相好光明無等倫
白毫宛轉五須彌|紺目澄清四大海
光中化佛無數億|化菩薩眾亦無邊
四十八願度眾生|九品咸令登彼岸
@/

#= 無量壽佛讚
@2
無量壽佛甘露王|威德願力難量
洪名虔稱消災障|化火宅為清涼
菩提心中接佛光|福慧善根自長
一向專念莫徬徨|勤薰戒定香
信願行是三資糧|苦海得慈航
@/
南無西方極樂世界大慈大悲大願大力接引師阿彌陀佛

#= 西方迴向偈
@2
願生西方淨土中|九品蓮華為父母
華開見佛悟無生|不退菩薩為伴侶
@/

#= 三自皈依
@4
自皈依佛|當願衆生|體解大道|發無上心
自皈依法|當願衆生|深入經藏|智慧如海
自皈依僧|當願衆生|統理大衆|一切無礙
@/

#= 普賢十願
@5
禮敬諸佛|稱讚如來|廣修供養|懺悔業障|隨喜功德
請轉法輪|請佛住世|常隨佛學|恆順衆生|普皆迴向
@/

#= 懺悔滅罪偈
@2
我昔所造諸惡業|皆由無始貪瞋癡
從身語意之所生|一切我今皆懺悔
@/

#= 發四宏願
@2
衆生無邊誓願度|煩惱無盡誓願斷
法門無量誓願學|佛道無上誓願成
@/

#= 迴向偈
@2
願以此功德|莊嚴佛淨土
上報四重恩|下濟三途苦
若有見聞者|同發菩提心
願此一報身|同生極樂國
@/

#= 普願文
@5
天下和順|日月清明|風雨以時|災厲不起
國豐民安|兵戈無用|崇德興仁|務修禮讓
國無盜賊|無有冤枉|強不淩弱|各得其所
+祝願法界一切有情，所有六道四生
|宿世怨親|現世業債|咸憑法力|悉得解脫
祝願現生者|增福延壽|發菩提心|常隨佛學|勤修精進
|利濟群生
祝願已故者|往生淨土|同出苦輪|共登覺岸
@/

#= 禮敬三寶
@3
一切三寶|體常徧滿|無所不在
衆生迷惑|流轉可哀
我為衆生|翻迷歸悟|禮敬三寶
@/

#= 皈依三寶
@2
皈依佛|二足尊
皈依法|離欲尊
皈依僧|衆中尊
@/

#= 看破放下
@5
真誠|清淨|平等|正覺|慈悲
看破|放下|自在|隨緣|念佛
@/

#= 覺林菩薩偈
@4
譬如工畫師，|分布諸彩色。|虛妄取異相，|大種無差別。
大種中無色，|色中無大種。|亦不離大種，|而有色可得。
心中無彩畫，|彩畫中無心。|然不離於心，|有彩畫可得。
彼心恒不住，|無量難思議。|示現一切色，|各各不相知。
譬如工畫師，|不能知自心。|而由心故畫，|諸法性如是。
心如工畫師，|能畫諸世間。|五蘊悉從生，|無法而不造。
如心佛亦爾，|如佛眾生然。|應知佛與心，|體性皆無盡。
若人知心行，|普造諸世間。|是人則見佛，|了佛真實性。
心不住於身，|身亦不住心。|而能作佛事，|自在未曾有。
若人欲了知，|三世一切佛。|應觀法界性，|一切唯心造。
@/

#= 空有同俱
有是緣起，空是體性，是[名|meng]緣起性空。

#= 妄心
@lnbk
因心生境，因境生心；
心生種種法，法生種種心。
心外無法，法外無心。
@/lnbk

#= 破我相即破我見
@lnbk
我相因我見生，我見以我相顯。
一表一裡，從來不離。
破我相即是破我見也。
@/lnbk

一切法皆不能自有，但依妄心分別故有。

#= 閻浮衆生、業力甚大、三不可思議
@3
是閻浮衆生|舉心動念|無非是罪
|脫獲善利|多退初心
|若遇惡緣|念念增益
@/

業力甚大，能敵須彌，能深巨海，能障聖道。

佛力不可思議，法力不可思議，自性功德力不可思議。

#= 地藏菩薩讚
@2
稽首本然淨心地|無盡佛藏大慈尊
南方世界湧香雲|香雨花雲及花雨
寶雨寶雲無數種|為祥為瑞遍莊嚴
天人問佛是何因|佛言地藏菩薩至
三世如來同讚歎|十方菩薩共皈依
我今宿植善因緣|稱揚地藏真功德
慈因積善|誓救眾生
手中金錫|振開地獄之門
掌上明珠|光攝大千世界
智慧音裡|吉祥雲中
為閻浮提苦眾生|作大證明功德主
@/
大悲大願　大聖大慈　本尊地藏菩薩摩訶薩

#= 地藏王讚
@2
地藏菩薩妙難倫|化現金容處處分
三塗六道聞妙法|四生十類蒙慈恩
明珠照耀天堂路|金錫振開地獄門
累劫親姻蒙接引|九蓮臺畔禮慈尊
@/
南無九華山幽冥世界　大慈大悲　地藏王菩薩
南無地藏王菩薩

#= 觀世音菩薩讚
@2
觀音菩薩妙難酬|清淨莊嚴累劫修
三十二應周塵刹|百千萬劫化閻浮
瓶中甘露常遍洒|手內楊枝不計秋
千處祈求千處應|苦海常作度人舟
@/
南無普陀琉璃世界 大慈大悲觀世音菩薩
南無觀世音菩薩

#= 大悲咒發願文
@2
稽首觀音大悲主|願力洪深相好身
千臂莊嚴普護持|千眼光明遍觀照
真實語中宣密語|無為心內起悲心
速令滿足諸希求|永使滅除諸罪業
龍天聖衆同慈護|百千三昧頓熏修
受持身是光明幢|受持心是神通藏
洗滌塵勞願濟海|超證菩提方便門
我今稱誦誓歸依|所願從心悉圓滿
南無大悲觀世音|願我速知一切法
南無大悲觀世音|願我早得智慧眼
南無大悲觀世音|願我速度一切衆
南無大悲觀世音|願我早得善方便
南無大悲觀世音|願我速乘般若船
南無大悲觀世音|願我早得越苦海
南無大悲觀世音|願我速得戒定道
南無大悲觀世音|願我早登涅槃山
南無大悲觀世音|願我速會無為舍
南無大悲觀世音|願我早同法性身
@/
@2
我若向刀山|刀山自摧折
我若向火湯|火湯自枯竭
我若向地獄|地獄自消滅
我若向餓鬼|餓鬼自飽滿
我若向修羅|惡心自調伏
我若向畜生|自得大智慧
@/

#= 楞嚴咒發願文等
@2
妙湛總持不動尊|首楞嚴王世稀有
銷我億劫顛倒想|不歷僧祇獲法身
願今得果成寶王|還度如是恆沙眾
將此身心奉塵剎|是則名為報佛恩
伏請世尊為證明|五濁惡世誓先入
如一眾生未成佛|終不於此取泥洹
大雄大力大慈悲|希更審除微細惑
令我早登無上覺|於十方界坐道場
舜若多性可銷亡|爍迦羅心無動轉
@/
南無常住十方佛
南無常住十方法
南無常住十方僧
南無釋迦牟尼佛
南無佛頂首楞嚴
南無觀世音菩薩
南無金剛藏菩薩

爾時世尊 從肉髻中 湧百寶光
光中湧出 千葉寶蓮 有化如來
坐寶華中 頂放十道 百寶光明
一一光明 皆遍示現 十恆河沙
金剛密跡 擎山持杵 遍虛空界
大眾仰觀 畏愛兼抱 求佛哀祐
一心聽佛 無見頂相 放光如來
宣說神咒

#= 奉請八金剛
@2
奉請青除災金剛|奉請辟　毒金剛
奉請黃隨求金剛|奉請白淨水金剛
奉請赤聲火金剛|奉請定持災金剛
奉請紫　賢金剛|奉請大　神金剛
@/

#= 奉請四金剛菩薩
奉請金剛眷菩薩@
奉請金剛索菩薩@
奉請金剛愛菩薩@
奉請金剛語菩薩

#= 金剛經發願文
@2
稽首三界尊，|皈命十方佛
我今發宏願，|持此金剛經
上報四重恩，|下濟三塗苦
若有見聞者，|悉發菩提心
盡此一報身，|同生極樂國
@/

#= 云何梵
@2
云何得長壽，|金剛不壞身
復以何因緣，|得大堅固力
云何於此經，|究竟到彼岸
願佛開微密，|廣為眾生說
+南無本師釋迦牟尼佛 (三稱)
@/

#= 金剛讚
@lnbk
斷疑生信。絕相超宗。
頓忘人法解真空。
般若味重重。
四句融通。福德嘆無窮。
南無金剛會上佛菩薩。(三稱)
@/lnbk

#= 地藏菩薩論念佛往生
@lnbk
「復次若人欲生他方現在淨國者
應當隨彼世界佛之名字 專意誦念一心不亂
如上觀察者決定得生彼佛淨國善根增長 速獲不退
當知如上一心繫念思惟諸佛平等法身 一切善根中 其業最勝」
《占察善惡業報經》
@/lnbk

#= 金剛經摘要
一切諸佛，及諸佛阿耨多羅三藐三菩提法，皆從此經出。

爾時，世尊食時，著衣持缽，入舍衛大城乞食。
於其城中，次第乞已，還至本處。
飯食訖，收衣缽，洗足已，敷座而坐。

諸菩薩摩訶薩應如是降伏其心。所有一切眾生之類，若卵生、若胎生、若濕生、若化生， \
若有色、若無色、若有想、若無想、若非有想、非無想，我皆令入無餘涅槃而滅度之。 \
如是滅度無量無數無邊眾生，實無眾生得滅度者。 \
若菩薩有我相、人相、衆生相、壽者相，即非菩薩。

若菩薩不住相布施，其福德不可思量。

凡所有相，皆是虛妄。若見諸相非相，即見如來。

應無所住，而生其心。

一切法皆是佛法。

過去心不可得，現在心不可得，未來心不可得。

@lnbk
若人言：如來有所說法，即為謗佛，不能解我所說故。
說法者，無法可說，是[名|meng]說法。
@/lnbk

@lnbk
有我者，即非有我，而凡夫之人以為有我。
凡夫者，如來說即非凡夫，是[名|meng]凡夫。
@/lnbk

菩薩所作福德，不應貪著，是故說不受福德。

不取於相，如如不動。

一切有為法，如夢幻泡影，如露亦如電，應作如是觀。

#= 壇經摘要
佛者覺也。法者正也。僧者淨也。

@2
菩提本無樹|明鏡亦非臺
本來無一物|何處惹塵埃
@/

@lnbk
何期自性，本自清淨。
何期自性，本不生滅。
何期自性，本自具足。
何期自性，本無動搖。
何期自性，能生萬法。
@/lnbk

但持《金剛經》，即自見性，直了成佛。

菩提自性，本來清淨，但用此心，直了成佛。

自心常生智慧，不離自性，即是福田。

@lnbk
無上菩提，須得言下，識自本心，見自本性，不生不滅，
於一切時中，念念自見，萬法無滯。
@/lnbk

不是風動，不是幡動，仁者已動。

迷人口說，智者心行。

迷時師度，悟了自度。度名雖一，用處不同。只合自性自度。

@lnbk
若真修道人，不見世間過。
若見他人非，自非卻是左。
他非我不非，我非自有過。
但自卻非心，打除煩惱破。
@/lnbk

吾之所見，常見自心過愆，不見他人是非好惡，是以亦見亦不見。

見性是功，平等是德。念念無滯，常見本性，真實妙用，[名|meng]為功德。

但一切善惡，都莫思量，自然得入清淨心體，湛然常寂，妙用恒沙。

#= 得明教義
@lnbk
多讀大乘以廣其心
勤修觀行以銷其障
常求加被以開其慧
@/lnbk
`)
.useLineBreak()
.useHrBeforeTitle();

