new GDHReader('各種短文',
`
#= 開經偈

無上甚深微妙法 百千萬劫難遭遇
我今見聞得受持 願解如來真實義

#= 迴向文

願以此功德 莊嚴佛淨土
上報四重恩 下濟三途苦
若有見聞者 同發菩提心
願此一報身 同生極樂國

#= 懺悔滅罪偈

我昔所造諸惡業 皆由無始貪瞋癡 從身語意之所生 一切我今皆懺悔

#= 看破放下

真誠　清淨　平等　正覺　慈悲　看破　放下　自在　隨緣　念佛

#= 覺林菩薩偈

若人欲了知　三世一切佛　應觀法界性　一切唯心造

#= 空有同俱

有是緣起，空是體性，是名緣起性空。

#= 妄心

因心生境，因境生心；心生種種法，法生種種心。心外無法，法外無心。

#= 破我相即破我見

我相因我見生，我見以我相顯。一表一裡，從來不離。破我相即是破我見也。

一切法皆不能自有，但依妄心分別故有。

#= 閻浮衆生、業力甚大、三不可思議

是閻浮衆生，舉心動念，無非是罪。脫獲善利，多退初心。若遇惡緣，念念增益。

業力甚大，能敵須彌，能深巨海，能障聖道。

佛力不可思議，法力不可思議，自性功德力不可思議。

#= 南無釋迦牟尼佛

南無　娑婆世界　三界導師　四生慈父　人天教主　三類化身　本師釋迦牟尼佛

#= 地藏菩薩讚

稽首本然淨心地　無盡佛藏大慈尊　南方世界湧香雲　香雨花雲及花雨
寶雨寶雲無數種　為祥為瑞遍莊嚴　天人問佛是何因　佛言地藏菩薩至
三世如來同讚歎　十方菩薩共皈依　我今宿植善因緣　稱揚地藏真功德
慈因積善　誓救眾生　手中金錫　振開地獄之門　掌上明珠　光攝大千世界
智慧音裡　吉祥雲中　為閻浮提苦眾生　作大證明功德主
大悲大願　大聖大慈　本尊地藏菩薩摩訶薩

#= 阿彌陀佛身金色偈

阿彌陀佛身金色　相好光明無等倫　白毫宛轉五須彌　紺目澄清四大海
光中化佛無數億　化菩薩眾亦無邊　四十八願度眾生　九品咸令登彼岸

#= 大悲咒發願文

稽首觀音大悲主　願力洪深相好身　千臂莊嚴普護持　千眼光明遍觀照
真實語中宣密語　無為心內起悲心　速令滿足諸希求　永使滅除諸罪業
龍天聖衆同慈護　百千三昧頓熏修　受持身是光明幢　受持心是神通藏
洗滌塵勞願濟海　超證菩提方便門　我今稱誦誓歸依　所願從心悉圓滿
南無大悲觀世音　願我速知一切法
南無大悲觀世音　願我早得智慧眼
南無大悲觀世音　願我速度一切衆
南無大悲觀世音　願我早得善方便
南無大悲觀世音　願我速乘般若船
南無大悲觀世音　願我早得越苦海
南無大悲觀世音　願我速得戒定道
南無大悲觀世音　願我早登涅槃山
南無大悲觀世音　願我速會無為舍
南無大悲觀世音　願我早同法性身
我若向刀山　刀山自摧折
我若向火湯　火湯自枯竭
我若向地獄　地獄自消滅
我若向餓鬼　餓鬼自飽滿
我若向修羅　惡心自調伏
我若向畜生　自得大智慧

#= 蓮池讚

蓮池海會　彌陀如來　觀音勢至坐蓮臺　接引上金階　大誓弘開　普願離塵埃
南無蓮池海會佛菩薩　南無蓮池海會佛菩薩　南無蓮池海會佛菩薩

#= 普賢十願

禮敬諸佛　稱讚如來　廣修供養　懺悔業障　隨喜功德
請轉法輪　請佛住世　常隨佛學　恆順衆生　普皆迴向

#= 禮敬三寶

一切三寶，體常徧滿，無所不在。衆生迷惑，流轉可哀。我為衆生，翻迷歸悟，禮敬三寶。

#= 發四宏願

衆生無邊誓願度　煩惱無盡誓願斷　法門無量誓願學　佛道無上誓願成

#= 香讚

爐香乍熱　法界蒙熏　諸佛海會悉遙聞　隨處結祥雲　誠意方殷　諸佛現全身
南無　香雲蓋菩薩摩訶薩

#= 得明教義

多讀大乘以廣其心　勤修觀行以銷其障　常求加被以開其慧

#= 楞嚴咒發願文等

妙湛總持不動尊 首楞嚴王世稀有 
銷我億劫顛倒想 不歷僧祇獲法身 
願今得果成寶王 還度如是恆沙眾 
將此身心奉塵剎 是則名為報佛恩 
伏請世尊為證明 五濁惡世誓先入 
如一眾生未成佛 終不於此取泥洹 
大雄大力大慈悲 希更審除微細惑 
令我早登無上覺 於十方界坐道場 
舜若多性可銷亡 爍迦羅心無動轉

南無常住十方佛 
南無常住十方法 
南無常住十方僧 
南無釋迦牟尼佛 
南無佛頂首楞嚴 
南無觀世音菩薩 
南無金剛藏菩薩

爾時世尊 從肉髻中 湧百寶光 
光中湧出 千葉寶蓮 有化如來 
坐寶華中 頂放十道 百寶光明 
一一光明 皆遍示現 十恆河沙 
金剛密跡 擎山持杵 遍虛空界 
大眾仰觀 畏愛兼抱 求佛哀祐 
一心聽佛 無見頂相 放光如來 
宣說神咒


#= 金剛經摘要

一切諸佛，及諸佛阿耨多羅三藐三菩提法，皆從此經出。

爾時，世尊食時，著衣持缽，入舍衛大城乞食。於其城中，次第乞已，還至本處。

飯食訖，收衣缽，洗足已，敷座而坐。

諸菩薩摩訶薩應如是降伏其心。所有一切眾生之類，若卵生、若胎生、若濕生、若化生，

若有色、若無色、若有想、若無想、若非有想、非無想，我皆令入無餘涅槃而滅度之。

如是滅度無量無數無邊眾生，實無眾生得滅度者。若菩薩有我相、人相、衆生相、壽者相，即非菩薩。

若菩薩不住相布施，其福德不可思量。

凡所有相，皆是虛妄。若見諸相非相，即見如來。

應無所住，而生其心。

一切法皆是佛法。

過去心不可得，現在心不可得，未來心不可得。

若人言：如來有所說法，即為謗佛，不能解我所說故。說法者，無法可說，是名說法。

有我者，即非有我，而凡夫之人以為有我。凡夫者，如來說即非凡夫，是名凡夫。

菩薩所作福德，不應貪著，是故說不受福德。

不取於相，如如不動。

一切有為法，如夢幻泡影，如露亦如電，應作如是觀。


#= 壇經摘要

佛者，覺也；法者，正也；僧者，淨也。

菩提本無樹，明鏡亦非臺。本來無一物，何處惹塵埃？

何期自性：本自清淨　本不生滅　本自具足　本無動搖　能生萬法

但持《金剛經》，即自見性，直了成佛。

菩提自性，本來清淨，但用此心，直了成佛。

自心常生智慧，不離自性，即是福田。

無上菩提，須得言下，識自本心，見自本性，不生不滅，於一切時中，念念自見，萬法無滯。

不是風動，不是幡動，仁者已動。

迷人口說，智者心行。

迷時師度，悟了自度。度名雖一，用處不同。只合自性自度。

若真修道人，不見世間過。若見他人非，自非卻是左。他非我不非，我非自有過。但自卻非心，打除煩惱破。

吾之所見，常見自心過愆，不見他人是非好惡，是以亦見亦不見。

見性是功，平等是德。念念無滯，常見本性，真實妙用，名為功德。

但一切善惡，都莫思量，自然得入清淨心體，湛然常寂，妙用恒沙。
`).useHrBeforeTitle();

