(() => {
new GDHReader('西方發願文‧原作蓮池大師，吾略<extra>增文</extra>',
`稽首西方安樂國，接引衆生大導師，我今發願願往生，唯願慈悲哀攝受。

弟子${getYourName('extra','yourname')}，普為四恩三有、法界衆生求於諸佛一乘無上菩提道故，
專心持念阿彌陀佛萬德洪名，期生淨土。

又以業重福輕，障深慧淺，染心易熾，淨德難成。今於佛前，翹勤五體，披瀝一心，投誠懺悔。
我及衆生，曠劫至今，迷本淨心，縱貪瞋癡，染穢三業，無量無邊，
所作罪垢，無量無邊，所結冤業，願悉消滅。

從於今日，立深誓願，遠離惡法，誓不更造，勤修聖道，誓不退墮，誓成正覺，誓度衆生。

阿彌陀佛以慈悲願力，當證知我，當哀憫我，當加被我。
<extra>潔淨我體，安隱我心，精進我促，定慧我與。</extra>
願禪觀之中，夢寐之際，得見阿彌陀佛金色之身，得歷阿彌陀佛寶嚴之土。
得蒙阿彌陀佛，甘露灌頂，光明照身，手摩我頭，衣覆我體。
使我宿障自除，善根增長，疾空煩惱，頓破無明。圓覺妙心，廓然開悟，寂光真境，常得現前。

至於臨欲命終，預知時至，
身無一切病苦厄難，心無一切貪戀迷惑，諸根悅豫，正念分明，捨報安詳，如入禪定。
阿彌陀佛與觀音勢至，諸聖賢衆，放光接引，垂手提攜。
樓閣幢幡，異香天[樂|ngo]，西方聖境，昭示目前。令諸衆生，見者聞者，歡喜感嘆，發菩提心。
我於爾時，乘金剛臺，隨從佛後，如彈指頃，生極樂國，
七寶池內，勝蓮華中，華開見佛，見諸菩薩，聞妙法音，獲無生忍。
於須臾間，承事諸佛，親蒙授記，得授記已，三身四智，五眼六通，無量百千陀羅尼門，
一切功德，皆悉成就。

然後不違安養，回入娑婆，分身無數，徧十方剎，<extra>師地藏、觀音、一切賢聖，</extra>
以不可思議自在神力，種種方便，度脫衆生，咸令離染，還得淨心，同生西方，入不退地。
如是大願，世界無盡，衆生無盡，業及煩惱，一切無盡，我願無盡。

願今禮佛發願，修持功德，回施有情。四恩總報，三有齊資，法界衆生，同圓種智。`);
})();
