const titles = [
  '法會聖衆第一',     '德遵普賢第二',     '大教緣起第三',     '法藏因地第四',
  '至心精進第五',     '發大誓願第六',     '必成正覺第七',     '積功累德第八',
  '圓滿成就第九',     '皆願作佛第十',     '國界嚴淨第十一',   '光明遍照第十二',
  '壽衆無量第十三',   '寶樹遍國第十四',   '菩提道場第十五',   '堂舍樓觀第十六',
  '泉池功德第十七',   '超世希有第十八',   '受用具足第十九',   '德風華雨第二十',
  '寶蓮佛光第二十一', '決證極果第二十二', '十方佛讚第二十三', '三輩往生第二十四',
  '往生正因第二十五', '禮供聽法第二十六', '歌歎佛德第二十七', '大士神光第二十八',
  '願力宏深第二十九', '菩薩修持第三十',   '真實功德第三十一', '壽樂無極第三十二',
  '勸諭策進第三十三', '心得開明第三十四', '濁世惡苦第三十五', '重重誨勉第三十六',
  '如貧得寶第三十七', '禮佛現光第三十八', '慈氏述見第三十九', '邊地疑城第四十',
  '惑盡見佛第四十一', '菩薩往生第四十二', '非是小乘第四十三', '受菩提記第四十四',
  '獨留此經第四十五', '勤修堅持第四十六', '福慧始聞第四十七', '聞經獲益第四十八'
];

// Start of text.
// 誦讀分段者，依照妙音姐姐粵語誦讀。
const SUTRA_TEXT = `
#@ 大教緣起 <a href="../淨土宗/《無量壽經》/48.html?c=1">大誓願</a> 成就極樂國（一至十品）

#1 法會聖衆第一
如是我聞 一時佛在王舍城 耆闍崛山中 與大比丘衆 萬二千人俱
一切大聖 神通已達 其名曰
尊者憍陳如 尊者舍利弗 尊者大目犍連 尊者迦葉 尊者阿難等 而為上首
又有普賢菩薩 文殊師利菩薩 彌勒菩薩 及賢劫中一切菩薩 皆來集會


#2 德遵普賢第二
又賢護等十六正士 所謂
@4
善思惟菩薩|慧辯才菩薩|觀無住菩薩|神通華菩薩
光英菩薩|寶幢菩薩|智上菩薩|寂根菩薩
信慧菩薩|願慧菩薩|香象菩薩|寶英菩薩
中住菩薩|制行菩薩|解脫菩薩|而為上首
@/

咸共遵修普賢大士之德 具足無量行願
@6=
>安住一切=功德法中=遊步十方=行權方便=入佛法藏=究竟彼岸
願於無量世界=成等正覺=捨兜[率|s]=[降|g]王宮=棄位出家=苦行學道
>作斯示現=順世間故=以定慧力=降伏魔怨=得微妙法=成最正覺
>天人歸仰=請轉法輪
@/

@6
常以法音|覺諸世間|破煩惱城|壞諸欲塹|洗濯垢污|顯明清白
調衆生|宣妙理|貯功德|示福田
以諸法藥|救療三苦|昇灌頂階|授菩提記|為教菩薩|作阿闍黎
常習相應|無邊諸行|成熟菩薩|無邊善根|無量諸佛|咸共護念
@/

@6
諸佛剎中|皆能示現|譬善幻師|現衆異相|於彼相中|實無可得
此諸菩薩|亦復如是|通諸法性|達衆生相|供養諸佛|開導群生
化現其身|猶如電光|裂魔見網|解諸纏縛|遠超聲聞|辟支佛地
入空無相|無願法門|善立方便|顯示三乘|於此中下|而現滅度
@/

@6
>得無生無滅|諸三摩地|及得一切|陀羅尼門|隨時悟入|華嚴三昧
>具足總持|百千三昧|住深禪定
悉睹無量諸佛|於一念頃|>徧遊|一切佛土
@/

@6
得佛辯才|住普賢行|善能分別|衆生語言|開化顯示|真實之際
超過世間|諸所有法|心常諦住|度世之道|於一切萬物|隨意自在
為諸庶類|作不請之友|受持如來|甚深法藏|護佛種性|常使不絕
@/

@6
興大悲|愍有情|演慈辯|授法眼|杜惡趣|開善門
於諸衆生|視若自己|拯濟負荷|皆度彼岸|悉獲諸佛|無量功德
智慧聖明|不可思議
@/
如是等諸大菩薩 無量無邊 一時來集
又有比丘尼五百人 清信士七千人 清信女五百人 欲界天 色界天 諸天梵衆 悉共大會


#3 大教緣起第三
爾時世尊 威光赫奕 如融金聚 又如明鏡 影暢表裏 現大光明 數千百變
尊者阿難 即自思惟 今日世尊 色身諸根 悅豫清淨 光顏巍巍 寶剎莊嚴@
從昔以來 所未曾見 喜得瞻仰 生希有心 即從座起 偏袒右肩 長跪合掌
而白佛言

世尊今日入大寂定 住奇特法 住諸佛所住導師之行 最勝之道@
去來現在佛佛相念 為念過去未來諸佛耶 為念現在他方諸佛耶@
何故威神顯耀 光瑞殊妙乃爾 願為宣說

於是世尊 告阿難言 善哉善哉 汝為哀愍利[樂|ngaau]諸衆生故 能問如是微妙之義
汝今斯問 勝於供養一天下阿羅漢 辟支佛 布施累劫諸天人民 蜎飛蠕動之類
功德百千萬倍 何以故 當來諸天人民一切含靈 皆因汝問而得度脫故

阿難 如來以無盡大悲 矜哀三界 所以出興於世 光闡道教 欲拯群萌
惠以真實之利 難值難見 如優曇華 希有出現 汝今所問多所饒益

阿難當知 如來正覺其智難量 無有障礙 能於念頃 住無量億劫
身及諸根 無有增減 所以者何 如來定慧 究暢無極 於一切法
而得最勝自在故 阿難諦聽 善思念之 吾當為汝 分別解說


#4 法藏因地第四
佛告阿難 過去無量不可思議無央數劫 有佛出世 名世間自在王如來
應供 等正覺 明行足 善逝 世間解 無上士 調御丈夫 天人師 佛 世尊
在世教授四十二劫 時為諸天及世人民說經講道

@6
有大國主|名世饒王|聞佛說法|歡喜開解|尋發無上|真正道意
棄國捐王|行作沙門|號曰法藏|修菩薩道|高才勇哲|與世超異
信解明記|悉皆第一|>又有|殊勝行願|及念慧力|增上其心
堅固不動|修行精進|無能踰者|往詣佛所|頂禮長跪|向佛合掌
+即以伽他讚佛 發廣大願 頌曰
@/

@4
　如來微妙色端嚴|一切世間無有等|光明無量照十方|日月火珠皆匿曜
　世尊能演一音聲|有情各各隨類解|又能現一妙色身|普使衆生隨類見
@/

@4
　願我得佛清淨聲|法音普及無邊界|宣揚戒定精進門|通達甚深微妙法
　智慧廣大深如海|內心清淨絕塵勞|超過無邊惡趣門|速到菩提究竟岸
　無明貪瞋皆永無|惑盡過亡三昧力
@/

@4
　亦如過去無量佛|為彼群生大導師|能救一切諸世間|生老病死衆苦惱
　常行布施及戒忍|精進定慧六波羅|未度有情令得度|已度之者使成佛
　假令供養恆沙聖|不如堅勇求正覺
@/

@4
　願當安住三摩地|恆放光明照一切|感得廣大清淨居|殊勝莊嚴無等倫
　輪迴諸趣衆生類|速生我剎受安樂|常運慈心拔有情|度盡無邊苦衆生
　我行決定堅固力|唯佛聖智能證知|縱使身止諸苦中|如是願心永不退
@/


#5 至心精進第五
法藏比丘說此偈已 而白佛言
我今為菩薩道 已發無上正覺之心 取願作佛 悉令如佛 願佛為我廣宣經法
我當奉持 如法修行 拔諸勤苦生死根本 速成無上正等正覺 欲令我作佛時
智慧光明 所居國土 教授名字 皆聞十方 諸天人民及蜎蠕類 來生我國
悉作菩薩 我立是願 都勝無數諸佛國者 甯可得不

世間自在王佛 即為法藏而說經言 譬如大海一人斗量 經歷劫數尚可窮底
人有至心求道 精進不止 會當尅果 何願不得
汝自思惟修何方便 而能成就佛剎莊嚴 如所修行 汝自當知 清淨佛國 汝應自攝

法藏白言 斯義宏深 非我境界 惟願如來應正遍知 廣演諸佛無量妙剎
若我得聞如是等法 思惟修習 誓滿所願
世間自在王佛知其高明 志願深廣 即為宣說二百一十億諸佛剎土
功德嚴淨 廣大圓滿之相 應其心願悉現與之 說是法時 經千億歲

爾時法藏聞佛所說 皆悉覩見 起發無上殊勝之願 於彼天人善惡 國土麤妙
思惟究竟 便一其心 選擇所欲 結得大願 精勤求索 恭慎保持 修習功德滿足五劫
於彼二十一俱胝佛土 功德莊嚴之事 明了通達 如一佛剎 所攝佛國 超過於彼

既攝受已 復詣世自在王如來所 稽首禮足 繞佛三匝 合掌而住
白言世尊 我已成就莊嚴佛土 清淨之行
佛言善哉 今正是時 汝應具說 令衆歡喜
亦令大衆 聞是法已 得大善利 能於佛剎 修習攝受 滿足無量大願


#6 發大誓願第六
法藏白言 唯願世尊 大慈聽察@
我若證得無上菩提 成正覺已 所居佛剎 具足無量不可思議功德莊嚴
無有地獄 餓鬼 禽獸 蜎飛蠕動之類 所有一切衆生 以及焰摩羅界 三惡道中
來生我剎 受我法化 悉成阿耨多羅三藐三菩提 不復更墮惡趣
得是願 乃作佛 不得是願 不取無上正覺

我作佛時 十方世界 所有衆生 令生我剎 皆具紫磨真金色身 三十二種大丈夫相
端正淨潔 悉同一類 若形貌差別 有好醜者 不取正覺

我作佛時 所有衆生 生我國者 自知無量劫時宿命 所作善惡 皆能洞視徹聽
知十方去來現在之事 不得是願 不取正覺@
我作佛時 所有衆生 生我國者 皆得他心智通
若不悉知 億那由他百千佛剎 衆生心念者 不取正覺

我作佛時 所有衆生 生我國者 皆得神通自在 波羅蜜多 於一念頃
不能超過億那由他百千佛剎 周徧巡歷 供養諸佛者 不取正覺@
我作佛時 所有衆生 生我國者 遠離分別 諸根寂靜
若不決定成等正覺 證大涅槃者 不取正覺

我作佛時 光明無量 普照十方 絕勝諸佛 勝於日月之明 千萬億倍
若有衆生 見我光明 照觸其身 莫不安樂 慈心作善 來生我國 若不爾者 不取正覺

我作佛時 壽命無量 國中聲聞天人無數 壽命亦皆無量 假令三千大千世界衆生
悉成緣覺 於百千劫 悉共計校 若能知其量數者 不取正覺@
我作佛時 十方世界無量剎中 無數諸佛 若不共稱歎我名 說我功德國土之善者
不取正覺

我作佛時 十方衆生 聞我名號 至心信[樂|ngaau] 所有善根 心心回向 願生我國 乃至十念
若不生者 不取正覺 唯除五逆 誹謗正法

我作佛時 十方衆生 聞我名號 發菩提心 修諸功德 奉行六波羅蜜 堅固不退
復以善根迴向 願生我國 一心念我 晝夜不斷 臨壽終時 我與諸菩薩衆 迎現其前
經須臾間 即生我剎 作阿惟越致菩薩 不得是願 不取正覺

我作佛時 十方衆生 聞我名號 繫念我國 發菩提心 堅固不退 植衆德本 至心迴向
欲生極樂 無不遂者 若有宿惡 聞我名字 即自悔過 為道作善 便持經戒 願生我剎
命終不復更三惡道 即生我國 若不爾者 不取正覺

我作佛時 國無婦女 若有女人 聞我名字 得清淨信 發菩提心 厭患女身 願生我國
命終即化男子 來我剎土
十方世界諸衆生類 生我國者 皆於七寶池蓮華中化生 若不爾者 不取正覺

我作佛時 十方衆生 聞我名字 歡喜信[樂|ngaau] 禮拜歸命 以清淨心 修菩薩行
諸天世人 莫不致敬 若聞我名 壽終之後 生尊貴家 諸根無缺 常修殊勝梵行
若不爾者 不取正覺

我作佛時 國中無不善名 所有衆生 生我國者 皆同一心 住於定聚
永離熱惱 心得清涼 所受快樂 猶如漏盡比丘 若起想念 貪計身者 不取正覺

我作佛時 生我國者 善根無量 皆得金剛那羅延身 堅固之力 身頂皆有光明照耀
成就一切智慧 獲得無邊辯才 善談諸法秘要 說經行道 語如鐘聲
若不爾者 不取正覺

我作佛時 所有衆生 生我國者 究竟必至一生補處
除其本願 為衆生故 被弘誓鎧 教化一切有情 皆發信心 修菩提行 行普賢道
雖生他方世界 永離惡趣 或[樂|ngaau]說法 或[樂|ngaau]聽法 或現神足 隨意修習 無不圓滿
若不爾者 不取正覺

我作佛時 生我國者 所須飲食 衣服 種種供具 隨意即至 無不滿願
十方諸佛 應念受其供養 若不爾者 不取正覺@
我作佛時 國中萬物 嚴淨光麗 形色殊特 窮微極妙 無能稱量
其諸衆生 雖具天眼 有能辨其形色 光相 名數 及總宣說者 不取正覺

我作佛時 國中無量色樹 高或百千由旬 道場樹高四百萬里
諸菩薩中 雖有善根劣者 亦能了知
欲見諸佛淨國莊嚴 悉於寶樹間見 猶如明鏡 睹其面像 若不爾者 不取正覺@
我作佛時 所居佛剎 廣博嚴淨 光瑩如鏡 徹照十方無量無數 不可思議諸佛世界
衆生睹者 生希有心 若不爾者 不取正覺

我作佛時 下從地際 上至虛空 宮殿樓觀 池流華樹 國土所有一切萬物
皆以無量寶香合成 其香普熏十方世界 衆生聞者 皆修佛行 若不爾者 不取正覺

我作佛時 十方佛剎諸菩薩衆 聞我名已 皆悉逮得清淨 解脫 普等三昧 諸深總持
住三摩地 至於成佛 定中常供無量無邊一切諸佛 不失定意 若不爾者 不取正覺

我作佛時 他方世界諸菩薩衆 聞我名者 證離生法 獲陀羅尼 清淨歡喜 得平等住
修菩薩行 具足德本 應時不獲一二三忍 於諸佛法 不能現證不退轉者 不取正覺


#7 必成正覺第七
佛告阿難 爾時法藏比丘說此願已 以偈頌曰
@4
　我建超世志|必至無上道|斯願不滿足|誓不成等覺
　復為大施主|普濟諸窮苦|令彼諸群生|長夜無憂惱
　出生衆善根|成就菩提果|我若成正覺|立名無量壽
　衆生聞此號|俱來我剎中
@/

@4
　如佛金色身|妙相悉圓滿|亦以大悲心|利益諸群品
　離欲深正念|淨慧修梵行|願我智慧光|普照十方剎
　消除三垢冥|明濟衆厄難|悉捨三途苦|滅諸煩惱暗
　開彼智慧眼|獲得光明身|閉塞諸惡道|通達善趣門
　為衆開法藏|廣施功德寶
@/

@4
　如佛無礙智|所行慈愍行|常作天人師|得為三界雄
　說法師子吼|廣度諸有情|圓滿昔所願|一切皆成佛
　斯願若尅果|大千應感動|虛空諸天神|當雨珍妙華
@/
佛告阿難 法藏比丘 說此頌已
應時普地六種震動 天雨妙華 以散其上 自然音[樂|ngo]空中讚言 決定必成無上正覺


#8 積功累德第八
阿難 法藏比丘於世自在王如來前 及諸天人大衆之中 發斯弘誓願已
@6=
住真實慧=勇猛精進=一向專志=莊嚴妙土=所修佛國=開廓廣大
超勝獨妙=建立常然=無衰無變=於無量劫=積植德行=不起貪瞋
癡欲諸想=不著色聲=香味觸法=但[樂|ngaau]憶念=過去諸佛=所修善根
行寂靜行=遠離虛妄=依真諦門=植衆德本
@/

@6
不計衆苦|少欲知足|專求白法|惠利群生|志願無倦|忍力成就
於諸有情|常懷慈忍|和顏愛語|勸諭策進|恭敬三寶|奉事師長
無有虛偽|諂曲之心|莊嚴衆行|軌範具足|觀法如化|三昧常寂
善護口業|不譏他過|善護身業|不失律儀|善護意業|清淨無染
@/

所有國城聚落 眷屬珍寶 都無所著 恆以布施持戒 忍辱精進 禪定智慧
六度之行 教化安立衆生 住於無上 真正之道@
由成如是 諸善根故 所生之處 無量寶藏 自然發應
或為長者居士 豪姓尊貴 或為剎利國王 轉輪聖帝 或為六欲天主
乃至梵王 於諸佛所 尊重供養 未曾間斷 如是功德 說不能盡

@6=
身口常出=無量妙香=猶如栴檀=優缽羅華=其香普熏=無量世界
隨所生處=色相端嚴=三十二相=八十種好=悉皆具足
手中常出=無盡之寶=莊嚴之具=一切所須=最上之物=利[樂|ngaau]有情
由是因緣=+能令無量衆生 皆發阿耨多羅三藐三菩提心
@/


#9
佛告阿難 法藏比丘 修菩薩行 積功累德 無量無邊 於一切法而得自在
非是語言分別之所能知 所發誓願圓滿成就 如實安住 具足莊嚴 威德廣大
清淨佛土@
阿難聞佛所說 白世尊言
法藏菩薩成菩提者 為是過去佛耶 未來佛耶 為今現在他方世界耶

世尊告言 彼佛如來 來無所來 去無所去 無生無滅 非過現未來 但以酬願度生
現在西方 去閻浮提百千俱胝那由他佛剎 有世界名曰極樂 法藏成佛號阿彌陀
成佛以來 於今十劫 今現在說法 有無量無數菩薩 聲聞之衆 恭敬圍繞


#10
佛說阿彌陀佛為菩薩求得是願時 阿闍王子 與五百大長者聞之 皆大歡喜
各持一金華蓋 俱到佛前作禮 以華蓋上佛已 卻坐一面聽經 心中願言
令我等作佛時 皆如阿彌陀佛

佛即知之 告諸比丘 是王子等 後當作佛 彼於前世住菩薩道 無數劫來
供養四百億佛 迦葉佛時 彼等為我弟子 今供養我 復相值也
時諸比丘聞佛言者 莫不代之歡喜


#@ 極樂國土功德莊嚴（十一至二十三品）

#11
佛語阿難 彼極樂界 無量功德 具足莊嚴 永無衆苦 諸難 惡趣 魔惱之名
亦無四時 寒暑 雨冥之異 復無大小江海 丘陵坑坎 荊棘沙礫 鐵圍 須彌
土石等山 惟以自然七寶 黃金為地 寬廣平正 不可限極 微妙奇麗 清淨莊嚴
超逾十方一切世界

阿難聞已 白世尊言 若彼國土無須彌山 其四天王天 及忉利天 依何而住@
佛告阿難 夜摩兜[率|s] 乃至色無色界 一切諸天 依何而住@
阿難白言 不可思議業力所致

佛語阿難 不思議業 汝可知耶 汝身果報 不可思議 衆生業報 亦不可思議
衆生善根 不可思議 諸佛聖力 諸佛世界 亦不可思議 其國衆生 功德善力
住行業地 及佛神力 故能爾耳@
阿難白言 業因果報 不可思議 我於此法 實無所惑但為將來衆生破除疑網
故發斯問


#12
佛告阿難 阿彌陀佛威神光明 最尊第一 十方諸佛所不能及
遍照東方恆沙佛剎 南西北方 四維上下 亦復如是
若化頂上圓光 或一二三四由旬 或百千萬億由旬 諸佛光明 或照一二佛剎
或照百千佛剎

惟阿彌陀佛 光明普照無量無邊無數佛剎
諸佛光明所照遠近 本其前世求道所願功德 大小不同 至作佛時 各自得之
自在所作 不為預計
阿彌陀佛 光明善好 勝於日月之明 千億萬倍 光中極尊 佛中之王

是故 無量壽佛 亦號無量光佛 亦號無邊光佛 無礙光佛 無等光佛@
亦號智慧光 常照光 清淨光 歡喜光 解脫光 安隱光 超日月光 不思議光

如是光明 普照十方一切世界 其有衆生 遇斯光者 垢滅善生 身意柔軟
若在三途極苦之處 見此光明 皆得休息 命終皆得解脫
若有衆生 聞其光明 威神功德 日夜稱說 至心不斷 隨意所願 得生其國


#13
佛語阿難 無量壽佛 壽命長久 不可稱計
又有無數聲聞之衆 神智洞達 威力自在 能於掌中持一切世界

我弟子中大目犍連 神通第一 三千大千世界 所有一切星[宿|sau]衆生 於一晝夜
悉知其數 假使十方衆生 悉成緣覺 一一緣覺 壽萬億歲 神通皆如大目犍連
盡其壽命 竭其智力 悉共推算 彼佛會中聲聞之數 千萬分中不及一分

譬如大海 深廣無邊 設取一毛 析為百分 碎如微塵 以一毛塵 沾海一滴
此毛塵水 比海孰多 阿難 彼目犍連等所知數者 如毛塵水 所未知者 如大海水
彼佛壽量 及諸菩薩 聲聞 天人壽量亦爾 非以算計譬喻之所能知


#14
@6
彼如來國|多諸寶樹|或純金樹|純白銀樹|琉璃樹|水晶樹
>琥珀樹|>美玉樹|>瑪瑙樹|唯一寶成|不雜餘寶|或有二寶三寶
乃至七寶|轉共合成|根莖枝幹|此寶所成|華葉果實|他寶化作
@/

@6
或有寶樹|黃金為根|白銀為身|琉璃為枝|水晶為梢|琥珀為葉
美玉為華|瑪瑙為果|其餘諸樹|復有七寶|互為根幹|枝葉華果
種種共成|各自異行|行行相值|莖莖相望|枝葉相向|華實相當
榮色光曜|不可勝視|清風時發|出五音聲|微妙宮商|自然相和
是諸寶樹|周遍其國
@/


#15
@6
>又其道場|有菩提樹|高四百萬里|其本周圍|五千由旬|枝葉四布
>二十萬里|一切衆寶|自然合成|華果敷榮|光暉遍照
復有紅綠青白|諸摩尼寶|衆寶之王|以為瓔珞|雲聚寶鏁|飾諸寶柱
>金珠鈴鐸|周匝條間|珍妙寶網|羅覆其上|百千萬色|互相映飾
@/

@6
無量光炎|照耀無極|一切莊嚴|隨應而現|微風徐動|吹諸枝葉
演出無量|妙法音聲|其聲流布|遍諸佛國|清暢哀亮|微妙和雅
十方世界|音聲之中|最為第一
@/

若有衆生 覩菩提樹 聞聲 嗅香 嘗其果味 觸其光影 念樹功德
皆得六根清澈 無諸惱患 住不退轉 至成佛道
復由見彼樹故 獲三種忍 一音響忍 二柔順忍 三者無生法忍
佛告阿難 如是佛剎 華果樹木 與諸衆生 而作佛事
此皆無量壽佛 威神力故 本願力故 滿足願故 明了 堅固 究竟願故


#16
又無量壽佛講堂精舍 樓觀欄楯 亦皆七寶自然化成
復有白珠摩尼以為交絡 明妙無比 諸菩薩衆 所居宮殿 亦復如是
中有在地講經 誦經者 有在地受經 聽經者 有在地經行者 思道及坐禪者
有在虛空講誦受聽者 經行 思道及坐禪者

或得須陀洹 或得斯陀含 或得阿那含 阿羅漢
未得阿惟越致者 則得阿惟越致 各自念道 說道 行道 莫不歡喜


#17
又其講堂左右 泉池交流 縱廣深淺 皆各一等 或十由旬 二十由旬
乃至百千由旬
@6
湛然香潔|具八功德|岸邊無數|旃檀香樹|吉祥果樹|華果恆芳
光明照耀|修條密葉|交覆於池|出種種香|世無能喻|隨風散馥
沿水流芬|>又復|池飾七寶|地布金沙|優鉢羅華|鉢曇摩華
拘牟頭華|芬陀利華|雜色光茂|彌覆水上
@/

若彼衆生 過浴此水 欲至足者 欲至膝者 欲至腰腋 欲至頸者
或欲灌身 或欲 冷者溫者 急流者 緩流者
其水一一 隨衆生意 開神悅體 淨若無形 寶沙映澈 無深不照

微瀾徐廻 轉相灌注 波揚無量微妙音聲 或聞佛法僧聲 波羅蜜聲 止息寂靜聲
無生無滅聲 十力無畏聲 或聞無性無作無我聲 大慈大悲喜捨聲 甘露灌頂受位聲

得聞如是種種聲已 其心清淨 無諸分別 正直平等 成熟善根 隨其所聞 與法相應@
其願聞者 輒獨聞之 所不欲聞 了無所聞 永不退於阿耨多羅三藐三菩提心

十方世界諸往生者 皆於七寶池蓮華中 自然化生 悉受清虛之身 無極之體@
不聞三途惡惱苦難之名 尚無假設 何況實苦 但有自然快樂之音
是故彼國 名為極樂


#18
彼極樂國所有衆生 容色微妙 超世希有 咸同一類 無差別相 但因順餘方俗
故有天人之名@
佛告阿難 譬如世間貧苦乞人 在帝王邊 面貌形狀寧可類乎
帝王若比轉輪聖王 則為鄙陋 猶彼乞人 在帝王邊也
轉輪聖王 威相第一 比之忉利天王 又復醜劣 假令帝釋 比第六天 雖百千倍 不相類也

第六天王 若比極樂國中 菩薩聲聞 光顏容色 雖萬億倍 不相及逮
所處宮殿 衣服飲食 猶如他化自在天王
至於威德 階位 神通變化 一切天人不可為比 百千萬億 不可計倍
阿難應知 無量壽佛極樂國土 如是功德莊嚴 不可思議


#19
復次 極樂世界 所有衆生 或已生 或現生 或當生 皆得如是 諸妙色身
@6
形貌端嚴|福德無量|智慧明了|神通自在|受用種種|一切豐足
宮殿服飾|香華幡蓋|莊嚴之具|隨意所須|悉皆如念
@/

@6
>若欲食時|七寶鉢器|自然在前|百味飲食|自然盈滿
>雖有此食|實無食者|但見色聞香|以意為食|色力增長|而無便穢
>身心柔軟|無所味著|事已化去|時至復現
>復有衆寶妙衣|冠帶瓔珞|無量光明|百千妙色|悉皆具足|自然在身
@/

@6
所居舍宅|稱其形色|寶網彌覆|懸諸寶鈴|奇妙珍異|周遍校飾
光色晃曜|盡極嚴麗|樓觀欄楯|堂宇房閣|廣狹方圓|或大或小
或在虛空|或在平地|清淨安隱|微妙快樂|應念現前|無不具足
@/


#20
@6
其佛國土|每於食時|自然德風徐起|吹諸羅網|及衆寶樹|出微妙音
演說苦空|無常無我|諸波羅蜜|流布萬種|溫雅德香|其有聞者
塵勞垢習|自然不起|風觸其身|安和調適|猶如比丘|得滅盡定
@/

@6
復吹七寶林樹|飄華成聚|種種色光|遍滿佛土|隨色次第|而不雜亂
>柔軟光潔|如兜羅緜|足履其上|沒深四指|隨足舉已|還復如初
>過食時後|其華自沒|大地清淨|更雨新華|隨其時節|還復周遍
>與前無異|如是六反
@/


#21
@6
>又衆寶蓮華|周滿世界|一一寶華|百千億葉
>其華光明|無量種色|青色青光|白色白光|玄黃朱紫|光色亦然
復有無量妙寶|百千摩尼|映飾珍奇|明曜日月
@/

彼蓮華量 或半由旬 或一二三四 乃至百千由旬
一一華中 出三十六百千億光
一一光中 出三十六百千億佛 身色紫金 相好殊特
一一諸佛 又放百千光明 普為十方說微妙法
如是諸佛 各各安立無量衆生於佛正道


#22
復次阿難 彼佛國土 無有昏闇 火光 日月星曜 晝夜之象 亦無歲月劫數之名
復無住著家室 於一切處 既無標式名號 亦無取捨分別 唯受清淨最上快樂
若有善男子 善女人 若已生 若當生 皆悉住於正定之聚 決定證於阿耨多羅三藐三菩提
何以故 若邪定聚 及不定聚 不能了知建立彼因故


#23
復次阿難 東方恆河沙數世界 一一界中如恆沙佛 各出廣長舌相 放無量光
說誠實言 稱讚無量壽佛不可思議功德
南西北方恆沙世界 諸佛稱讚亦復如是 四維上下恆沙世界 諸佛稱讚亦復如是 何以故

欲令他方所有衆生聞彼佛名 發清淨心 憶念受持 歸依供養 乃至能發一念淨信
所有善根 至心迴向 願生彼國 隨願皆生 得不退轉 乃至無上正等菩提

#@ 往生正因 極樂世界正報功德莊嚴（二十四至三十一品）

#24
佛告阿難 十方世界諸天人民 其有至心願生彼國 凡有三輩@
其上輩者 捨家棄欲而作沙門 發菩提心 一向專念阿彌陀佛 修諸功德 願生彼國
此等衆生 臨壽終時 阿彌陀佛與諸聖衆 現在其前 經須臾間 即隨彼佛往生其國
便於七寶華中自然化生 智慧勇猛 神通自在

是故阿難 其有衆生 欲於今世見阿彌陀佛者 應發無上菩提之心
復當專念極樂國土 積集善根 應持迴向
由此見佛 生彼國中 得不退轉 乃至無上菩提

其中輩者 雖不能行作沙門 大修功德 當發無上菩提之心 一向專念阿彌陀佛
隨己修行 諸善功德 奉持齋戒 起立塔像 飯食沙門 懸繒然燈 散華燒香
以此迴向 願生彼國

其人臨終 阿彌陀佛化現其身 光明相好 具如真佛 與諸大衆前後圍繞
現其人前 攝受導引 即隨化佛往生其國 住不退轉無上菩提 功德智慧次如上輩者也

其下輩者 假使不能作諸功德 當發無上菩提之心 一向專念阿彌陀佛 歡喜信[樂|ngaau]
不生疑惑 以至誠心 願生其國 此人臨終夢見彼佛 亦得往生 功德智慧次如中輩者也

若有衆生住大乘者 以清淨心 向無量壽 乃至十念 願生其國
聞甚深法 即生信解 乃至獲得一念淨心 發一念心念於彼佛
此人臨命終時 如在夢中 見阿彌陀佛 定生彼國 得不退轉無上菩提


#25
復次阿難 若有善男子 善女人 聞此經典 受持 讀誦 書寫 供養 晝夜相續
求生彼剎 發菩提心 持諸禁戒 堅守不犯 饒益有情 所作善根 悉施與之
令得安樂 憶念西方阿彌陀佛 及彼國土
是人命終 如佛色相 種種莊嚴 生寶剎中 速得聞法 永不退轉

復次阿難 若有衆生欲生彼國 雖不能大精進禪定 盡持經戒 要當作善
所謂一不殺生 二不偷盜 三不婬欲 四不妄言 五不綺語 六不惡口 七不兩舌
八不貪 九不瞋 十不癡
如是晝夜思惟 極樂世界阿彌陀佛 種種功德 種種莊嚴 志心歸依 頂禮供養
是人臨終 不驚不怖 心不顛倒 即得往生彼佛國土

若多事物 不能離家 不暇大修齋戒 一心清淨 有空閒時 端正身心 絕欲去憂
慈心精進 不當瞋怒 嫉妒 不得貪餮慳惜 不得中悔 不得狐疑 要當孝順
至誠忠信 當信佛經語深 當信作善得福

奉持如是等法 不得虧失 思惟熟計 欲得度脫 晝夜常念
願欲往生阿彌陀佛清淨佛國
十日十夜 乃至一日一夜不斷絕者 壽終皆得往生其國 行菩薩道

諸往生者 皆得阿惟越致 皆具金色三十二相 皆當作佛
欲於何方佛國作佛 從心所願 隨其精進早晚 求道不休 會當得之 不失其所願也
阿難 以此義利故 無量無數不可思議 無有等等無邊世界 諸佛如來
皆共稱讚無量壽佛所有功德


#26
復次阿難 十方世界諸菩薩衆 為欲瞻禮極樂世界無量壽佛 各以香華幢幡寶蓋
往詣佛所 恭敬供養 聽受經法 宣布道化 稱讚佛土功德莊嚴
爾時世尊即說頌曰
@4
　東方諸佛剎|數如恆河沙|恆沙菩薩衆|往禮無量壽
　南西北四維|上下亦復然|咸以尊重心|奉諸珍妙供
@/

@4
　暢發和雅音|歌歎最勝尊|究達神通慧|遊入深法門
　聞佛聖德名|安隱得大利|種種供養中|勤修無懈倦
　觀彼殊勝剎|微妙難思議|功德普莊嚴|諸佛國難比
　因發無上心|願速成菩提
@/

@4
　應時無量尊|微笑現金容|光明從口出|遍照十方國
　迴光還繞佛|三匝從頂入|菩薩見此光|即證不退位
　時會一切衆|互慶生歡喜
@/

@4
　佛語梵雷震|八音暢妙聲
　十方來正士|吾悉知彼願|志求嚴淨土|受記當作佛
　覺了一切法|猶如夢幻響|滿足諸妙願|必成如是剎
　知土如影像|恆發弘誓心|究竟菩薩道|具諸功德本
@/

@4=
　修勝菩提行=受記當作佛=通達諸法性=一切空無我
　專求淨佛土=必成如是剎=聞法[樂|ngaau]受行=得至清淨處
　必於無量尊=受記成等覺
@/

@4
　無邊殊勝剎|其佛本願力|聞名欲往生|自致不退轉
　菩薩興至願|願己國無異|普念度一切|各發菩提心
　捨彼輪迴身|俱令登彼岸|奉事萬億佛|飛化遍諸剎
　恭敬歡喜去|還到安養國
@/


#27
佛語阿難 彼國菩薩 承佛威神 於一食頃 復往十方 無邊淨剎 供養諸佛
華香幢幡 供養之具 應念即至 皆現手中 珍妙殊特 非世所有 以奉諸佛 及菩薩衆

@6=
其所散華=即於空中=合為一華=華皆向下=端圓周匝=化成華蓋
百千光色=色色異香=香氣普薰
蓋之小者=滿十由旬=如是轉倍=乃至遍覆=+三千大千世界
隨其前後=以次化沒=若不更以=新華重散=前所散華=終不復落
於虛空中=共奏天[樂|ngo]=以微妙音=歌歎佛德
@/

@6
>經須臾間|還其本國|都悉集會|七寶講堂|無量壽佛
則為廣宣大教|演暢妙法|莫不歡喜|心解得道|即時香風|吹七寶樹
>出五音聲|無量妙華|隨風四散|自然供養|如是不絕
@/

@6=
一切諸天=皆齎百千華香=萬種伎[樂|ngo]=供養彼佛=及諸菩薩聲聞之衆
前後往來=熙怡快樂=此皆無量壽佛=本願加威=及曾供養如來
善根相續=無缺減故=善修習故=善攝取故=善成就故
@/


#28
@6
佛告阿難|彼佛國中|諸菩薩衆|悉皆洞視|徹聽八方|上下去來
現在之事|諸天人民|以及蜎飛|蠕動之類|心意善惡|口所欲言
何時度脫|得道往生|皆豫知之
又彼佛剎|諸聲聞衆|身光一尋|菩薩光明|照百由旬
有二菩薩|最尊第一|威神光明|+普照三千大千世界
@/

阿難白佛 彼二菩薩 其號云何@
佛言 一名觀世音 一名大勢至
此二菩薩 於娑婆界 修菩薩行 往生彼國 常在阿彌陀佛左右
欲至十方無量佛所 隨心則到
現居此界 作大利樂 世間善男子 善女人 若有急難恐怖
但自歸命觀世音菩薩 無不得解脫者


#29
@6
>復次阿難|彼佛剎中|所有現在|>未來|一切菩薩|皆當究竟
>一生補處|唯除大願|入生死界|為度群生|作師子吼|擐大甲胄
>以宏誓功德|而自莊嚴
雖生五濁惡世|示現同彼|直至成佛|不受惡趣|生生之處|常識宿命
@/

@6
>無量壽佛|意欲度脫|十方世界|諸衆生類|皆使往生其國
悉令得泥洹道|作菩薩者|令悉作佛|既作佛已|轉相教授|轉相度脫
>如是輾轉|不可復計|十方世界|聲聞菩薩|諸衆生類|生彼佛國
>得泥洹道|當作佛者|不可勝數
@/

@6
彼佛國中|常如一法|不為增多|所以者何|猶如大海|為水中王
諸水流行|都入海中|是大海水|寧為增減|八方上下|佛國無數
阿彌陀國|長久廣大|明好快樂|最為獨勝|本其為菩薩時
求道所願|累德所致|無量壽佛|恩德布施|八方上下|無窮無極
深大無量|不可勝言
@/


#30
@6
復次阿難|彼佛剎中|一切菩薩|禪定智慧|神通威德|無不圓滿
諸佛密藏|究竟明了|調伏諸根|身心柔軟|深入正慧|無復餘習
依佛所行|七覺聖道|修行五眼|照真達俗|肉眼簡擇|天眼通達
法眼清淨|慧眼見真|佛眼具足|覺了法性
@/

@6
辯才總持|自在無礙|善解世間|無邊方便|所言誠諦|深入義味
度諸有情|演說正法|無相無為|無縛無脫|無諸分別|遠離顛倒
@/

@6=
於所受用=皆無攝取=遍遊佛剎=無愛無厭=亦無希求=不希求想
亦無彼我=違怨之想=>何以故=彼諸菩薩=於一切衆生=有大慈悲
利益心故=捨離一切執著=>成就=無量功德=以無礙慧=解法如如
善知集滅=音聲方便=不欣世語=[樂|ngaau]在正論
@/

@6
知一切法|悉皆空寂|生身煩惱|二餘俱盡|於三界中|平等勤修
究竟一乘|至於彼岸|決斷疑網|證無所得|以方便智|增長了知
從本以來|安住神通|得一乘道|不由他悟
@/


#31
@6
其智宏深|譬如巨海|菩提高廣|喻若須彌|自身威光|超於日月
其心潔白|猶如雪山|忍辱如地|一切平等|清淨如水|洗諸塵垢
熾盛如火|燒煩惱薪|不著如風|無諸障礙|法音雷震|覺未覺故
雨甘露法|潤衆生故|曠若虛空|大慈等故|如淨蓮華|離染污故
如尼拘樹|覆蔭大故|如金剛杵|破邪執故|+如鐵圍山 衆魔外道 不能動故
@/

@6
其心正直|善巧決定|論法無厭|求法不倦|戒若琉璃|內外明潔
其所言說|令衆悅服|擊法鼓|建法幢|曜慧日|破癡闇
淳淨溫和|寂定明察|為大導師|調伏自他|引導群生|捨諸愛著
永離三垢|遊戲神通|因緣願力|出生善根|+摧伏一切魔軍
>尊重|奉事諸佛|為世明燈|最勝福田
@/

@6
殊勝吉祥|堪受供養|赫奕歡喜|雄猛無畏|身色相好|功德辯才
具足莊嚴|無與等者|常為諸佛|所共稱讚|+究竟菩薩 諸波羅蜜
而常安住|不生不滅|諸三摩地|行遍道場|遠二乘境
@/
阿難 我今略說 彼極樂界 所生菩薩 真實功德 悉皆如是 若廣說者 百千萬劫 不能窮盡

#@|勸喻衆生|奉持經戒|求生極樂國（三十二至三十七品）

#32
@6
佛告彌勒菩薩|諸天人等|無量壽國|聲聞菩薩|功德智慧|不可稱說
又其國土|微妙安樂|清淨若此|+何不力為善 念道之自然
@/

@6=
出入供養=觀經行道=喜[樂|ngaau]久習=才猛智慧=心不中迴=意無懈時
外若遲緩=內獨駛急=容容虛空=適得其中
中表相應=自然嚴整=檢斂端直
@/

@6
身心潔淨|無有愛貪|志願安定|無增缺減|求道和正|不誤傾邪
隨經約令|不敢蹉跌|若於繩墨|咸為道慕|曠無他念|無有憂思
自然無為|虛空無立|淡安無欲|作得善願|盡心求索|含哀慈愍
禮義都合|苞羅表裏|過度解脫
@/

自然保守 真真潔白 志願無上 淨定安樂@
一旦開達明徹 自然中自然相 自然之有根本 自然光色參迴 轉變最勝

@4
鬱單成七寶|橫攬成萬物|光精明俱出|善好殊無比
著於無上下|洞達無邊際|宜各勤精進|努力自求之
必得超絕去|+往生無量清淨阿彌陀佛國
橫截於五趣|惡道自閉塞|無極之勝道|易往而無人
其國不逆違|自然所牽隨|捐志若虛空|勤行求道德
可得極長生|壽樂無有極|何為著世事|譊譊憂無常
@/


#33
世人共爭不急之務 於此劇惡極苦之中 勤身營務以自給濟

@6
尊卑貧富|少長男女|累念積慮|為心走使|無田憂田|無宅憂宅
眷屬財物|有無同憂|有一少一|思欲齊等|適小具有|又憂非常
水火盜賊|怨家債主|焚漂劫奪|消散磨滅|心慳意固|無能縱捨
命終棄捐|莫誰隨者|貧富同然|憂苦萬端
@/

@6
世間人民|父子兄弟|夫婦親屬|當相敬愛|無相憎嫉|有無相通
無得貪惜|言色常和|莫相違戾|或時心諍|有所恚怒|後世轉劇
至成大怨|世間之事|更相患害|雖不臨時|應急想破
@/

@6
人在愛欲之中|獨生獨死|獨去獨來|苦樂自當|無有代者
>善惡變化|追逐所生|道路不同|會見無期
何不於強健時|努力修善|欲何待乎
@/

@6
世人善惡|自不能見|吉凶禍福|競各作之|身愚神闇|轉受餘教
顛倒相續|無常根本|蒙冥抵突|不信經法|心無遠慮|各欲快意
迷於瞋恚|貪於財色|終不休止|哀哉可傷
@/

@6
先人不善|不識道德|無有語者|殊無怪也|死生之趣|善惡之道
都不之信|謂無有是|更相瞻視|且自見之|或父哭子|或子哭父
兄弟夫婦|更相哭泣
@/

@6
>一死一生|迭相顧戀|憂愛結縛|無有解時|思想恩好|不離情欲
不能深思熟計|專精行道|年壽旋盡|無可奈何|惑道者衆|悟道者少
>各懷殺毒|惡氣冥冥|為妄興事|違逆天地|恣意罪極|頓奪其壽
>下入惡道|無有出期
@/

@6
若曹當熟思計|遠離衆惡|擇其善者|勤而行之|愛欲榮華|不可常保
>皆當別離|無可樂者|當勤精進|生安樂國|智慧明達|功德殊勝
勿得隨心所欲|虧負經戒|在人後也
@/

#34
@5
彌勒白言|佛語教戒|甚深甚善|皆蒙慈恩|解脫憂苦
佛為法王|尊超群聖|光明徹照|洞達無極|普為一切
天人之師|今得值佛|復聞無量壽聲|靡不歡喜|心得開明
@/

@6
佛告彌勒|敬於佛者|是為大善|實當念佛|截斷狐疑|拔諸愛欲
杜衆惡源|遊步三界|無所挂礙|開示正道|度未度者
若曹當知|十方人民|永劫以來|輾轉五道|憂苦不絕|生時苦痛
老亦苦痛|病極苦痛|死極苦痛|惡臭不淨|無可樂者
@/

@4
宜自決斷|洗除心垢|言行忠信|表裏相應
人能自度|轉相拯濟|至心求願|積累善本
@/
雖一世 精進勤苦 須臾間耳 後生無量壽國 快樂無極 永拔生死之本
無復苦惱之患 壽千萬劫 自在隨意

@6
宜各精進|求心所願|無得疑悔|自為過咎|生彼邊地|七寶城中
於五百歲|受諸厄也
彌勒白言|受佛明誨|專精修學|如教奉行|不敢有疑
@/


#35
佛告彌勒
汝等能於此世 端心正意 不為衆惡 甚為大德 所以者何@
十方世界 善多惡少 易可開化 唯此五惡世間最為劇苦@
我今於此作佛 教化群生 令捨五惡 去五痛 離五燒
降化其意 令持五善 獲其福德 何等為五

其一者 世間諸衆生類 欲為衆惡
@6
>強者伏弱|轉相尅賊|殘害殺傷|迭相吞噉|不知為善|後受殃罰
故有窮乞孤獨|聾盲瘖瘂|癡惡尪狂|皆因前世|不信道德|不肯為善
其有尊貴豪富|賢明長者|智勇才達|皆由宿世|慈孝修善|積德所致
@/

@6
>世間有此|目前現事|壽終之後|入其幽冥|轉生受身|改形易道
>故有泥犁|+禽獸 蜎飛蠕動之屬
譬如世法牢獄|劇苦極刑|魂神命精|隨罪趣向|所受壽命|或長或短
>相從共生|更相報償|殃惡未盡|終不得離|輾轉其中|累劫難出
>難得解脫|痛不可言
+天地之間 自然有是 雖不即時暴應 善惡會當歸之
@/

其二者 世間人民不順法度 奢婬驕縱 任心自恣
@5
居上不明|在位不正|陷人冤枉|損害忠良|心口各異
機偽多端|尊卑中外|更相欺誑|瞋恚愚癡|欲自厚己
欲貪多有|利害勝負|結忿成讐|破家亡身|不顧前後
@/

@6
>富有慳惜|不肯施與|愛保貪重|心勞身苦|如是至竟|無一隨者
>善惡禍福|追命所生|或在樂處|或入苦毒
>又或見善憎謗|不思慕及|常懷盜心|悕望他利|用自供給|消散復取
神明尅識終入惡道|自有三途|無量苦惱|輾轉其中|累劫難出|痛不可言
@/

其三者 世間人民相因寄生 壽命幾何 不良之人 身心不正
@5
常懷邪惡|常念婬妷|煩滿胸中|邪態外逸|費損家財
事為非法|所當求者|而不肯為|>又或|交結聚會
興兵相伐|攻劫殺戮|強奪迫脅|歸給妻子|極身作樂
衆共憎厭|患而苦之|如是之惡|著於人鬼|神明記識
自入三途|無量苦惱|輾轉其中|累劫難出|痛不可言
@/

其四者 世間人民不念修善
@6
兩舌惡口|妄言綺語|憎嫉善人|敗壞賢明|不孝父母|輕慢師長
朋友無信|難得誠實|尊貴自大|謂己有道|橫行威勢|侵易於人
欲人畏敬|不自慚懼|難可降化|常懷驕慢
@/

@6
賴其前世|福德營護|今世為惡|福德盡滅|壽命終盡|諸惡繞歸
又其名籍|記在神明|殃咎牽引|無從捨離|但得前行|入於火鑊
身心摧碎|神形苦極|當斯之時|悔復何及
@/

其五者 世間人民徙倚懈怠 不肯作善 治身修業
@6
父母教誨|違戾反逆|譬如怨家|不如無子|負恩違義|無有報償
放恣遊散|耽酒嗜美|魯扈抵突|不識人情|無義無禮|不可諫曉
六親眷屬|資用有無|不能憂念
@/
不惟父母之恩 不存師友之義

@5
意念身口|曾無一善|>不信|諸佛經法|不信生死善惡
欲害真人|鬥亂僧衆|愚癡蒙昧|自為智慧|不知生所從來
死所趣向|不仁不順|希望長生|慈心教誨|而不肯信
苦口與語|無益其人|心中閉塞|意不開解|大命將終
悔懼交至|不豫修善|臨時乃悔|悔之於後|將何及乎
@/

@6
天地之間|五道分明|善惡報應|禍福相承|身自當之|無誰代者
善人行善|從樂入樂|從明入明|惡人行惡|從苦入苦|從冥入冥
誰能知者|獨佛知耳|教語開示|信行者少|生死不休|惡道不絕
如是世人|難可具盡|>故有|自然三途|無量苦惱|輾轉其中
世世累劫|無有出期|難得解脫|痛不可言
@/

@5
如是五惡|五痛五燒|譬如大火|焚燒人身|若能自於其中
一心制意|端身正念|言行相副|所作至誠|獨作諸善 不為衆惡
身獨度脫|獲其福德|可得長壽|泥洹之道|是為五大善也
@/


#36
@6
佛告彌勒|吾語汝等|如是五惡|五痛五燒|輾轉相生|敢有犯此
當歷惡趣|或其今世|先被病殃|死生不得|示衆見之|或於壽終
入三惡道|愁痛酷毒|自相燋然|共其怨家|更相殺傷|從小微起
成大困劇
@/

@6
皆由貪著財色|不肯施惠|各欲自快|無復曲直|癡欲所迫|厚己爭利
>富貴榮華|當時快意|不能忍辱|不務修善|威勢無幾|隨以磨滅
>天道施張|自然糺舉|煢煢忪忪|當入其中|古今有是|痛哉可傷
@/

@6
汝等得佛經語|熟思惟之|各自端守|終身不怠|尊聖敬善|仁慈博愛
>當求度世|拔斷生死|衆惡之本|當離三塗|+憂怖苦痛之道
@/

@6
若曹作善|云何第一|當自端心|當自端身|耳目口鼻|皆當自端
身心淨潔|與善相應|勿隨嗜欲|不犯諸惡|言色當和|身行當專
動作瞻視|安定徐為|作事倉卒|敗悔在後|為之不諦|亡其功夫
@/


#37
@6
汝等廣植德本|勿犯道禁|忍辱精進|慈心專一|齋戒清淨|一日一夜
勝在無量壽國|為善百歲|所以者何|彼佛國土|皆積德衆善|無毫髮之惡
>於此修善|十日十夜|勝於他方|諸佛國中|為善千歲
>所以者何|他方佛國|福德自然|無造惡之地
@/

@6=
唯此世間=善少惡多=飲苦食毒=未嘗寧息
吾哀汝等=苦心誨喻=授與經法=悉持思之=悉奉行之
尊卑男女=眷屬朋友=轉相教語=自相約檢=和順義理=歡樂慈孝
所作如犯=則自悔過=去惡就善=朝聞夕改=奉持經戒=如貧得寶
改往修來=洒心易行=自然感[降|gon]=所願輒得
@/

@6
佛所行處|國邑丘聚|靡不蒙化|天下和順|日月清明
風雨以時|災厲不起|國豐民安|兵戈無用|崇德興仁
務修禮讓|國無盜賊|無有怨枉|強不凌弱|各得其所
@/

我哀汝等 甚於父母念子 我於此世作佛 以善攻惡 拔生死之苦 令獲五德 升無為之安
吾般泥洹 經道漸滅 人民諂偽 復為衆惡 五燒五痛 久後轉劇
汝等 轉相教誡 如佛經法 無得犯也@
彌勒菩薩 合掌白言 世人惡苦 如是如是 佛皆慈哀 悉度脫之 受佛重誨 不敢違失


#@ 親見淨國、蓮池海會 邊地疑城（三十八至四十一品）

#38
佛告阿難 若曹欲見無量清淨平等覺 及諸菩薩阿羅漢等 所居國土
應起西向 當日沒處 恭敬頂禮 稱念南無阿彌陀佛@
阿難即從座起 面西合掌 頂禮白言
我今願見極樂世界阿彌陀佛 供養奉事 種諸善根

頂禮之間 忽見阿彌陀佛 容顏廣大 色相端嚴 如黃金山 高出一切諸世界上@
又聞十方世界諸佛如來 稱揚讚歎阿彌陀佛種種功德 無礙無斷

阿難白言 彼佛淨剎 得未曾有 我亦願[樂|ngaau] 生於彼土@
世尊告言 其中生者 已曾親近 無量諸佛 植衆德本 汝欲生彼 應當一心 歸依瞻仰@
作是語時 阿彌陀佛 即於掌中 放無量光 普照一切 諸佛世界 時諸佛國 皆悉明現
如處一尋

以阿彌陀佛 殊勝光明 極清淨故 於此世界 所有黑山雪山 金剛鐵圍 大小諸山
江河叢林 天人宮殿 一切境界 無不照見 譬如日出 明照世間
乃至 泥犁溪谷 幽冥之處 悉大開闢 皆同一色 猶如劫水 彌滿世界
其中萬物 沉沒不現 滉瀁浩汗 唯見大水
彼佛光明 亦復如是 聲聞菩薩 一切光明 悉皆隱蔽 唯見佛光 明耀顯赫

此會四衆 天龍八部 人非人等 皆見極樂世界 種種莊嚴
阿彌陀佛 於彼高座 威德巍巍 相好光明 聲聞菩薩 圍繞恭敬
譬如 須彌山王 出於海面 明現照耀 清淨平正 無有雜穢 及異形類
唯是 衆寶莊嚴 聖賢共住

阿難及諸菩薩衆等 皆大歡喜 踊躍作禮 以頭著地 稱念南無阿彌陀三藐三佛陀@
諸天人民 以至蜎飛蠕動 睹斯光者 所有疾苦 莫不休止 一切憂惱 莫不解脫
悉皆慈心作善 歡喜快樂 鐘磬琴瑟 箜篌樂器 不鼓自然皆作五音

諸佛國中 諸天人民 各持華香 來於虛空 散作供養@
爾時 極樂世界 過於西方 百千俱胝那由他國
以佛威力 如對目前 如淨天眼 觀一尋地
彼見此土 亦復如是 悉睹 娑婆世界 釋迦如來 及比丘衆 圍繞說法


#39
爾時佛告阿難 及慈氏菩薩
汝見極樂世界宮殿 樓閣 泉池 林樹 具足微妙 清淨莊嚴不
汝見欲界諸天 上至色究竟天 雨諸香華 遍佛剎不@
阿難對曰 唯然已見@
汝聞阿彌陀佛大音宣布一切世界 化衆生不@
阿難對曰 唯然已聞

佛言 汝見彼國淨行之衆 遊處虛空 宮殿隨身無所障礙 遍至十方供養諸佛不
 　　及見彼等念佛相續不@
 　　復有衆鳥住虛空界 出種種音 皆是化作 汝悉見不@
慈氏白言 如佛所說一一皆見

@6
佛告彌勒|彼國人民|有胎生者|汝復見不
彌勒白言|世尊我見|極樂世界|人住胎者|如夜摩天|處於宮殿
又見衆生|於蓮華內|結跏趺坐|自然化生
何因緣故|彼國人民|有胎生者|有化生者
@/


#40
@6
佛告慈氏|若有衆生|以疑惑心|修諸功德|願生彼國|不了佛智
不思議智|不可稱智|大乘廣智|無等無倫|最上勝智
於此諸智|疑惑不信|猶信罪福|修習善本|願生其國
@/

復有衆生 積集善根 希求佛智 普遍智 無等智 威德廣大不思議智
於自善根 不能生信 故於往生 清淨佛國 意志猶豫 無所專據
然猶續念不絕 結其善願為本 續得往生 是諸人等
以此因緣 雖生彼國 不能前至 無量壽所 道止佛國界邊 七寶城中

佛不使爾 身行所作 心自趣向 亦有寶池蓮華 自然受身 飲食快樂 如忉利天
於其城中 不能得出 所居舍宅在地 不能隨意高大 於五百歲
常不見佛 不聞經法 不見菩薩聲聞聖衆
其人智慧不明 知經復少 心不開解 意不歡樂 是故於彼 謂之胎生

若有衆生 明信佛智 乃至勝智 斷除疑惑 信己善根 作諸功德 至心迴向
皆於七寶華中 自然化生 跏趺而坐 須臾之頃 身相光明 智慧功德
如諸菩薩 具足成就

彌勒當知 彼化生者 智慧勝故
其胎生者 五百歲中 不見三寶 不知菩薩法式 不得修習功德 無因奉事無量壽佛
當知此人 宿世之時 無有智慧 疑惑所致


#41
@6=
譬如轉輪聖王=有七寶獄=王子得罪=禁閉其中=層樓綺殿=寶帳金床
>欄窗榻座=妙飾奇珍=飲食衣服=如轉輪王=而以金鏁=繫其兩足
>諸小王子=寧[樂|ngaau]此不
>慈氏白言=不也世尊=彼幽縶時=心不自在
但以種種方便=欲求出離=求諸近臣=終不從心=輪王歡喜=方得解脫
@/

@6=
>佛告彌勒=此諸衆生=亦復如是=+若有墮於疑悔
希求佛智=至廣大智=於自善根=不能生信=由聞佛名=起信心故
雖生彼國=於蓮華中=不得出現=彼處華胎=猶如園苑=宮殿之想
>何以故=彼中清淨=無諸穢惡=>然於=五百歲中=不見三寶
不得供養=奉事諸佛=遠離一切=殊勝善根=以此為苦=不生欣[樂|ngaau]
@/

@6
若此衆生|識其罪本|深自悔責|求離彼處|往昔世中|過失盡已
然後乃出|即得往詣|無量壽所|聽聞經法|久久亦當|開解歡喜
亦得遍供|+無數無量諸佛 修諸功德
汝阿逸多|當知疑惑|於諸菩薩|為大損害|為失大利
是故應當|明信諸佛|無上智慧
@/

慈氏白言 云何此界 一類衆生 雖亦修善 而不求生@
佛告慈氏 此等衆生 智慧微淺 分別西方 不及天界 是以非樂 不求生彼@
慈氏白言 此等衆生 虛妄分別 不求佛剎 何免輪迴

佛言彼等 所種善根 不能離相 不求佛慧 深著世樂 人間福報
雖復修福 求人天果 得報之時 一切豐足 而未能出 三界獄中
假使父母妻子 男女眷屬 欲相救免 邪見業王 未能捨離 常處輪迴 而不自在

汝見 愚癡之人 不種善根 但以世智聰辯 增益邪心 云何出離 生死大難@
復有衆生 雖種善根 作大福田 取相分別 情執深重 求出輪迴 終不能得@
若以 無相智慧 植衆德本 身心清淨 遠離分別 求生淨剎 趣佛菩提 當生佛剎
永得解脫


#@ 菩薩往生 流通此經 更勸精進（四十二品至終）

#42
彌勒菩薩白佛言 今此娑婆世界 及諸佛剎 不退菩薩當生極樂國者 其數幾何 @
佛告彌勒 於此世界 有七百二十億菩薩 已曾供養無數諸佛 植衆德本 當生彼國@
諸小行菩薩 修習功德 當往生者 不可稱計

不但我剎諸菩薩等 往生彼國 他方佛土亦復如是 @
從遠照佛剎 有十八俱胝那由他菩薩摩訶薩 生彼國土@
東北方寶藏佛剎 有九十億不退菩薩 當生彼國

從無量音佛剎 光明佛剎 龍天佛剎 勝力佛剎 師子佛剎 離塵佛剎 德首佛剎
仁王佛剎 華幢佛剎 不退菩薩當往生者 或數十百億 或數百千億 乃至萬億

其第十二佛名無上華 彼有無數諸菩薩衆 皆不退轉 智慧勇猛
已曾供養無量諸佛 具大精進 發趣一乘
於七日中 即能攝取百千億劫 大士所修堅固之法 斯等菩薩 皆當往生

其第十三佛名曰無畏 彼有七百九十億大菩薩衆
諸小菩薩及比丘等 不可稱計 皆當往生@
十方世界諸佛名號及菩薩衆當往生者 但說其名 窮劫不盡


#43
佛告慈氏 汝觀彼諸菩薩摩訶薩 善獲利益 若有善男子 善女人 得聞阿彌陀佛名號
能生一念喜愛之心 歸依瞻禮 如說修行 當知此人為得大利 當獲如上所說功德
心無下劣 亦不貢高 成就善根 悉皆增上
當知此人非是小乘 於我法中 得名第一弟子

是故告汝天人世間 阿修羅等 應當愛[樂|ngaau]修習 生希有心 於此經中生導師想
欲令無量衆生 速疾安住得不退轉 及欲見彼廣大莊嚴 攝受殊勝佛剎
圓滿功德者 當起精進 聽此法門

為求法故 不生退屈諂偽之心 設入大火 不應疑悔 何以故
彼無量億諸菩薩等 皆悉求此微妙法門 尊重聽聞 不生違背
多有菩薩 欲聞此經而不能得 是故汝等應求此法


#44
@6=
若於來世=>乃至正法滅時=當有衆生=植諸善本=已曾供養=無量諸佛
由彼如來=加威力故=能得如是=廣大法門=攝取受持=當獲廣大一切智智
於彼法中=廣大勝解=獲大歡喜=廣為他說=常[樂|ngaau]修行
@/

諸善男子 及善女人 能於是法 若已求 現求 當求者 皆獲善利
汝等應當 安住無疑 種諸善本 應常修習 使無疑滯 不入一切種類珍寶成就牢獄@
阿逸多 如是等類 大威德者 能生佛法廣大異門
由於此法 不聽聞故 有一億菩薩退轉阿耨多羅三藐三菩提

@6
若有衆生|於此經典|書寫供養|受持讀誦|於須臾頃|為他演說
勸令聽聞|不生憂惱|乃至晝夜|思惟彼剎|及佛功德|於無上道
終不退轉|彼人臨終|假使三千|大千世界|滿中大火|亦能超過
生彼國土|是人已曾|值過去佛|受菩提記|一切如來|同所稱讚
是故應當|專心信受|持誦說行
@8


#45
吾今為諸衆生 說此經法 令見無量壽佛 及其國土一切所有
@6
所當為者|皆可求之|無得以我|滅度之後|復生疑惑
當來之世|經道滅盡|>我以|慈悲哀愍|特留此經|止住百歲
其有衆生|值斯經者|隨意所願|皆可得度
@/

@6=
如來興世=難值難見=諸佛經道=難得難聞=遇善知識=聞法能行
此亦為難=若聞斯經=信[樂|ngaau]受持=難中之難=無過此難
若有衆生=得聞佛聲=慈心清淨=踊躍歡喜=衣毛為起=或淚出者
皆由前世=曾作佛道=故非凡人
若聞佛號=心中狐疑=於佛經語=都無所信=+皆從惡道中來
宿殃未盡=未當度脫=故心狐疑=不信向耳
@/


#46
@6
佛告彌勒|諸佛如來|無上之法|十力無畏|無礙無著|甚深之法
及波羅蜜等|菩薩之法|非易可遇|能說法人|亦難開示|堅固深信
時亦難遭
@/

@6
我今如理宣說|如是廣大|微妙法門|一切諸佛|之所稱讚|咐囑汝等
>作大守護|為諸有情|長夜利益|莫令衆生|淪墮五趣|備受危苦
>應勤修行|隨順我教|當孝於佛|常念師恩|當令是法|久住不滅
>當堅持之|無得毀失|無得為妄|增減經法|常念不絕|則得道捷
>我法如是|作如是說|如來所行|亦應隨行|種修福善|求生淨剎
@/


#47
爾時世尊而說頌曰
@4
　若不往昔修福慧|於此正法不能聞|已曾供養諸如來|則能歡喜信此事
　惡驕懈怠及邪見|難信如來微妙法|譬如盲人恆處闇|不能開導於他路
　唯曾於佛植衆善|救世之行方能修|聞已受持及書寫|讀誦讚演并供養
　如是一心求淨方|決定往生極樂國|假使大火滿三千|乘佛威德悉能超
@/

@4
　如來深廣智慧海|唯佛與佛乃能知|聲聞億劫思佛智|盡其神力莫能測
　如來功德佛自知|唯有世尊能開示|人身難得佛難值|信慧聞法難中難
　若諸有情當作佛|行超普賢登彼岸|是故博聞諸智士|應信我教如實言
　如是妙法幸聽聞|應常念佛而生喜|受持廣度生死流|佛說此人真善友
@/


#48
爾時世尊說此經法 天人世間 有萬二千那由他億衆生 遠離塵垢 得法眼淨
二十億衆生 得阿那含果 六千八百比丘 諸漏已盡 心得解脫
四十億菩薩 於無上菩提住不退轉 以弘誓功德而自莊嚴 二十五億衆生 得不退忍

四萬億那由他百千衆生 於無上菩提未曾發意 今始初發 種諸善根
願生極樂 見阿彌陀佛 皆當往生彼如來土 各於異方次第成佛 同名妙音如來

復有十方佛剎 若現在生 及未來生 見阿彌陀佛者 各有八萬俱胝那由他人
得授記法忍 成無上菩提 彼諸有情 皆是阿彌陀佛宿願因緣 俱得往生極樂世界

爾時三千大千世界 六種震動 并現種種希有神變 放大光明 普照十方
復有諸天於虛空中 作妙音[樂|ngo] 出隨喜聲 乃至色界諸天悉皆得聞
歎未曾有 無量妙華紛紛而[降|gong]
尊者阿難 彌勒菩薩 及諸菩薩 聲聞 天龍八部 一切大衆
聞佛所說 皆大歡喜 信受奉行`;

var noa = get('noaudio');
new GDHReader('佛說大乘無量壽莊嚴清淨平等覺經', SUTRA_TEXT, titles, !noa && audiofxn)
.setTOCBreak(10);
if (!noa) readerHost.useLineBreak();

readerHost.postRender = () => {
  var prefix = '<ending id="ending">', suffix = '</ending>';
  var partAnno = [ '[偏事　]', '[偏事　]', '[偏　理]',
                   '[偏　理]', '[偏事　]', '[偏　理]' ];
  w(prefix);
  var i, cumuPins = 0, cumuSegs = 0, cumuZis = 0, len = readerHost.partStats.length;
  w('<center><table><tr><td><ol>',
    '<li>粵語讀誦錄音採自YouTube上“妙音姐姐”的作品（阿彌陀佛！），分割為各段。</li>',
    '<li>為學方便，擅作分會如下（未出現在正文）：</li>',
    '</ol></td></tr></table>',
    '<table bgcolor="white" cellpadding="10px" cellspacing="0">',
    '<tr><td style="color:gray; border-top:1px solid gray; border-bottom:1px solid gray">',
    '<table border=0 cellpadding=0 cellspacing=0>');
  for (i=0; i<len; ++i) {
    var x = readerHost.partStats[i].title.split('（');
    w('<tr><td>第', zNumber(i+1), '會&nbsp;&nbsp;</td><td>', x[0], '</td><td>（', x[1], '</tr>');
    //w('<a href="#hui_', i+1, '">第', zNumber(i+1), '會</a> ', readerHost.partStats[i].title, '\n');
  }
  w('</table><pre>');
  w('\n　　一部大經 ＝ 當感師恩&nbsp;＋&nbsp;依教奉行 ＝ 大慈大悲',
    '\n　　　　　　 　  第一會&nbsp;　&nbsp;　　　　　　&nbsp;大善',
    '\n　　　　　　 　  第二會&nbsp;　&nbsp;　　　　　　&nbsp;大利',
    '\n　　　　　　 　  第三會&nbsp;　&nbsp;　　　　　　&nbsp;大德',
    '\n　　　　　　 　  　　　&nbsp;　&nbsp;　第四會　　&nbsp;大修（戒律）',
    '\n　　　　　　 　  第五會&nbsp;　&nbsp;　　　　　　&nbsp;大信',
    '\n　　　　　　 　  　　　&nbsp;　&nbsp;　第六會　　&nbsp;大讚（弘揚）\n\n');
  for (i=0; i<len; ++i) {
    var ps = readerHost.partStats[i];
    cumuPins += ps.cntPins;
    cumuSegs += ps.cntSegs;
    cumuZis += ps.cntZis;
    w('　　第', zNumber(i+1), '會　', toW(ps.cntPins,2), '品 ', toW(ps.cntSegs,3), '段 ',
      toW(ps.cntZis,5), '字　　', partAnno[i], '\n');
  }
  w('　　總共：　', cumuPins, '品 ', cumuSegs, '段 ', cumuZis, '字 （平均', (cumuZis/cumuSegs).toFixed(0), '字/段）',
    '</pre></td></tr></table></center><p>&nbsp;</p>',
    suffix);
};

