
const this_book = new MyBookInfo('占經•一八九相節錄', '天竺三藏菩提燈譯')
//.setImage(window['IMAGE_KSITIGARBHA'])
.set('paraPrefix', '')
.set('breakLen', 27)
.addContent(

`chapter#甲、 修持佛法及道业精进等

　　　　一者，求上乘得不退；　　　　　二者，所求果現當證；\
|　　　　三者，求中乘得不退；　　　　　四者，求下乘得不退；\
|　　　　五者，求神通得成就；　　　　　六者，修四梵得成就；\
|　　　　七者，修世禪得成就；　　　　　八者，所欲受得妙戒；\
|　　　　九者，所曾受得戒具；　　　　十　者，求上乘未住信；\
|　　　十一者，求中乘未住信；　　　　十二者，求下乘未住信；\
|　　　十三者，所觀人為善友；　　　　十四者，隨所聞是正法；\
|　　　十五者，所觀人為惡友；　　　　十六者，隨所聞非正教；\
|　　　十七者，所觀人有實德；　　　　十八者，所觀人無實德；\
|　　　十九者，所觀義不錯謬；　　　二十　者，所觀義是錯謬；\
|　　二十一者，有所誦不錯謬；　　　二十二者，有所誦是錯謬；\
|　　二十三者，所修行不錯謬；　　　二十四者，所見聞是善相；\
|　　二十五者，有所證為正實；　　　二十六者，有所學是錯謬；\
|　　二十七者，所見聞非善相；　　　二十八者，有所證非正法；\
|　　二十九者，有所獲邪神持；　　　三十　者，所能說邪智辯；\
|　　三十一者，所玄知非人力；　　　三十二者，應先習觀智道；\
|　　三十三者，應先習禪定道；　　　三十四者，觀所學無障礙；\
|　　三十五者，觀所學是所宜；　　　三十六者，觀所學非所宜；\
|　　三十七者，觀所學是宿習；　　　三十八者，觀所學非宿習；\
|　　三十九者，觀所學善增長；　　　四十　者，觀所學方便少；\
|　　四十一者，觀所學無進趣；　　　四十二者，所求果現未得；\
|　　四十三者，求出家當得去；　　　四十四者，求聞法得教示；\
|　　四十五者，求經卷得讀誦；　　　四十六者，觀所作是魔事；

chapter#乙、 人世间学业、事业

　　四十七者，觀所作事成就；　　　四十八者，觀所作事不成；\
|　　四十九者，求大富財盈滿；　　　五十　者，求官位當得獲；\
|　　五十一者，求壽命得延年；　　　五十二者，求世仙當得獲；\
|　　五十三者，觀學問多所達；　　　五十四者，觀學問少所達；

chapter#丙、 人际、姻缘、亲戚、子女等

　　五十五者，求師友得如意；　　　五十六者，求弟子得如意；\
|　　五十七者，求父母得如意；　　　五十八者，求男女得如意；\
|　　五十九者，求妻妾得如意；　　　六十　者，求同伴得如意；\
|　　六十一者，觀所慮得和合；　　　六十二者，所觀人心懷恚；\
|　　六十三者，求無恨得歡喜；　　　六十四者，求和合得如意；\
|　　六十五者，所觀人心歡喜；　　　六十六者，所思人得會見；\
|　　六十七者，所思人不復會；　　　六十八者，所請喚得來集；\
|　　六十九者，所憎惡得離之；　　　七十　者，所愛敬得近之；\
|　　七十一者，觀欲聚得和集；　　　七十二者，觀欲聚不和集；\
|　　七十三者，所請喚不得來；　　　七十四者，所期人必當至；\
|　　七十五者，所期人住不來；　　　七十六者，所觀人得安吉；\
|　　七十七者，所觀人不安吉；　　　七十八者，所觀人已無身；

chapter#丁、 事情、事物、财物、器具等

　　七十九者，所望見得睹之；　　　八十　者，所求覓得見之；\
|　　八十一者，求所聞得吉語；　　　八十二者，所求見不如意；\
|　　八十三者，觀所疑即為實；　　　八十四者，觀所疑為不實；\
|　　八十五者，所觀人不和合；　　　八十六者，求佛事當得獲；\
|　　八十七者，求供具當得獲；　　　八十八者，求資生得如意；\
|　　八十九者，求資生少得獲；　　　九十　者，有所求皆當得；\
|　　九十一者，有所求皆不得；　　　九十二者，有所求少得獲；\
|　　九十三者，有所求得如意；　　　九十四者，有所求速當得；\
|　　九十五者，有所求久當得；　　　九十六者，有所求而損失；\
|　　九十七者，有所求得吉利；　　　九十八者，有所求而受苦；\
|　　九十九者，觀所失求當得；　一百　　　者，觀所失求不得；\
|一百　　一者，觀所失自還得；

chapter#戊、 国家、社会、出外、迁移、居家、灾劫、吉凶等

一百　　二者，求離厄得脫難；　一百　　三者，求離病得除愈；\
|一百　　四者，觀所去無障礙；　一百　　五者，觀所去有障難；\
|一百　　六者，觀所住得安止；　一百　　七者，觀所住不得安；\
|一百　　八者，所向處得安快；　一百　　九者，所向處有厄難；\
|一百一十　者，所向處為魔網；　一百一十一者，所向處難開化；\
|一百一十二者，所向處可開化；　一百一十三者，所向處自獲利；\
|一百一十四者，所遊路無惱害；　一百一十五者，所遊路有惱害；\
|一百一十六者，君民惡饑饉起；　一百一十七者，君民惡多疾疫；\
|一百一十八者，君民好國豐樂；　一百一十九者，君無道國災亂；\
|一百二十　者，君修德災亂滅；　一百二十一者，君行惡國將破；\
|一百二十二者，君修善國還立；　一百二十三者，觀所避得度難；\
|一百二十四者，觀所避不脫難；　一百二十五者，所住處眾安隱；\
|一百二十六者，所住處有障難；　一百二十七者，所依聚眾不安；\
|一百二十八者，閑靜處無諸難；　一百二十九者，觀怪異無損害；\
|一百三十　者，觀怪異有損害；　一百三十一者，觀怪異精進安；

chapter#己、 梦境吉凶

一百三十二者，觀所夢無損害；　一百三十三者，觀所夢有所損；\
|一百三十四者，觀所夢精進安；　一百三十五者，觀所夢為吉利；

chapter#庚、 目前灾难可否化解

一百三十六者，觀障亂速得離；　一百三十七者，觀障亂漸得離；\
|一百三十八者，觀障亂不得離；　一百三十九者，觀障亂一心除；\
|一百四十　者，觀所難速得脫；　一百四十一者，觀所難久得脫；\
|一百四十二者，觀所難受衰惱；　一百四十三者，觀所難精進脫；\
|一百四十四者，觀所難命當盡；

chapter#辛、 身体健康、疾病方面，何方法

一百四十五者，觀所患大不調；　一百四十六者，觀所患非人惱；\
|一百四十七者，觀所患合非人；　一百四十八者，觀所患可療治；\
|一百四十九者，觀所患難療治；　一百五十　者，觀所患精進差；\
|一百五十一者，觀所患久長苦；　一百五十二者，觀所患自當差；\
|一百五十三者，所向醫堪能治；　一百五十四者，觀所療是對治；\
|一百五十五者，所服藥當得力；　一百五十六者，觀所患得除愈；\
|一百五十七者，所向醫不能治；　一百五十八者，觀所療非對治；\
|一百五十九者，所服藥不得力；　一百六十　者，觀所患命當盡；

chapter#壬、 过去世果报业缘

一百六十一者，從地獄道中來；　一百六十二者，從畜生道中來；\
|一百六十三者，從餓鬼道中來；　一百六十四者，從阿修羅道中來；\
|一百六十五者，從人道中而來；　一百六十六者，從天道中而來；\
|一百六十七者，從在家中而來；　一百六十八者，從出家中而來；\
|一百六十九者，曾值佛供養來；　一百七十者，曾親供養賢聖來；\
|一百七十一者，曾得聞深法來；

chapter#奎、 未来世果报业缘

一百七十二者，捨身已入地獄；　一百七十三者，捨身已作畜生；\
|一百七十四者，捨身已作餓鬼；　一百七十五者，捨身已作阿修羅；\
|一百七十六者，捨身已生人道；　一百七十七者，捨身已為人王；\
|一百七十八者，捨身已生天道；　一百七十九者，捨身已為天王；\
|一百八十者，捨身已聞深法；　　一百八十一者，捨身已得出家；\
|一百八十二者，捨身已值聖僧；　一百八十三者，捨身已生兜率天；\
|一百八十四者，捨身已生淨佛國；一百八十五者，捨身已尋見佛；\
|一百八十六者，捨身已住下乘；　一百八十七者，捨身已住中乘；\
|一百八十八者，捨身已獲果證；　一百八十九者，捨身已住上乘。
`);
