ZJL.add(999, null,
`/TEXT339/宗鑑錄序
/R/左朝請郎尚書禮部員外郎護軍楊傑撰

諸佛真語。以心為宗。眾生信道。以宗為鑑。眾生界即諸佛界。因迷而為眾生。諸佛心是眾生心。因悟而成諸佛。心如明鑑。萬象歷然。佛與眾生。其猶影像。涅槃生死。俱是強名。鑒體寂而常照。鑒光照而常寂。心佛眾生。三無差別。國初吳越永明智覺壽禪師。證最上乘。了第一義。洞究教典。深達禪宗。稟奉律儀。廣行利益。因讀[楞伽經]云。佛語心為宗。乃製宗鑑錄。於無疑中起疑。非問處設問。為不請友。真大導師。擲龍宮之寶。均施群生。徹祖門之關。普容來者。舉目而視。有欲皆充。信手而拈。有疾皆愈。蕩滌邪見。指歸妙源。所謂舉一心為宗。照萬法為鑑矣。若人以佛為鑑。則知戒定慧為諸善之宗。人天聲聞緣覺菩薩如來。由此而出。一切善類莫不信受。若以眾生為鑑。則知貪瞋癡為諸惡之宗。脩羅旁生地獄鬼趣。由此而出。一切惡類莫不畏憚。善惡雖異。其宗則同。返鑑其心。則知靈明湛寂。廣大融通。無為無住。無修無證。無塵可染。無垢可磨。為一切諸法之宗矣。初吳越忠懿王。序之。祕于教藏。至元豐中。皇弟魏端獻王。鏤板分施名藍。四方學者。罕遇其本。元祐六年夏。游東都法雲道場。始見錢唐新本。尤為精詳。乃吳人徐思恭。請法涌禪師。同永樂法真二三耆宿。遍取諸錄。用三乘典籍。聖賢教語。校讀成就。以廣流布。其益甚博。法涌知予喜閱是錄。因請為序云。


/TEXT339/宗鏡錄序
/R/天下大元帥吳越國王俶製

詳夫。域中之教者三。正君臣。親父子。厚人倫。儒。吾之師也。寂兮寥兮。視聽無得。自微妙。升虛無。以止乎乘風馭景。君得之則善建不拔。人得之則延貺無窮。道。儒之師也。四諦十二因緣。三明八解脫。時習不忘。日修以得。一登果地。永達真常。釋道之宗也。惟此三教。並自心修。心鏡錄者。智覺禪師所撰也。總乎百卷。包盡微言。

我佛金口所宣。盈于海藏。蓋亦提誘後學。師之智慧辯才。演暢萬法。明了一心。禪際河遊。慧間雲布。數而稱之。莫能盡紀。聊為小序。以頌宣行云爾。
`);
