XXSZ.sectionTitle = '修行守則';
XXSZ.volNum = 1;
XXSZ.text = `<table cellspacing="0" cellpadding="0">
<tr><td colspan=2 align="right" style="padding-right:5px">
/BQKaiTi18L/知恩報恩</td>
<td>
/BQKaiTi14L/上報四重恩<br>下濟三途苦
</td></tr></table>

/TEXT339/【學為人師 行為世範】

/TEXT339/一、教依
/class BQKaiTi14/
⑴  總依<a href="../../../淨土宗/index.html">淨宗五經一論</a>
⑵  專依<a href="../../../淨土宗/《無量壽經》/index.html">無量壽經夏會集本</a>
　　　 <a href="../books/0871.htm">佛說阿彌陀經蕅益要解</a>　<ail>【<a href="../books/0627.htm">淨空法師講記</a>；<a href="../books/0900.htm">淨空法師演義會本</a>】</ail>
　　　 普賢行願品清涼疏鈔　　<ail>【<a href="../books/0662.htm">淨空法師講記</a>】</ail>
⑶  　　淨宗祖師語錄　　　　　<ail>【<a href="../../../淨土宗/西方二聖開示/JK-teachings.html">淨空法師法語我集</a>】</ail>
　　　 印光大師文鈔　　　　　<ail>【<a href="../books2/1288.htm">增廣正編</a>；<a href="../../../淨土宗/西方二聖開示/印光大師文鈔菁華錄.html">菁華錄</a>】</ail>
/_class/

/TEXT339/二、理依
/class BQKaiTi14/
⑴  信依要解六信，受持如來甚深法藏，護佛種性，常使不絕。
⑵  十界一真，世出世法，唯心所現，唯識所變，觀法如化，三昧常寂，通諸法性，達眾生相。
⑶  住真實慧，開化顯示真實之際，惠以真實之利，於諸眾生，視若自己，念念普利群生，心心流入覺海。
⑷  以真誠、清淨、平等、正覺、慈悲之心，以看破、放下、自在、隨緣之行，破除一切妄想執著。
⑸  發菩提心，一向專念阿彌陀佛，決定一生往生不退成佛。
/_class/

/TEXT339/三、行依
/class BQKaiTi14/
⑴  觀經三福：一者孝養父母，奉事師長，慈心不殺，修十善業。
　　　　　　 二者受持三皈，具足眾戒，不犯威儀。
　　　　　　 三者發菩提心，深信因果，讀誦大乘，勸進行者。
⑵  六和敬：　見和同解，戒和同修，身和同住，口和無諍，意和同悅，利和同均。
⑶  三無漏學：起心動念，遠離三毒惡惱，必與清淨（戒）、平等（定）、正覺（慧）相應。
⑷  菩薩六度：恆以布施、持戒、忍辱、精進、禪定、智慧，六度之行，教化眾生，住於無上真正之道。
⑸  普賢十願：咸共遵修普賢大士之德，
　　　　　　 一禮敬諸佛，二稱讚如來，三廣修供養，四懺悔業障，五隨喜功德，
　　　　　　 六請轉法輪，七請佛住世，八常隨佛學，九恆順眾生，十普皆迴向。
　　　　　　 學習菩薩，修此大願，無有窮盡，念念相續，無有間斷，身語意業，無有疲厭。
/_class/

/TEXT339/四、果求
/class BQKaiTi14/
⑴  實踐四好，存好心、說好話、行好事、做好人，成就自身，莊嚴眾行，規範具足。
⑵  效法<a href="../../../佛學基礎/《大方廣佛華嚴經》/善財童子五十三參.html">華嚴五三善友</a>，誓作世間眾生、家庭、工作、社團之好模範。
⑶  和睦各各族群、宗教、文化，存異求同，共存共榮。
⑷  安定社會，崇德興仁，互助合作，人皆均富樂利幸福美滿，勸諭策進世界永久和平。
⑸  深信因果，信願念佛，求生淨土，共諸上善，同會彌陀一乘願海。
/_class/

/KaiTi-R/以上四綱要謹貢獻給
/KaiTi-R/首屆淨宗聯誼會諸上善人參考指教
/KaiTi-R/釋淨空敬獻 一九九七年十二月`;
