XXSZ.sectionTitle = '大乘無量壽經';
XXSZ.volNum = 2;
XXSZ.text = `
/TEXT339/【大乘無量壽經】
${COL_START}
/bq/
/olzh BQKaiTi14L/
心常諦住度世之道。
為諸庶類，作不請之友。
於諸眾生，視若自己。
不計眾苦。
少欲知足。
於諸有情，常懷慈忍。
和顏愛語，勸諭策進。
恭敬三寶。
奉事師長。
善護口業，不譏他過。
善護身業，不失律儀。
善護意業，清淨無染。
觀法如化，三昧常寂。
發菩提心，一向專念，<br>阿彌陀佛。
奉持齋戒。
有空閒時，端正身心，<br>絕欲去憂，慈心精進。
不當瞋怒嫉妒。
要當孝順，至誠忠信。
當信作善得福。
不得貪餮慳惜。
//
${COL_DIV30}
/olzh@21 BQKaiTi14L/
不殺生。
不偷盜。
不淫欲。
不妄言。
不綺語。
不惡口。
不兩舌。
不貪。
不瞋。
不痴。
檢斂端直，身心潔淨。
父子兄弟夫婦親屬，<br>當相敬愛。
言色常和，莫相違戾。
擇其善者，勤而行之。
當勤精進。
勿得隨心所欲，<br>虧負經戒。
何不於強健時，<br>努力修善，欲何待乎。
敬於佛者，是為大善。
實當念佛，截斷狐疑。
開示正道，度未度者。
洗除心垢。
言行忠信，表裡相應。
//
${COL_DIV30}
/olzh@41 BQKaiTi14L/
受佛明誨，專精修學，<br>如教奉行，不敢有疑。
端心正意，不為眾惡。
端身正念，言行相副，<br>所作至誠。
獨作諸善，不為眾惡。
尊聖敬善。
仁慈博愛。
身心潔淨，與善相應。
勿隨嗜欲，不犯諸惡。
言色當和，身行當專，<br>動作瞻視，安定徐為。
慈心專一，齋戒清淨。
自相約檢，和順義理，<br>歡樂慈孝。
所作如犯，則自悔過。
去惡就善，朝聞夕改。
改往修來，洗心易行。
心無下劣，亦不貢高。
為求法故，不生退屈<br>諂偽之心。
當孝於佛。
常念師恩。
種修福善，求生淨剎。
積功累德。
//
${COL_END}`;

