var lARBRE = `
!!〇〇/ail|《大乘起信論》有兩個重點：一、對本性的觀照，二、對緣起的觀照。能掌握此兩觀照，就能正確掌握大乘正見。/
!!
〇/kp0|壹、論主略史/                                             [1#VOL]
〇〇（一）在家因緣（出生背景，家學淵源，專長興趣）
〇〇（二）出家因緣（對抗、歸依、修學佛教）
〇〇（三）修學因緣（遵從師教，中印度弘法，北印度弘法，
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇回小向大） [?2#VOL]
〇/kp0|貳、解釋標題/                                             [KP?2&loc=a01#VOL]
〇〇/kp0|甲一、別釋/
〇〇〇/kp0|釋大乘/
〇〇〇〇釋大
〇〇〇〇釋乘
〇〇〇〇合釋大乘
〇〇〇/kp0|釋起信/                                       [3#VOL]
〇〇〇〇釋信
〇〇〇〇釋起信
〇〇〇〇〇能信：心
〇〇〇〇〇所信：內因力（信根本）；外緣力（信佛、法、僧）
〇〇〇〇〇〇內因力與外緣力和合，生起大乘的功德
〇〇〇/kp0|釋論/
〇〇/kp0|甲二、合釋/
〇〇〇/kp0|乙一、明心/：有情眾生五種種性，約生滅門而立
〇〇〇/kp0|乙二、淨心/：六即佛                                   [4#VOL]
!!
〇/kp0|叁、隨文釋義/〰/ail|（根據會性法師的科判，大致蕅益大師《大乘起信論裂網疏》之簡化）（本論學習主要依止法藏、蕅益二師）/
〇〇/kp0|甲一、//b|歸敬述意/（類於序分）〰〰【/see:歸敬述意|經文/】
〇〇〇/kp0|乙一、歸依三寶/
〇〇〇/kp0|乙二、述造論意/：除疑，捨邪執，起大乘正信
〇〇/kp0|甲二、//b|正說五分/（類於正宗分）                       [5#VOL]
〇〇〇/kp0|乙一、標科/
〇〇〇〇/kp0|丙一、標宗/：有法能起摩訶衍信根
〇〇〇〇/kp0|丙二、列科/：因緣分，立義分，解釋分，修行信心分，勸修利益分
〇〇〇/kp0|乙二、正說/
〇〇〇〇/kp0|丙一、//b|因緣分/〰〰【/see:因緣分|經文/】
〇〇〇〇〇/kp0|丁一、標章/
〇〇〇〇〇/kp0|丁二、征釋/
〇〇〇〇〇〇/kp0|戊一、正明八因/
〇〇〇〇〇〇〇/kp0|己一、總征/：有何因緣，而造此論？
〇〇〇〇〇〇〇/kp0|己二、別釋/：造此論的八個因緣
〇〇〇〇〇〇/kp0|戊二、釋疑明意/                                 [6#VOL]
〇〇〇〇〇〇〇/kp0|己一、釋疑/
〇〇〇〇〇〇〇〇/kp0|庚一、征問/
〇〇〇〇〇〇〇〇/kp0|庚二、答釋/
〇〇〇〇〇〇〇〇〇/kp0|辛一、總釋/
〇〇〇〇〇〇〇〇〇/kp0|辛二、別釋/
〇〇〇〇〇〇〇/kp0|己二、明意/
〇〇〇〇/kp|丙二、//b|立義分/〰〰【/see:立義分|經文/】
〇〇〇〇〇/kp|丁一、結前生起/
〇〇〇〇〇/kp|丁二、正立義宗/
〇〇〇〇〇〇/kp|戊一、總標/
〇〇〇〇〇〇〇/b|法/者：能詮，是法的自體
〇〇〇〇〇〇〇/b|義/者：所詮，是法的含義
〇〇〇〇〇〇/kp|戊二、別說/
〇〇〇〇〇〇〇/kp|己一、出法體/
〇〇〇〇〇〇〇〇/kp|庚一、就體總立/
〇〇〇〇〇〇〇〇〇因緣所生的法主要就是/b|一念心/，即/b|眾生心/
〇〇〇〇〇〇〇〇〇是心攝持一切世間雜染法，也攝持出世間功德法
〇〇〇〇〇〇〇〇〇沒有心，一切染法淨法都不能建立。有心造作、保存，才能有世間雜染法及佛菩薩功德莊嚴出現
〇〇〇〇〇〇〇〇〇大乘佛法依止心，有無量生命的觀念。小乘依空而修
〇〇〇〇〇〇〇〇/kp|庚二、開門別立/：是心有二相貌
〇〇〇〇〇〇〇〇〇/b|心真如相/：〰〰真，真實不虛；如，恆常不變。示摩訶衍體
〇〇〇〇〇〇〇〇〇/b|心生滅因緣相/：念心有隨順染淨的因緣、個體因緣的生滅。示摩訶衍自體相用
〇〇〇〇〇〇〇/kp|己二、彰名義/
〇〇〇〇〇〇〇〇/kp|庚一、明大義/
〇〇〇〇〇〇〇〇〇/b|體大/：體性者，真如平等，無增減之相，在凡不減，在聖不增，自他不二
〇〇〇〇〇〇〇〇〇/b|相大/：相狀者，念心在體性上具足無量功能德用〇〇/ail|一切法自性空，故有無量可能，故叫性具/
〇〇〇〇〇〇〇〇〇/b|用大/：生滅作用，乘性功德只是具足不能受用，要假六波羅蜜因緣才能生起善因果而得其用
〇〇〇〇〇〇〇〇〇〇一念心也會生起惡的因果，是違背真理，顛倒所生，虛妄不實。惡因果是情有理無
〇〇〇〇〇〇〇〇/kp|庚二、顯//b|乘//kp|義/
〇〇〇〇〇〇〇〇〇三世諸佛能夠成佛，一定要依止體相用三大而成就乘
〇〇〇〇〇〇〇〇〇佛法不共世間法者，有乘的功德〇〇/ail|佛法義理来到心中，能載此一念煩惱罪業之心趨向清淨安樂彼岸/
〇〇〇〇〇〇〇〇〇《瑜伽師地論》論及菩薩種性，即能成大乘種性者，有二相貌：
〇〇〇〇〇〇〇〇〇〇一、雖造惡業，速疾能悔
〇〇〇〇〇〇〇〇〇〇二、若墮惡趣，終不久留
〇〇〇〇/kp|丙三、//b|解釋分/                                    [7#VOL]
!!〇〇〇〇〇/ail|主要就是解釋生命的真實相，本論主要依據一心具足二門以觀察/
!!〇〇〇〇〇/ail|大乘因緣觀的宗旨安立在萬法唯是一心的基礎/
!!〇〇〇〇〇/ail|觀照心，依照真如門（觀差即無差的平等法界）、生滅門（觀無差成差的差別法界）/
〇〇〇〇〇/kp|丁一、結前啟後/
〇〇〇〇〇/kp|丁二、標列正解/〰〰【/see:解釋三種|經文/】
〇〇〇〇〇〇/kp|戊一、標列/
〇〇〇〇〇〇〇一者顯示正義：〰〰發明整個大乘佛法的要義和生命的真相，包括凡夫的流轉門、聖人的還滅門
〇〇〇〇〇〇〇二者對治邪執：〰〰所對治者：凡夫的我執，二乘的法執
〇〇〇〇〇〇〇三者分別發趣道相：發心趣向無上菩提，真正發心，發起直心、深心、大悲心
〇〇〇〇〇〇〇〇本論中從凡夫到成佛三種發心：信成就發心、解行發心、證發心
〇〇〇〇〇〇/kp|戊二、正解/
〇〇〇〇〇〇〇/kp|己一、//b|顯示正義/
〇〇〇〇〇〇〇〇/kp|庚一、總標二門/〰〰【/see:顯示正義|經文/】
〇〇〇〇〇〇〇〇〇心真如門：顯現隨緣不變、內心中的一個體性。本身隨順染淨因緣不能改變，叫做真實而不變
〇〇〇〇〇〇〇〇〇心生滅門：顯現一個不變隨緣的作用，心受業力的熏習，隨所造業力而生滅變化，是心的作用
〇〇〇〇〇〇〇〇〇〇古德曰此門有二義：區別義（真如與生滅區別），有通達義（兩者可互相通達）
〇〇〇〇〇〇〇〇〇真如門是染淨諸法的總相，生滅門是顯現諸法的別相
〇〇〇〇〇〇〇〇〇〇二門各總攝一切染淨諸法
〇〇〇〇〇〇〇〇〇〇二門不能分開
〇〇〇〇〇〇〇〇〇〇生滅門是我們目前所顯現的相貌，真如門是我們的歸依處
〇〇〇〇〇〇〇〇/kp|庚二、各釋二門/
〇〇〇〇〇〇〇〇〇/kp|辛一、釋//b|心真如門/
〇〇〇〇〇〇〇〇〇〇/kp|壬一、釋//b|心真如相/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、正詮顯法體/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、借言詮法/〰〰【/see:顯示正義:心真如|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|真如是一真法界，包括整個十法界染淨的因果，是一個總相的法門體。凡夫的心念有生滅/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|真如體性是超越時空的一個整體生命，在空間上是總相，在時間上是不生不滅，它是超越有時間障礙的個體生命/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|我們本來是不生不滅，因為有妄念，心向外攀緣，不喜歡安住不生不滅的本性，一念的妄動，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|開始產生很多很多所謂的個體生命，所以這些個體生命是很多很多的妄念所變現出來。/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|當我們把妄念都消滅時，這些生命的流轉果報就消失了/
〇〇〇〇〇〇〇〇〇〇〇〇〇一、迷真起妄——流轉門〇若心念發動，若非從我空、法空真理，而從自我意識，都叫做妄念
〇〇〇〇〇〇〇〇〇〇〇〇〇二、返妄歸真——還滅門〇若離妄念，則無一切境界之相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇如何消滅妄念，或者說返妄歸真的依止處             [?8#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、破遍計執〇〇即離言說相，離名字相，離心緣相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、遠離依他〇〇即畢竟平等，無有變異，不可破壞
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、唯是一心〇〇大乘佛法強調空有明瞭性，所以唯是一心，是現前一念心性
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、顯法離言/〰〰【/see:顯示正義:心真如:顯法離言|經文/】/ail|真聖人與真如接觸時之相貌，即四段經文/   [KP?8&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、明隨順悟入/〰〰【/see:顯示正義:心真如:隨順悟入|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇破所取相：一切法，雖說而無有能說、可說；乃至念頭
〇〇〇〇〇〇〇〇〇〇〇〇亦即，開始在趨向真如時，是先成就其空，後再成就其如實不空
〇〇〇〇〇〇〇〇〇〇/kp|壬二、即示大乘體/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、略標釋/〰〰〰〰【/see:顯示正義:心真如:大乘體|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇一者如實空〇〇以能究竟顯實故。所空的是遍計執跟遠離依他起，空掉心中的名言分別。故先如實空，產生否定
〇〇〇〇〇〇〇〇〇〇〇〇二者如實不空〇〇以有自體，具足無量性功德故。所對治的是遍計執，但不能生起斷滅見，因為真如有體性
〇〇〇〇〇〇〇〇〇〇〇〇〇具足無漏性功德〇〇諸法不自生，亦不從他生，不共不無因，是故說無生。以無生理，所以具足無量性功德故
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、廣釋成/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、釋空義/〰〰〰【/see:顯示正義:心真如:空義|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇如實空是顯現真實性。真實性者，一切染法不相應故
〇〇〇〇〇〇〇〇〇〇〇〇〇離一切法差別相，以無虛妄心念故，虛妄念未真實染污到我們本性
〇〇〇〇〇〇〇〇〇〇〇〇〇一切眾生，以有妄心，念念分別，皆不相應
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋不空義/〰〰【/see:顯示正義:心真如:不空義|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇如何了解生命真相                       [?9#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇從假入空：在我空、法空的無生理體中，具足常恆不變的清淨功德〇〇染法不相應是斷惡
〇〇〇〇〇〇〇〇〇〇〇〇〇從空出假：不空無相可取，唯證相應故〇〇發誓修善，能生善法，因為本性本來具足善的功能
〇〇〇〇〇〇〇〇〇/kp|辛二、釋//b|心生滅門/                    [KP?9&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇/kp|壬一、正釋此心生滅因緣相/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、明染淨生滅/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、正釋//b|心生滅/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、標名列義/〰【/see:顯示正義:心生滅門|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、標題：/b|如來藏/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇如來藏簡言之即真如，屬其不空部分，具足無漏性功德，是一念清淨平等心性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇如來藏為無明妄動風所吹，真如不守自性向外攀緣，一念的妄動而成所謂生滅心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、辨相：/b|阿賴耶識/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇不生不滅與生滅合和，非一非異，名阿賴耶識，即藏〇〇含藏一切諸法種子，變現一切法果報
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇與唯識定義有不同〇〇唯識者開導出五種種性，然無不生滅，未論眾生皆可成佛，故被判勸教
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇個體生命依止於阿賴耶識，其本性不生滅，所謂真如〇〇任何業力並未染污到清淨本性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、明用〇〇在整個生滅因緣中，阿賴耶識扮演攝與生兩個功能
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/b|覺/：〰覺悟的因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/b|不覺/：迷惑的因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇小乘：就是業力〇〇造有漏業力，生命在苦集二道流轉；造無漏業力，生命在滅道二諦安住
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇大乘：業是身口意的造作，其實是心的造作〇〇一/see:風動幡動|動心/就是一個業，所以業由心生
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、依各釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、釋覺義/（/b1|覺悟的功德/）〰〰【/see:顯示正義:心生滅門:覺義|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、總立本覺、始覺/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/b|覺/：心體離念。遠離一切的妄念。佛法曰對治
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇離念相：等虛空界，無所不遍。虛空：週遍義，無差別義
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇真如之如實不空，就是本覺〇〇如來藏具足無漏性功德，以本具的覺悟總攝一切無漏功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/b|本覺、始覺/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本：本來具
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇始：生滅相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺、始覺之關係
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺針對始覺而安立，兩個相對。前者本來具，後者發心才有
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺在一念無明後就全體變成不覺。不覺在流轉中是一個生滅門
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇有本覺，有緣遇到三寶，才能啟動始覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、別辨本覺、始覺/                   [10#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰一、辨//b|始覺//kp|義/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳一、總標淺深/〰〰【/see:顯示正義:心生滅門:始覺|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇非究竟覺：觀照內心，見道心與私慾二功能而已，不究竟
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇究竟覺：〰觀照內心，撥離此二功能，見到清淨本性，方究竟
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳二、詳示淺深/〰/ail|覺悟有四種/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|觀照力是本論第一個功德，一定先正確觀照生命，才能產生正確的希望、修行行動/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、滅相（業果的覺悟：實不覺）/ail|起人天種性的覺照/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|未經佛法訓練者，即跟著感覺走的生死凡夫/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|佛弟子起惡念時，能覺知前念起惡，生反省克制後念展轉相續，令不再生/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|凡夫畏果，菩薩畏因。開始覺照因地時，第一道觀照力正式啟動，對治惡念、讚歎善念/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、異相（無常的觀察：相似覺）/ail|起二乘或初發意菩薩種性的覺照/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|從念頭的變化觀察到念相，等於是無常觀，觀察心念無常/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|從無常中觀察到我空的智慧；念無異相觀察到心念中沒有人我對待相，無我/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|以捨粗分別執著相故，離分別我執，名相似覺，或曰隨順，隨順於覺悟/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇觀心無常〇〇向外攀緣，心隨境轉；心非常態
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無常故苦〇〇無常故苦，生滅是苦；生命是苦
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇苦即無我〇〇即知我們對生命沒有主宰性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無我故空〇〇無我即空，悟入我空的真理
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、住相（空性的觀察：隨分覺）
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|法身菩薩能察心念住相，不必待心念有變，觀察到心念無住相，住相不可得，住無自性/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|遠離分別法執的粗念相故，叫隨分覺，叫分證本覺/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|心無自性，即能變化；若心中惟有一相，法界一相，則類似於住相/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|無自性的空如何安立？從緣起，假因緣所生，緣起性空；因緣所生法/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|譬如念佛之行為，由種子、所緣境、作意的心所三者和合而生/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、生相（無生的觀察：究竟覺）
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|菩薩因地窮盡，應該是等覺後心，看到一念不覺最初那個一念妄動之生相/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|觀察心無初相，妄相最初那一念妄動，原來覓心了不可得，遠離一切微細妄念，悟入清淨本性/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|心即常住，一切顛倒生滅心完全脫落，即究竟覺/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇總結〰〰《楞伽經》
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇補充說明
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇信根本，以無生的清淨本性依止點當根本
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇從對治的角度，也要有業果、無常、空性的對治
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇有權法、有實法，如此操作才能夠圓滿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳三、明淺深無性/〰〰【/see:顯示正義:心生滅門:始覺:覺不覺的因緣|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇覺悟的因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇第一法，對治法〇〇〇所謂凡夫、二乘、菩薩的覺照，讓夢慢慢醒來
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇第二法，根本法門〇〇觀察覓心不可得，夢中即知其不真、假一念無明夢心變現
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇不覺的因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇眾生顛倒，無始以來念念相續，未曾離念，是講流轉門
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇總結
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇約著對治義，前安立四種智慧
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇從本性觀察，其實這四個相本來平等，同一覺故，皆一念清淨本性所顯
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇故前安立四種覺悟的差別體相，此處會歸到一心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〖學員提問〗
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇如何讓自己養成圓頓種性，遇境隨緣，如何作觀？
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|只有一法：多聞熏習如理思惟。如此熏習，遇境逢緣你就知道觀照，觀照真如，即正念真如/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|真如有二個觀：一個觀察如實空，一個觀察如實不空/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇假設有人過去世布施今生富有，今生慳貪，何因造成退轉？〇〇環境
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇如何達到離念的境界？〇〇先把多念轉成一念，修一相三昧，再進入所謂的無念三昧
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇平時行住坐臥、穿衣吃飯、上殿作佛事，如何依止真如，不依止自我意識？
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|要依止真如，要有觀照力。一從本性的觀照，二生滅門/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰二、辨//b|本覺//kp|義/                    [11#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳一、標二相/〰〰【/see:顯示正義:心生滅門:本覺|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺的兩種相貌
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇隨染本覺：就是隨順染污以後產生對治而恢復清淨的本覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇性淨本覺：本性具足清淨的本覺〇（見下卯三）
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺隨染分別，產生對治功能，生起兩種功德相；功德相與本覺的體性不相捨離
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇智淨相〰〰〰/ail|根據根本無分別智生出我空、法空的智慧所成就的一種自受用的功德/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇不思議業相〰/ail|菩薩從空出假後依善巧方便令眾生起種種善根，成就一種他受用的功德/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳二、釋二相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇午一、智淨相〇〇前段偏重否定：破和合識、滅相續心；後段加以肯定：體性不能斷滅
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇未一、示相〰〰【/see:顯示正義:心生滅門:本覺:智淨相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇破和合識：破除阿賴耶識生滅顛倒相〇〇以戒定，得觀照一念心性是因緣所生法
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇滅相續心：破除前七轉識染污現行〇〇〇修行時先下手處：持戒，修定
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇未二、釋成
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇清淨法身在無量劫流轉過程中被無明所牽，十二因緣中不斷流轉
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇然清淨本性決定沒有消失，未被污染
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無明攀緣產生動相，令清淨心與之和合；因無形相，無明與真如不捨離
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇午二、不思議業相〰〰〰【/see:顯示正義:心生滅門:本覺:不思議業相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇簡言之，即恆順眾生，廣設方便
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯三、總顯四種大義/〰/ail|性淨本覺/〰【/see:顯示正義:心生滅門:覺義:總顯四義|經文/】  [12#VOL]
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|本覺體性四種相貌，簡言之即體大、相大：如實空體大，餘三相大/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、如實空鏡〇〇非覺照義者，非凡夫之妄念攀緣所能分別；依止我空法空智慧方能相應
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、因熏習鏡〇〇總說不空（或謂相大）
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一切世間境界都在本覺的體性顯現〇〇不離不即，不失不少，依止一心而顯現
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺體性雖空，內具足無漏熏眾生之潛伏功能，稱為本覺內熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、法出離鏡
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇約自受用功德說〇〇本覺內熏會生戒定慧功德能對治煩惱，謂出離；破阿賴耶相，恢復本性清淨
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇當信心中的戒定慧之法能對治煩惱
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、緣熏習鏡〇〇利他功德，成就眾生得度的因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇阿賴耶識覺的功能總結
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇小乘觀心〇心純粹是雜染性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇天台觀心〇心完全是清淨的
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本論觀心〇心的本性清淨，但是帶妄，所以是真妄和合的阿賴耶識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、釋//b|不覺//kp|義/（/b1|不覺的相貌/）
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|法藏大師曰，本論中不覺之相貌有二：根本不覺或無明，枝末不覺或無明/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、總明不覺依覺故無實/（/b|根本不覺/）
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇根本不覺〰（迷真取妄）〰【/see:顯示正義:心生滅門:不覺:依覺故無實|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇真如之法本來平等不二。生命現象本來無我相、人相對立，是一切法如的相貌
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一念妄動，生起向外攀緣之心動，不覺心起，而有其念，致個體生命現象出現
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇此最初一念妄動，開始有時間、空間、各種因緣果報
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇妄動念無自相，不離本覺
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|一念妄動，即十二因緣第一個無明，產生業力、行，產生阿賴耶識，產生很多果報，這叫根本不覺/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇真覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇其一，覺與不覺，兩者因對立方能安立；真有待妄之義，即有妄想才安立覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇其二，完全棄捨不覺之心，則無真覺自相可得，是為妄有起淨之功
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇雖一念妄動全體變成不覺，但本覺體性並未失去
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、別示不覺虛妄相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇枝末不覺〰〰【/see:顯示正義:心生滅門:不覺:三細六粗|經文/】〰/ail|（執妄為真，生妄想之相續；開展有三細六粗、共九種相貌）/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一念不覺生/b|三細/〰/ail|三者是同時出現。此皆非常微細之和合識阿賴耶識，皆依他起性/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無明業相〇無明業相是一個個體生命真正的開始，才有我你差別；生命皆以無明為根本所發動的業相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇造作義：產生一個業力。業即一種動相，不斷活動
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇招感義：業招感果報；相對真如而言皆是苦惱；於涅槃均有老病死之繫縛
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇能見相〇既有個體生命，即有一個能照見的，有能所；就人而言，有一能照見相，或言能受用
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇境界相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇境界為緣長/b|六粗/〰/ail|境界為緣長六粗，即前七轉識作用所產生的遍計所執性，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰〰〰〰/ail|即此在無明業相的個體生命中，由境界的刺激、不斷造作所產生之六種相貌/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇智相〇〇〇此智是一種分別心，特別是第六意識分別功能叫智相，依於境界心起分別，愛與不愛故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|由境界受用，產生一希望，內心中於種種事物有所期待、希望，叫智相。很微細之分別/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇相續相〇〇依止前智分別希望，產生苦受、樂受，叫相續相。此感受又將前述希望變成具累積性、更強烈
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇執取相〇〇依相續，一再緣念受用各種境界，產生一種住持，至於堅固執取。所謂生活經驗
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇計名字相〇由執取故，進而安立各種名言
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇起業相〇〇對生命有種種思想後，依止思想而造業
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇業系苦相〇所造業有招感義，在三界裡得果報
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇總結〇三細六粗皆一念心顛倒所生，一切雜染法均非覺所引生
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇修行
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、依止對三寶信心，持戒以破第五起業相，令不造業
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、依止持戒，再修止觀，破第四計名字相〇於凡夫，最嚴重名言是貪戀娑婆
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑三、總辨同異/             [13#VOL]
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|把覺與不覺的同異點作一總辨，作一籠總的說明/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、標/〰〰【/see:顯示正義:心生滅門:覺與不覺:同相異相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、釋//b|同相/〰〰【/see:顯示正義:心生滅門:覺與不覺:同相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無漏無明，種種業幻，皆同真如性相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一切眾生，本來常住，入於涅槃〇修多羅者，《圓覺經》《大品般若經》
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇菩提之法，非可修相，非可作相〇把這些萬德莊嚴攝用歸體時，實無少法可得，亦為依止共相而言
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇從共相角度，諸佛菩薩菩提之法無有色相可見
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|各種眾生所見之相，隨染業幻所作，非是智色不空之性/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、釋//b|異相/〰〰【/see:顯示正義:心生滅門:覺與不覺:異相|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|生滅門，是一個對立性，有覺、不覺，清淨、雜染。/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無漏無明所引生的差別，叫隨染幻差別，依止願力
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|先從覺悟因緣而言，無漏因緣是隨染幻差別。一個覺悟的心在創造生滅門，其因緣是隨染幻差別/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無明煩惱所引生的差別，叫性染幻差別，依止煩惱
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|諸佛菩薩的果報依止願力，一種自在力；凡夫生起的果報依止煩惱，為煩惱所推動，不是願力/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇凡夫煩惱的差異相，根據《瑜伽師地論》
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇性質的差別：同樣的業，因為性染幻差別（即煩惱不同），果報不同
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇強弱的不同：煩惱有強弱不同
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、約心〇〇依止心的意樂，若三時有心（期待、歡喜、隨喜），此業將非常強大
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、約境〇〇所造作業緣上品境（父母、師長、三寶境界），非常強大的業，此田特別殊勝
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、約相續〇於一弱業，數數現行都無慚愧，天天造作，此業也會變得強大
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇同相之理在修行上的應用
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇成佛的可能性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇淨土修行中的感應道交
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、明生滅因緣/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、明迷染因緣/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、總明依心故轉/〰〰【/see:顯示正義:生滅因緣:迷染因緣:依心故轉|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇眾生相、眾生果報，主要依止心、意、意識三法轉而生
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇心：第八識阿賴耶識；俱生的我執、法執
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇意、意識：前六識；粗的分別我執、法執
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇第七意識在本論中分散到第八與前六
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、別釋意及意識/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、釋//b|意/〰〰【/see:顯示正義:生滅因緣:迷染因緣:意|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇有情眾生的果報依止此心意識而轉
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇心者，阿黎耶識；依之起無明不覺，能見能現能取境界，起念相續，說為意
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|真如生起妄動，即無明、根本不覺，真如成阿賴耶，啟動的意有五種相：/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|不覺而起，能見、能現、能取境界，起念相續，故說為意/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇此意復有五種名
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇業識，謂無明力，不覺心動故〇整個生命的因相，即果報，皆由阿賴耶識裡此業識所變現
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇轉識，依於動心，能見相故〇〇每一期生命果報裡，能受用的我相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇現識，現一切境界，現於色像〇此果報面對五塵境界，能顯現各樣五塵相貌
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇                [?14#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇智識，謂分別染淨法故〇〇轉識現識接觸，產生智識，一種分別，生愛憎心、希望
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇相續識，以念相應不斷故〇心境接觸產生感受，成實際生命經驗，強化堅固希望，成為相續
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|相續識與智識都是愛著，約著強弱分別而安立。智識只是一種內心的期待、希望。/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|相續識依真實受用產生一種實際感受經驗，非常強烈，在生命中的作用非常大/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇住持過去無量世等善惡之業，令不失故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|相續識對業力有引導作用，阿賴耶識裡究竟哪個業力對來生會生招感性與相續識有關/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇能成熟現在、未來苦樂等報，無差違故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|愛憎取捨之相續可把有轉成生，能將業力、業種轉成有，再滋潤之而轉成生/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇能令現在已經之事忽然而念；未來之事不覺妄慮
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|此心念有一種等流性；已發生事，會忽然生起；未來之事，也可種種妄想而生起規劃/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇是故三界虛偽，唯心所作，離心則無六塵境界
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|三界果報皆因緣所生法、自性空，皆一念心所造作變現/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇以一切法皆從心起，妄念而生〇一切分別，即分別自心。心不見心，無相可得
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇世間一切境界皆依眾生無明妄心而得住持〇心生則種種法生，心滅則種種法滅
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇對五意之理解
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、一念不覺生三細，業識、轉識、現識，屬於業力部分，無法改變皆要承當
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、境界為緣長六粗，智識、相續識是分別所引生，故可以改變
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、釋//b|意識/〰〰【/see:顯示正義:生滅因緣:迷染因緣:意識|經文/】  [KP?14&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇所謂意識者，即此相續識；亦名分別事識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇此乃最粗重之心識，轉成所謂執取相，即執取識，加以執著
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇隨事攀緣，分別六塵，即產生計名字相，生很多分別，所謂名言，很多思想
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇依止迷理的見煩惱和迷事的愛煩惱而展轉引生，乃至展轉增上
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇凡夫流轉果報由心識流轉引生。先談第六意識之粗顯心識，是下手的第一道
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇第六意識引生的心識，依本論可分兩類：感受問題，思想問題
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇從本論，所安立的八識要完全消滅，因為它是見愛煩惱所引生
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇唯識學不認為心識是見愛煩惱，當作分別
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本論先安立真如，再變成阿賴耶；阿賴耶消滅後回歸一心真如
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、明悟淨因緣/                               [15#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、明悟有淺深/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇依無明熏習所起識者〰〰【/see:顯示正義:生滅因緣:悟淨因緣|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇凡夫不知，二乘不覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇菩薩，從初正信發心觀察；若證法身得少分知；乃至究竟地不能盡知
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇唯佛窮了
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、詳釋淺深差別/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、總明義深/〰〰【/see:顯示正義:生滅因緣:悟淨因緣:具説|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一念心性，本來相貌是自性清淨
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇雖有染心，而常恆不變。所謂心性常無念故，名為不變
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇以不達一法界故心不相應。忽然念起名為無明
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇真如轉成阿賴耶識的過程，由無明來主導，此過程叫無明。無明者，
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、不與心所法相應。無明沒有心所法，故本身是無記性
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、不與一切外在境界相應。只是向內擾動，不向外攀緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、別示次第/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰一、正釋悟淨次第/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳一、明離染心次第/〰/ail|達妄本空，破執法門；對治染心/〰〰〰【/see:顯示正義:生滅因緣:悟淨因緣:染心|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|（一）前三個屬於相應染，指其會與環境相應，會受環境影響/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|（二）後三個不相應染，不跟外在環境相應，也無善惡差別，跟阿賴耶識相應/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、執相應染。依二乘解脫及信相應地，遠離故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、不斷相應染。依信相應地修學方便，漸漸能捨得淨心地，究竟離故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、分別智相應染。依具戒地漸離；乃至無相方便地，究竟離故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、現色不相應染。依色自在地能離故     [?16#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五、能見心不相應染。依心自在地能離故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇六、根本業不相應染。依菩薩盡地得入如來地，能離故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳二、明離不覺次第/〰/ail|知真本有，肯定法門；對治根本無明/〰【/see:顯示正義:生滅因緣:悟淨因緣:離不覺次第|經文/】  [KP?16&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰二、轉釋相應不相應義/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯三、結示二障/〰〰【/see:顯示正義:生滅因緣:悟淨因緣:結示二障|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇煩惱礙〇染心義，能障真如根本智故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇智礙〇〇無明義，能障世間自然業智故
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子三、辨生滅之相/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、正辨/〰〰【/see:顯示正義:生滅因緣:生滅之相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇細分
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇麤中之麤，凡夫境界
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇麤中之細及細中之麤，菩薩境界
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇細中之細，是佛境界
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、釋疑/〰〰【/see:顯示正義:生滅因緣:生滅之相:釋疑|經文/】
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、明染淨熏習/                                  [17#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇本論大致分生滅門的因緣果報為
!!〇〇〇〇〇〇〇〇〇〇〇〇/ail|生滅門即每個人內心依止處不同，發動不同業力，招感各種差別果報，皆為生滅門所收攝/
〇〇〇〇〇〇〇〇〇〇〇〇〇第一種、依止慾望：三塗種性
〇〇〇〇〇〇〇〇〇〇〇〇〇第二種、依止業果：人天種性
〇〇〇〇〇〇〇〇〇〇〇〇〇第三種、依止空性：二乘種性
〇〇〇〇〇〇〇〇〇〇〇〇〇第四種、依止實相：菩薩種性
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、總標熏義相/
〇〇〇〇〇〇〇〇〇〇〇〇〇四種法熏習〰〰【/see:顯示正義:生滅因緣:染淨熏習|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一者淨法，　　名為真如〇清淨法，其體性決定清淨，就是真如熏習
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二者一切染因，名為無明〇此指根本無明。無明即愚癡之意，是一切染法的根源，體性也是決定的
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三者妄心，　　名為業識〇妄即生滅之意，生滅心名為業識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇四者妄境界，　所謂六塵〇生滅的境界也是通染、通淨的。環境熏習也扮演一個重要角色
〇〇〇〇〇〇〇〇〇〇〇〇〇熏習三原則
〇〇〇〇〇〇〇〇〇〇〇〇〇〇熏習的依止處
〇〇〇〇〇〇〇〇〇〇〇〇〇〇熏習的強弱
〇〇〇〇〇〇〇〇〇〇〇〇〇〇熏習的內外差別
〇〇〇〇〇〇〇〇〇〇〇〇〇在本論中熏習四法：真如、無明、妄心、妄境之三觀念
〇〇〇〇〇〇〇〇〇〇〇〇〇〇第一個、熏習的依止處：〰一念第六意識分別心是整個染淨熏習的依止處
〇〇〇〇〇〇〇〇〇〇〇〇〇〇第二個、熏習的強弱：〰〰熏習過程中勢力強者叫能熏，弱者叫所熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇第三個、熏習的內外差別
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇內引生：由內在體性所引生的叫做習熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇外引生：由外因的資助緣引生的功能叫做資熏
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋熏習染法/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、正明熏義/〰〰【/see:顯示正義:生滅因緣:熏習染法|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|在虛妄的熏習中，第一個不覺為因，第二個境界為緣/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|大乘佛法安立真如是說：真如有不變義，也有隨緣義。故所謂熏習真如/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|馬鳴菩薩安立的真如是受熏。受無明干擾，真如功能就消失；受到智慧觀照，真如功能就恢復/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、發生無明〇真如，清淨本然；突有一念妄動，產生對立，發生無明，根本無明
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、產生妄心〇開始無明只是無記的一個對立思考；不斷熏習真如，越來越強，生出妄心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、造業流轉〇心識加強無明；不了真如平等法，現妄境界；妄心會造業，就得果報。遞相流轉、加強
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、釋義差別/         [18#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇妄境界熏習差別〰/ail|此是資熏/〰〰【/see:顯示正義:生滅因緣:熏習染法:妄境界熏習|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一者、增長念熏習〇念者，一種分別心，即智相與相續相，等於一個分別法執
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二者、增長取熏習〇取者，一種愛取、慾望、追求，可以推動身口去造業
〇〇〇〇〇〇〇〇〇〇〇〇〇〇妄心熏習差別〰/ail|此是習熏/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一者、業識根本熏習，能受阿羅漢、辟支佛、一切菩薩生滅苦故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|每個對立思考就加強阿賴耶識的相續功能，也加強界外變易生死的力量，當然這是很微細/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二者、增長分別事識熏習，能受凡夫業繫苦故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|六粗的愛取煩惱，得則貪愛，不得則恨。愛恨功能發動，就增長凡夫業力與痛苦果報/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇無明熏習差別〰/ail|無明通內通外，有習熏、資熏/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一者、根本熏習，以能成就業識義故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|根本無明，是一種對立思考，增長阿賴耶識，是習熏/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二者、所起見愛熏習，以能成就分別事識義故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|枝末無明，是對環境愛取，增長分別事識，是前六識的六粗煩惱，叫資熏/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇熏習因緣的二因素
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、選擇一個清淨的環境
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、趕快加強心中的光明
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子三、釋熏習淨法/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、正明熏義/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇總說〰〰〰〰〰【/see:顯示正義:生滅因緣:熏習淨法|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇以有真如法故，能熏習無明
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇以熏習因緣力故，則令妄心厭生死苦，樂求涅槃
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇以此妄心，有厭求因緣故，即熏習真如
〇〇〇〇〇〇〇〇〇〇〇〇〇〇淨法生起次第
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、自信己性〇十信位，開始依止內心覺悟觀照，不斷依止三寶、造作，斷惡修善
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、知心妄動，無前境界〇十住，於真如理如實安住，有禪定力量，心中止觀強
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、修遠離法〇十行與十迴向，即六度妙法，六度能使遠離、對治煩惱障
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、以如實知無前境界故，種種方便起隨順行，不取不念〇十地菩薩，一念相應慧成就十地
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五、久遠熏習力，無明滅心不起境界滅。因緣滅心相盡，名得涅槃成自然業〇佛果
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、釋義差別/               [19#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、釋妄熏義別/〰〰【/see:顯示正義:生滅因緣:熏習淨法:妄心熏習|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|淨法熏習的第一個內涵叫妄心，妄心即第六意識所相應的始覺智慧、分別心，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|經佛法聽聞、思惟所產生的一種觀照智慧，時生時滅，叫做妄/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一者分別事識熏習〇依諸凡夫二乘人等，厭生死苦，隨力所能，以漸趣向無上道故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、凡夫的厭生死苦〇深信業果，斷惡修善，生起第一個觀照力，遠離惡道因緣，求人天果報
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、二乘人的觀照〇〇以空性作觀照，依止三法印（諸行無常、諸法無我、涅槃寂靜）
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二者意熏習〇謂諸菩薩，發心勇猛，速趣涅槃故
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|求解脫必要修空性，無論小乘、大乘。然兩者之對治內涵有所不同/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、小乘的空性：滅色取空〇滅了內心遍計執的妄想，也滅了依他起的因緣果報法
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、大乘的空性：緣起性空〇破遍計執，保留清淨依他起，所謂遍計本空，依他如幻
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、釋真如熏義/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、總標/〰〰【/see:顯示正義:生滅因緣:熏習淨法:真如熏習|經文/】
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|妄心是第六意識，其熏習要假藉如理作意觀想才能生起，時觀失念，故是生滅/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|真如熏習是第八識的，無作、任運生起，叫真如熏習/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|從論文看，自體相表自力法門，內在本覺功能所帶動；用熏習是仰仗他力，諸佛菩薩加被力/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、別釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰一、釋體別/〰自體相熏習
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳一、正釋/〰〰【/see:顯示正義:生滅因緣:熏習淨法:真如熏習:自體相熏習|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇具無漏法〇一念明瞭心性，無始世來很多妄想煩惱，然本性具此特殊功能，無漏法，即不空本覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇此本覺功能能生二力量
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇備有不思議業用〇能引生在生死流轉中厭惡生死、欣求涅槃的力量；是能觀智
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇作境界之性〇〇〇阿賴耶識中本覺功能會顯現很多的清淨所緣境引導趨向解脫；是所觀境
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇依此二義，恆常熏習，產生內觀外助，使令眾生厭生死而樂求涅槃
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇自信己身有真如法，發心修行〇廣修六度方便，開顯自性功德，叫體熏習；即本覺內熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺內熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇人皆永欲離苦得樂。佛法言安樂有二：色身的、內心的
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇色身安樂有二障
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇色身的快樂是躁動，會令內心不安；內心安樂是寂靜安穩
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇追求色身快樂會生煩惱與罪業過患；追求內心快樂無此過之憂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇既然人皆欲離苦得樂，總會從障礙中得覺悟，安立而作本覺
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇人皆永欲離苦得樂。佛法言安樂有二：色身的、內心的
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳二、釋疑/〰〰【/see:顯示正義:生滅因緣:熏習淨法:真如熏習:體熏習釋疑|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|午一、疑問/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇既然平等熏習，何來眾生差別
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|午二、答釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|未一、直約無明煩惱厚薄釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇眾生根機不一
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|未二、更約因緣互相成辨釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇眾生因緣不同
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇成佛之道必須因緣具足                   [?20#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、內因力：自有熏習之力，即本覺內熏
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、外緣力：必須有佛菩薩法語開導，對生命本質具觀照力。得二功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、生厭苦心，信有涅槃，修習善根；叫外凡資糧位
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、在佛法中慢慢進步，修善根成熟；到內凡加行位
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇體熏習總結
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三內涵：真如、無明、三寶
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇在真如熏習中成佛之道有二因緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇根利遮輕者〇除有本覺內熏，其善根強，遮障又輕薄。學習經典後，很快脫出障礙
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇根利遮重者〇雖在三寶中熏習善根也強，無始劫來所熏煩惱罪業特別厚重，就須破障法門
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰二、釋用熏/〰用熏習                      [KP?20&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳一、略標/〰/ail|是眾生外緣之力，有無量義/〰〰【/see:顯示正義:生滅因緣:染淨熏習:真如熏習:用熏習|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|巳二、各釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|午一、釋差別緣/〰〰【/see:顯示正義:生滅因緣:染淨熏習:真如熏習:用熏習:差別緣|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇感應佛菩薩之因，招致感應之果結緣，獲取攝受之功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇近緣、遠緣
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇近緣〇善根成熟，諸佛菩薩直捨方便，但說無上道，令直接返妄歸真
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇遠緣〇善根尚未成熟，必須在過程中有方便，佛菩薩也會慈悲為實施權
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇近遠二緣中各分兩種
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇增長行緣：成就利他的功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇受道緣：〰成就自利的功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|午二、釋平等緣/〰〰【/see:顯示正義:生滅因緣:染淨熏習:真如熏習:用熏習:平等緣|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇諸佛菩薩對眾生平等攝受〇眾生必須成就三昧，在禪定明瞭寂靜心中見十方諸佛，聽聞說法
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯三、結示/〰〰【/see:顯示正義:生滅因緣:染淨熏習:真如熏習:用熏習:結示|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇未相應：未到法身菩薩眾生
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇已相應：法身菩薩
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子四、結判斷與不斷/〰〰【/see:顯示正義:生滅因緣:染淨熏習:有斷不斷|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇永遠記住：斷惡修善，真如能破妄心，妄心不能破真如
〇〇〇〇〇〇〇〇〇〇〇〇兩個心得
〇〇〇〇〇〇〇〇〇〇〇〇〇有兩種修行方便：外熏習，內熏習
〇〇〇〇〇〇〇〇〇〇〇〇〇修學次第：先修外熏習，成就一種三寶的善業力，再成就內心的止觀、智慧與大悲
〇〇〇〇〇〇〇〇〇〇〇〇真如緣起中三大問難
〇〇〇〇〇〇〇〇〇〇〇〇〇真妄別體難
〇〇〇〇〇〇〇〇〇〇〇〇〇真前妄後難
〇〇〇〇〇〇〇〇〇〇〇〇〇悟後卻迷難
〇〇〇〇〇〇〇〇〇〇/kp|壬二、顯示大乘體相用/                              [21#VOL]
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、顯示體相/〰〰【/see:顯示正義:生滅因緣:大乘:體相用|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、正顯示/
〇〇〇〇〇〇〇〇〇〇〇〇〇一、體大：如實空〇〇因地修學，內心煩惱罪業福德智慧有增減。然體大，無有增減。又非前生後滅，無始無終
〇〇〇〇〇〇〇〇〇〇〇〇〇二、相大：如實不空〇如來藏具足無漏性功德故。自性滿足六種無漏功德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、大智慧光明義故〇有破滅無明煩惱的功能
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、遍照法界義故〇〇能普照十法界諸法差別相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、真實識知義故〇〇能如實了知生命的總相，我空、法空的真理
〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、自性心清淨義故〇無有罪業的雜染。是約解脫德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇五、常樂我淨義故〇〇是約法身德
〇〇〇〇〇〇〇〇〇〇〇〇〇〇六、清涼、不變、自在義故〇我們內心有般若德、解脫德、法身德
〇〇〇〇〇〇〇〇〇〇〇〇〇故於相大而言，六種功德不離真如，相續不斷，與真如法性平等一味
!!〇〇〇〇〇〇〇〇〇〇〇〇〇廣而言之，一切佛法功德完全滿足而無欠缺
!!〇〇〇〇〇〇〇〇〇〇〇〇〇凡夫在因地時如來功德就具足，故叫/b|如來藏/；
!!〇〇〇〇〇〇〇〇〇〇〇〇〇在果地上安立做/b|如來法身/，大功德法之所莊嚴故名法身
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋疑示/〰〰【/see:顯示正義:生滅因緣:大乘:體相用:釋疑示|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〖問〗上說真如其體平等離一切相，云何復說體有如是種種功德？
〇〇〇〇〇〇〇〇〇〇〇〇〇一心真如雖具足六無漏性功德，六無差別對立之相，與真如等同一味，法界一心唯一真如
〇〇〇〇〇〇〇〇〇〇〇〇〇所有修學、無量法門，都是開顯內心相貌；離開心沒有所謂斷惡修善、轉凡成聖之事
〇〇〇〇〇〇〇〇〇〇〇〇〇智者大師把整個大乘止觀分成兩類
〇〇〇〇〇〇〇〇〇〇〇〇〇〇次第止觀：開始觀照，慢慢地煩惱淡薄，修無相觀、四念處，等等對治觀法
〇〇〇〇〇〇〇〇〇〇〇〇〇〇摩訶止觀：對治觀法後，最後一定要入不二法門， 入無所得相應的平等觀
〇〇〇〇〇〇〇〇〇〇〇〇〇又，凡夫的差別從何而來？依止業識，阿賴耶識。如果返妄歸真，則
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、不迷：心性不起，即是大智慧光明義故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、不取：心性離見，即是遍照法界義故
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、不動：心性無動，則有過恆沙等，諸淨功德相義示現
〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、總結：如是淨法無量功德，即是一心，更無所念。是故滿足，名為法身，如來之藏
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、顯示用/                                      [22#VOL]
!!〇〇〇〇〇〇〇〇〇〇〇〇/ail|修因證果必須能隨順於真如，開顯體大、相大，用即真如/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、正明用即真如/〰〰【/see:顯示正義:生滅因緣:大乘:體相用:用即真如|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇因地修學時必須修學兩個重要法門
〇〇〇〇〇〇〇〇〇〇〇〇〇一、大悲利他
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇願：立大誓願，發願度盡一切眾生〇利益眾生心的生起，宗喀巴大師教法中有二重點
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、七重因果：主要就是知母，能如實了知一切眾生是自己過去的母親
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、自他交換：屬理上觀察。自他者，指愛護自他的心情
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇先取平等對待；後貶己褒他，把愛己之心轉成愛著眾生
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|培養利他心，未必行動；念念與真如相應，開顯心中大智慧光明義故、遍照法界義故、常樂我淨義故，如此思考/
〇〇〇〇〇〇〇〇〇〇〇〇〇二、三空自調，成就利他與自利
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|要更深觀察，看到眾生真如心之如與我們的如無有差別。於是突破我空、法空，到空空，入平等法界，三空自調/
〇〇〇〇〇〇〇〇〇〇〇〇果地功德
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|要更深觀察，看到眾生真如心之如與我們的如無有差別。於是突破我空、法空，到空空，入平等法界，三空自調/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|依止大悲利他、三空自調，雖然表面上利益眾生，其實自己得最大利益，除滅心中我愛執，開顯內心清淨法身/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇如來身有二：法身，智身。
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|法身是所受用，是色法，能見者叫遍一切處。智身是心法，離相、清淨明瞭智慧心性。/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|色心二法都是相應第一義諦，一個如如境界。/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|而凡夫這種生滅門世俗諦，一種差別對立，有種種造作、所得/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|隨順真如時，剛開始根機有所偏重：一種悲增上，二者智增上/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、廣明隨機見別/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、總明隨機/〰〰【/see:顯示正義:生滅因緣:大乘:體相用:隨機見別|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、別示見別/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、約所依識以判二身/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、標征/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、正明/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰一、明應身/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇依止名言妄想所生遍計所執之心識叫分別心識，其取著叫分別事識
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇分別事識包括凡夫（依止有相取著）、二乘（依止無相取著），只見到應化身
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰二、明報身/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇報身依正莊嚴
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇功德報身，成就二力量：
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇外緣力，種種利他因緣所成就福德資糧
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇本覺內熏，依止內心三空自調、正念真如、念念隨順真如，本覺內熏所成就、
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇悲智所成就。這種報身有無量無邊的安樂解脫之相，故說為報身
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇維摩詰經言：見佛陀報身，一定得利益，滅惡生善，絕不空過；見應化身未必
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、約機所見以判粗細/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇最粗者，凡夫所見粗略法身、智身，隨順六道遍計執心，各見不同。非受樂相
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三賢位菩薩深信真如法，見佛身無時空障礙、自他分齊，知一心真如所現而不離真如
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇十地菩薩見佛法身、智身依正莊嚴，是不可思議的微妙
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇人完全離開所有妄動業識，則無見相；諸佛如來法身，無彼此對立相貌可得
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子三、結示真如妙用/〰〰【/see:顯示正義:生滅因緣:大乘:體相用:真如妙用總結|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〖問〗這個法身是離於色相，那為什麼能夠現色相呢？
〇〇〇〇〇〇〇〇〇〇〇〇〇諸佛如來的真如妙用，他的大智慧光明義故能夠離一切時空的障礙，諸佛如來是法界身
!!〇〇〇〇〇〇〇〇〇〇〇〇〇憶念，要深信諸佛皆充滿，即能得諸佛如來加持
!!〇〇〇〇〇〇〇〇〇〇〇〇〇其實無量莊嚴，各各差別，皆無分齊，而不相妨，皆成就諸佛功德
〇〇〇〇〇〇〇〇/kp|庚三、結示證入/〰〰【/see:顯示正義:結示證入|經文/】      [23#VOL]
〇〇〇〇〇〇〇〇〇從生滅門而入真如門
〇〇〇〇〇〇〇〇〇〇門者，區別義、通達義
〇〇〇〇〇〇〇〇〇〇生滅門是一個對立的思考、修學；真如門是平等的修學
〇〇〇〇〇〇〇〇〇〇兩者有差別，但也有通達；二門可以互通
〇〇〇〇〇〇〇〇〇〇生滅門是一種因緣果報，有造作、有因緣、及其招感的果報
〇〇〇〇〇〇〇〇〇〇真如門是非因緣、非果報的，眾生本具，諸佛所證的一個平等法界
〇〇〇〇〇〇〇〇〇如何證入真如門
〇〇〇〇〇〇〇〇〇〇如實觀察生滅果報體
!!〇〇〇〇〇〇〇〇〇〇/ail|此五蘊果報體有色法與心法：心法是受、想、行、識，有明瞭性；色法是一個執愛，沒有明瞭性/
!!〇〇〇〇〇〇〇〇〇〇/ail|開出來的是六塵的境界/
〇〇〇〇〇〇〇〇〇〇一、破除所取相〇〇所取因緣即色聲香味觸法的境界，觀察這些境界畢竟無念
〇〇〇〇〇〇〇〇〇〇二、破除能取相〇既然一切法由心所現，心是什麼相貌？觀心無形相，十方求之不可得
!!〇〇〇〇〇〇〇〇〇〇/ail|重點就是破執，破除對外境的執取與對內心的執取。這是一個方便/
!!〇〇〇〇〇〇〇〇〇〇/ail|若能觀察，知心無念，即得隨順入真如門故/
!!〇〇〇〇〇〇〇〇〇〇/ail|最重要的關鍵點是，要能深觀動心，即不生滅/
!!〇〇〇〇〇〇〇〇〇〇/ail|觀察這念生滅擾動的心，本性是不生滅，是自他不二，妄想的本性它的本質就是真如/
〇〇〇〇〇〇〇/kp|己二、//b|對治邪執/
〇〇〇〇〇〇〇〇/kp|庚一、總標二見/〰〰【/see:對治邪執|經文/】
〇〇〇〇〇〇〇〇〇人我見：又叫補特伽羅我見，對生命本身之執取〇我執者，認為自己果報體有一常一主宰
〇〇〇〇〇〇〇〇〇法我見：對一切因緣所生法之執取〇法指一切因緣所生法。法執是認為法離開念心有真實體性，離心別有
〇〇〇〇〇〇〇〇/kp|庚二、別釋二見/
〇〇〇〇〇〇〇〇〇/kp|辛一、人我見/〰〰【/see:對治邪執:人我見|經文/】
!!〇〇〇〇〇〇〇〇〇〇/ail|人我見即我相執取，皆錯解經義。有五種；前二執空（空相、空性），後三執有/
〇〇〇〇〇〇〇〇〇〇一：執空相
〇〇〇〇〇〇〇〇〇〇〇執取相貌：以不知為破著故，謂虛空是如來性〇虛空有二義：週遍義，無差別義
〇〇〇〇〇〇〇〇〇〇〇對治方法
〇〇〇〇〇〇〇〇〇〇〇〇總說：虛空相是其妄法，體無不實。以對色故有，是可見相，令心生滅
〇〇〇〇〇〇〇〇〇〇〇〇別明：以一切色法，本來是心，實無外色。若無色者，則無虛空之相
〇〇〇〇〇〇〇〇〇〇〇〇總結：一切境界皆念心妄動，動即業力造作而生果。業力消失則果報消失；唯一真心無所不遍
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰/ail|諸佛清淨心廣大，虛空非為一有為生滅法。此謬常為外道，未得聽聞大乘佛法故/
〇〇〇〇〇〇〇〇〇〇二：執空性〰〰《般若經》                 [?24#VOL]
〇〇〇〇〇〇〇〇〇〇〇執取相貌：以不知為破著故，謂真如涅槃之性唯是其空
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|空者，離一切相也。錯認：所有有為法、無為法，畢竟空/
〇〇〇〇〇〇〇〇〇〇〇對治方法：明真如法自體不空，具足無量性功德故〇以空性為究竟義，將墮二乘涅槃
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|佛陀的整個修學目的是成就妙有/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|佛道的究竟義是無量莊嚴，而非畢竟空/
〇〇〇〇〇〇〇〇〇〇三：執取清淨功德（樂觀派）〰〰《楞伽經》《涅槃經》
〇〇〇〇〇〇〇〇〇〇〇執取相貌：以不解故，即謂如來之藏，有色心法自相差別
!!〇〇〇〇〇〇〇〇〇〇〇〰〰〰〰/ail|真如的因地叫如來藏，就是凡夫打妄想的心，本性無有增減，在凡不減在聖不增，心佛眾生三無差別/
〇〇〇〇〇〇〇〇〇〇〇對治方法：以唯依真如義說故。因生滅染義示現說差別故
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|本論所立如來藏具足無量性功德，安立在平等法界/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|生滅門在本論中不說無明具足功德。落入生滅門，就造業得報/
〇〇〇〇〇〇〇〇〇〇四：執取因地雜染法（悲觀派）
〇〇〇〇〇〇〇〇〇〇〇執取相貌：以不解故，謂如來藏，自體具有一切世間生死等法
〇〇〇〇〇〇〇〇〇〇〇對治方法：思惟本來面目是清淨功德、平等法界；
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|後來一念妄動成對立思考，發生個體生命，始造業、染著，乃至虛妄相/
〇〇〇〇〇〇〇〇〇〇五：執取果報〰〰《勝鬘經》
〇〇〇〇〇〇〇〇〇〇〇執取相貌：以見始故，復謂如來所得涅槃，有其終盡，還作眾生
!!〇〇〇〇〇〇〇〇〇〇〰〰〰〰〰/ail|錯解眾生有始，真前妄後，即真如在前、無明在後/
〇〇〇〇〇〇〇〇〇〇〇對治方法：不應說從真起妄，應說迷真起妄，對真如迷惑才有妄想。
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|但這是方便說；事實上本論一再強調，真如是無始，無明也是無始/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|所以佛法中，如來藏是無始無終，/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|諸佛涅槃跟如來藏相應時也就無始無終，不可能又會起顛倒時/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|精準的來，本性是真妄和合，真如帶妄。但在修證過程中，祖師告訴：/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|達妄本空，知真本有；妄想畢竟空，真如真實有，要不斷憶念真如/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|《靈峰宗論》：我們的心是真妄和合，何不常思惟「何期自性本自雜染」？/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|蕅益大師說：這樣思惟，理論上不錯，但是不能令生四悉檀的因緣/
!!〇〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|佛法的安立，一定要具足四悉檀，歡喜生善破惡入理，要有滅惡生善的功能/
〇〇〇〇〇〇〇〇〇/kp|辛二、法我見/〰〰【/see:對治邪執:法我見|經文/】  [KP?24&loc=a01#VOL]
〇〇〇〇〇〇〇〇〇〇執取相貌：法我見是二乘人
〇〇〇〇〇〇〇〇〇〇對治方法：佛陀對二乘鈍根人（定性聲聞），講我空觀
!!〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|佛陀對因緣法，不說生死是空、涅槃也是空，只講生死中無我。是為實施權/
!!〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|五蘊之法，非真實有；自性不生，本來不生，無所謂滅/
!!〇〇〇〇〇〇〇〇〇〇〇〰〰〰/ail|本來面目是一心真如之大般涅槃。一旦會歸一心真如平等法界，兩種執取即消失/
〇〇〇〇〇〇〇〇/kp|庚三、究竟離妄/
〇〇〇〇〇〇〇〇〇/kp|辛一、正明/〰〰【/see:對治邪執:究竟離妄|經文/】
〇〇〇〇〇〇〇〇〇〇想要究竟離開人我見、法我見，應觀察生死雜染法、清淨涅槃法；都是對待法，生滅門
!!〇〇〇〇〇〇〇〇〇〇當依止覺悟因緣起動了，就出現涅槃功德；隨順不覺所起動，出現生死雜染法
!!〇〇〇〇〇〇〇〇〇〇把生滅對立的雜染法、清淨法會歸到本來面目時，一切法是畢竟不可說相
〇〇〇〇〇〇〇〇〇/kp|辛二、釋疑/
〇〇〇〇〇〇〇〇〇〇佛陀所以安立很多言說，俱是善巧方便，引導眾生離念、歸於一心真如，離開心中一切妄念
〇〇〇〇〇〇〇〇〇〖學員提問〗法師曾提到修行次第，是從業力的有相修行到心念無相的觀照；也提到大小乘空
!!〇〇〇〇〇〇〇〇〇〰〰〰〰〰觀的不同，小乘是把心性完全否定而滅色取空，大乘是講到緣起性空，保留心性
!!〇〇〇〇〇〇〇〇〇〰〰〰〰〰本具妙用。在實際修行上，在進入到心念觀照時，是否是先修小乘的空觀成就後，
!!〇〇〇〇〇〇〇〇〇〰〰〰〰〰再進入大乘的空觀；還是直接修進入修習大乘的空觀；或者兩個可以同時並行？
〇〇〇〇〇〇〇〇〇大小乘的判定，最好不要用法門，應該是從它的正見跟發心
〇〇〇〇〇〇〇/kp|己三、//b|分別發趣道相/                         [25#VOL]
〇〇〇〇〇〇〇〇/kp|庚一、總標/〰〰〰〰〰〰〰〰〰【/see:分別發趣道相|經文/】
〇〇〇〇〇〇〇〇〇一切諸佛所證之道，菩提心是果的、果地的菩提心，諸佛所發菩提心無差別，佛佛道同
〇〇〇〇〇〇〇〇〇菩薩因地發心之幾種差別
〇〇〇〇〇〇〇〇〇〇一、信成就發心：菩提心的建立依止對真如法性的信心〇主要是一種內在的觀照；成就十住
〇〇〇〇〇〇〇〇〇〇二、解行發心：〰依止內在觀照力，更生六度妙行，積集福慧二資糧〇內涵中包括十行、十迴向
〇〇〇〇〇〇〇〇〇〇三、證發心：如實證入真如佛性，產生勝義菩提心〇階位是十地以上菩薩
〇〇〇〇〇〇〇〇/kp|庚二、別釋/
〇〇〇〇〇〇〇〇〇/kp|辛一、釋信成就發心/
〇〇〇〇〇〇〇〇〇〇/kp|壬一、征起/〰〰〰〰〰〰〰【/see:分別發趣道相:信成就發心:征起|經文/】
〇〇〇〇〇〇〇〇〇〇〇問因相：信成就發心者何等根機？修何法門？
〇〇〇〇〇〇〇〇〇〇〇問果相：成就信成就之內涵？所發菩提心為何？
〇〇〇〇〇〇〇〇〇〇/kp|壬二、解釋/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、釋信成就/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、正釋成就/〰〰〰【/see:分別發趣道相:信成就發心:成就|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇信成就發心修行根機是依止不定聚眾生，即十信位菩薩
〇〇〇〇〇〇〇〇〇〇〇〇〇不定聚眾生如何修大乘信心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、依止內因力熏習：依止大乘的正見，厭生死苦，欲求無上菩提
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、假藉外緣力熏習：大乘善根熏習，非一生一世，須多生多劫熏習
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|故須祈求三寶加被每一期生命都能遇諸佛住世，尤其善知識住世/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|由大乘善知識如法開導，令熏修大乘善根，是外緣力，善知識攝受力/
〇〇〇〇〇〇〇〇〇〇〇〇〇一萬劫後，堅固不退轉信心，成就堅固菩薩種性
〇〇〇〇〇〇〇〇〇〇〇〇〇菩薩種性成立後，自然發起心中願力，依止信心會發菩提心
〇〇〇〇〇〇〇〇〇〇〇〇〇信心成就十住菩薩，正定聚，永不退轉，叫安住如來種性，或安住菩薩種性
〇〇〇〇〇〇〇〇〇〇〇〇〇信成就發心有二因緣：鈍根、利根的差別，來自智慧的觀照
〇〇〇〇〇〇〇〇〇〇〇〇〇〇鈍根菩薩，依止生滅門，是對立的正見，本論所說信業果報，能起十善
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|先修有相行，依止慚愧心、斷惡修善；再修無相行，修我空、法空的智慧/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|依止生滅門的正見，修習善根、正定聚；其十住是別教十住位，證得空觀，斷除三界見思煩惱/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇利根菩薩，依止真如門、一心三大的道理，能自信己身有真如法，因地時即能稱性起修
!!〇〇〇〇〇〇〇〇〇〇〇〇〇/ail|修行一萬劫，所成就的十住是圓教十住，直接的破無明、證法身，入法身菩薩位/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、兼顯未成/〰〰〰【/see:分別發趣道相:信成就發心:未成|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇退轉發菩提心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、善根淺薄〇佛法的善根主要指智慧
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〰/ail|是類菩薩發心後，多喜修福德資糧、善法；對大乘甚深不二法門不生好樂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、煩惱深厚〇此處煩惱指：所發菩提心非永遠存在，故菩薩戒有時叫他勝處法
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〰/ail|發菩提心就以菩提心為自體，但有時煩惱會去破壞菩提心/
!!〇〇〇〇〇〇〇〇〇〇〇〇〇〇〰/ail|菩薩戒講到：修學菩薩道有三煩惱最易傷害菩提心：瞋恚心，高慢心，嫉妒心/
〇〇〇〇〇〇〇〇〇〇〇〇〇外緣力薄弱，雖然成就，結果退失〇未經萬劫，遇四因緣也會發菩提心，不純正。有四種相貌
〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、所謂見佛色相，而發其心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、或因供養眾僧，而發菩提心
〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、或因二乘之人，教令發心〇修四聖諦，二乘人偏重苦諦，大乘人偏重道諦
〇〇〇〇〇〇〇〇〇〇〇〇〇〇四、或學他發心
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、釋發心/                                    [26#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、釋所發之心/〰〰【/see:分別發趣道相:信成就發心:發心|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、正釋/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇菩提心三相貌
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一、直心：正念真如法故〇是根本行，整個菩薩道的根本。住位菩薩之心。所觀境約惡法以對治
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二、深心：樂集一切諸善行故〇所觀境是善法。善法者何？能生起此生、他生安樂果報
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三、大悲心：欲拔一切眾生苦故〇是利他行，成就一心之用大
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、釋疑/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〖問〗上說法界一相，佛體無二。何故不唯念真如，復假求學諸善之行？
〇〇〇〇〇〇〇〇〇〇〇〇〇〇若人修習一切善法，才能歸順於真如法故，不能執理廢事
!!〇〇〇〇〇〇〇〇〇〇〇〇〇修行不能只是生善，還要破惡；兩者缺一不可
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋發心之行/〰〰【/see:分別發趣道相:信成就發心:發心之行|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇一、行根本方便
〇〇〇〇〇〇〇〇〇〇〇〇〇二、能止方便
〇〇〇〇〇〇〇〇〇〇〇〇〇三、發起善根增長方便
〇〇〇〇〇〇〇〇〇〇〇〇〇四、大願平等方便
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子三、釋發心之益/〰〰【/see:分別發趣道相:信成就發心:發心之益|經文/】          [27#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、正明勝益/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、約實明能/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、約權簡過/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、顯退不退/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、權說有退/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、實則不退/
〇〇〇〇〇〇〇〇〇/kp|辛二、釋解行發心/〰〰【/see:分別發趣道相:解行發心|經文/】
〇〇〇〇〇〇〇〇〇〇於真如法中，深解現前，所修離相
〇〇〇〇〇〇〇〇〇〇〇一、以知法性體無慳貪故，〰〰〰〰隨順修行檀〰〰波羅蜜。
〇〇〇〇〇〇〇〇〇〇〇二、以知法性無染，離五欲過故，〰隨順修行尸〰〰波羅蜜。
〇〇〇〇〇〇〇〇〇〇〇三、以知法性無苦離瞋惱故，〰〰〰隨順修行羼提〰波羅蜜。
〇〇〇〇〇〇〇〇〇〇〇四、以知法性無身心相，離懈怠故，隨順修行毗梨耶波羅蜜。
〇〇〇〇〇〇〇〇〇〇〇五、以知法性常定，體無亂故，〰〰隨順修行禪〰〰波羅蜜。
〇〇〇〇〇〇〇〇〇〇〇六、以知法性體明，離無明故，〰〰隨順修行般若〰波羅蜜。
〇〇〇〇〇〇〇〇〇/kp|辛三、釋證發心/                     [28#VOL]
〇〇〇〇〇〇〇〇〇〇/kp|壬一、明分證/〰〰〰【/see:分別發趣道相:證發心:分證|經文/】
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、明所證/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、明證體/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、明起用/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、明心相/〰〰【/see:分別發趣道相:證發心:分證:心相|經文/】
〇〇〇〇〇〇〇〇〇〇/kp|壬二、明滿證/〰〰〰【/see:分別發趣道相:證發心:滿證|經文/】
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、正明/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、釋疑/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、釋一切種智疑/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋任運利生疑/
〇〇〇〇/kp|丙四、//b|修行信心分/                         [29#VOL]
〇〇〇〇〇/kp|丁一、結前起後/
〇〇〇〇〇/kp|丁二、正說修信/
〇〇〇〇〇〇/kp|戊一、正明修習信心/〰〰〰〰【/see:修行信心|經文/】
〇〇〇〇〇〇〇/kp|己一、總征/
〇〇〇〇〇〇〇/kp|己二、別釋/
〇〇〇〇〇〇〇〇/kp|庚一、釋信心/
〇〇〇〇〇〇〇〇〇一、信根本
〇〇〇〇〇〇〇〇〇二、信佛
〇〇〇〇〇〇〇〇〇三、信法
〇〇〇〇〇〇〇〇〇四、信僧
〇〇〇〇〇〇〇〇/kp|庚二、釋修習/〰〰〰〰〰【/see:修習|經文/】
〇〇〇〇〇〇〇〇〇/kp|辛一、總標/
〇〇〇〇〇〇〇〇〇/kp|辛二、別釋/
〇〇〇〇〇〇〇〇〇〇/kp|壬一、釋施門/
〇〇〇〇〇〇〇〇〇〇〇財佈施，無畏佈施，法佈施
〇〇〇〇〇〇〇〇〇〇/kp|壬二、釋戒門/
〇〇〇〇〇〇〇〇〇〇〇三聚淨戒：攝律儀戒，攝善法戒，攝眾生戒
〇〇〇〇〇〇〇〇〇〇/kp|壬三、釋忍門/                     [30#VOL]
〇〇〇〇〇〇〇〇〇〇〇生忍
〇〇〇〇〇〇〇〇〇〇〇法忍
〇〇〇〇〇〇〇〇〇〇/kp|壬四、釋進門/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、總明精進意/
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、別示精進法/
〇〇〇〇〇〇〇〇〇〇/kp|壬五、釋止觀門/〰〰〰〰〰【/see:修習:止觀門|經文/】
〇〇〇〇〇〇〇〇〇〇〇/kp|癸一、總標/
〇〇〇〇〇〇〇〇〇〇〇〇止
〇〇〇〇〇〇〇〇〇〇〇〇觀
〇〇〇〇〇〇〇〇〇〇〇〇隨順：真如三昧
〇〇〇〇〇〇〇〇〇〇〇/kp|癸二、別釋/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子一、釋止/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、明修相/〰〰〰【/see:修習:止觀門:修止|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、修前方便/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、正明修法/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅三、揀成不成/           [31#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、明證相/〰〰〰【/see:修習:止觀門:修止:證相|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑三、辨魔事/〰〰〰【/see:修習:止觀門:辨魔事|經文/】    [32#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、示魔事相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、明致魔之由/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、明魔事之相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰一、辨形聲/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|辰二、辨起過/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、示對治法/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、治邪/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、皈正/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑四、勸修習/〰〰〰【/see:修習:止觀門:勸修習|經文/】
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、正勸/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、明益/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子二、釋觀/〰〰〰〰〰【/see:修習:止觀門:觀|經文/】        [33#VOL]
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑一、明應修/
〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|丑二、明修相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅一、明觀相/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅二、示觀用/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯一、起大悲心/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯二、因悲立願/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|卯三、依願起行/
〇〇〇〇〇〇〇〇〇〇〇〇〇〇/kp|寅三、顯觀時/
〇〇〇〇〇〇〇〇〇〇〇〇/kp|子三、釋雙行/                                             [34#VOL]
〇〇〇〇〇〇〇〇〇〇〇/kp|癸三、結益/〰〰〰〰〰〰【/see:修習:止觀門:結益|經文/】
〇〇〇〇〇〇/kp|戊二、更示勝異方便/〰〰〰〰〰〰〰【/see:修習:勝異方便|經文/】
〇〇〇〇〇〇〇/kp|己一、泛明念佛除障/
〇〇〇〇〇〇〇/kp|己二、的指求生極樂/
〇〇〇〇〇〇〇说明之一〇念佛法門所取代的是真如三昧。真如三昧無相三昧，以無住為本，難點在于相續太難。
!!〇〇〇〇〇〇〇〇〇〇〇/ail|於是，當修了一段時間無相三昧，可修一相三昧。一個相，就是彌陀佛的相狀。/
!!〇〇〇〇〇〇〇〇〇〇〇/ail|但是其他的出離心、大悲心都不能少。/
〇〇〇〇〇〇〇说明之二〇何以阿彌陀佛國，而非他國？果地、因地二殊勝故！
〇〇〇〇/kp0|丙五、//b|勸修利益分/〰〰〰〰〰〰〰〰〰〰【/see:勸修利益|經文/】
〇〇〇〇〇/kp0|丁一、結前起後/
〇〇〇〇〇/kp0|丁二、正說勸修/
〇〇〇〇〇〇/kp0|戊一、總勸/
〇〇〇〇〇〇/kp0|戊二、別勸/
〇〇〇〇〇〇〇/kp0|己一、修學功德/
〇〇〇〇〇〇〇/kp0|己二、譭謗過失/
〇〇〇〇〇〇/kp0|戊三、結勸/
〇〇/kp0|甲三、//b|結施迴向/（類於流通分）
〇〇〇/green|諸佛甚深廣大義，我今隨順總持說，迴此功德如法性，普利一切眾生界/
!!
〇/kp0|肆、結示勸修/`;

function getARBRE(kpOnly, inBooks9) { // returns { tree, Ts }
  var a   = lARBRE.split('\n'), lnNum = 2, Ts = [];
      buf = new Buffer(`/b|《大乘起信論講記》科判${kpOnly?'':'、筆記'}/`); // the root node
  for (var i in a) {
    var ln = a[i].trim();
    if (!ln) continue;
    if (kpOnly) {
      if (ln[0] == '!' ||
          ln.indexOf('/kp') < 0 ||
          ln.indexOf('、結前') > 0)
        continue;
      var idx = ln.indexOf('【/see:');
      if (idx > 0) {
        var idx1 = ln.indexOf('】', idx+8);
        ln = ln.substring(0, idx) + ln.substring(idx1+1);
      }
    }
    if (ln.endsWith('VOL]')) {
      var idx = ln.lastIndexOf('['),
          volinfo = ln.substring(idx+1, ln.length-5);
      ln = rtrim(ln.substring(0, idx));
      if (volinfo.startsWith('KP?')) {
        if (kpOnly) Ts.push({ line:lnNum, link:volinfo.substring(3) });
      } else if (volinfo.startsWith('?')) {
        if (!kpOnly) Ts.push({ line:lnNum, link:volinfo.substring(1) });
      } else {
        Ts.push({ line:lnNum, link:volinfo });
      }
    }
    buf.w('\n', ln);
    ++lnNum;
  }
  return { text:buf.render(), Ts };
}

function 大乘起信論講記Creator(kpOnly, inBooks9) {
  return gp => {
    var treeInfo = getARBRE(kpOnly, inBooks9);
    gp ||= newGP();
    gp.setStyle(AIL + BOLD)
      .setWidth(kpOnly ? 50 : 54)
      .setTree(treeInfo.text);
    if (!kpOnly) {
      if (!inBooks9) gp.T(46.75, 1, '/b1|淨界法師主講/');
      new 大乘起信論Verses(gp);
    }
    // Add volume info/links
    for (var i in treeInfo.Ts) {
      var lnk = treeInfo.Ts[i], link = lnk.link, vol = link, idx = link.indexOf('&');
      if (idx > 0) vol = parseInt(link.substring(0,idx));
      if (inBooks9)
        gp.T(kpOnly ? 45 : 49, lnk.line, `/c339|▸ //href:"9151.htm?vol=${link}"|第${zNumber(vol)}集/`);
      else
        gp.T(kpOnly ? 45 : 49, lnk.line, `/c339|◼ 第${zNumber(vol)}集/`);
    }
    if (!inBooks9) gp.hasRightEdge();
    return gp;
  };
}

createGP('大乘起信論講記',      CAT_經論, 大乘起信論講記Creator());
createGP('大乘起信論講記•科判', CAT_經論, 大乘起信論講記Creator(true));
