JT14.volNum = 1;
JT14.subttl = '新時代';
JT14.text = `
淨空法師回家已經快四年了。八十多年前，印光大師謝幕。祂是大菩薩，自然看見身後五年的蘑菇雲，心知肚明，新時代到來了。下一個是核子、高科技、全球化時代；時間像是拐了一個直角的彎，與過去千萬年完全不相同了。淨空大師接棒，帶領衆生迎接這個新時代。

科學技術在神通面前，荒唐可笑；然而對於五根凡夫、本紀元千萬年來的人類生活，絕對不可思議。佛菩薩當然懂得這一切，長久以來抑制任何人類感官之外的超自然知識，因為祂們慈悲為懷，知道這個潘朵拉盒子之危害。第二次世界大戰以來，科學技術全面噴發，不再忸怩。這個盒子已被打開，洪水猛獸洶湧而來。這是一個關鍵拐點。

科學技術本身沒有意圖，而且完全可以用來造福人間和地球，可是偏偏被用來殘害生靈、毀壞環境、大規模殺戮。十方三世一切諸佛、文殊普賢觀音勢至地藏彌勒、閻羅天子、堅牢地神、天龍八部，一個個都大眼瞪小眼，看得清清楚楚真真切切。本來可以積功累德的好事，偏偏要來造無窮無盡的阿鼻重罪，真是不可理喻，十分詭異。

現在的地球人，忙碌憂苦疲憊不堪，在勾引與逼迫的雙重驅使下不斷造罪業而不覺，誤以為生活就是如此。他們不知道，自己像是湯鍋裡的青蛙。在印光大師的日子裡，湯水已經開始發燙；及至2016，大火已經打開，湯水就要沸騰了。這是另一個關鍵的、終極的拐點。人工智能同時出現，徹底標示著沒有人再可以自視為「重要」，隨時隨地可能被拋棄。這就是我們時代的詭異。縱然不講佛法，在世俗層面，人生意義業已隨風飄去。太詭異了。

話雖如此，「人身難得佛難值」；既然身為直立行者，兩大困難已去其一，正好藉此良機反省人生之真實意義。若能幡然醒悟，皈依佛道，則恰如蓮花之出污泥，棄名聞利養如敝屣，擯貪嗔痴慢似蛇蠍，生亂世而取實德，其勝果將不可思議！

在此人類歷史上最詭異的時刻，大慈大悲的佛菩薩，乃至一切龍天善神，若是無動于衷、顧左右而言他，就荒唐了。正值此時，出現在世的是淨空法師。祂怎麼可能是凡夫啊！其身份究竟為何？必然是一個大塊頭。大到觀世音菩薩的級別。不如此，不夠本時代的級別。

潘朵拉盒子最後沒有放出來的東西，叫做希望。這個盒子我不寄希望。希望只有從佛菩薩來。

事實上，我認定，淨空法師真是觀世音菩薩化身而來。在此，筆者與衆生分享目力所及，以如下專題述之：
/olzh/
新時代<ail>（即本篇）</ail>
<a href="?vol=2">淨空大師是觀世音菩薩再來</a>
<a href="?vol=3">菩薩現世之功</a>
<a href="?vol=4">《佛說大乘無量壽莊嚴清淨平等覺經》是佛經嗎？</a>
<a href="?vol=5">「將心來，與汝安」</a>
//`;
