var I20zi = '<img src="../../../images/真誠清淨平等正覺慈悲看破放下自在隨緣念佛.jpg" style="padding:19px 19px 39px 0px" align=left width=284>';
JT14.volNum = 2;
JT14.subttl = '淨空大師是觀世音菩薩再來';
JT14.text = `
如前所述，淨空法師沒有可能性是凡人。祂是觀世音菩薩再來。我將擺出很多證據、證明，沒有問題。大士選擇在中國發生、入華夏族裔，說明了中國人的福報。

「中國」，梵語 madhya deśa，在印度佛教中指佛陀釋迦牟尼出世及弘法之地，古印度佛教文化圈的中心。「中國」之外稱為邊地，又叫支那，梵語 cīna；在中文佛經裡，支那就特指華夏大地了。如今，大乘佛法紮根華夏，中國就是「中國」了。華夏子民當明了自己的地位。

淨空法師選擇的時機入世、住世、離世，自然絕非隨意。${I20zi}其所選擇結緣的人物亦然。祂1927年出生在安徽廬江，一個保守、但有著深厚文化底蘊的農村環境，得以親身體驗傳統文化，品味真正中國味道。一手上品書法展示其「無量才藝」，隱晦透露不凡身份。少年至青年時期，隨動盪局勢流轉，直到1949年定居台灣，始學佛法。如此避開了與印光大師的相會。廬江、蘇州雖去千里，水路交通其實方便。何以故？印光大師是成名的一代老宗師，倘若相見，必生瓜葛，非其計畫。在台中淨空法師親近李炳南老居士；李老師與印光大師有鬆散的師承，於是成就淨土宗的師承關係。但李老居士並不列淨空為其弟子，何也？李老師識貨啊！不敢啊！淨空法師學佛法時得以親近時任台大哲學系主任的方東美、藏傳佛教第七世活佛章嘉呼圖克圖；這種因緣豈是隨便可以得到！六十年代開始出家、講經說法；夏蓮居老居士於1965年往生，又錯開了。直到1987年，在美國與黃念祖老居士會面，開始弘揚夏老會集的《佛說大乘無量壽莊嚴清淨平等覺經》以及黃老作的《解》。李老師說只能教淨空法師若干年，之後推薦印光大師作老師，以讀《文抄》為徑；而淨空法師向佛弟子介紹好老師，直接推薦阿彌陀佛。這是指夏蓮居老居士，也就是阿彌陀佛再來。「黃念祖」，不就是念佛的祖宗嗎？祂當然也是大勢至菩薩再來。在地球上，黃念祖是夏蓮居的學生；在佛經裡，大勢至菩薩是阿彌陀佛的學生。佛菩薩化身來實在是稀疏平常的事情不過的了。夏蓮居居士、黃念祖居士與淨空法師是<a href="../../../images/無經三聖_三傑來此娑婆土.png">西方三聖一波聯袂而來</a>的示現。這種事情，一點都不奇怪，因為我們現在的時代太特殊了。至於示現的真實情況，實在講，非吾等凡夫之所慮、當慮、能慮。

上述感性認知多少有說服力，當然也不脫主觀臆測的風險。接下來列舉硬核證據。

法師俗名徐業鴻，就是葉紅。請問哪位大菩薩<a href="../../../images/觀世音菩薩1.jpg" title="觀世音菩薩">足履紅葉</a>？作為中國人，不會陌生吧？法名「釋淨空」者：「釋」姓就是佛；「淨」表僧，約六組惠能；「空」是法，尤其老法師愛說：「一切法，無所有，畢竟空，不可得。」是故「釋淨空」正是「佛僧法」三寶！《大悲咒》及許多咒語、特別是觀世音菩薩的咒語，常以「南無三寶」（namo ratna trayāya）開始，正合其名。

老法師著名的廿字訣上闕是「真誠清淨平等正覺慈悲」，前八個字正是大乘佛法，合一「大」字，配後二字成「大慈悲」，合《大悲咒》第二句之結尾。廿字訣下闕是「看破放下自在隨緣念佛」；前八個字直表「照見五蘊皆空，度一切苦厄」，最後「念佛」是淨土宗修行法門。念阿彌陀佛和念觀世音菩薩都能往生西方極樂世界。

淨空法師<a href="../books/0166.htm">自己說</a>：「我在往年每一個新的道場建立，第一部經一定是講《地藏菩薩本願經》。」這固然是地藏法門的殊勝，不過，不也正是兌現釋迦摩尼佛在忉利大會上對觀音菩薩的咐囑嗎？「<verse>是故觀音汝當知，普告恆沙諸國土</verse>」，《地藏經》上世尊如是說。

<img src="../../../images/華藏衛視《觀音三經》讀誦本.png" width="400px" align=right>華藏衛視是淨空法師廣大弘法的關鍵渠道，其總裁陳彩瓊女士無疑是老法師最內圈的助手，沒有之一。陳女士特別愛弘《觀世音普門品》。在淨空法師往生周年紀念時，有特別推出一套裝潢十分精美的觀音三經合讀本。陳女士對觀音菩薩的推崇是不遺餘力、情真意切、持之以恆的；她對別的佛菩薩都沒有這麼盡力；非為不敬，而是在告訴我們一件事情。你猜得出來嗎？

淨空法師曾假借一位日本老和尚之口說，所有宗教創始人都是觀世音菩薩的化身。祂在評論菩薩現千眼千手相時說：「頭部現三十二個面孔代表三十二應，應以什麼身得度，他就現什麼身，建議把畫像裡觀音的三十二個面孔畫作各種不同宗教創始人的面孔，那個表法就清楚了，讓我們一看，原來這些宗教創始人全是觀世音菩薩的化身。」法師曾聲稱：「《聖經》我講得比牧師好；《古蘭經》我講得比阿訇好。」切莫以為這是輕狂自讚。佛菩薩不講廢話，蓋彼等乃真語者、實語者、如語者、不誑語者、不異語者。祂這麼說，是在告訴我們一件事情。你猜得出來嗎？

淨空法師的俗家慈母<a href="../books/0038.htm#a08">馬太夫人往生</a>；法師本人在新加坡弘法，其弟徐業華居士報告過程，說「在院期間，還曾見到觀音菩薩金色莊嚴，歡喜無量。」這還會有錯嗎？淨空法師的二老分別示現：父親演示惡報之相，母親演示往生瑞相。他們肯定都是菩薩啦。

老法師一生誨人不倦，弘法不斷，法音普及無邊界，語如鐘聲獅子吼，威德莊嚴妙難倫，通達甚深微妙法，智慧廣大深如海，內心清淨絕塵勞，慈悲哀愍衆生苦，苦口婆心教出離，開導群生無厭倦，身體力行作表率，宣揚大教聖言量，力勸念佛真解脫，真正是學為人師行為世範的無上楷模。如此威神階位，唯有大權示現之聖者方能顯現。`;
