JT14.volNum = 3;
JT14.subttl = '菩薩現世之功';
JT14.text = `
/SECTION/引言

試問，釋迦摩尼佛涅槃後，祂離開我們了嗎？釋迦摩尼佛出生之前，世尊、燃燈佛、阿彌陀佛、觀世音菩薩、地藏菩薩、彌勒菩薩、等等聖人，都不在這裡嗎？每時每刻，在地球上，有多少聖人，你數得過來嗎？還有大小鬼神，《地藏經》告訴我們，亦復如是。實在講，佛菩薩皆盡虛空、遍法界，祂們想逃都無處可去啊。佛菩薩、龍天善神的慈悲心不可思議。今天，在本紀元人類歷史上的最低點，祂們怎麼可能無動於衷、顧左右而言他？這沒有可能性。虛空中的聖人們太多了！祂們也不可能一個個單打獨鬥，必然尋求最佳方案、最大化利益人。

早有人注意到，觀世音菩薩在早期信仰與婆羅門教有深厚淵源，其源頭可追溯至《梨俱吠陀》中的善神形象，特別是雙馬童神，象徵慈悲、治療與保護，「後來被大乘佛教拉去當菩薩」。這個說法太可愛了！大菩薩需要人去拉嗎？拉得動嗎？這是典型的人本主義的顛倒迷惑。佛教之前的神教神話恰恰記錄了佛菩薩的行跡，不過名字相不同而已。

觀世音菩薩與阿彌陀佛、大勢至菩薩乃西方三聖，本是一體；淨土法門又是娑婆世界末法衆生唯一的生路，這個大因緣自然而然。但是，此次示現，淨空法師還告訴了我們兩個秘密，成為另外兩個因緣。由此三因緣，祂做了三件大事。

/SECTION/第一個秘密和因緣大事

第一個秘密是，世界上所有的宗教都是觀世音菩薩建立的。<a href="?vol=2">上一篇</a>已經講過，淨空法師借助一個日本老和尚之口說出，後來在贈送觀世音畫像為禮物時都有表白。實在講，對於佛弟子，神通變化毫無神秘性；掃羅往大馬士革，耶穌向他現身放光，遂改名保羅，啟動基督教。不是嗎？《新約》裡除了四福音、啓示錄，基本就是保羅了。請自參 † 與 卍 的異同。

因此，淨空法師年青時「混跡」於基督教、伊斯蘭教，後來自詡「《聖經》我講得比牧師好。《古蘭經》我講得比阿訇好。」祂不會打妄語。也不是炫耀口才。這是在說事。金口難開，佛菩薩不說廢話。

由此因緣，淨空法師推動世界宗教團結，促警世界和平。亦體現了祂所示現時代的特質，即全球化。是為其所作之一件大事。

/SECTION/第二個秘密和因緣大事

第二個秘密是，中華文化是本紀元人類文明的歸宿。這點祂老人家沒有明說，但用行動表露無遺。

其關鍵點在於，大乘佛法最終根植震旦、普被東亞。佛弟子明白，盡虛空、遍法界，沒有比大乘佛法更重要的東西了。淨空法師在講經說法時，沒有停過讚嘆中華文化、漢字、文言文、歷代祖師大德。祂老人家一手上品書法絕藝是自性的流露。在論述「一個人的成就必須要有兩個基礎」時，祂說：「一個人的成就必須要有兩個基礎。第一是德行，第二要學文言文。」這個含義很深；作為華夏子孫、尤其大乘佛弟子，應該明晰。

佛菩薩沒有時間、空間限制，又悲心戚戚、念茲在茲要度脫終生。釋迦摩尼佛來地球降生之前，佛菩薩們預先作好安排，為正法流布、常住作準備，不違常情吧？由此推斷、以後世歷史為證，就不得不看到：老子、孔子，乃至在希臘，與世尊幾乎同時出興於世的時機，絕非偶然。佛陀早就準備將來佛法要落戶中華大地！

/SECTION/文明就是戒律

孔夫子「信而好古」，信好者何？無他，戒律也。儒教者何？戒律也。戒生定、定生慧；是以後來大乘佛法在中國，捨小乘基礎直上大乘，就是由於儒修基礎；淨空法師常講這點。

再觀地中海，最終歸於三大宗教。宗教者何？無他，戒律也。宗教具強制性，是菩薩為根器薄弱人群創造的權宜方便。Civilization 意為「文明」，其字根 civil 是城市、聚落的意思；有城就有界限、規矩、法律，也就是戒律。西方文明由宗教體現。日常用語透露端倪：merci、gracias 就是慈悲、恩典，adieu、ade、a dios 是禮敬上帝，等等。猶太、伊斯蘭人民更不在話下。

既然觀世音菩薩在西面創造了宗教，東方儒家的戒律就不是祂創造的？淨空法師「隨口」問李炳南老師：「中國古代聖人是佛菩薩再來嗎？」師曰：「理上講得通，事上無憑證。」這不是暗示，是挑明。金口難開，佛菩薩不說廢話。

所以，觀音菩薩用李老師與日本和尚的嘴說出了創立東、西方文明的始作俑者。

釋迦摩尼佛在印度出現是偶然的嗎？絕無可能。在人類歷史的那個特定時間點上，有三個靈性層次（佛語根器）：
/olzh/
印度人，具天人氣質，已能入禪定、觀輪迴。佛陀直接開教。
中國人，遠古有孔夫子所敬仰的神秘「完美禮教」，退而成為禮、義、仁、智、信；老子更從理上反映古老智慧，民間則有求道修仙。<br>是以，中華文化是人道中最人道者。最終為全人類承擔了大乘佛法。佛說人道最利於修道、成佛，正契此機！<br>經儒、道持續教化，根器漸熟，佛法在像法時期開始班師支那。
荒蠻、遊牧、諍戰族類，根器雖低，鬼神不絕。公元四世紀，體制化宗教建立推廣。以神靈之相、制訂戒律，提升文明。
//
/SECTION/中華文化是本紀元人類文明的歸宿

筆者向來以為《道德經》是遠古佛教之殘留。試看，「道可道非常道」不就是第一義諦？「名可名非常名」不就是「言語道斷心行處滅」，以及「凡所有相（文字相）皆是虛妄」？「有大患者為吾有身」者，能放下若斯，這是人話嗎？「為學日益為道日損」豈非「因定生慧」？「下士聞道不笑不足以為道」翻成梵文一定是「哼—凡夫凡夫莫哈凡夫凡凡夫」（玩笑了）。

漢字不簡單。人的思維，載體是圖像。所以佛修講究觀想；「我懂了」英文用 <i>I see</i>。語言是人際溝通的載體。字母文字是語音的載體。拼音文字的確簡單，蓋語言畢竟不離音聲；然而用於表義，終究差強人意。比如，<i>Catherine</i>，<i>Katalina</i> 等等其實是同一個名字，可是無論讀、寫都因語言而異。反觀一個實義漢字，各地人發音可以不同，乃至到了外國、可以套上他們固有的字音。縱然表音字，因其形象之固定，直接映射為意思。拼音文字也有類似；當看到 <i>see </i> 時，大腦直接反映、無需翻譯；但字符串的視覺特徵不比方塊字，速度畢竟差些；又浪費篇幅，比如 <i>apartment</i>，漢字「公寓」。大部分語言的起始字母亦各有義，可是數量有限、不敢開拓，最終淪為音符。

漢字妙啊！老法師常常感嘆。其前身，以形表義的甲骨文、金文、碑文成批湧現，誰幹的？倉頡老祖，您是哪位？中文漢字在世界上絕無僅有、延續至今，難道沒有佛菩薩加持之功？大乘佛法亦然，純屬偶遇？

漢明帝一夢，佛法開始東來；那年，羅馬軍團還在攻打耶路撒冷。隨後，多少印度菩薩不遠萬里來到中國；其實也不難，憑其神足通。乃至達摩祖師，到般剌密帝，雖貴為國師、非要違抗王命、將《楞嚴經》偷傳來華。更有智者大師將世尊的講法完美規範化、玄奘大師的壯舉、即身成佛的惠能大師、高僧大德代代輩出、佛菩薩化身比比皆是，大乘佛法在中國的成就人數遠超印度，淨空法師如是說。

中國，就是為大乘佛法而生。「家家彌陀佛，戶戶觀世音」不是迷信，是真際。彌陀、觀音，本是一體。除卻大乘佛法，人間莫非世智聰辯而已。華文文化圈裡，我們有望直達佛之知見、出離生死、乃至成佛，這是何等榮耀、何等高貴、何等福德！

淨空法師一生，一方面印贈大量佛經、散佈全世界，同時也大量印贈中華文化經典、散佈全球各地以求保存。講經說法時不斷敦促研習優良傳統文化，交相輝映。這是祂老人家為人類做的第二件大事。同時用行動印證關於中華文化的觀點。

/SECTION/廣大弘揚淨土法門

弘揚佛法是淨空法師的本業。淨空法師一生講經不輟，長逾六旬，為佛法作了詳盡的開導，並且專注於最為契合末法衆生根機的淨土法門，雖廣宣大教而不說一句廢話。祂是人類歷史上首位留下大量音容笑貌的聖賢大德，充分利用現代技術之方便、廣施聖賢之教，令法音普及無邊界，通達甚深微妙法，速到菩提究竟岸。現代人已被普遍愚化、不學無術，乃至印光大師的文字已經覺得佶屈聱牙，更遑論唐宋明清古大德們的經典論述。煩滿胸中常念邪妷，起心動念莫非是業、無不是罪；不能專注、妄想紛飛，靜心安穩十五分鐘亦為不易。善知識們用心良苦，削足適履，苦口婆心，為求開化。大師的說教影音暨文字既流通於公共平台，又保存於獨立單位，善於維護其真實性、準確性、完整性。

大師早年長期跟隨章嘉大師、李炳南居士等佛學大德修習，愛說大經大論、善解佛法妙義；然後專弘淨土，單刀直入，其行徑與承遠法照永明蓮池蕅益之流不二無異。老法師明瞭當下衆生根基之薄弱，非常重視紮根教育，呼應印光大師之倡導，運用中國優秀傳統文化的力量，改善學人的學佛因緣、成就機會，制訂完善的《<a href="9090.htm">淨宗同學修行守則</a>》，為末法衆生開出全方位的藥方，方便持戒、精勤、專修念佛，其作為與印光大師如出一轍，青出於藍。

淨空大師與其他聖賢們清楚明瞭淨土法門的瓶頸所在，即缺乏一部完整的、堪當重任的《無量壽經》版本。衆生需要的是一部即包含世尊所說的有關淨土法門的要旨、準確反映阿彌陀佛四十八個大願、又契合末法時代當下和未來根基的大經，作為淨土法門最重要的指導綱領。夏蓮居老居士會集的《佛說無量壽莊嚴清淨平等覺經》正是這個集體努力的結晶。黃念祖老居士為之做了詳細的《<a href="${jieUri}"">註解</a>》。淨空法師在全世界範圍大力推動，廣大信衆受持讀誦，大獲裨益。這是西方三聖為即將久初暗冥的末法苦衆生所安排的長遠佈局，絕非一時衝動心血來潮。凡夫俗眼不明就裡，妄生疑慮心不堅固。圍繞這部經，尤其是淨空法師面對層層阻力而強勢推動，在淨土宗界內乃至廣大修習民衆中，都引起廣泛關注。《佛說無量壽莊嚴清淨平等覺經》的成敗關乎老法師一生的成就、衆生的福祉。為此，在此開闢<a href="?vol=4">專篇</a>予以深入研究。

/SECTION/活躍於世界舞台

得益於現代生活之便利，法師亦得活躍於世界舞台，東西南北，弘法利生，推進世界和平與和諧。尤其以超越的態度，歡迎、團結世界宗教，互信互利，利樂廣大世界人民，提升了佛教、中華文化在全世界的形象和地位。`;
