var dj = '《<XB>大經</XB>》';
JT14.volNum = 4;
JT14.subttl = '《佛說大乘無量壽莊嚴清淨平等覺經》是佛經嗎？';
JT14.text = `
淨空法師傾力推廣的《佛說大乘無量壽莊嚴清淨平等覺經》夏蓮居居士會集本，成即大功德，不成則大敗筆，因為祂投入太多了。

淨土法門的瓶頸在於缺乏一個完整的、堪當重任的《無量壽經》版本。衆生需要的是一部即包含世尊所說的有關淨土法門的要旨、準確反映阿彌陀佛四十八個大願、又契合末法時代當下和未來根基的大經，作為淨土法門最重要的指導綱領。歷史上真心實意修習淨土的賢士們，如王龍舒、彭紹升、魏承貫，莫不深感此切膚之痛，以至於鋌而走險、啟筆會集。王龍舒的會集本得到廣泛讚譽、引用，證明了淨土學人們的需求。蓮池大師指出了王龍舒會集本的缺陷，致其流通式微。乃至後人繼續，終未成就。但是問題沒有解決，懸而未決。人們只能推崇康僧鎧的譯本；可是，如果康本果真周齊，又何來這一爭議？前輩們又何須大費周章、斗膽會集呢？所以一部優良的《無量壽經》之需求是客觀事實。其結果視其質量而定。

民國早年，夏蓮居居士開始會集，最後成就《佛說大乘無量壽莊嚴清淨平等覺經會集本》。諸多佛界大德大為讚嘆、奉為至善之本。其學生黃念祖老居士最終實現老師囑託，完成其大經之《<a href="${jieUri}">註解</a>》巨著。1987年，淨空法師與黃老在美國相會；夏老已於1965年往生。淨空法師旋即啟動推廣此會集本。而其驚世駭俗之舉在於，刪去「會集本」、直接以《經》來推廣！

一旦意識到《經》與《經•會集本》之別，人人心中必起激盪。佛言之聖潔不容參雜；偽經之擾佛子俱憤。此舉引發的震動可以預見，重大潛在危機至少有三：
/olzh/
<a href="#a01">會集本對各原譯內容的取捨、改組。</a>
<a href="#a02">淨空法師刪除標題裡的「會集本」三字。</a>
<a href="#a03">印光大師的反對。</a>
//
不解決所有疑慮的話，對此經的信心將無法建立。對此，筆者發心啟動了一個非學術性、但足夠細緻的《<a href="9077.htm">〈無量壽經〉夏王五譯之對比研究</a>》；儘管還有很多研究可做，結論確鑿無誤：《<XB>佛說大乘無量壽莊嚴清淨平等覺經</XB>》堪當正法佛經、不單單是善書而已。因此，我對此經具備完全的信心，沒有任何懷疑。（歡迎各位利用此<a href="9077.htm#c7">對比研究框架</a>論證，乃至自行收集數據進行研究。切勿輕信任何人的一家之言。）

從技術層面看，${dj}是當之無愧的僞經，無庸置疑。夏老深明此慮，故而綴經名以「會集本」規避。淨空法師鐵腕刪去「會集本」，意味深長。祂可以這麼做！但在凡夫地，人們需要解套；其關鍵在於，應當了解夏蓮居及其同僚們為什麼要義無反顧地去做這件事情。

下面，針對具體疑惑逐一探討。為省篇幅計，本文自此起稱《佛說大乘無量壽莊嚴清淨平等覺經》為${dj}，除非特殊需要。

/SECTION:a01/一、會集本的內容取捨、改組之憂

《印光法師嘉言錄》有云：「在昔之時，隨修一法，而四者皆備。即今之世，若捨淨土，則果證全無。良以去聖時遙。人根陋劣。匪<ail>（非）</ail>仗佛力，決難解脫。」白話說就是，二十世紀後的人類已經一塌糊塗、難以救藥了。大學生的課堂專注力只有十五分鐘；明朝袁了凡可以坐三天不起一念；因為他沒有手機電視、天天考試、獎金休假、吃喝玩樂。現代人已經接近徹底的 zombie、行屍走肉了。在此境遇下，大慈大悲的佛菩薩只能為我們開一帖猛藥！必須簡至極致、專到無他，如此方有可能救拔些許根熟末世衆生。何謂末世衆生？內缺善根、外徧惡緣。如果還要求持誦《金剛經》、演說禪定波舟種種華麗法門，則佛菩薩的智慧將淪為笑談。

於是，${dj}不羅列諸多佛、賢聖名字，乃至其他內容；整部經裡的人物可以說只有釋迦佛、阿南尊者、彌勒菩薩和阿彌陀佛；十六正士代表我們，才得入文。簡到了極致。整部經其實只有阿彌陀佛四十八願；佛理幾乎沒有特別闡述，只在四十八願的正依二報的描述以及勸修中簡單羅列而已，因為成佛雖然是終極目標，但不是淨土法門的直接修行目的。這是專到了無他，把高光徹底聚焦在阿彌陀佛身上，突出彰顯「阿彌陀佛」之萬德洪名。這不是普通的大乘佛法經典，而是淨土法門的專科教材、特定劇本。不是佛菩薩再來，不可能有這個智慧、膽識和能力。<a href="9077.htm">上述研究</a>其實講得更完備；依其結論，${dj}的內容之憂、之惑，可以已矣。危機之一消除。

/SECTION:a02/二、刪除標題裡的「會集本」三字

然而，這不能改變${dj}的偽經性質！所謂僞經，就是把不是明確由釋迦摩尼佛說的話語稱之為佛經。當然，或可謂${dj}裡的每一個字、每一個句子都是從某譯本裡而來；但這是狡辯，因為文章不是文字、文句的簡單堆砌；文字背後的文、韻、理才是文章的靈魂。每一篇文章都有自己的靈魂、脈動。更何況同樣的文字，在不同場景可以表達完全不同的意思。要把多本不同來源的作品降維整合成一篇融通文章、並期待「完美」會集，根本是不食人間煙火；反之，若要挑毛病，可謂信手拈來、隨意即至。

可是，淨空法師硬是沉下臉來，大筆一揮，劃去「會集本」，露出「經」字！為什麼？為什麼？是邪、癡、瘋、還是狂？都不是，而是慈、悲、智、勇。因為我們，末法底層佛法修行人，需要《無量壽經》；可是我們沒有。

《佛說阿彌陀經》等淨土經論，雖然推崇淨土法門，卻不夠翔實、完整。必須有一部淨土法門的完整經典，方能令人信服、堅固信願、求生淨土。淨土法門雖被稱為「易行道」，那只是相對於其他法門而言；要一生成佛，談何容易！漫說往生極樂、從無量劫無量生中解脫出離輪迴苦海；若給你一架飛機或一艘潛艇，外加一份精簡的使用說明書、幾張廣告，你就敢上天、入海？

或問，大家不都推崇康僧鎧的魏譯本嗎？印光大師都說了，「既有《無量壽經》，何無事生事！」夏蓮居版的主體大致基於康本和唐、宋本。可是別的姑且不論，康本的四十八願實在有欠完備。好幾願都可以（或應該）合併，導致總願數遠不足六八；又，很多願的次序簡直莫名其妙，毫無章法。其他的譯本未加細究，水平參差不齊。雖然它們都有梵文原本，但沒有一本能勝任末法時代《無量壽經》之擔當；同時，它們又各含康本沒有的內容。康本是矮子裡拔尖子，無奈之選。這一窘境不僅為王龍舒、彭紹升、魏承貫、夏蓮居、梅光羲、黃念祖、釋淨空等所認同，凡了解實情者皆有此憂；如是方有歷代大德的前赴後繼。淨空法師為我們衆生做了果斷的抉擇。所以，末法九千年苦衆生回家的路有了，這不是空口說白話。我們要感恩祂老人家！危機之二消除。

一些反對者言辭激烈、詛咒老法師：要受果報的！我要提醒他們：聖人殺盜淫妄而沒有果報；祂們本來無漏啊！祂們一切為衆生的福祉，應機救度衆生。比如淨空法師年幼時打獵殺生，可是作為聖人，被殺的動物可能立得超度、脫離惡道了；或者那些動物根本就是祂的化身，本無命根。返觀自己，先問問是不是無漏吧。「凡根不察身邊神。」有漏人，閉嘴為智；若已經毀謗了、抓緊懺悔啊。

/SECTION:a03/三、印光大師的反對

反對派最強大的火力莫過於印光大師的反對態度了。推託印祖看不到${dj}文本，絕對是自欺欺人。夏蓮居及同僚們辛勤多年，成文後印祖還有好幾年陽壽；雖然戰火紛飛、北上入同願會不太現實，然以其皓月當空的聲望，豈乏中人轉交？除非印祖拒絕接受、所以不見，方合情理。

這個麻煩大了。淨空法師自己說印祖是大勢至菩薩再來，並訓導淨土學人要把《印祖文抄》讀三十遍、《文鈔菁華錄》三千遍，好像還要背出來云云。${dj}的同僚們是一個鼻孔出氣，應該都是聖人。印祖若與他們作對，按數理邏輯，兩邊應有一方不是無漏。否則，以各自三藐三菩提，自可在其維度裡統籌安排，何必在裟婆人道示現不和！

一種可能性是，印祖唱的是紅臉、${dj}群聖唱的是白臉。${dj}是僞經、卻是衆生所必須；但是作僞經之風絕不可姑息。是以印祖竭力呵斥，現護法神相，以阻斷未來愚夫、魔鬼效仿作祟。${dj}群聖則現蓮國佛菩薩相，實推念佛淨修法門。「<verse>如來深廣智慧海，唯佛與佛乃能知。</verse>」「常惑賢聖不修經，凡根不察身邊神。」又，${dj}反對者們引用印祖，實則增益了止僞功用。印光大師、夏蓮居居士，同時登臺卻形同陌路、而且黃家裡就在上海，豈不生疑？這個解釋令我滿意；危機之三除去。

/SECTION:a04/「僞經」乎？

迄今，雖言《佛說大乘無量壽莊嚴清淨平等覺經》性同僞經，實並不以之為然。心理障礙莫過於要接受「<verse>佛說</verse>」「<verse>如是我聞</verse>」「<verse>不得為妄增減經法</verse>」。關鍵是「<verse>增減經法</verse>」；此非「增減經文」。若善男子善女人能夠研究認可，會集本的確沒有增減經法，則不相違背，障礙自除。於筆者本人，經由《<a href="9077.htm#a06">〈無量壽經〉夏王五譯之對比研究</a>》確認，夏集本果真覆蓋五譯本之精髓而沒有實質性增減經法，於是的如阿難尊者所聞、此法亦為我佛所說；於是障礙何由？

就事而言，其實用性無以堪比，從彌陀大願的完備、文字的簡練流暢，到法理的豐足、對淨土法門的護持。究理而論，這實在是佛菩薩親手製作，若非佛經、又為何物？佛佛本來體同；縱阿南尊者再來，亦無愧於「<verse>如是我聞</verse>」之謂。「阿彌陀」本是通號，佛佛皆是阿彌陀；且阿彌陀佛就是釋迦摩尼佛。未來若佛菩薩再來，自可以大慈大悲、隨心所欲，因為祂們無妄，所以不可能增減經法，以無所增減故。

在另一個維度上講，世尊的「四依法」故訓是：一、依法不依人；二、依義不依語；三、依了義不依不了義；四、依智不依識。世尊在很多經裡都講述或提到阿彌陀佛的淨國；《佛說大乘無量壽莊嚴清淨平等覺經》提供了淨土法門最完整的法寶；其經義完全契合世尊的教義；是究竟完備的大乘佛法；是自性的無上智慧之呈現。是故，以此${dj}來修行淨土法門，不會走錯。反之，若刻意詆毀${dj}，必將承擔謗佛謗法的大風險。當然，各原譯本還包含了會集本不可能全部收錄的內容；若以${dj}為指導、各原譯本為補充，將會得到更豐富的經意、亦能驗證${dj}的準確性乃至完備性、體察會集本的良苦用心，建立更強信心。

/SECTION:a05/「四十八願」

「四十八願」是《無量壽經》的核心、全部，包括其反襯，即五惡五痛五燒。法藏比丘發大心、為所有衆生設計營造了這艘「極樂世界」號擺渡船，來度無量無邊衆生前往彼岸。無數諸佛於十方世界無量剎中廣發廣告、招募渡客，彰顯佛佛道同。在裟婆人間，此經是為利益我等輪迴苦衆生。譬如，三十二相好者，即依印度時尚而作；而關於他方菩薩之願，則點到為止。在他世他界，當機或為諸菩薩、天龍鬼神等，自當另現別說。即使在裟婆，釋迦佛也為不同當機分別演說，故有諸多版本，乃至願數亦有差異。

阿彌陀佛度生之願深廣圓融、本是一體；分之為六八等等、但唯人間方便。此經主要是激勵衆生求生淨土，而未盡論最終成佛部分，蓋因我等看不懂、也不受用，所以經文極為應機：「<verse>輪廽諸趣衆生類，速生我剎受安樂。常運慈心拔有情，度盡無邊苦衆生。</verse>」但也不違阿彌陀佛為更高階的菩薩們的誓願（見〈菩薩往生品〉）。佛經裡經常出現量數，比如「十方」、「七寶」、「二十一倶胝那由他」等，實則是一個象徵，代表全部。「四十八願」亦復如是，代表彌陀度生大願之完備性。「<verse>世尊能演一音聲，有情各各隨類解。</verse>」當把握文義之精髓。

/SECTION:a06/信心

只要能往生極樂世界，就是大成功、大功德，就是一生成就、立地成佛。還有什麼更值得牽腸掛肚？值此末法大亂之世，佛菩薩應時而來，軌範《無量壽經》，更遣淨空大德把關，是我等莫大之福慧，當不存二心、殷勤修持、努力精進，令是法久住不滅；是則名為報佛恩。

就修行操作而言，${dj}恰為我需！真如實相、般若智慧，尚可從諸多大乘佛經學習；唯彌陀大願，非《無量壽經》莫予。${dj}將彌陀大願合理歸類為：正報利益十二願、教主己願有五、名號功德十願、正報莊嚴十一願、依報莊嚴五願、他方菩薩五願，繼而詳述正報、依報各種功德莊嚴，後具陳五濁惡世之五惡五痛五燒，苦口婆心勸戒衆生懨離裟婆、求生淨土；「<verse>忍辱精進，慈心專一</verse>」，「<verse>雖一世精進勤苦，須臾間耳，後生無量壽國，快樂無極，永拔生死之本，無復苦惱之患，壽千萬劫，自在隨意。</verse>」

是故，淨空大師等西方三聖示現於世、傾力製作推廣的《佛說大乘無量壽莊嚴清淨平等覺經》正合淨土宗之綱要，為未來九千年的末法衆生之救拔作了最佳佈局，是祂老人家此番示現的一大成就。「<verse>敬於佛者，是為大善。</verse>」「<verse>當孝於佛，常念師恩，當令是法，久住不滅。</verse>」

故說頌曰：

/gatha/
三聖駕臨娑婆土　至尊親集無量經
勢至註述殷切切　觀音弘揚四海行
末法九千苦衆生　成就就在一部經
此經即是無量壽　一句佛號乾坤定
//`;
