parts[3] =
`// 正宗分之三。
卷七    （乙）三，明正助合行所成伏斷圓三德位
　　G048　：　（丙）初，申請【修證佛三摩地未到涅槃，何為乾慧之地，四十四心，入地中，等覺菩薩】*
　　G049　：　　：　次，讚許
　　    　：　　：　三，正說
　　    　：　　：　（丁）初，總明三德
　　G050　：　　：　　：　（戊）初，明理絕名相【妙性圓明，離諸名相，本來無有世界眾生】
　　G051　：　　：　　：　　：　次，明因妄立真【生滅名妄；滅妄名真。是稱無上菩提及大涅槃，二轉依號】
　　    　：　　：　　：　次，別示迷悟
　　G052　：　　：　　：　（戊）初，明迷真起妄成十二類生顛倒法【先當識眾生世界二顛倒因。顛倒不生斯則如來真三摩地】*
　　    　：　　：　　：　　：　（己）初，敘意總明
　　G053　：　　：　　：　　：　　：　次，約相別示【因明發性，性妄見生，從畢竟無成究竟有。本此無住建立世界眾生】
　　G054　：　　：　　：　　：　　：　　　　　　　【妄性無體非有所依；將欲復真，已非真真如性，非真求復，宛成非相】
　　G055　：　　：　　：　　：　　：　　　　　　　【非生非住，非心非法；展轉發生，生力發明，熏以成業，同業相感。】
　　    　：　　：　　：　　：　　：　　　　　　　【因有感業，相滅相生，由是故有眾生顛倒。】
　　    　：　　：　　：　　：　　：　（庚）初，明眾生顛倒因
　　    　：　　：　　：　　：　　：　　：　次，明世界顛倒
　　G056　：　　：　　：　　：　　：　　：　（辛）初，約因標名【云何名為世界顛倒】
　　    　：　　：　　：　　：　　：　　　　　　　【是有所有，分段妄生，因此界立；非因所因，無住所住，遷流不住，】
　　    　：　　：　　：　　：　　：　　　　　　　【因此世成。三世四方，和合相涉，變化眾生，成十二類。】
　　G057　：　　：　　：　　：　　：　　：　　　　【因動有聲，因聲有色，因色有香，因香有觸，因觸有味，因味知法，】
　　    　：　　：　　：　　：　　：　　：　　　　【六亂妄想，成業性故，十二區分，由此輪轉】
　　G058　：　　：　　：　　：　　：　　：　　　　【是故世間，聲香味觸窮十二變為一旋復。乘此輪轉顛倒相故是有世界】
　　    　：　　：　　：　　：　　：　　：　　：　次，約果釋相
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，別明
　　G059　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，卵生相〇【世界虛妄輪迴動顛倒故；和合氣成飛沈亂想】*
　　G060　：　　：　　：　　：　　：　　：　　：　　：　　：　次，胎生相〇【世界雜染輪迴欲顛倒故；和合滋成橫豎亂想】*
　　G061　：　　：　　：　　：　　：　　：　　：　　：　　：　三，濕生相〇【世界執著輪迴趣顛倒故；和合暖成翻覆亂想】*
　　G062　：　　：　　：　　：　　：　　：　　：　　：　　：　四，化生相〇【世界變易輪迴假顛倒故；和合觸成新故亂想】*
　　G063　：　　：　　：　　：　　：　　：　　：　　：　　：　五，有色相〇【世界留礙輪迴障顛倒故；和合著成精耀亂想】*
　　G064　：　　：　　：　　：　　：　　：　　：　　：　　：　六，無色相〇【世界銷散輪迴惑顛倒故；和合暗成陰隱亂想】*
　　G065　：　　：　　：　　：　　：　　：　　：　　：　　：　七，有想相〇【世界罔象輪迴影顛倒故；和合憶成潛結亂想】*
　　G066　：　　：　　：　　：　　：　　：　　：　　：　　：　八，無想相〇【世界愚鈍輪迴癡顛倒故；和合頑成枯槁亂想】*
　　G067　：　　：　　：　　：　　：　　：　　：　　：　　：　九，非有色相【世界相待輪迴偽顛倒故；和合染成因依亂想】*
　　G068　：　　：　　：　　：　　：　　：　　：　　：　　：　十，非無色相【世界相引輪迴性顛倒故；和合咒成呼召亂想】*
　　G069　：　　：　　：　　：　　：　　：　　：　　：　　：　11，非有想相【世界合妄輪迴罔顛倒故；和合異成回互亂想】*
　　G070　：　　：　　：　　：　　：　　：　　：　　：　　：　12，非無想相【世界怨害輪迴殺顛倒故；和合怪成食父母想】*
　　G071　：　　：　　：　　：　　：　　：　　：　　：　次，總結【是名十二種類眾生】
卷八    　：　　：　　：　　：　次，明滅妄名真立六十聖位轉依號【如是眾生類中，亦各各具十二顛倒】*
　　    　：　　：　　：　　：　（己）初，總明三漸次為能轉之行
　　    　：　　：　　：　　：　　：　（庚）初，結前生後
　　H001　：　　：　　：　　：　　：　　：　（辛）初，結前生類互具
　　H002　：　　：　　：　　：　　：　　：　　：　次，生後對治法門【修證佛三摩地，於是本因元所亂想，立三漸次方得除滅】
　　    　：　　：　　：　　：　　：　　：　次，標列正明
　　H003　：　　：　　：　　：　　：　　：　（辛）初，標列【一修習，除其助因；二真修，刳其正性；三增進，違其現業】
　　    　：　　：　　：　　：　　：　　：　　：　次，正明
　　H004　：　　：　　：　　：　　：　　：　　：　（壬）初，除助因【助因：當斷世間五種辛菜。是名第一增進修行漸次】
　　H005　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【是五種辛，熟食發婬，生噉增恚】
　　H007　：　　：　　：　　：　　：　　：　　：　　：　次，刳正性【嚴持清戒，永斷婬心，不食酒肉；以火淨食無噉生氣】
　　H008　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【當觀婬如毒蛇怨賊。是名第二增進修行漸次】
　　H009　：　　：　　：　　：　　：　　：　　：　　：　三，違現業【云何現業？持清戒人心無貪婬，於外六塵不多流逸；】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　　　【因不流逸旋元自歸。塵既不緣根無所偶，反流全一六用】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　　　【不行；十方國土皎然清淨。一切如來密圓淨妙皆現。】
　　H010　：　　：　　：　　：　　：　　：　　：　　：　　　　　　【即獲無生法忍，是名第三增進修行漸次】
　　    　：　　：　　：　　：　　：　次，別明諸位次為所轉之號*
　　H011　：　　：　　：　　：　　：　（庚）初，觀行轉依號　　　　　【乾慧地】
　　H012　：　　：　　：　　：　　：　　：　次，相似轉依號　　　　　【信心住。念心住。精進心。慧心住。定心住。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【不退心。護法心。迴向心。戒心住。願心住。】
　　    　：　　：　　：　　：　　：　　：　三，分證轉依號
　　H022　：　　：　　：　　：　　：　　：　（辛）初，明十住〇〇〇〇【發心住。治地住。修行住。生貴住。方便具足住。】*
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【正心住。不退住。童真住。灌頂住。歡喜行。】
　　H032　：　　：　　：　　：　　：　　：　　：　次，明十行〇〇〇〇【歡喜行。饒益行。無瞋恨行。無盡行。離癡亂行。】*
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【善現行。無著行。尊重行。善法行。真實行。】
　　    　：　　：　　：　　：　　：　　：　　：　三，明十向*
　　H042　：　　：　　：　　：　　：　　：　　：　（壬）初，正明十向【救護一切眾生，離眾生相迴向。不壞迴向。】*
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【等一切佛迴向。至一切處迴向。無盡功德藏迴向。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【隨順平等善根迴向。隨順等觀一切眾生迴向。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【真如相迴向。無縛解脫迴向。法界無量迴向。】
　　H052　：　　：　　：　　：　　：　　：　　：　　：　次，別明加行【是清淨四十一心，次成四種，妙圓加行。】*
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【暖地。頂地。忍地。世第一地。】
　　H053　：　　：　　：　　：　　：　　：　　：　四，十地〇〇〇〇〇【歡喜地。離垢地。發光地。焰慧地。難勝地。】*
　　    　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　【現前地。遠行地。不動地。善慧地。法雲地。】
　　H064　：　　：　　：　　：　　：　　：　　：　五，明等覺〇〇〇〇【等覺】*
　　H065　：　　：　　：　　：　　：　　：　四，究竟轉依號【從乾慧心，至等覺已，是覺始獲金剛心中，初乾慧地】
　　    　：　　：　　：　　：　　：　三，合結諸位次由三行而成
　　H066　：　　：　　：　　：　　：　（庚）初，總以止觀結【是種種地，用諸如來毗婆舍那，清淨修證，漸次深入】
　　H067　：　　：　　：　　：　　：　　：　次，正以三行結【如是皆以三增進故，善能成就五十五位真菩提路】
　　H068　：　　：　　：　　：　　：　　：　三，復以邪正結【作是觀者，名為正觀；若他觀者，名為邪觀】
// 正宗分之三竟。`;
