parts[2] =
`// 正宗分之二。
卷四    （乙）次，示不生滅為本修因妙三觀門*
　　    　：　（丙）初，為當機示圓通本根*
　　D048　：　　：　（丁）初，嘆領述請【阿難及諸眾聞佛示誨，疑惑銷除心悟實相，身意輕安得未曾有】總論為當機示圓通本根 👈
　　D050　：　　：　　　　　　　　　　【若能觀心究竟解脫；不能觀者永處纏縛】觀心亦即入佛知見之正因 👈
　　    　：　　：　　：　次，宣示法義*
　　D051　：　　：　　：　（戊）初，住家敘意
　　    　：　　：　　：　　：　次，如來正說*
　　    　：　　：　　：　　：　（己）初，總示因心*
　　    　：　　：　　：　　：　　：　（庚）初，正明二義*
　　D052　：　　：　　：　　：　　：　　：　（辛）初，總徵示【汝等決定發菩提心，於佛如來妙三摩提不生疲倦，當先明發覺初心二決定義】
　　    　：　　：　　：　　：　　：　　：　　：　次，別釋*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，應審觀因地發心*
　　D053　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總勸審觀【一、若欲捐聲聞修菩薩乘入佛知見，當審觀因地發心與果地覺之同異】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示審觀
　　D054　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，立喻【當照明，諸器世間可作之法皆從變滅】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，簡妄生滅相合可作喻*
　　D055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，指妄總標【由四大之纏，分湛圓妙覺明心為視聽覺察，從始入終五疊渾濁】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約義別釋
　　D056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，通示濁義【云何為濁？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示濁名
　　D057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，劫濁〇【劫濁依色陰立】*
　　D058　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，見濁〇【見濁依受陰而成】*
　　D059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，煩惱濁【煩惱濁依想陰成】*
　　D060　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，眾生濁【眾生濁依意根之行陰而成】*
　　D061　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，命濁〇【命濁依識陰中第八識而立】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，依無生滅性合虛空喻
　　D062　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，棄濁就清【欲契如來常樂我淨，當先擇生死根本；依不生滅圓湛性成】👈
　　D063　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以喻合法【初伏客塵煩惱；後永斷根本無明；明相精純，成妙覺極果】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，應審詳煩惱根本*
　　D064　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總勸審詳【二、欲發菩提心決定棄捐諸有為相，當審詳煩惱根本】審觀即止觀，毗缽舍那觀
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示審詳
　　D065　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，立喻【汝觀世間解結之人，不見所結云何知解？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，委示顛倒處合所結喻*
　　D066　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總示結根
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示結相【六根賊媒自劫家寶；無始眾生世界生纏縛故，於器世間不能超越】
　　D067　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，約眾全世界以明妄數【界性定位與世相涉，流變三疊，一十百千】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約世界妄數以歷六根
　　D068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，明性本圓融【六根之中，各各功德有千二百】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明用分優劣
　　D069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總明【汝復於中，克定優劣】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示
　　D070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，明眼根相用【〇八百功德】*
　　D071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳根相用【千二百功德】*
　　D072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根相用【〇八百功德】*
　　D073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌根相用【千二百功德】*
　　D074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身根相用【〇八百功德】*
　　D075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意根相用【千二百功德】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸詳擇降伏合知解喻
　　D076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，勸簡略明【欲逆生死欲流至不生滅，當驗六根合離、深淺、圓通與否】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，因疑廣示
　　D078　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，述疑【云何逆流，深入一門能令六根一時清淨？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，？？？
　　D079　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，就法研破
　　D080　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　     【用中相背非一w性中相知非六；計一計六俱屬妄執】
　　D082　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，借喻顯理【如虛空參合群器，器異名異空；器除空為一】
　　D083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，以法合喻【六受用根，亦復如是】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約妄相別示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，明從真起妄六用偏局*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，別示生起之由分
　　D084　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，明眼根結相【見精映色，結色成根】*
　　D085　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示耳根結相【聽精映聲，卷聲成根】*
　　D086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根結相【嗅精映香，納香成根】*
　　D087　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，示舌根結相【嘗精映味，絞味成根】*
　　D088　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，示身根結相【覺精映觸，摶觸成根】*
　　D089　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，示意根結相【知精映法，攬法成根】*
　　D090　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總結偏局之相離塵無體【見聞覺知性無體可得】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明返妄歸真六根互用
　　D091　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，明返妄圓拔【隨拔一根伏歸元真發本明耀】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明歸真互用
　　D092　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，證互用之相【不由前塵，六根互用】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示互用所以
　　D093　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（申）初，示妄體本真【一根返元六根解脫】
　　D094　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指現量為證
　　D095　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，示以修顯性
　　    　：　　：　　：　　：　　：　　：　次，決通疑滯*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明因果俱常決通初疑*
　　D096　：　　：　　：　　：　　：　　：　　：　（壬）初，疑問【見聽離於前塵，畢竟無體。云何將此畢竟斷滅以為修因，欲獲如來七常住果？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　D098　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，斥迷許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指事除疑
　　D099　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，詰根塵顯迷倒
　　D102　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，就聞性示因常【佛以鐘聲，詰阿難及眾：云何自語矯亂？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，會通結示疑
　　D104　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明迷故常即無常
　　D105　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，悟故無常即常【眾生無始循諸色聲逐念流轉；曾不開悟性淨妙常不循所常，生生雜染流轉】
　　D106　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【棄生滅守真常，常光現，根塵識心應時銷落。想相塵識情垢二俱遠離；法眼清，成無上覺】
卷五    　：　　：　　：　　：　　：　　：　　：　次，明結解無二決通次義*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，正明結解無二*
　　E001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，述請【今日身心云何是結？從何名解？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示
　　E002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，現瑞【手摩阿難頂；十方普世六種震動，微塵如來住世界者頂出寶光同來祇陀林灌如來頂】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正說
　　E003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，諸佛同宣【十方如來同告：復欲知無上菩提速證寂靜妙常，亦汝六根更非他物】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋尊親說
　　E004　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，疑問【云何令我生死輪迴安樂妙常，同是六根更非他物？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　E005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，長文【根塵同源識性虛妄；知見立知即無明本；知見無見無漏真淨】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，偈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，頌說法門
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，重頌（祇夜伽陀）
　　E006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，頌近文顯性以為修本【重宣此義，而說偈言】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【真性有為空，緣生故如幻；無為無起滅，不實如空華。】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【言妄顯諸真，妄真同二妄，猶非真非真，云何見所見？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【中間無實性，是故若交蘆。結解同所因，聖凡無二路；】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【汝觀交中性，空有二俱非。迷悔即無明，發明便解脫。】
　　E007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌遠文示修以合妙性
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【解結因次第，六解一亦亡；根選擇圓通，入流成正覺。】
　　E008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，孤起頌
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【陀那微細識，習氣成瀑流；真非真恐迷，我常不開演。】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【自心取自心，非幻成幻法；不取無非幻，非幻尚不生，】
　　E009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌嘆法門
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【幻法云何立？是名妙蓮華，金剛王寶覺，如幻三摩提，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　【彈指超無學，此阿毗達磨，十方薄伽梵，一路涅槃門。】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，兼顯六解一亡*
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，疑請
　　E010　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，敘益【阿難及眾心目開明嘆未曾有】
　　E011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述請【心猶未達六解一亡舒結倫次】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答示
　　E012　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，結巾喻迷【綰疊華巾，總成六結】動靜根覺空滅結，六根各個有此六結
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，解結喻悟
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，喻六解一亡
　　E015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，立喻
　　E016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，喻解由心
　　E017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正顯由心【若欲除結，當於結心】
　　E018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指法興勸【隨汝選擇六根，根結若除塵相自滅，諸妄銷亡不真何待？】
　　E019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，喻解當次第【是結當次第而解】解結與成就 👈
　　    　：　　：　　：　　：　　：　次，別顯修證*
　　E020　：　　：　　：　　：　　：　（庚）初，阿難請問圓根【雖復悟知一六亡義，然猶未達圓通本根】
　　E021　：　　：　　：　　：　　：　　：　次，如來垂詢聖眾【世尊問眾賢：最初發心悟十八界誰為圓通？從何方便入三摩地？】
　　    　：　　：　　：　　：　　：　　：　三，眾聖各說證門*
　　    　：　　：　　：　　：　　：　　：　（辛）初，觀六塵*
　　E022　：　　：　　：　　：　　：　　：　　：　（壬）初，陳那觀聲塵
　　E023　：　　：　　：　　：　　：　　：　　：　　：　次，沙陀觀色
　　E024　：　　：　　：　　：　　：　　：　　：　　：　三，香嚴觀香
　　E025　：　　：　　：　　：　　：　　：　　：　　：　四，藥王觀味
　　E026　：　　：　　：　　：　　：　　：　　：　　：　五，賢護觀觸
　　E027　：　　：　　：　　：　　：　　：　　：　　：　六，迦葉觀法
　　    　：　　：　　：　　：　　：　　：　　：　次，觀五根*
　　E028　：　　：　　：　　：　　：　　：　　：　（壬）初，那律觀眼
　　E029　：　　：　　：　　：　　：　　：　　：　　：　次，繼道觀鼻
　　E030　：　　：　　：　　：　　：　　：　　：　　：　三，牛伺觀舌
　　E031　：　　：　　：　　：　　：　　：　　：　　：　四，餘習觀身
　　E032　：　　：　　：　　：　　：　　：　　：　　：　五，空生觀意
　　    　：　　：　　：　　：　　：　　：　　：　三，觀六識*
　　E033　：　　：　　：　　：　　：　　：　　：　（壬）初，舍利弗觀眼識
　　E034　：　　：　　：　　：　　：　　：　　：　　：　次，普賢觀耳識
　　E035　：　　：　　：　　：　　：　　：　　：　　：　三，艷喜觀鼻識
　　E036　：　　：　　：　　：　　：　　：　　：　　：　四，滿慈觀舌識
　　E037　：　　：　　：　　：　　：　　：　　：　　：　五，波離觀身識
　　E038　：　　：　　：　　：　　：　　：　　：　　：　六，目犍連觀意識
　　    　：　　：　　：　　：　　：　　：　　：　四，觀七大*
　　E039　：　　：　　：　　：　　：　　：　　：　（壬）初，火頭觀火大
　　E040　：　　：　　：　　：　　：　　：　　：　　：　次，持地觀地大
　　E042　：　　：　　：　　：　　：　　：　　：　　：　三，月光觀水大
　　E045　：　　：　　：　　：　　：　　：　　：　　：　四，琉璃光觀風大
　　E047　：　　：　　：　　：　　：　　：　　：　　：　五，虛空藏觀空大
　　E048　：　　：　　：　　：　　：　　：　　：　　：　六，慈氏觀識大
　　E050　：　　：　　：　　：　　：　　：　　：　　：　七，大勢至觀根大【無量光佛，教我念佛三昧】
卷六    　：　　：　　：　　：　　：　　：　　：　五，觀耳根*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，敘悟緣起
　　F001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，值佛稟教【觀世音佛教我，從聞、思、修入三摩地】觀世音 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，依教修證
　　F002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，總敘圓修〇〇〇〇〇〇〇【初於聞中，入流亡所】本覺理起始覺智；解脫真俗中諦法流 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明破陰分
　　F003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，圓破色陰超劫濁〇【所入既寂，〇〇〇〇】解動結 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　　【動靜二相，了然不生】解靜結 👈
　　F004　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，圓破受陰超見濁〇【如是漸增，聞所聞盡】解根結 👈
　　F005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，圓破想陰超煩惱濁【盡聞不住，覺所覺空】解覺結 👈
　　F006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，圓破行陰超眾生濁【空覺極圓，空所空滅】解空結 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　【生滅既滅，寂滅現前】解滅結 👈
　　F007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，圓破識陰超命濁〇【忽然超越，世出世間，十方圓明】證大圓鏡智。顯修證之功 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　【獲二殊勝。上合佛同一慈力，下合眾同一悲仰】顯利他之德 👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，由證起用
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明三十二應
　　F008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起【觀音如來授我如幻聞薰聞修金剛三昧，身成三十二應入諸國土】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明應說之相
　　F009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，現四聖法界
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，現六凡法界
　　F010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，成就樂欲
　　F027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，成就厭離
　　F036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結明功由三昧【是名妙淨三十二應入國土身；以三昧聞熏聞修，無作妙力自在成就】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明二求無畏
　　F037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起【以此聞熏聞修三昧無作妙力，令眾生於我身心獲十四種無畏功德】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別施無畏相
　　F038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總明現苦無畏【一者】
　　F039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明七難無畏【二者】
　　F046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明三毒無畏〇【九者】
　　F049　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，別明二求無畏【十二者】
　　F051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，結明持名無畏【十四者】
　　F052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結明福備眾生
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明四不思議
　　F053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起【能善獲四不思議無作妙德】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明不思議相
　　F054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，現容不思議〇【一者能現眾多妙容，能說無邊秘密神咒】
　　F056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，說咒不思議〇【二者妙能現一一形、誦一一咒，能以無畏施諸眾生】
　　F057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，受供養不思議【三者所遊世界皆令眾生，捨身珍寶求我哀愍】
　　F058　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，興供不思議〇【四者能以珍寶種種，供養十方如來；傍及法界六道眾生】
　　F059　：　　：　　：　　：　　：　　：　　：　　：　次，牒證結答【佛問圓通，從耳門圓照三昧，成就菩提，斯為第一】
　　F061　：　　：　　：　　：　　：　　：　四，放光現瑞總印*
　　    　：　　：　　：　　：　　：　　：　五，佛敕文殊簡擇*
　　F064　：　　：　　：　　：　　：　　：　（辛）初，佛敕文殊【如來告文殊師利法王子為阿難開悟入菩薩乘，何方便門得易成就？】
　　    　：　　：　　：　　：　　：　　：　　：　次，受命簡擇*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，敘儀
　　F065　：　　：　　：　　：　　：　　：　　：　　：　次，正說【文殊師利法王子奉佛慈旨，說偈對佛】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，頌真如不變之體以標真源
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌真如隨緣之能以明染淨*
　　F066　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，頌隨染緣從源出流
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌隨淨緣從流溯源*
　　F068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明滅妄歸真
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別顯歸真方便*
　　F069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總示方便須擇
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正為選方便門*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，簡非
　　F070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，簡六塵
　　F071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，簡五根
　　F072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，簡六識
　　F073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，簡七大
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯是*
　　F074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，泛明此土入道所宜【欲取三摩提，實以聞中入】*
　　F075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正明離苦得樂人法【離苦得解脫，良哉觀世音】*
　　F076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正明觀音所修法門【我今啟如來，如觀音所說】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，誨敕當機諦聽學行*
　　F079　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，示其合機〇【今此娑婆國，眾生迷本聞，循聲故流轉】
　　F080　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸其善修〇【將聞持佛佛，何不自聞聞？】
　　F083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結其真實〇【旋汝倒聞機，反聞聞自性，性成無上道】
　　F084　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，嘆美法勝以寓勸修【此是微塵佛，一路涅槃門】
　　F085　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，述成佛意結示簡選【觀世音為最。自餘諸方便，皆是佛威神】
　　F086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　七，禮請加被以明真實【願加被未來，於此門無惑，方便易成就】
　　F087　：　　：　　：　　：　　：　　：　　：　三，時眾獲益【阿難及眾，身心了然得大開示，觀佛菩提及大涅槃；猶如有人，明了其家所歸道路】
　　    　：　　：　次，為末世示道場方法*
　　F088　：　　：　（丁）初，陳請【我雖未度，願度末劫一切眾生。欲攝其心入三摩地，云何令其安立道場遠諸魔事？】
　　F089　：　　：　　：　次，讚許【世尊於大眾中稱讚阿難】
　　    　：　　：　　：　三，宣說*
　　    　：　　：　　：　（戊）初，明根本戒法*
　　F090　：　　：　　：　　：　（己）初，總顯三學以戒為本【攝心為戒，因戒生定，因定發慧，名為三無漏學】
　　    　：　　：　　：　　：　　：　次，別示四重以彰無漏
　　F091　：　　：　　：　　：　　：　（庚）初，牒徵【云何攝心，我名為戒？】四決定清淨明誨，戒無漏學
　　    　：　　：　　：　　：　　：　　：　次，詳示
　　F092　：　　：　　：　　：　　：　　：　（辛）初，婬戒〇〇【眾生若心不婬，不隨生死相績。否則禪定現前必落魔道：魔王、魔民、魔女】*
　　F093　：　　：　　：　　：　　：　　：　　　　　　　　　　【汝教世人修三摩地，先斷心婬，是名如來先佛世尊，第一決定清淨明誨】
　　F095　：　　：　　：　　：　　：　　：　　　　　　　　　　【以婬身求佛果，縱得妙悟，皆是婬根根本成婬，輪轉三塗必不能出】
　　F096　：　　：　　：　　：　　：　　：　　　　　　　　　　【必使婬機身心俱斷，斷性亦無，於佛菩提斯可希冀】
　　F097　：　　：　　：　　：　　：　　：　　：　次，殺戒〇〇【眾生若其心不殺，則不隨其生死相續。否則禪定現前必落神道：大力鬼、飛行夜叉等、地行羅剎】*
　　F098　：　　：　　：　　：　　：　　：　　　　　　　　　　【我令比丘食五淨肉，皆我化生本來命根。奈何如來滅度之後，食眾生肉名為釋子】
　　F099　：　　：　　：　　：　　：　　：　　　　　　　　　　【食肉人縱得心開似三摩地，皆大羅剎，報終必沈生死苦海非佛弟子】
　　F100　：　　：　　：　　：　　：　　：　　　　　　　　　　【汝教世人修三摩地，次斷殺生，是名如來先佛世尊，第二決定清淨明誨】
　　F102　：　　：　　：　　：　　：　　：　　　　　　　　　　【清淨比丘云何大悲取諸眾生血肉充食？若不服絲綿絹帛靴履裘毳乳酩醍醐，於世真脫不遊三界】
　　F104　：　　：　　：　　：　　：　　：　　：　三，盜戒〇〇【眾生若其心不偷，則不隨其生死相續。否則禪定現前必落邪道；精靈、妖魅、邪人】*
　　F105　：　　：　　：　　：　　：　　：　　　　　　　　　　【我教比丘循方乞食，令其捨貪成菩提道】
　　F106　：　　：　　：　　：　　：　　：　　　　　　　　　　【能於如來像前身燃一燈等，是人無始宿債一時酬畢，長揖世間永脫諸漏，是人於法已決定心】
　　F107　：　　：　　：　　：　　：　　：　　　　　　　　　　【汝教世人修三摩地，後斷偷盜，是名如來先佛世尊，第三決定清淨明誨】
　　F110　：　　：　　：　　：　　：　　：　　：　四，大妄語戒【眾生雖三行已圓，若大妄語即三摩地不得清淨；未得謂得未證言證；永殞善根無復知見，不成三昧】*
　　F111　：　　：　　：　　：　　：　　：　　　　　　　　　　【我滅度後，敕諸菩薩羅漢應身作種種形，度諸輪轉。終不自言我真，泄佛密因。唯除命終陰有遺付】
　　F112　：　　：　　：　　：　　：　　：　　　　　　　　　　【汝教世人修三摩地，後復斷除諸大妄語，是名如來先佛世尊，第四決定清淨明誨】
卷七    　：　　：　　：　　：　次，明誦咒治習*
　　G001　：　　：　　：　　：　（己）初，結前　　　　　　　　【入三摩地，修學妙門，求菩薩道，要先持此四種律儀】
　　    　：　　：　　：　　：　　：　次，正明
　　    　：　　：　　：　　：　　：　（庚）初，略示應持
　　    　：　　：　　：　　：　　：　　：　（辛）初，略勸誦持顯益
　　G002　：　　：　　：　　：　　：　　：　　：　（壬）初，勸持【若有宿習不能滅除，一心誦佛頂光明，摩訶薩怛多般怛羅無上神咒】
　　G003　：　　：　　：　　：　　：　　：　　：　　：　次，顯益
　　    　：　　：　　：　　：　　：　　：　　：　次，略示道場方法
　　G004　：　　：　　：　　：　　：　　：　　：　（壬）初，方便【擇師成戒，著新淨衣然香閑居，誦心佛所說神咒一百八遍】
　　G005　：　　：　　：　　：　　：　　：　　：　　：　次，正修【然後結界，建立道楊，求於十方現住如來放大悲光來灌其頂】
　　    　：　　：　　：　　：　　：　　：　次，廣顯儀軌
　　    　：　　：　　：　　：　　：　　：　（辛）初，正示道場軌則
　　G006　：　　：　　：　　：　　：　　：　　：　（壬）初，請問
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，別示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明檀法
　　G007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，立檀方法【立八角壇】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，供養方法
　　G008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，檀中供物【壇心寶蓮華，盛八月露水；八鏡圍繞；外十六蓮華香爐間華鋪設】
　　G009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　【供養美食於佛菩薩】
　　G010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，壇外莊嚴【壇中四壁敷設十方如來及諸菩薩所有形像】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明修法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正示行法
　　G011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，三七行道【初七至誠頂禮。二七發菩薩願。三七承佛摩頂】
　　G012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，懺後正修【即於道場修三摩地；身心明淨猶如琉璃】
　　G013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，簡其不成　　　【若有一不清淨者，多不成就】
　　G014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明其獲益
　　G015　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總結
　　    　：　　：　　：　　：　　：　　：　　：　次，重宣佛頂神咒*
　　G016　：　　：　　：　　：　　：　　：　　：　（壬）初，阿難述請【惟願大慈，重為宣說佛頂神咒】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，如來正說
　　G018　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，現化佛說咒*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，現化表法（楞嚴咒詳列）【爾時世尊，】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　【從肉髻中，涌百寶光，光中涌出，千葉寶蓮，有化如來，坐寶華中，頂放十道，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　【百寶光明；一一光明，皆遍示現，十恒河沙，金剛密跡，擎山持杵，遍虛空界。】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　【大眾仰觀，畏愛兼抱，求佛哀佑，一心聽佛，無見頂相，放光如來，宣說神咒。】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第一會137句。　第二會41句。　第三會94句。　第四會60句。　第五會95句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正說神咒（詳細解說楞嚴咒！）【咒之八義】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　一、毗盧真法界會。密開十二。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　二、釋尊應化會。密開八。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　三、觀音合同會。密開四。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　四、剛藏折攝會。密開四。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　五、文殊弘傳會。密開八。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　六、咒心。*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述功德勸持*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，顯果上自行化他功德*
　　G019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明【是佛頂光聚悉怛多般怛囉秘密伽陀，出生十方一切諸佛】
　　G020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別顯【十方如來因此咒心，成無上正覺，降魔制外，坐寶蓮華，應微塵國，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【於微塵國，轉大法輪，能於十方，摩頂授記；自果未成，亦於十方蒙佛授記】
　　G021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【能於十方，拔濟群苦】
　　G022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【能於十方，事善知識，四威儀中，供養如意】
　　G023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【能於十方，攝受親因；令諸小乘，聞秘密藏，不生驚怖】
　　G024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【成無上覺；坐菩提樹，入大涅槃】
　　G025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　【傳此咒心，於滅度後，付佛法事，究竟住持，嚴淨戒律，悉得清淨】
　　G026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，總結
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明因人滅惡生善功德*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，略明
　　G027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，明不持之失【汝等有學，取阿羅漢。不持此咒，無有是處】
　　G028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明能持之得【書寫此咒，或身上或宅中，是人盡其生年，一切諸毒所不能害】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣顯*
　　G029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總標*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示*
　　G030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，能滅諸難【末世眾生能自誦或教他誦，則無能害】*
　　G031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，菩薩加持【是咒常有廣大勝衆及眷屬晝夜隨侍】*
　　G032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，不墮惡道【生生不生鬼道，或貧窮下賤不可樂處】*
　　G033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，同佛功德【縱其自身不作福業，十方如來所有功德悉與此人】*
　　G034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，能淨業障【犯禁戒於未受時，持咒後無問輕重，一時銷滅】*
　　G035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，能除夙業【讀誦書寫此咒，身帶安居處，積業銷除，不久悟無生忍】*
　　G036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　七，能滿眾願【國土眾生隨有此咒，天龍歡喜風雨順時五谷豐殷兆庶安樂】*
　　G037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　八，能護國界【鎮惡；滅災】*
　　G039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結勸【此咒保護初學諸修行者入三摩地，身心泰然得大安隱】
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，述願護法*
　　G040　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，八部眾【八部眾：我當盡心，至誠保護，令其一生，所作如願】*
　　G045　：　　：　　：　　：　　：　　：　　：　　：　　：　次，菩薩眾【金剛藏王菩薩：我輩久成菩提，不取涅槃；常隨此咒救護末世修三摩提正修行者】*
// 正宗分之二竟。`;
