parts[2] =
`// 正宗分之二。
卷四    （乙）次，示不生滅為本修因妙三觀門*
　　    　：　（丙）初，為當機示圓通本根*
　　D048　：　　：　（丁）初，嘆領述請
　　    　：　　：　　：　次，宣示法義*
　　D051　：　　：　　：　（戊）初，住家敘意
　　    　：　　：　　：　　：　次，如來正說*
　　    　：　　：　　：　　：　（己）初，總示因心*
　　    　：　　：　　：　　：　　：　（庚）初，正明二義*
　　D052　：　　：　　：　　：　　：　　：　（辛）初，總徵示
　　    　：　　：　　：　　：　　：　　：　　：　次，別釋*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，應審觀因地發心*
　　D053　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總勸審觀
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示審觀
　　D054　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，立喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，簡妄生滅相合可作喻
　　D055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，指妄總標
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約義別釋
　　D056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，通示濁義
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示濁名
　　D057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，劫濁
　　D058　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，見濁
　　D059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，煩惱濁
　　D060　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，眾生濁
　　D061　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，命濁
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，依無生滅性合虛空喻
　　D062　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，棄濁就清
　　D063　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以喻合法
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，應審詳煩惱根本*
　　D064　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總勸審詳
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示審詳
　　D065　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，立喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，委示顛倒處合所結喻
　　D066　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總示結根
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示結相
　　D067　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，約眾全世界以明妄數
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約世界妄數以歷六根
　　D068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，明性本圓融
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明用分優劣
　　D069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示
　　D070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，明眼根相用
　　D071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳根相用
　　D072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根相用
　　D073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌根相用
　　D074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身根相用
　　D075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意根相用
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸詳擇降伏合知解喻
　　D076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，勸簡略明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，因疑廣示
　　D078　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，述疑
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，？？？
　　D079　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，就法研破
　　D082　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，借喻顯理
　　D083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，以法合喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約妄相別示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，明從真起妄六用偏局
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，別示生起之由分
　　D084　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，明眼根結相
　　D085　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示耳根結相
　　D086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根結相
　　D087　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，示舌現根相結
　　D088　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，示身根結相
　　D089　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，示意根結相
　　D090　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總結偏局之相離塵無體
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明返妄歸真六根互用
　　D091　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，明返妄圓拔
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明歸真互用
　　D092　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（未）初，證互用之相
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示互用所以
　　D093　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（申）初，示妄體本真
　　D094　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指現量為證
　　D095　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，示以修顯性
　　    　：　　：　　：　　：　　：　　：　次，決通疑滯*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明因果俱常決通初疑*
　　D096　：　　：　　：　　：　　：　　：　　：　（壬）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　D098　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，斥迷許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指事除疑
　　D099　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，詰根塵顯迷倒
　　D102　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，就聞性示因常
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，會通結示疑
　　D104　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明迷故常即無常
　　D105　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，悟故無常即常
卷五    　：　　：　　：　　：　　：　　：　　：　次，明結解無二決通次義*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，正明結解無二*
　　E001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，述請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示
　　E002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，現瑞
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正說
　　E003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，諸佛同宣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋尊親說
　　E004　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　E005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，長文
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，偈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，頌說法門
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，重頌
　　E006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，頌近文顯性以為修本
　　E007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌遠文示修以合妙性
　　E008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，孤起頌
　　E009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌嘆法門
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，兼顯六解一亡*
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，疑請
　　E010　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，敘益
　　E011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答示
　　E012　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，結巾喻迷
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，解結喻悟
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，喻六解一亡
　　E015　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，立喻
　　E016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，喻解由心
　　E017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正顯由心
　　E018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，指法興勸
　　E019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，喻解當次第
　　    　：　　：　　：　　：　　：　次，別顯修證*
　　E020　：　　：　　：　　：　　：　（庚）初，阿難請問圓根
　　E021　：　　：　　：　　：　　：　　：　次，如來垂詢聖眾
　　    　：　　：　　：　　：　　：　　：　三，眾聖各說證門*
　　    　：　　：　　：　　：　　：　　：　（辛）初，觀六塵*
　　E022　：　　：　　：　　：　　：　　：　　：　（壬）初，陳那觀聲塵
　　E023　：　　：　　：　　：　　：　　：　　：　　：　次，沙陀觀色
　　E024　：　　：　　：　　：　　：　　：　　：　　：　三，香嚴觀香
　　E025　：　　：　　：　　：　　：　　：　　：　　：　四，藥王觀味
　　E026　：　　：　　：　　：　　：　　：　　：　　：　五，賢護觀觸
　　E027　：　　：　　：　　：　　：　　：　　：　　：　六，迦葉觀法
　　    　：　　：　　：　　：　　：　　：　　：　次，觀五根*
　　E028　：　　：　　：　　：　　：　　：　　：　（壬）初，那律觀眼
　　E029　：　　：　　：　　：　　：　　：　　：　　：　次，繼道觀鼻
　　E030　：　　：　　：　　：　　：　　：　　：　　：　三，牛伺觀舌
　　E031　：　　：　　：　　：　　：　　：　　：　　：　四，餘習觀身
　　E032　：　　：　　：　　：　　：　　：　　：　　：　五，空生觀意
　　    　：　　：　　：　　：　　：　　：　　：　三，觀六識*
　　E033　：　　：　　：　　：　　：　　：　　：　（壬）初，舍利弗觀眼識
　　E034　：　　：　　：　　：　　：　　：　　：　　：　次，普賢觀耳識
　　E035　：　　：　　：　　：　　：　　：　　：　　：　三，艷喜觀鼻識
　　E036　：　　：　　：　　：　　：　　：　　：　　：　四，滿慈觀舌識
　　E037　：　　：　　：　　：　　：　　：　　：　　：　五，波離觀身識
　　E038　：　　：　　：　　：　　：　　：　　：　　：　六，目犍連觀意識
　　    　：　　：　　：　　：　　：　　：　　：　四，觀七大*
　　E039　：　　：　　：　　：　　：　　：　　：　（壬）初，火頭觀火大
　　E040　：　　：　　：　　：　　：　　：　　：　　：　次，持地觀地大
　　E042　：　　：　　：　　：　　：　　：　　：　　：　三，月光觀水大
　　E045　：　　：　　：　　：　　：　　：　　：　　：　四，琉璃光觀風大
　　E047　：　　：　　：　　：　　：　　：　　：　　：　五，虛空藏觀空大
　　E048　：　　：　　：　　：　　：　　：　　：　　：　六，慈氏觀識大
　　E050　：　　：　　：　　：　　：　　：　　：　　：　七，大勢至觀根大
卷六    　：　　：　　：　　：　　：　　：　　：　五，觀耳根*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，敘悟緣起
　　F001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，值佛稟教
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，依教修證
　　F002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，總敘圓修
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明破陰分
　　F003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，圓破色陰超劫濁
　　F004　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，圓破受陰超見濁
　　F005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，圓破想陰超煩惱濁
　　F006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，圓破行陰超眾生濁
　　F007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，圓破識陰超命濁
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，由證起用
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明三十二應
　　F008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明應說之相
　　F009　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，現四聖法界
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，現六凡法界
　　F010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，成就樂欲
　　F027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，成就厭離
　　F036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結明功由三昧
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明二求無畏
　　F037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別施無畏相
　　F038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總明現苦無畏
　　F039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明七難無畏
　　F046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明三毒無畏
　　F049　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，別明二求無畏
　　F051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，結明持名無畏
　　F052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結明福備眾生
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明四不思議
　　F053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明大用所起
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明不思議相
　　F054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，現容不思議
　　F056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，說咒不思議
　　F057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，受供養不思議
　　F058　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，興供不思議
　　F059　：　　：　　：　　：　　：　　：　　：　　：　次，牒證結答
　　F061　：　　：　　：　　：　　：　　：　四，放光現瑞總印*
　　    　：　　：　　：　　：　　：　　：　五，佛敕文殊簡擇*
　　F064　：　　：　　：　　：　　：　　：　（辛）初，佛敕文殊
　　    　：　　：　　：　　：　　：　　：　　：　次，受命簡擇*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，敘儀
　　F065　：　　：　　：　　：　　：　　：　　：　　：　次，正說*
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，頌真如不變之體以標真源*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌真如隨緣之能以明染淨*
　　F066　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，頌隨染緣從源出流
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，頌隨淨緣從流溯源
　　F068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明滅妄歸真
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別顯歸真方便
　　F069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總示方便須擇
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正為選方便門
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，簡非
　　F070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，簡六塵
　　F071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，簡五根
　　F072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，簡六識
　　F073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，簡七大
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，顯是
　　F074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，泛明此土入道所宜
　　F075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正明離苦得樂人法
　　F076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正明觀音所修法門
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，誨敕當機諦聽學行
　　F079　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，示其合機
　　F080　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，勸其善修
　　F083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結其真實
　　F084　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，嘆美法勝以寓勸修
　　F085　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，述成佛意結示簡選
　　F086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　七，禮請加被以明真實
　　F087　：　　：　　：　　：　　：　　：　　：　三，時眾獲益
　　    　：　　：　次，為末世示道場方法*
　　F088　：　　：　（丁）初，陳請
　　F089　：　　：　　：　次，讚許
　　    　：　　：　　：　三，宣說*
　　    　：　　：　　：　（戊）初，明根本戒法*
　　F090　：　　：　　：　　：　（己）初，總顯三學以戒為本
　　    　：　　：　　：　　：　　：　次，別示四重以彰無漏
　　F091　：　　：　　：　　：　　：　（庚）初，牒徵
　　    　：　　：　　：　　：　　：　　：　次，詳示
　　F092　：　　：　　：　　：　　：　　：　（辛）初，婬戒
　　F097　：　　：　　：　　：　　：　　：　　：　次，殺戒
　　F104　：　　：　　：　　：　　：　　：　　：　三，盜戒
　　F110　：　　：　　：　　：　　：　　：　　：　四，大妄語戒
卷七    　：　　：　　：　　：　次，明誦咒治習*
　　G001　：　　：　　：　　：　（己）初，結前
　　    　：　　：　　：　　：　　：　次，正明
　　    　：　　：　　：　　：　　：　（庚）初，略示應持
　　    　：　　：　　：　　：　　：　　：　（辛）初，略勸誦持顯益
　　G002　：　　：　　：　　：　　：　　：　　：　（壬）初，勸持
　　G003　：　　：　　：　　：　　：　　：　　：　　：　次，顯益
　　    　：　　：　　：　　：　　：　　：　　：　次，略示道場方法
　　G004　：　　：　　：　　：　　：　　：　　：　（壬）初，方便
　　G005　：　　：　　：　　：　　：　　：　　：　　：　次，正修
　　    　：　　：　　：　　：　　：　　：　次，廣顯儀軌
　　    　：　　：　　：　　：　　：　　：　（辛）初，正示道場軌則
　　G006　：　　：　　：　　：　　：　　：　　：　（壬）初，請問
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，別示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明檀法
　　G007　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，立檀方法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，供養方法
　　G008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，檀中供物
　　G010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，壇外莊嚴
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明修法
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正示行法
　　G011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，三七行道
　　G012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，懺後正修
　　G013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，簡其不成
　　G014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明其獲益
　　G015　：　　：　　：　　：　　：　　：　　：　　：　　：　次，總結
　　    　：　　：　　：　　：　　：　　：　　：　次，重宣佛頂神咒
　　G016　：　　：　　：　　：　　：　　：　　：　（壬）初，阿難述請
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，如來正說
　　G018　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，現化佛說咒
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，現化表法（楞嚴咒詳列）
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第一會，137句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第二會，41句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第三會，94句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第四會，60句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　第五會，95句。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正說神咒（詳細解說楞嚴咒！）
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　一、毗盧真法界會。密開十二。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　二、釋尊應化會。　密開八。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　三、觀音合同會。　密開四。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　四、剛藏折攝會。　密開四。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　五、文殊弘傳會。　密開八。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　　六、咒心。
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，述功德勸持
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，顯果上自行化他功德
　　G019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，總明
　　G020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別顯
　　G026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，總結
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明因人滅惡生善功德
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，略明
　　G027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，明不持之失
　　G028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明能持之得
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣顯
　　G029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，總標
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別示
　　G030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，能滅諸難
　　G031　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，菩薩加持
　　G032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，不墮惡道
　　G033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，同佛功德
　　G034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，能淨業障
　　G035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，能除夙業
　　G036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　七，能滿眾願
　　G037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　八，能護國界
　　G039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結勸
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，述願護法
　　G040　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，八部眾
　　G045　：　　：　　：　　：　　：　　：　　：　　：　　：　次，菩薩眾
// 正宗分之二竟。`;
