parts[1] =
`// 正宗分之一。
卷一    （乙）初，顯如來藏妙真如性圓三諦理*
　　    　：　（丙）初，正明理性*
　　A017　：　　：　（丁）初，當機悔請【阿難見佛，頂禮悲泣。殷勤啟請十方如來，得成菩提妙奢摩他、三摩禪那，最初方便】👈
　　A018　：　　：　　：　次，大眾願聞
　　    　：　　：　　：　三，如來答示*
　　    　：　　：　　：　（戊）初，就事顯理
　　    　：　　：　　：　　：　（己）初，逐破妄執密顯真心*
　　    　：　　：　　：　　：　　：　（庚）初，徵其發心本因*
　　A019　：　　：　　：　　：　　：　　：　（辛）初，如來問
　　A020　：　　：　　：　　：　　：　　：　　：　次，阿難答
　　    　：　　：　　：　　：　　：　　：　次，示以常心直道*
　　A021　：　　：　　：　　：　　：　　：　（辛）初，點示常心
　　A022　：　　：　　：　　：　　：　　：　　：　次，勸修直道
　　    　：　　：　　：　　：　　：　　：　三，廣破七番妄計*
　　    　：　　：　　：　　：　　：　　：　（辛）初，正破內計*
　　A023　：　　：　　：　　：　　：　　：　　：　（壬）初，徵起緣心
　　A024　：　　：　　：　　：　　：　　：　　：　　：　次，喻明降伏
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，牒其內計
　　A025　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正牒徵
　　A026　：　　：　　：　　：　　：　　：　　：　　：　　：　次，立例
　　A027　：　　：　　：　　：　　：　　：　　：　　：　四，懸示定名
　　    　：　　：　　：　　：　　：　　：　　：　　：　五，正破非內
　　A028　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，初引例
　　A029　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　次，破轉計在外*
　　A030　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A031　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，立例
　　A032　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　三，破轉計潛根*
　　A033　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A034　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，立例
　　A035　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　四，破轉計見內*
　　A036　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A037　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正破
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉破
　　A038　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，被其轉計內對
　　A039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破其轉計在空
　　A040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，破其轉計兩覺
　　A041　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結破
　　    　：　　：　　：　　：　　：　　：　　：　五，破轉計隨生*
　　A042　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A043　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，牒計
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　A044　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，破無體
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破有體
　　A045　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，約內外出入破
　　A046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約一多遍不遍破
　　A047　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結破
　　    　：　　：　　：　　：　　：　　：　　：　六，破轉計中間*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，破泛計
　　A048　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，泛計
　　A049　：　　：　　：　　：　　：　　：　　：　　：　　：　次，泛破
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破正計
　　A050　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正計
　　A051　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　七，破轉計無著*
　　A052　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　A053　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　    　：　　：　　：　　：　　：　次，顯示妙理兼破餘妄*
　　    　：　　：　　：　　：　　：　（庚）初，總示萬法唯心*
　　    　：　　：　　：　　：　　：　　：　（辛）初，正示二本不離一心*
　　A054　：　　：　　：　　：　　：　　：　　：　（壬）初，當機申請
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，如來開示
　　A055　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，瑞表真常
　　A056　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示二本【一切眾生無始顛倒，皆由不知二種根本錯亂修習】
　　A057　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　【一者無始生死根本；二者無始菩提涅槃元清淨體】👈
　　    　：　　：　　：　　：　　：　　：　　：　次，委示心使不同妄執*
　　A058　：　　：　　：　　：　　：　　：　　：　（壬）初，重斥妄計非心
　　A060　：　　：　　：　　：　　：　　：　　：　　：　次，正示真心有體【清淨妙淨明心必有自體。無生法忍】👈
　　A062　：　　：　　：　　：　　：　　：　　：　　：　三，委明分別無性
　　A063　：　　：　　：　　：　　：　　：　　：　　：　四，總斥從來誤執
　　    　：　　：　　：　　：　　：　　：　次，別就見精顯性*
　　A064　：　　：　　：　　：　　：　　：　（辛）初，領旨哀請【今日乃知，雖有多聞，若不修行與不聞等；如人說食終不能飽】出家，入道 👈
　　    　：　　：　　：　　：　　：　　：　　：　次，正垂開示
　　A065　：　　：　　：　　：　　：　　：　　：　（壬）初，現瑞許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，正示見性【十番顯見，亦即廣示二本】
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，直指見性是心非眼*
　　A066　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，以拳例見定其常情
　　A068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，引例破執正顯見性【正顯見性離塵有體】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約客塵顯見性不動*
　　A070　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，默請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，徵名驗解
　　A071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，如來問【雖借鹿園證，實為顯圓教】
　　A072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，陳那答【答客義、塵與空義】長老有三 👈
　　A073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，佛印可【佛證其二見/解】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，現相證成
　　A074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，開合寶掌證成客與主義【本無動靜，遑論住不】
　　A075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，飛光動頭證成塵與空義【證悟見性如主如空】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結會責失
　　A076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，結會【十番顯見，亦即廣示二本】👈
　　A077　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，責失【無始顛倒，性心失真成惑；認物為己是業，作業受報，自取流轉】
卷二    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，約觀河顯見性無遷【身有童耄，見性不變】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，請問
　　B001　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，阿難密請【心願而未口宣】
　　B002　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，匿王顯請【匿王乃菩薩再來】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，說示
　　B003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，明身有變遷
　　B006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明性無生滅【王信知身後捨生趣生，見性不滅】
　　B008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，領悟
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　四，約垂手顯見性無滅【緣及所緣如客如塵；妙真精心如主如空】*
　　B009　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，疑問【云何名我等遺失真性、顛倒行事】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　B010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，順世立喻【手無倒正，世人迷為之有；更執上正下倒，倍迷矣】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正以法合
　　B011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，直舉法合【眾生由顛倒業、感顛倒身，故號性顛倒】
　　B012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，敕令諦觀【汝身佛身，名字何處號為顛倒？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，備明倒因
　　B013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，示無倒性【百法涵一切法，真心所現；圓心具妙明真三德，為能現】👈
　　B014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示顛倒相【晦昧指最初妄念發無明；妄認四大六塵為自身、心相】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　五，約標指顯見性無還【可還之法如客如塵；見性無還如主如空】*
　　B015　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，陳請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示
　　B016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，以喻總明【誡執言喪道、著教迷心之緣心聽法】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，就體別簡
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，簡緣心可還如觀指影
　　B017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，近就音聲以明無性
　　B018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣歷諸法分別以示可還【緣心各有所還，屬客非主】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示見性無還如天上月
　　B019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，承責咨請【云何妙明元心無還？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示無還
　　B020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，就月喻顯法體【以第二月表帶妄顯真】
　　B021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以可還顯不還【八象各有所還，能見八象之見性還誰？】
　　B022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結不還是本心【本妙是法身，本明是般若，本淨是解脫】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　六，約周遍顯見性非物【見性無大小內外等相，皆是主空】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，示無差別義
　　B023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，問【何以知此見精便是妙明真心？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答
　　B024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，約迷悟明無差而差
　　B025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約自他明差而無差【物類有別，見性無殊；精妙明即見性，見性即是真性】
　　B026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正明見性非物【見性非物，見性周遍，非汝而誰？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示無大小義
　　B027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　B028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，破執【見性能隨緣而體不變。欲見無大小，但除前塵；須內觀見性】
　　B030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，會通【眾生迷己為物為物所轉；若能轉物則同如來；身心圓明坐理道場】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　七，約無是非是顯見性唯真【見、見緣、所想相是客塵；元是菩提妙淨明體即主即空】*
　　B031　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，疑問【妙性在前，身心何物？見性實我，而身非我？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，斥破是非兩途
　　B032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正破是見【佛以萬象皆有自體而破見精在前。即物無見；離物亦無見】
　　B034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉破非見【萬象非見，亦非非見】
　　B035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，大眾茫然【無是無非，正是清淨實相；非無學者，茫然不知】
　　B036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，如來安慰【無上法王，是真實語，如所如說，不誑不妄】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，會通真性一理
　　B037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，文殊述疑啟請【無是見，無非見二義，是眾疑之由】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來垂慈示答
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，示妙體絕待
　　B038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，正明絕待【見分相分，依他起性；所想相，遍計執性；本無所有】
　　B039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，引列釋成【此見相二分，元本就是妙明無上菩提，淨圓真心】
　　B040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示迷悟得失【觀見與塵即見相二分，依他起性；種種發明，遍計執性】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　八，約外道世諦對簡顯見性非因緣自然【因緣自然、及其非皆客塵；無是無非離一切相即主即空】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，對外道簡自然
　　B041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，疑請【徵與外道、自然、因緣之異】
　　B042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示【若必自然，當有其體；然證實無】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，對世諦簡因緣
　　B043　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，轉計【必此妙見，是因緣生】
　　B044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破斥【因是親因，緣是助緣。遂破因、破緣】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結顯自性
　　B047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正示離過真體【精覺妙明，於因緣自然，無非不非，無是非是。離一切相，即一切法】
　　B048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結責滯著名相【世間多有戲論名相；妙明真心離名絕相】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　九，約二妄合明顯見性非見【能見所見、二種妄見皆客塵；見見非見、見猶離見皆主皆空】*
　　B049　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，引昔致疑【阿難再問佛因緣，不知佛昔所說是指眼識。唯識宗謂眼識九緣生】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，對理徵破
　　B050　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直明昔說隨情【佛昔說世間諸因緣相，非第一義】
　　B051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，重顯見性非緣【明相暗相，二俱名見，云何不見？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正示見性
　　B052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直示真性非見【見見之時見非是見見猶離見見不能及：以真鑒妄真不墮妄妄不及真】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，騰疑細釋應作述迷細釋
　　B053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，阿難騰疑應作述迷啟請【更聞見見非見，重增迷悶】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來細釋【將欲敷演大陀羅尼、諸三摩提、妙修行路（先悟後修）】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，訶誡許宣
　　B054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，經家敘意
　　B055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來誡許【奢摩他、三摩缽提、中觀（觀空觀有、不住空有）】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合明二妄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，直示二妄
　　B056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總標【眾生由二顛倒，分別見妄，當處發生，當業輪轉】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　B057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，釋別業妄見【目、眚、夜、燈、圓影各有所喻】👈
　　B061　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋同分妄見【喻九界聖凡同見三土五陰，名同分】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，進退合明
　　B062　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總示【二種妄見進退合明。所有見皆虛妄；知虛妄即真見】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明
　　B063　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，進別例同【受想行識能見，所見為內根外界之色】
　　B065　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，退同例別【眾生同分妄見；和合妄生，和合妄死】
　　B066　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，顯示歸真【遠離和合緣及不和合，滅除諸生死因；清淨本心，本覺常住】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　十，破和合不和合餘疑顯見性離過絕非法爾現證【和合與不即客塵；見性非和合非不即主即空】*
　　B067　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，責迷【如是覺元，非和合生及不和合】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，徵破
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，破和合
　　B068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，牒疑【猶以世間妄想和合諸因緣性而自疑惑，證菩提心和合起者】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　B069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，破和【約義破、體破、名破、例破】
　　B070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破合【合則必須大小同一。則明暗難以兩全，例破之】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破非和合
　　B071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，轉計【此妙覺元，與諸緣塵及心念慮，非和合耶？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　B072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，破非和【兩物異體各不相涉，謂之非和，必有邊畔；例破之】
　　B073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破非合【和合與不和合，皆是戲論；例破之】👈
　　    　：　　：　　：　　：　　：　　：　三，遍歷陰入處界會理*
　　B074　：　　：　　：　　：　　：　　：　（辛）初，總示【非但見精，總攝六根之藏性（實則為一），五陰、六入、十二處、十八界四科，皆是如來藏妙真如性】👈
　　    　：　　：　　：　　：　　：　　：　　：　次，別明
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，明五陰性*
　　B075　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵【五陰本如來藏妙真如性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　B076　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明色陰即藏性【瞪以發勞，虛空別見狂華。非從空來或目出。色陰虛妄，非因緣非自然性】
　　B080　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明受陰即藏性【二手相摩，妄生澀滑冷熱。非從空來或掌出。受陰虛妄，非因緣非自然性】
　　B083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明想陰即藏性【說梅口水出，思崖足心澀。非從梅崖或口足。想陰虛妄，非因緣非自然性】👈
　　B086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明行陰即藏性【暴流波浪相續，前際後際。不因水有非水性。行陰虛妄，非因緣非自然性】👈
　　B089　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明識陰即藏性【取空瓶，千里遠行餉他國。此空非彼來此入。識陰虛妄，非因緣非自然性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，明六入性*
　　C001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵【六入本如來藏妙真如性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明眼入即藏性【兼目與勞，同是菩提，瞪發勞相。眼入虛妄，非因緣非自然性，屬見惑】
　　C005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳入即藏性【兼耳與勞，同是菩提，瞪發勞相。耳入虛妄，非因緣非自然性，屬見惑】
　　C008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻入即藏性【兼鼻與勞，同是菩提，瞪發勞相。鼻入虛妄，非因緣非自然性，屬見惑】
　　C011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌入即藏性【兼舌與勞，同是菩提，瞪發勞相。舌入虛妄，非因緣非自然性，屬見惑】
　　C014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身入即藏性【兼身與勞，同是菩提，瞪發勞相。身入虛妄，非因緣非自然性，屬見惑】
　　C017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意入即用性【兼意與勞，同是菩提，瞪發勞相。意入虛妄，非因緣非自然性，屬思惑】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，明十二處性*
　　C020　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵【十二處本如來藏妙真如性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C021　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明色與見即藏性【見與色空俱無處所。色見二處虛妄；非因緣非自然性】
　　C024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明聽與聲即藏性【聽與音聲俱無處所。聽聲二處虛妄；非因緣非自然性】
　　C027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明嗅與香即藏性【香鼻與聞俱無處所。嗅香二處虛妄；非因緣非自然性】
　　C030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明嘗與味即藏性【味舌與嘗俱無處所。嘗味二處虛妄；非因緣非自然性】
　　C033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身與觸即藏性【覺觸與身俱無處所。身觸二處虛妄；非因緣非自然性】
　　C036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意與法即藏性【法則與心俱無處所。意法二處虛妄；非因緣非自然性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　四，明十八界性*
　　C039　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵【十八界本如來藏妙真如性】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C040　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明眼識界即藏性【眼色為緣生眼識界三處都無；眼色界三非因緣非自然性】
　　C044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳識界即藏性【耳聲為緣生耳識界三處都無；耳聲界三非因緣非自然性】
　　C048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻識界即藏性【鼻香為緣生鼻識界三處都無；鼻香界三非因緣非自然性】
　　C053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌識界即藏性【舌味為緣生舌識界三處都無；舌味界三非因緣非自然性】
　　C059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身識界即藏性【身觸為緣生身識界三處都無；身觸界三非因緣非自然性】
　　C064　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意識界即藏性【意法為緣生意識界三處都無；意法界三非因緣非自然性】👈
　　    　：　　：　　：　　：　次，明性本具相*
　　C069　：　　：　　：　　：　（己）初，當機疑請【因緣自然，何以二俱排擯？】
　　C070　：　　：　　：　　：　　：　次，訶誡許宣【汝先厭離小乘發心無上菩提，故我今時為汝開示第一義諦】天台大乘四教 👈
　　    　：　　：　　：　　：　　：　三，正為開示
　　    　：　　：　　：　　：　　：　（庚）初，牒疑說示
　　C071　：　　：　　：　　：　　：　　：　（辛）初，就法破妄【大性體非非和合，非和合；性相名殊體同，何來此諸戲論】
　　C072　：　　：　　：　　：　　：　　：　　：　次，借喻顯理【如水成冰，冰還成水】
　　    　：　　：　　：　　：　　：　　：　次，歷大別顯
　　    　：　　：　　：　　：　　：　　：　（辛）初，明藏性即地大*
　　C073　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【以鄰虛塵破色和合。若能析色成空，則虛空亦應能出生色相】
　　C074　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性【如來藏中性色真空即有即空，性空真色即空即有，清淨本然周遍法界；隨眾生心循業發現】
　　C075　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　次，明藏性即火大性*
　　C076　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【火性無我寄於諸緣；炊家手執陽燧日前求火】
　　C079　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性【如來藏中性火真空性空真火；清淨本然周遍法界；隨眾生心循業發現，起遍世間寧有方所】
　　C080　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　三，明藏性即水大性*
　　C081　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【水性不定流息無恒；幻師求太陰精手執方諸承月中水】諸事水外道 👈
　　C083　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性【如來藏中性水真空性空真水；清淨本然周遍法界；隨眾生心循業發現，生滿世間寧有方所】
　　C084　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　四，明藏性即風大性*
　　C085　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【風性無體動靜不常；僧伽梨角衣動有風拂彼人面】僧伽梨 👈
　　C087　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性【如來藏中性風真空性空真風；清淨本然周遍法界；隨眾生心循業發現，遍法界拂寧有方所】
　　C088　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　五，明藏性即空大性*
　　C089　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【空性無形因色顯發；鑿井求水出土得空】空有內外。四種姓 👈
　　C092　：　　：　　：　　：　　：　　：　　：　　：　次，明大均【地水火風空名五大，性真圓融，皆如來藏，本無生滅】
　　C093　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性【如來藏中性覺真空性空真覺；清淨本然周遍法界；隨眾生心循業發現，圓滿十方寧有方所】
　　C094　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑【世間惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　六，明藏性即根大【大小乘經均明地水火風空識六大；本經於識另立根大】*
　　C095　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【見覺無知因色空有；在祇陀林，或明或暗，因見分析】另立根大之義三 👈
　　C096　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【此見為復與明暗相，並太虛空，為同一體？為非一體？或同非同？或異非異？】
　　C099　：　　：　　：　　：　　：　　：　　：　　：　次，明大均【地水火風空見名六大，性真圓融，皆如來藏，本無生滅】見聞覺知，總為根性
　　C100　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性【如來藏中性見覺明覺精明見；清淨本然周遍法界；隨眾生心循業發現，諸根圓滿十虛寧有方所】
　　C101　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】
　　    　：　　：　　：　　：　　：　　：　　：　七，明藏性即識大性*
　　C102　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執【識性因六根塵妄出；此會聖眾用目循歷，但如鏡中無別分析】
　　C103　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【中觀論：「諸法不自生，亦不從他生」無生故無滅，非藏性而何？】
　　C106　：　　：　　：　　：　　：　　：　　：　　：　次，明大均【地水火風空根識名七大，性真圓融，皆如來藏，本無生滅】本經顯見相二分，即自證分 👈
　　C107　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性【如來藏中性識明知覺明真識；妙覺湛然遍周法界。循業發現，含吐十虛寧有方所】
　　C108　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑【世間無知，惑為因緣自然性，皆是識心分別計度，但有言說都無實義】含吐六義 👈
　　    　：　　：　　：　四，大眾圓悟*
　　    　：　　：　　：　（戊）初，經家敘益
　　    　：　　：　　：　　：　（己）初，敘益
　　C109　：　　：　　：　　：　　：　（庚）初，略敘【阿難及諸初心凡夫大眾，蒙佛如來微妙開示一乘妙法，身心蕩然得無掛礙】
　　    　：　　：　　：　　：　　：　　：　次，廣敘
　　    　：　　：　　：　　：　　：　　：　（辛）初，圓悟三大
　　C110　：　　：　　：　　：　　：　　：　　：　（壬）初，悟性量即相大【領悟四科中「不動周圓」義，七大中周遍法界含吐十虛義，見性周遍義】
　　C111　：　　：　　：　　：　　：　　：　　：　　：　次，悟性體即體大【領悟七大中「清淨本然」義，四科中「其性真為妙覺明體」義，等等】
　　C112　：　　：　　：　　：　　：　　：　　：　　：　三，悟性具即用大【性具即性空真色火等。用大即隨眾生心應所知量循業發現。法性當處出生隨處滅盡】
　　C113　：　　：　　：　　：　　：　　：　　：　次，結屬真因【自知妙心常住不滅】
　　C114　：　　：　　：　　：　　：　次，敘儀【禮佛合掌，得未曾有！於如來前，說偈贊佛】
　　    　：　　：　　：　　：　次，當機偈讚
　　    　：　　：　　：　　：　（己）初，讚嘆述益
　　C115　：　　：　　：　　：　　：　（庚）初，讚圓常人法【妙湛總持不動尊，首楞嚴王世希有！】首楞嚴：一切事（皆如來藏，妙真如性）究竟堅固；人人本具 👈
　　C116　：　　：　　：　　：　　：　　：　次，述所證淺深【銷我億劫顛倒想，不歷僧祇獲法身。】
　　    　：　　：　　：　　：　　：　次，誓願請加
　　C117　：　　：　　：　　：　　：　（庚）初，發大願【願今得果成寶王，還度如是恒沙眾；將此深心奉塵剎，是則名為報佛恩。】
　　    　：　　：　　：　　：　　：　　　　　　　　　【伏請世尊為證明，五濁惡世誓先入；如一眾生未成佛，終不於此取泥洹。】
　　C118　：　　：　　：　　：　　：　　：　次，請佛加【大雄大力大慈悲，希更審除微細惑；令我早登無上覺，於十方界坐道場。】
　　C119　：　　：　　：　　：　　：　　：　三，喻不退【舜若多性可銷亡，爍迦羅心無動轉。】總結前三卷皆顯如來藏妙真如性，圓三諦理。👈
卷四    　：　　：　次，廣破餘疑*
　　    　：　　：　（丁）初，明事理性相本融*
　　    　：　　：　　：　（戊）初，疑請
　　D001　：　　：　　：　　：　（己）初，敘敬【富樓那彌多羅尼子祈請】或名滿慈
　　    　：　　：　　：　　：　　：　次，嘆述
　　D002　：　　：　　：　　：　　：　（庚）初，嘆德【讚如來敷演如來第一義諦】
　　    　：　　：　　：　　：　　：　　：　次，述請
　　D003　：　　：　　：　　：　　：　　：　（辛）初，總述疑請【我等登無漏者，今聞如來法音，尚紆疑悔】
　　    　：　　：　　：　　：　　：　　：　　：　次，別述二難
　　D004　：　　：　　：　　：　　：　　：　　：　（壬）初，從陰入處界起理違事難【云何忽生山河大地、諸有為相？次第遷流、終而復始？】
　　D005　：　　：　　：　　：　　：　　：　　：　　：　次，從七大起相違性難　　【地水火風周遍法界者。地何容水？水火不陵？地障空虛，云何二俱周遍？】
　　D006　：　　：　　：　　：　　：　　：　　：　三，請佛開示【惟願如來，宣流大慈，開我迷雲，及諸大眾】
　　D007　：　　：　　：　　：　次，許宣【如來今日普為此會，宣勝義中真勝義性。令皆獲一乘寂滅場地，真阿練若正修行處】
　　    　：　　：　　：　　：　三，正說*
　　    　：　　：　　：　　：　（己）初，答迷真起妄以釋理違事難*
　　    　：　　：　　：　　：　　：　（庚）初，總辨真覺*
　　D008　：　　：　　：　　：　　：　　：　（辛）初，直指覺性本來寂照【如來常說，性覺妙明，本覺明妙】*
　　D009　：　　：　　：　　：　　：　　：　　：　次，雙破覺非明與不明【佛問「覺明」，是覺體本明？是此覺須明？滿慈選次而錯】*
　　    　：　　：　　：　　：　　：　　：　次，別明迷悟*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明眾生迷真成妄*
　　D010　：　　：　　：　　：　　：　　：　　：　（壬）初，明所起妄因【性覺必明妄為明覺；覺非所明因明立所。所既妄立生汝妄能】此問有二迷 👈*
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，明所感妄果*
　　D011　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，牒上略明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣顯三種相續
　　D012　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明世界相續*
　　D013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明眾生相續之因*
　　D014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明業果相續*
　　D015　：　　：　　：　　：　　：　　：　　：　　：　三，結果歸因
　　    　：　　：　　：　　：　　：　　：　　：　次，明諸佛悟妄唯真*
　　D016　：　　：　　：　　：　　：　　：　　：　（壬）初，領義起疑【如來今得妙空明覺，山河大地，有為習漏，何當復生？】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，舉喻答釋
　　D017　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，喻妄因妄果其體本真【譬如迷人惑南為北】
　　D018　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　　【此迷無本性畢竟空；覺迷迷滅，覺不生迷】
　　D019　：　　：　　：　　：　　：　　：　　：　　：　　：　次，喻真智真斷不重起妄【礦金純則不成雜，木成灰則不為木】
　　    　：　　：　　：　　：　　：　次，答相隨性得以釋相違性難*
　　D020　：　　：　　：　　：　　：　（庚）初，牒問【滿慈第二問】
　　    　：　　：　　：　　：　　：　　：　次，正答
　　D021　：　　：　　：　　：　　：　　：　（辛）初，舉喻【虛空日照則明雲屯則暗覺；是明非日非空不異空日】喻七大之相隨緣之用，諸相無體
　　D022　：　　：　　：　　：　　：　　：　　：　次，法合【觀相元妄無可指陳，何詰相陵滅義？】
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，正合上喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，重明理性
　　D023　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明不變隨緣用【眾生迷悶背覺合塵，故發塵勞有世間相】
　　D024　：　　：　　：　　：　　：　　：　　：　　：　　　　　【如來藏唯妙覺明圓照法界。一為無量無量為一。不動道場遍十方界身含十方無盡虛空】👈
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明隨緣不變體
　　D025　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明隨緣不變如實空義　【如來藏本妙圓心，非心、。。。。。。】👈
　　D027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明隨緣不變如實不空義【如來藏本妙圓心，即心、。。。。。。】
　　D029　：　　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　　　　　　【如來藏妙明心元，離即離非，是即非即】👈
　　D030　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結責迷情【眾生以所知心測度如來無上菩提，用世間語言入佛知見；汝暫舉心，塵勞先起】
　　    　：　　：　　：　次，明迷悟因緣無性*
　　    　：　　：　　：　（戊）初，答滿慈重徵妄因*
　　D031　：　　：　　：　　：　（己）初，牒問【敢問如來：一切眾生何因有妄，自蔽妙明受此淪溺？】
　　    　：　　：　　：　　：　　：　次，答
　　    　：　　：　　：　　：　　：　（庚）初，明妄本無因*
　　D032　：　　：　　：　　：　　：　　：　（辛）初，立喻【雖除大疑，餘惑未盡；室羅城之演若達多為喻】鏡中頭喻相分，知鏡中頭是見分。妄本無因
　　D033　：　　：　　：　　：　　：　　：　　：　次，顯法【既稱為妄云何有因？若有所因云何名妄？】
　　D034　：　　：　　：　　：　　：　　：　　：　三，結合【妄性如是，因何為在？】
　　    　：　　：　　：　　：　　：　　：　次，明真亦無得*
　　D035　：　　：　　：　　：　　：　　：　（辛）初，法說【但不隨分別，世間業果眾生三種相續，三緣斷故，三因不生；演若達多狂性自歇，歇即菩提】
　　D036　：　　：　　：　　：　　：　　：　　：　次，喻合【喻有人於自衣中系如意珠而不自覺知】
　　    　：　　：　　：　　：　次，答阿難再執妄緣*
　　D037　：　　：　　：　　：　（己）初，疑問【心中達多狂性自歇歇即菩提不從人得；斯則因緣皎然明白，云何如來頓棄因緣？今說菩提不從因緣】
　　    　：　　：　　：　　：　　：　次，示答
　　    　：　　：　　：　　：　　：　（庚）初，破疑
　　    　：　　：　　：　　：　　：　　：　（辛）初，即喻推破
　　D038　：　　：　　：　　：　　：　　：　　：　（壬）初，立喻【演若達多狂性因緣若滅，則不狂性自然而出，因緣自然理窮於是】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破二執
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正破二執
　　D039　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，約頭破【頭、狂非自然非因緣】
　　D040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約狂破【狂非自然，狂非非自然】
　　D041　：　　：　　：　　：　　：　　：　　：　　：　　：　次，悟本俱非【若悟本頭，識知狂走，因緣、自然，俱為戲論】
　　    　：　　：　　：　　：　　：　　：　　：　次，合法結顯
　　D042　：　　：　　：　　：　　：　　：　　：　（壬）初，直結法【是故，三緣斷即菩提心】
　　D043　：　　：　　：　　：　　：　　：　　：　　：　次，重簡非【無生滅名為自然；諸相雜和名和合性；非和合者稱本然性】自然心想則有生滅
　　D045　：　　：　　：　　：　　：　　：　　：　　：　三，正指是【合然俱離，離合俱非，此句方名，無戲論法】
　　    　：　　：　　：　　：　　：　　：　次，誡勸
　　D046　：　　：　　：　　：　　：　　：　（辛）初，誡徒聞無功【菩提涅槃，汝離尚遙；雖憶十方如來十二部經，祇益戲論】
　　D047　：　　：　　：　　：　　：　　：　　：　次，勸真修有益【歷劫憶持如來密妙，不如一日修無漏業遠離世間，如摩登伽、耶輸陀羅】
// 正宗分之一竟。`;
