parts[5] =
`// 正宗分之五。
卷八    （乙）五，借破戒惡心為問端廣示七趣差別*
　　    　：　（丙）初，問
　　H072　：　　：　（丁）初，經家敘益
　　    　：　　：　　：　次，當機正請
　　H073　：　　：　　：　（戊）初，讚謝
　　    　：　　：　　：　　：　次，陳疑
　　H074　：　　：　　：　　：　（己）初，總疑真不容妄
　　H075　：　　：　　：　　：　　：　次，別疑地獄同別
　　H076　：　　：　　：　　：　　：　三，結請決定開示
　　    　：　　：　次，示答*
　　H077　：　　：　（丁）初，讚許
　　    　：　　：　　：　次，正說*
　　    　：　　：　　：　（戊）初，總明二分*
　　H078　：　　：　　：　　：　（己）初，約迷真雙標
　　    　：　　：　　：　　：　　：　次，約情想別示
　　H079　：　　：　　：　　：　　：　（庚）初，約情別示
　　H080　：　　：　　：　　：　　：　　：　次，約想別示
　　    　：　　：　　：　　：　　：　三，明純雜升沉
　　H081　：　　：　　：　　：　　：　（庚）初，正明升沉
　　H083　：　　：　　：　　：　　：　　：　次，結答同別
　　    　：　　：　　：　　：　次，別示七趣*
　　    　：　　：　　：　　：　（己）初，示地獄趣*
　　H084　：　　：　　：　　：　　：　（庚）初，總標
　　    　：　　：　　：　　：　　：　　：　次，別釋*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明十因*
　　H085　：　　：　　：　　：　　：　　：　　：　（壬）初，明婬習*
　　H086　：　　：　　：　　：　　：　　：　　：　　：　次，明貪習*
　　H087　：　　：　　：　　：　　：　　：　　：　　：　三，明慢習*
　　H088　：　　：　　：　　：　　：　　：　　：　　：　四，明瞋習*
　　H089　：　　：　　：　　：　　：　　：　　：　　：　五，明詐習*
　　H090　：　　：　　：　　：　　：　　：　　：　　：　六，明誑習*
　　H091　：　　：　　：　　：　　：　　：　　：　　：　七，明怨習*
　　H092　：　　：　　：　　：　　：　　：　　：　　：　八，明見習*
　　H093　：　　：　　：　　：　　：　　：　　：　　：　九，明枉習*
　　H094　：　　：　　：　　：　　：　　：　　：　　：　十，明訟習*
　　    　：　　：　　：　　：　　：　　：　　：　次，明六報*
　　H095　：　　：　　：　　：　　：　　：　　：　（壬）初，總徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　H096　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明眼根報*
　　H097　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳根報*
　　H098　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根報*
　　H099　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌根報*
　　H100　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身根報*
　　H101　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意根報*
　　    　：　　：　　：　　：　　：　　：　三，總結
　　H102　：　　：　　：　　：　　：　　：　（辛）初，總結十因六果
　　H103　：　　：　　：　　：　　：　　：　　：　次，別明因果輕重
　　    　：　　：　　：　　：　　：　次，示鬼趣*
　　H104　：　　：　　：　　：　　：　（庚）初，總標
　　H105　：　　：　　：　　：　　：　　：　次，別顯
　　H106　：　　：　　：　　：　　：　　：　三，結示
　　    　：　　：　　：　　：　　：　三，畜生趣*
　　H107　：　　：　　：　　：　　：　（庚）初，總標
　　H108　：　　：　　：　　：　　：　　：　次，別顯
　　H109　：　　：　　：　　：　　：　　：　三，結示
　　    　：　　：　　：　　：　　：　四，明人趣*
　　H110　：　　：　　：　　：　　：　（庚）初，總標
　　H111　：　　：　　：　　：　　：　　：　次，別顯
　　H112　：　　：　　：　　：　　：　　：　三，結示
　　    　：　　：　　：　　：　　：　五，示仙趣*
　　H113　：　　：　　：　　：　　：　（庚）初，總標
　　H114　：　　：　　：　　：　　：　　：　次，別顯
　　H115　：　　：　　：　　：　　：　　：　三，結示
　　    　：　　：　　：　　：　　：　六，示天趣*
　　    　：　　：　　：　　：　　：　（庚）初，別示諸天*
　　    　：　　：　　：　　：　　：　　：　（辛）初，欲界*
　　H116　：　　：　　：　　：　　：　　：　　：　（壬）初，總標欲天之因
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別示六天之相
　　H117　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，四天王天*
　　H118　：　　：　　：　　：　　：　　：　　：　　：　　：　次，忉利天*
　　H119　：　　：　　：　　：　　：　　：　　：　　：　　：　三，須焰摩天*
　　H120　：　　：　　：　　：　　：　　：　　：　　：　　：　四，兜率陀天*
　　H121　：　　：　　：　　：　　：　　：　　：　　：　　：　五，樂變化天*
　　H122　：　　：　　：　　：　　：　　：　　：　　：　　：　六，他化自在天*
　　H123　：　　：　　：　　：　　：　　：　　：　　：　三，結成欲界之名
卷九    　：　　：　　：　　：　　：　　：　　：　次，色界*
　　I001　：　　：　　：　　：　　：　　：　　：　（壬）初，總出其因
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別明其相
　　I002　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明初禪*
　　I003　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明二禪*
　　I004　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明三禪*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明四禪*
　　I005　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明凡夫四天
　　I006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明不還五天
　　I007　：　　：　　：　　：　　：　　：　　：　　：　三，總結其名
　　    　：　　：　　：　　：　　：　　：　　：　三，無色界*
　　I008　：　　：　　：　　：　　：　　：　　：　（壬）初，簡去回心不入*
　　I009　：　　：　　：　　：　　：　　：　　：　　：　次，別明四空天相*
　　I010　：　　：　　：　　：　　：　　：　　：　　：　三，更判凡聖二類*
　　I011　：　　：　　：　　：　　：　　：　　：　　：　四，總辨王民不同*
　　I012　：　　：　　：　　：　　：　　：　　：　　：　五，結成無色名目*
　　I013　：　　：　　：　　：　　：　　：　次，總結虛妄
　　I014　：　　：　　：　　：　　：　七，示修羅趣*
　　    　：　　：　　：　　：　三，結示勸修*
　　    　：　　：　　：　　：　（己）初，結示迷妄*
　　I015　：　　：　　：　　：　　：　（庚）初，結成妄果本空
　　I016　：　　：　　：　　：　　：　　：　次，重示妄因顛倒
　　    　：　　：　　：　　：　　：　次，舉悟勸修*
　　I017　：　　：　　：　　：　　：　（庚）初，正舉悟境
　　I018　：　　：　　：　　：　　：　　：　次，結勸真修
// 正宗分之五竟。`;
