parts[3] =
`// 正宗分之三。
卷七    （乙）三，明正助合行所成伏斷圓三德位
　　G048　：　（丙）初，申請
　　G049　：　　：　次，讚許
　　    　：　　：　三，正說
　　    　：　　：　（丁）初，總明三德
　　G050　：　　：　　：　（戊）初，明理絕名相
　　G051　：　　：　　：　　：　次，明因妄立真
　　    　：　　：　　：　次，別示迷悟
　　G052　：　　：　　：　（戊）初，明迷真起妄成十二類生顛倒法*
　　    　：　　：　　：　　：　（己）初，敘意總明
　　G053　：　　：　　：　　：　　：　次，約相別示
　　    　：　　：　　：　　：　　：　（庚）初，明眾生顛倒因
　　    　：　　：　　：　　：　　：　　：　次，明世界顛倒
　　G056　：　　：　　：　　：　　：　　：　（辛）初，約因標名
　　    　：　　：　　：　　：　　：　　：　　：　次，約果釋相
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，別明
　　G059　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，卵生相*
　　G060　：　　：　　：　　：　　：　　：　　：　　：　　：　次，胎生相*
　　G061　：　　：　　：　　：　　：　　：　　：　　：　　：　三，濕生相*
　　G062　：　　：　　：　　：　　：　　：　　：　　：　　：　四，化生相*
　　G063　：　　：　　：　　：　　：　　：　　：　　：　　：　五，有色相*
　　G064　：　　：　　：　　：　　：　　：　　：　　：　　：　六，無色相*
　　G065　：　　：　　：　　：　　：　　：　　：　　：　　：　七，有想相*
　　G066　：　　：　　：　　：　　：　　：　　：　　：　　：　八，無想相*
　　G067　：　　：　　：　　：　　：　　：　　：　　：　　：　九，非有色相*
　　G068　：　　：　　：　　：　　：　　：　　：　　：　　：　十，非無色相*
　　G069　：　　：　　：　　：　　：　　：　　：　　：　　：　十一，非有想相*
　　G070　：　　：　　：　　：　　：　　：　　：　　：　　：　十二，非無想相*
　　G071　：　　：　　：　　：　　：　　：　　：　　：　次，總結
卷八    　：　　：　　：　　：　次，明滅妄名真立六十聖位轉依號*
　　    　：　　：　　：　　：　（己）初，總明三漸次為能轉之行
　　    　：　　：　　：　　：　　：　（庚）初，結前生後
　　H001　：　　：　　：　　：　　：　　：　（辛）初，結前生類互具
　　H002　：　　：　　：　　：　　：　　：　　：　次，生後對治法門
　　    　：　　：　　：　　：　　：　　：　次，標列正明
　　H003　：　　：　　：　　：　　：　　：　（辛）初，標列
　　    　：　　：　　：　　：　　：　　：　　：　次，正明
　　H004　：　　：　　：　　：　　：　　：　　：　（壬）初，除助因
　　H007　：　　：　　：　　：　　：　　：　　：　　：　次，刳正性
　　H009　：　　：　　：　　：　　：　　：　　：　　：　三，違現業
　　    　：　　：　　：　　：　　：　次，別明諸位次為所轉之號*
　　H011　：　　：　　：　　：　　：　（庚）初，觀行轉依號
　　H012　：　　：　　：　　：　　：　　：　次，相似轉依號
　　    　：　　：　　：　　：　　：　　：　三，分證轉依號
　　H022　：　　：　　：　　：　　：　　：　（辛）初，明十住*
　　H032　：　　：　　：　　：　　：　　：　　：　次，明十行*
　　    　：　　：　　：　　：　　：　　：　　：　三，明十向*
　　H042　：　　：　　：　　：　　：　　：　　：　（壬）初，正明十向*
　　H052　：　　：　　：　　：　　：　　：　　：　　：　次，別明加行*
　　H053　：　　：　　：　　：　　：　　：　　：　四，十地*
　　H064　：　　：　　：　　：　　：　　：　　：　五，明等覺*
　　H065　：　　：　　：　　：　　：　　：　四，究竟轉依號
　　    　：　　：　　：　　：　　：　三，合結諸位次由三行而成
　　H066　：　　：　　：　　：　　：　（庚）初，總以止觀結
　　H067　：　　：　　：　　：　　：　　：　次，正以三行結
　　H068　：　　：　　：　　：　　：　　：　三，復以邪正結
// 正宗分之三竟。`;
