parts[5] =
`// 正宗分之五。
卷八    （乙）五，借破戒惡心為問端廣示七趣差別*
　　    　：　（丙）初，問
　　H072　：　　：　（丁）初，經家敘益
　　    　：　　：　　：　次，當機正請
　　H073　：　　：　　：　（戊）初，讚謝
　　    　：　　：　　：　　：　次，陳疑
　　H074　：　　：　　：　　：　（己）初，總疑真不容妄【此妙真淨心本來遍圓，云何復有六道？】
　　H075　：　　：　　：　　：　　：　次，別疑地獄同別【寶蓮香比丘尼；琉璃大王；善星比丘等公案】
　　H076　：　　：　　：　　：　　：　三，結請決定開示【令持戒眾生聞決定義，歡喜頂戴，謹潔無犯】
　　    　：　　：　次，示答*
　　H077　：　　：　（丁）初，讚許【快哉此問，令諸眾生，不入邪見】
　　    　：　　：　　：　次，正說*
　　    　：　　：　　：　（戊）初，總明二分*
　　H078　：　　：　　：　　：　（己）初，約迷真雙標　　【眾生本清淨；因彼妄見有妄習生，故有內分外分】
　　    　：　　：　　：　　：　　：　次，約情想別示
　　H079　：　　：　　：　　：　　：　（庚）初，約情別示【因諸愛染發起妄情；情積不休能生愛水　　　　】
　　    　：　　：　　：　　：　　：　　　　　　　　　　【諸愛雖別流結是同；潤濕不升自然從墜；名內分】
　　H080　：　　：　　：　　：　　：　　：　次，約想別示【因諸渴仰發明虛想，想積不休能生勝氣　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【諸想雖別輕舉是同；飛動不沈自然超越；名外分】
　　    　：　　：　　：　　：　　：　三，明純雜升沉
　　H081　：　　：　　：　　：　　：　（庚）初，正明升沉【一切世間，生死相續，生從順習，死從變流。　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【臨命終時，未捨暖觸，一生善惡，俱時頓現。　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【死逆生順，二習相交，　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【▸ 純想即飛，必生天上，　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　若飛心中，兼福慧淨願，心開見佛隨願往生。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　情少想多，輕舉非遠，即為飛仙，大力鬼王，】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　飛行夜叉，地行羅剎，遊於四天，所去無礙。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　中有善願善心護持我法，或護禁戒隨持戒人，】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　或護神咒隨持咒者，或護禪定保綏法忍，　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　是等親住，如來座下。　　　　　　　　　　】
　　H082　：　　：　　：　　：　　：　　：　　　　　　　【▸ 情想均等，生於人間，想明斯聰，情幽斯鈍。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【▸ 情多想少，流入橫生，重為毛群，輕為羽族。】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【▸ 七情三想，沈下水輪，生於火際，受氣猛火，】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　為餓鬼常被焚；水能害己，無食飲百千劫。　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【▸ 九情一想，下洞火輪，身入風火，二交過地；】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　生二地獄：八二有間，九一無間。　　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【▸ 純情即沈，入阿鼻獄；　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　若謗大乘，毀佛禁戒，誑妄說法，虛貪信施，】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【　濫膺恭敬，五逆十重，更生十方，阿鼻地獄。】
　　H083　：　　：　　：　　：　　：　　：　次，結答同別【循造惡業，雖則自招；眾同分中，兼有元地】
　　    　：　　：　　：　　：　次，別示七趣*
　　    　：　　：　　：　　：　（己）初，示地獄趣*
　　H084　：　　：　　：　　：　　：　（庚）初，總標　　【眾生自業所感，造十習因，受六交報】
　　    　：　　：　　：　　：　　：　　：　次，別釋*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明十因*
　　H085　：　　：　　：　　：　　：　　：　　：　（壬）初，明婬習【色目行婬同名欲火；菩薩見欲如避火坑】*
　　H086　：　　：　　：　　：　　：　　：　　：　　：　次，明貪習【色目多求同名貪水；菩薩見貪如避瘴海】*
　　H087　：　　：　　：　　：　　：　　：　　：　　：　三，明慢習【色目我慢名飲癡水；菩薩見慢如避巨溺】*
　　H088　：　　：　　：　　：　　：　　：　　：　　：　四，明瞋習【色目瞋恚名利刀劍；菩薩見瞋如避誅戮】*
　　H089　：　　：　　：　　：　　：　　：　　：　　：　五，明詐習【色目奸偽同名讒賊；菩薩見詐如畏豺狼】*
　　H090　：　　：　　：　　：　　：　　：　　：　　：　六，明誑習【色目欺誑同名劫殺；菩薩見誑如踐蛇虺】*
　　H091　：　　：　　：　　：　　：　　：　　：　　：　七，明怨習【色目怨家名違害鬼；菩薩見怨如飲鴆酒】*
　　H092　：　　：　　：　　：　　：　　：　　：　　：　八，明見習【色目惡見同名見坑；菩薩見此如臨毒壑】*
　　H093　：　　：　　：　　：　　：　　：　　：　　：　九，明枉習【色目怨謗同名讒虎；菩薩見枉如遭霹靂】*
　　H094　：　　：　　：　　：　　：　　：　　：　　：　十，明訟習【色目覆藏同名陰賊；菩薩見覆高山巨海】*
　　    　：　　：　　：　　：　　：　　：　　：　次，明六報*
　　H095　：　　：　　：　　：　　：　　：　　：　（壬）初，總徵【一切眾生六識造業，所招惡報從六根出】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　H096　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明眼根報【見報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交見猛火遍滿；神識飛墜乘煙入無間獄】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者明見，遍見諸惡，生無量畏　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者暗見，寂然不見，生無量恐　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是火見：燒聽，能為鑊湯烊銅　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　燒息，能為黑煙紫焰　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　燒味，能為焦丸鐵糜　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　燒觸，能為熱灰爐炭　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　燒心，能生星火迸灑，煽鼓空界　　】
　　H097　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳根報【聞報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交見濤溺天地，神識降注乘流入無間獄】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者開聽，聽種種鬧，精神茅亂　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者閉聽，寂無所聞，幽魄沈沒　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是波聞：注聞，能為責詰　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　註見，能為雷吼，為惡毒氣　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　注息，能為雨田，灑諸毒蟲遍體　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　注味，能為膿血，種種雜穢　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　注觸，能為畜鬼，為糞為尿　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　注意，能為電雹，摧碎心魄　　　　】
　　H098　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻根報【嗅報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交見毒氣充塞，神識從地涌出入無間獄】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者通聞，被諸惡氣，熏極心擾　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者塞聞，氣掩不通，悶絕於地　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是嗅氣：沖息，能為質履　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　沖見，能為火炬　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　沖聽，能為沒溺，為洋為沸　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　沖味，能為餒爽　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　沖觸，能為綻爛，為大肉山　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　　　　有百千眼，無量咂食　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　沖思，能為灰瘴，為飛沙礫擊碎身體】
　　H099　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌根報【味報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交，見鐵網，猛焰熾烈，周覆世界　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【亡者神識下透掛網，倒懸其頭，入無間獄　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者吸氣，結成寒冰，凍冽身肉　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者吐氣，飛為猛火，焦爛骨髓　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是嘗味：歷嘗，能為承為忍　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷見，為然金石　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷聽，能為利兵刃　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷息，能為大鐵籠，彌覆國土　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷觸，能為弓為箭，為弩為射　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷思，能為飛熱鐵，從空雨下　　　】
　　H100　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身根報【觸報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交，見大山，四面來合無復出路。　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【亡者神識，見大鐵城，火蛇火狗虎狼師子，　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【牛頭獄卒馬頭羅剎，執茅入城，向無間獄　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者合觸，合山逼體，骨肉血潰　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者離觸，刀劍觸身，心肝屠裂　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是合觸：歷觸，能為道為觀，為廳為案　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷見，能為燒為爇　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷聽，能為撞為擊，為剚為射　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷息，能為括為袋，為考為縛　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷嘗，能為耕為鉗，為斬為截　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　歷思，能為墜為飛，為煎為炙　　　】
　　H101　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意根報【思報，招引惡果】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【臨終業交，見惡風壞土，神識乘風墮無間獄　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【發二相：一者不覺，迷極則慌，奔走不息　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　二者不迷，覺知則苦，痛深難忍　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【是邪思：結思，能為方為所　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　結見，能為鑒為證　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　結聽，能為大合石，為冰霜土霧　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　結息，能為大火車，火船火檻　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　結嘗，能為大叫喚，為悔為泣　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　結觸，能為大為小，為一日中　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　【　　　　　　　萬生萬死，為偃為仰　　　　】
　　    　：　　：　　：　　：　　：　　：　三，總結
　　H102　：　　：　　：　　：　　：　　：　（辛）初，總結十因六果【是名地獄十因六果，眾生迷妄所造】
　　H103　：　　：　　：　　：　　：　　：　　：　次，別明因果輕重【眾生惡業同造，阿鼻獄經無量劫受無量苦】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【六根各造及彼所作兼境兼根，入八無間獄】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【身口意三作殺盜婬，入一十八地獄　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【三業不兼或一殺盜，入三十六地獄　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【見見一根單犯一業，入一百八地獄　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　【眾生別作別造，入同分世界。妄想非本有】
　　    　：　　：　　：　　：　　：　次，示鬼趣*
　　H104　：　　：　　：　　：　　：　（庚）初，總標【若眾生非破律儀犯菩薩戒毀佛涅槃，受罪已畢，受諸鬼形】
　　H105　：　　：　　：　　：　　：　　：　次，別顯【若於本因，】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪物之罪畢，遇物成形，名怪　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪色之罪畢，遇風成形，名魃　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪惑之罪畢，遇畜成形，名魅　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪恨之罪畢，遇蟲為形，名蠱毒鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪憶之罪畢，遇衰成形，名厲　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪傲之罪畢，遇氣成形，名餓　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪罔之罪畢，遇幽為形，名魘　鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪明之罪畢，遇精為形，名魍魎鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪成之罪畢，遇明為形，名役使鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【貪黨之罪畢，遇人為形，名傳送鬼】
　　H106　：　　：　　：　　：　　：　　：　三，結示【是人皆以純情墜落，業火燒乾上出為鬼】
　　    　：　　：　　：　　：　　：　　：　　：　　【此皆自妄想業所招引。若悟菩提妙圓明，本無所有】
　　    　：　　：　　：　　：　　：　三，畜生趣*
　　H107　：　　：　　：　　：　　：　（庚）初，總標【鬼業既盡，情想二空，】
　　    　：　　：　　：　　：　　：　　：　　：　　【於世間，與元負人怨對相值，身為畜生，酬其宿債】
　　H108　：　　：　　：　　：　　：　　：　次，別顯【物怪之鬼，物銷報盡，多生為梟類】
　　    　：　　：　　：　　：　　：　　：　　：　　【風魃之鬼，風銷報盡，多生為咎徵一切異類】
　　    　：　　：　　：　　：　　：　　：　　：　　【畜魅之鬼，畜死報盡，多生為狐類】
　　    　：　　：　　：　　：　　：　　：　　：　　【蟲蠱之鬼，蠱滅報盡，多生為毒類】
　　    　：　　：　　：　　：　　：　　：　　：　　【衰厲之鬼，衰窮報盡，多生為蛔類】
　　    　：　　：　　：　　：　　：　　：　　：　　【受氣之鬼，氣銷報盡，多生為食類】
　　    　：　　：　　：　　：　　：　　：　　：　　【綿幽之鬼，幽銷報盡，多生為服類】
　　    　：　　：　　：　　：　　：　　：　　：　　【和精之鬼，和銷報盡，多生為應類】
　　    　：　　：　　：　　：　　：　　：　　：　　【明靈之鬼，明滅報盡，多生為休徵一切諸類】
　　    　：　　：　　：　　：　　：　　：　　：　　【依人之鬼，人亡報盡，多生為循類】
　　H109　：　　：　　：　　：　　：　　：　三，結示【是等業火乾枯，酬其宿債傍為畜生】
　　    　：　　：　　：　　：　　：　　：　　：　　【此亦自虛妄業之所招引。若悟菩提，此妄本無所有】
　　    　：　　：　　：　　：　　：　四，明人趣*
　　H110　：　　：　　：　　：　　：　（庚）初，總標【從是畜生，酬償先債】
　　    　：　　：　　：　　：　　：　　：　　：　　【若彼酬者分越所酬，則還復為人反徵其剩】
　　    　：　　：　　：　　：　　：　　：　　：　　【　如彼有力兼有福德，則不捨人身酬還彼力】
　　    　：　　：　　：　　：　　：　　：　　：　　【　若無福者，還為畜生償彼餘直】
　　    　：　　：　　：　　：　　：　　：　　：　　【若用錢物或役其力，償足自停】
　　    　：　　：　　：　　：　　：　　：　　：　　【如殺彼身命或食其肉，乃至經微塵劫相食相誅，】
　　    　：　　：　　：　　：　　：　　：　　：　　【　猶如轉輪，互為高下，無有休息】
　　    　：　　：　　：　　：　　：　　：　　：　　【　除奢摩他，及佛出世，不可停寢】
　　H111　：　　：　　：　　：　　：　　：　次，別顯【梟倫者，酬足復形；生人道中，參合頑類】
　　    　：　　：　　：　　：　　：　　：　　：　　【咎徵者，酬足復形；生人道中，參合異類】
　　    　：　　：　　：　　：　　：　　：　　：　　【狐倫者，酬足復形；生人道中，參合庸類】
　　    　：　　：　　：　　：　　：　　：　　：　　【毒倫者，酬足復形；生人道中，參合很類】
　　    　：　　：　　：　　：　　：　　：　　：　　【蛔倫者，酬足復形；生人道中，參合微類】
　　    　：　　：　　：　　：　　：　　：　　：　　【食倫者，酬足復形；生人道中，參合柔類】
　　    　：　　：　　：　　：　　：　　：　　：　　【服倫者，酬足復形；生人道中，參合勞類】
　　    　：　　：　　：　　：　　：　　：　　：　　【應倫者，酬足復形；生人道中，參於文類】
　　    　：　　：　　：　　：　　：　　：　　：　　【休徵者，酬足復形，生人道中，參合明類】
　　    　：　　：　　：　　：　　：　　：　　：　　【循倫者，酬足復形，生人道中，參於達類】
　　H112　：　　：　　：　　：　　：　　：　三，結示【是等宿債畢酬，復形人道，，業計顛倒，相生相殺】
　　    　：　　：　　：　　：　　：　　：　　：　　【不遇如來不聞正法；塵勞中法爾輪轉，名可憐愍者】
　　    　：　　：　　：　　：　　：　五，示仙趣*
　　H113　：　　：　　：　　：　　：　（庚）初，總標【有人不依正覺修三摩地，別修妄念，】
　　    　：　　：　　：　　：　　：　　：　　：　　【存想固形，遊於山林人不及處，有十種仙】
　　H114　：　　：　　：　　：　　：　　：　次，別顯【堅固服餌，而不休息；食道圓成，名地行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固草木，而不休息；藥道圓成，名飛行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固金石，而不休息；化道圓成，名遊行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固動止，而不休息；氣精圓成，名空行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固津液，而不休息；潤德圓成，名天行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固精色，而不休息；吸粹圓成，名通行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固咒禁，而不休息；術法圓成，名道行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固思念，而不休息；思憶圓成，名照行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固交遘，而不休息；感應圓成，名精行仙】
　　    　：　　：　　：　　：　　：　　：　　：　　【堅固變化，而不休息；覺悟圓成，名絕行仙】
　　H115　：　　：　　：　　：　　：　　：　三，結示【是等於人中練心，不修正覺，別得生理，壽千萬歲】
　　    　：　　：　　：　　：　　：　　：　　：　　【休止深山或大海島，絕於人境。　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　【斯亦輪迴妄想流轉；不修三昧，報盡還來散入諸趣】
　　    　：　　：　　：　　：　　：　六，示天趣*
　　    　：　　：　　：　　：　　：　（庚）初，別示諸天*
　　    　：　　：　　：　　：　　：　　：　（辛）初，欲界*
　　H116　：　　：　　：　　：　　：　　：　　：　（壬）初，總標欲天之因【世人不求常住，未捨妻妾恩愛】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別示六天之相
　　H117　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，四天王天*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【邪婬中，心不流逸澄瑩生明；命終鄰於日月　】
　　H118　：　　：　　：　　：　　：　　：　　：　　：　　：　次，忉利天【於己妻房，婬愛微薄；〇〇〇〇〇】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【於靜居時不得全味。命終超日月明居人間頂　】
　　H119　：　　：　　：　　：　　：　　：　　：　　：　　：　三，須焰摩天【逢欲暫交，去無思憶；〇〇〇〇】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【人世間動少靜多。命終於虛空中朗然安住，　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【日月光明上昭不及，是諸人等自有光明　　　】
　　H120　：　　：　　：　　：　　：　　：　　：　　：　　：　四，兜率陀天【一切時靜，有應觸來未能違戾。】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【命終上升精微，不接下界諸人天境，　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【乃至劫壞，三災不及　　　　　　　　　　　】
　　H121　：　　：　　：　　：　　：　　：　　：　　：　　：　五，樂變化天【我無欲心，應汝行事；〇〇〇〇】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【於橫陳時，味如嚼蜡。命終生越化地　　　　】
　　H122　：　　：　　：　　：　　：　　：　　：　　：　　：　六，他化自在天【無世間心，同世行事；〇〇〇】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【於行事交了然超越。命終遍能出超，化無化境】
　　H123　：　　：　　：　　：　　：　　：　　：　　：　三，結成欲界之名【如是六天，形雖出動心跡尚交】
卷九    　：　　：　　：　　：　　：　　：　　：　次，色界*
　　I001　：　　：　　：　　：　　：　　：　　：　（壬）初，總出其因【世間修心人，不假禪那無有智慧，　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　【但能執身不行婬欲，若行若坐想念俱無】
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，別明其相
　　I002　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明初禪*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【愛染不生，無留欲界；　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　是人應念身為梵侶，名梵眾天　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【欲習既除，離欲心現，於諸律儀，愛樂隨順；　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　是人應時能行梵德，名梵輔天　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【身心妙圓，威儀不缺，清淨禁戒，加以明悟；　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　是人應時能統梵眾，為大梵王，名大梵天　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【此三勝流，一切苦惱所不能逼；雖非正修真三摩地，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　清淨心中諸漏不動，名為初禪　　　　　　　　　】
　　I003　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明二禪*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【統攝梵人圓滿梵行，澄心不動寂湛生光，名少光天　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【光光相然照耀無盡，映十方界遍成琉璃，名無量光天】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【吸持圓光成就教體，發化清淨應用無盡，名光音天　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【此三勝流，一切憂懸所不能逼；雖非正修真三摩地，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　清淨心中麤漏已伏，名為二禪　　　　　　　　　】
　　I004　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明三禪*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【圓光成音披音露妙，發成精行通寂滅樂，名少淨天　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【淨空現前引發無際，身心輕安成寂滅樂，名無量淨天】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【世界身心一切圓淨，淨德成就歸寂滅樂，名遍淨天　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【此三勝流，具大隨順得無量樂；雖非正得真三摩地，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　安隱心中，歡喜畢具，名為三禪　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明四禪*
　　I005　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明凡夫四天*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【不逼身心苦因已盡；樂非常住久必壞生；　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　苦樂二心俱時頓捨，麤重相滅淨福性生，名福生天】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【捨心圓融勝解清淨；福無遮中，得妙隨順窮未來際，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　名福愛天　　　　　　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【從是天中，有二岐路，　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　若於先心無量淨光，福德圓明修證而住，名廣果天】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　若於先心雙厭苦樂，精研捨心不斷，圓窮捨道，　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　　身心俱滅心慮灰凝經五百劫；是人以生滅為因，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　　不能發明不生滅性，初半劫滅後半生，名無想天】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【此四勝流，世間苦樂所不能動；雖非無為真不動地，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　有所得心，功用純熟，名為四禪　　　　　　　　】
　　I006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明不還五天【於下界中，〇〇〇〇〇〇〇〇】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　【九品習氣俱時滅盡，苦樂雙亡，下無卜居，　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　　　　【故於捨心眾同分中安立居處　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【苦樂兩滅鬥心不交，名無煩天　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【機括獨行研交無地，名無熱天　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【十方世界妙見圓澄，更無塵象一切沈垢，名善見天　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【精見現前陶鑄無礙，名善現天　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【究竟群幾究色性性，入無邊際，名色究竟天　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【此不還天，四禪，四天王，獨有欽聞不能知見。　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　今世曠野深山，聖道場地，皆有阿羅漢所住持；　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　　　【　世間麤人，所不能見　　　　　　　　　　　　　】
　　I007　：　　：　　：　　：　　：　　：　　：　　：　三，總結其名【是十八天，獨行無交未盡形累，名為色界】
　　    　：　　：　　：　　：　　：　　：　　：　三，無色界*
　　I008　：　　：　　：　　：　　：　　：　　：　（壬）初，簡去回心不入【從是有頂色邊際中，其間復有二種歧路。】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【若於捨心發明智慧，慧光圓通便出塵界，成阿羅漢，　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【入菩薩乘，如是一類，名為回心大阿羅漢　　　　　　　】
　　I009　：　　：　　：　　：　　：　　：　　：　　：　次，別明四空天相*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【若在捨心，捨厭成就，覺身為礙，銷礙入空，名為空處　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【諸礙既銷，無礙無滅，其中唯留阿賴耶識，全於末那半分】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　微細，名為識處　　　　　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【空色既亡，識心都滅，十方寂然，迥無攸往。名無所有處】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【識性不動，以滅窮研，於無盡中，發宣盡性，如存不存，】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　若盡非盡，名為非想非非想處　　　　　　　　　　　】
　　I010　：　　：　　：　　：　　：　　：　　：　　：　三，更判凡聖二類【此等窮空不盡空理，從不還天聖道窮者，】*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　名不回心鈍阿羅漢。　　　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　若從無想諸外道天，窮空不歸，迷漏無聞，便入輪轉　】
　　I011　：　　：　　：　　：　　：　　：　　：　　：　四，總辨王民不同*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【是諸天上，各各天人，則是凡夫，業果酬答，答盡入輪；】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　彼之天王，即是菩薩，遊三摩地，漸次增進，　　　　】
　　    　：　　：　　：　　：　　：　　：　　：　　：　　【　迴向聖倫所修行路　　　　　　　　　　　　　　　　】
　　I012　：　　：　　：　　：　　：　　：　　：　　：　五，結成無色名目【是四空天，身心滅盡定性現前，】*
　　    　：　　：　　：　　：　　：　　：　　：　　　　　　　　　　　　【無業果色從此逮終，名無色界　】
　　I013　：　　：　　：　　：　　：　　：　次，總結虛妄【此皆不了妙覺明心，積妄發生妄有三界；】　　　　　　　　　
　　    　：　　：　　：　　：　　：　　：　　　　　　　【中間妄隨七趣沈溺，補特伽羅各從其類　】
　　I014　：　　：　　：　　：　　：　七，示修羅趣【是三界中，復有四種阿修羅類】*
　　    　：　　：　　：　　：　　：　　：　【若於鬼道，以護法力乘通入空；從卵而生，鬼趣所攝　　　　　】
　　    　：　　：　　：　　：　　：　　：　【若於天中，降德貶墜其所卜居，鄰於日月；從胎而出，人趣所攝】
　　    　：　　：　　：　　：　　：　　：　【有修羅王，執持世界力洞無畏，能與梵王及天帝釋四天爭權；　】
　　    　：　　：　　：　　：　　：　　：　【　因變化有，天趣所攝　　　　　　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　【別有一分，下劣修羅生大海心沈水穴口，旦遊虛空暮歸水宿；　】
　　    　：　　：　　：　　：　　：　　：　【　因濕氣有，畜生趣攝　　　　　　　　　　　　　　　　　　】
　　    　：　　：　　：　　：　三，結示勸修*
　　    　：　　：　　：　　：　（己）初，結示迷妄*
　　I015　：　　：　　：　　：　　：　（庚）初，結成妄果本空【如是地獄餓鬼畜生人神仙天修羅，精研七趣，】
　　    　：　　：　　：　　：　　：　　：　【皆是昏沈諸有為相，妄想受生。妄想隨業，於妙圓明無作本心；】
　　    　：　　：　　：　　：　　：　　：　【皆如空華，元無所著，但一虛妄，更無根緒　　　　　　　　　】
　　I016　：　　：　　：　　：　　：　　：　次，重示妄因顛倒【不識本心受此輪迴，經無量劫不得真淨。　　】
　　    　：　　：　　：　　：　　：　　：　【皆由隨順殺盜婬故，反此三種，又則出生無殺盜婬。　　　　　】
　　    　：　　：　　：　　：　　：　　：　【有名鬼倫，無名天趣空有無相傾，起輪迴性　　　　　　　　　】
　　    　：　　：　　：　　：　　：　次，舉悟勸修*
　　I017　：　　：　　：　　：　　：　（庚）初，正舉悟境【若妙發三摩提，則妙常寂，有無二無，無二亦滅；】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【尚無不殺不偷不婬，云何更隨殺盜婬事　　　　　】
　　I018　：　　：　　：　　：　　：　　：　次，結勸真修【不斷三業，各各有私。眾私同分，非無定處。　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【自妄發生，生妄無因，無可尋究。　　　　　　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【欲得菩提，要除三惑。不盡三惑，縱得神通，　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【皆是世間，有為功用；習氣不滅，落於魔道。　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【雖欲除妄，倍加虛偽，汝妄自造，非菩提咎。　　】
　　    　：　　：　　：　　：　　：　　：　　　　　　　【作是說者，名為正說，若他說者，即魔王說。　　】
// 正宗分之五竟。`;
