parts[1] =
`// 正宗分之一。
卷一    （乙）初，顯如來藏妙真如性圓三諦理*
　　    　：　（丙）初，正明理性*
　　A017　：　　：　（丁）初，當機悔請
　　A018　：　　：　　：　次，大眾願聞
　　    　：　　：　　：　三，如來答示*
　　    　：　　：　　：　（戊）初，就事顯理*
　　    　：　　：　　：　　：　（己）初，逐破妄執密顯真心*
　　    　：　　：　　：　　：　　：　（庚）初，徵其發心本因*
　　A019　：　　：　　：　　：　　：　　：　（辛）初，如來問
　　A020　：　　：　　：　　：　　：　　：　　：　次，阿難答
　　    　：　　：　　：　　：　　：　　：　次，示以常心直道*
　　A021　：　　：　　：　　：　　：　　：　（辛）初，點示常心
　　A022　：　　：　　：　　：　　：　　：　　：　次，勸修直道
　　    　：　　：　　：　　：　　：　　：　三，廣破七番妄計*
　　    　：　　：　　：　　：　　：　　：　（辛）初，正破內計*
　　A023　：　　：　　：　　：　　：　　：　　：　（壬）初，徵起緣心
　　A024　：　　：　　：　　：　　：　　：　　：　　：　次，喻明降伏
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，牒其內計
　　A025　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正牒徵
　　A026　：　　：　　：　　：　　：　　：　　：　　：　　：　次，立例
　　A027　：　　：　　：　　：　　：　　：　　：　　：　四，懸示定名
　　    　：　　：　　：　　：　　：　　：　　：　　：　五，正破非內
　　A028　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，初引例
　　A029　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　次，破轉計在外*
　　A030　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A031　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，立例
　　A032　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　三，破轉計潛根*
　　A033　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A034　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，立例
　　A035　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　四，破轉計見內*
　　A036　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A037　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正破
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉破
　　A038　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，被其轉計內對
　　A039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破其轉計在空
　　A040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，破其轉計兩覺
　　A041　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結破
　　    　：　　：　　：　　：　　：　　：　　：　五，破轉計隨生*
　　A042　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　A043　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，牒計
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　A044　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，破無體
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破有體
　　A045　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，約內外出入破
　　A046　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約一多遍不遍破
　　A047　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結破
　　    　：　　：　　：　　：　　：　　：　　：　六，破轉計中間*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，破泛計
　　A048　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，泛計
　　A049　：　　：　　：　　：　　：　　：　　：　　：　　：　次，泛破
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破正計
　　A050　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正計
　　A051　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　    　：　　：　　：　　：　　：　　：　　：　七，破轉計無著*
　　A052　：　　：　　：　　：　　：　　：　　：　（壬）初，轉計
　　A053　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　    　：　　：　　：　　：　　：　次，顯示妙理兼破餘妄*
　　    　：　　：　　：　　：　　：　（庚）初，總示萬法唯心*
　　    　：　　：　　：　　：　　：　　：　（辛）初，正示二本不離一心*
　　A054　：　　：　　：　　：　　：　　：　　：　（壬）初，當機申請
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，如來開示
　　A055　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，瑞表真常
　　A056　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示二本
　　    　：　　：　　：　　：　　：　　：　　：　次，委示心使不同妄執*
　　A058　：　　：　　：　　：　　：　　：　　：　（壬）初，重斥妄計非心
　　A060　：　　：　　：　　：　　：　　：　　：　　：　次，正示真心有體
　　A062　：　　：　　：　　：　　：　　：　　：　　：　三，委明分別無性
　　A063　：　　：　　：　　：　　：　　：　　：　　：　四，總斥從來誤執
　　    　：　　：　　：　　：　　：　　：　次，別就見精顯性*
　　A064　：　　：　　：　　：　　：　　：　（辛）初，領旨哀請
　　    　：　　：　　：　　：　　：　　：　　：　次，正垂開示*
　　A065　：　　：　　：　　：　　：　　：　　：　（壬）初，現瑞許說
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，正示見性*
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，直指見性是心非眼*
　　A066　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，以拳例見定其常情
　　A068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，引例破執正顯見性
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約客塵顯見性不動*
　　A070　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，默請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，徵名驗解
　　A071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，如來問
　　A072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，陳那答
　　A073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，佛印可
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，現相證成
　　A074　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，開合寶掌證成客與主義
　　A075　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，飛光動頭證成塵與空義
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結會責失
　　A076　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，結會
　　A077　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，責失
卷二    　：　　：　　：　　：　　：　　：　　：　　：　　：　三，約觀河顯見性無遷*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，請問
　　B001　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，阿難密請
　　B002　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，匿王顯請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，說示
　　B003　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，明身有變遷
　　B006　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明性無生滅
　　B008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，領悟
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　四，約垂手顯見性無滅*
　　B009　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示答
　　B010　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，順世立喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正以法合
　　B011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，直舉法合
　　B012　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，敕令諦觀
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，備明倒因
　　B013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，示無倒性
　　B014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示顛倒相
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　五，約標指顯見性無還*
　　B015　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，陳請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示
　　B016　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，以喻總明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，就體別簡
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，簡緣心可還如觀指影
　　B017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，近就音聲以明無性
　　B018　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣歷諸法分別以示可還
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示見性無還如天上月
　　B019　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，承責咨請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正示無還
　　B020　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，就月喻顯法體
　　B021　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，以可還顯不還
　　B022　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結不還是本心
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　六，約周遍顯見性非物*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，示無差別義
　　B023　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答
　　B024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，約迷悟明無差而差
　　B025　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約自他明差而無差
　　B026　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正明見性非物
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示無大小義
　　B027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　B028　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，破執
　　B030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，會通
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　七，約無是非是顯見性唯真*
　　B031　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，疑問
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，答釋
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，斥破是非兩途
　　B032　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，正破是見
　　B034　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，轉破非見
　　B035　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，大眾茫然
　　B036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，如來安慰
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，會通真性一理
　　B037　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，文殊述疑啟請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來垂慈示答
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，示妙體絕待
　　B038　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，正明絕待
　　B039　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，引列釋成
　　B040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，示迷悟得失
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　八，約外道世諦對簡顯見性非因緣自然*
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，對外道簡自然
　　B041　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，疑請
　　B042　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，開示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，對世諦簡因緣
　　B043　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，轉計
　　B044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結顯自性
　　B047　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，正示離過真體
　　B048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，結責滯著名相
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　九，約二妄合明顯見性非見*
　　B049　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，引昔致疑
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，對理徵破
　　B050　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直明昔說隨情
　　B051　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，重顯見性非緣
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，正示見性
　　B052　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，直示真性非見
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，騰疑細釋應作述迷細釋
　　B053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，阿難騰疑應作述迷啟請
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來細釋
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，訶誡許宣
　　B054　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，經家敘意
　　B055　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，如來誡許
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，合明二妄
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（辰）初，直示二妄
　　B056　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總標
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　B057　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，釋別業妄見
　　B061　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，釋同分妄見
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，進退合明
　　B062　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（巳）初，總示
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別明
　　B063　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（午）初，進別例同
　　B065　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，退同例別
　　B066　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，顯示歸真
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　十，破和合不和合餘疑顯見性離過絕非法爾現證*
　　B067　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，責迷
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，徵破
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（丑）初，破和合
　　B068　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，牒疑
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，正破
　　B069　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，破和
　　B070　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破合
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破非和合
　　B071　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（寅）初，轉計
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破斥
　　B072　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　（卯）初，破非和
　　B073　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，破非合
　　    　：　　：　　：　　：　　：　　：　三，遍歷陰入處界會理*
　　B074　：　　：　　：　　：　　：　　：　（辛）初，總示
　　    　：　　：　　：　　：　　：　　：　　：　次，別明*
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，明五陰性*
　　B075　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　B076　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明色陰即藏性
　　B080　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明受陰即藏性
　　B083　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明想陰即藏性
　　B086　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明行陰即藏性
　　B089　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明識陰即藏性
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，明六入性*
　　C001　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C002　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明眼入即藏性
　　C005　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳入即藏性
　　C008　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻入即藏性
　　C011　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌入即藏性
　　C014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身入即藏性
　　C017　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意入即用性
　　    　：　　：　　：　　：　　：　　：　　：　　：　三，明十二處性*
　　C020　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C021　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明色與見即藏性
　　C024　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明聽與聲即藏性
　　C027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明嗅與香即藏性
　　C030　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明嘗與味即藏性
　　C033　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身與觸即藏性
　　C036　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意與法即藏性
　　    　：　　：　　：　　：　　：　　：　　：　　：　四，明十八界性*
　　C039　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，總徵
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，別釋
　　C040　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明眼識界性
　　C044　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明耳識界即藏性
　　C048　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明鼻識界即藏性
　　C053　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　四，明舌識即藏性
　　C059　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　五，明身識界即藏性
　　C064　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　六，明意識界即藏性
　　    　：　　：　　：　　：　次，明性本具相*
　　C069　：　　：　　：　　：　（己）初，當機疑請
　　C070　：　　：　　：　　：　　：　次，訶誡許宣
　　    　：　　：　　：　　：　　：　三，正為開示*
　　    　：　　：　　：　　：　　：　（庚）初，牒疑說示*
　　C071　：　　：　　：　　：　　：　　：　（辛）初，就法破妄
　　C072　：　　：　　：　　：　　：　　：　　：　次，借喻顯理
　　    　：　　：　　：　　：　　：　　：　次，歷大別顯*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明藏性即地大*
　　C073　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C074　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性
　　C075　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　次，明藏性即火大性*
　　C076　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C079　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性
　　C080　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　三，明藏性即水大性*
　　C081　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C083　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性
　　C084　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　四，明藏性即風大性*
　　C085　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C087　：　　：　　：　　：　　：　　：　　：　　：　次，顯理性
　　C088　：　　：　　：　　：　　：　　：　　：　　：　三，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　五，明藏性即空大性*
　　C089　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C092　：　　：　　：　　：　　：　　：　　：　　：　次，明大均
　　C093　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性
　　C094　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　六，明藏性即根大* （當為「見大」）
　　C095　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C099　：　　：　　：　　：　　：　　：　　：　　：　次，明大均
　　C100　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性
　　C101　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑
　　    　：　　：　　：　　：　　：　　：　　：　七，明藏性即識大性*
　　C102　：　　：　　：　　：　　：　　：　　：　（壬）初，破妄執
　　C106　：　　：　　：　　：　　：　　：　　：　　：　次，明大均
　　C107　：　　：　　：　　：　　：　　：　　：　　：　三，顯理性
　　C108　：　　：　　：　　：　　：　　：　　：　　：　四，斥迷惑
　　    　：　　：　　：　四，大眾圓悟*
　　    　：　　：　　：　（戊）初，經家敘益
　　    　：　　：　　：　　：　（己）初，敘益
　　C109　：　　：　　：　　：　　：　（庚）初，略敘
　　    　：　　：　　：　　：　　：　　：　次，廣敘
　　    　：　　：　　：　　：　　：　　：　（辛）初，圓悟三大
　　C110　：　　：　　：　　：　　：　　：　　：　（壬）初，悟性量即相大
　　C111　：　　：　　：　　：　　：　　：　　：　　：　次，悟性體即體大
　　C112　：　　：　　：　　：　　：　　：　　：　　：　三，悟性具即用大
　　C113　：　　：　　：　　：　　：　　：　　：　次，結屬真因
　　C114　：　　：　　：　　：　　：　次，敘儀
　　    　：　　：　　：　　：　次，當機偈讚
　　    　：　　：　　：　　：　（己）初，讚嘆述益
　　C115　：　　：　　：　　：　　：　（庚）初，讚圓常人法
　　C116　：　　：　　：　　：　　：　　：　次，述所證淺深
　　    　：　　：　　：　　：　　：　次，誓願請加
　　C117　：　　：　　：　　：　　：　（庚）初，發大願
　　C118　：　　：　　：　　：　　：　　：　次，請佛加
　　C119　：　　：　　：　　：　　：　　：　三，喻不退
卷四    　：　　：　次，廣破餘疑*
　　    　：　　：　（丁）初，明事理性相本融*
　　    　：　　：　　：　（戊）初，疑請
　　D001　：　　：　　：　　：　（己）初，敘敬
　　    　：　　：　　：　　：　　：　次，嘆述
　　D002　：　　：　　：　　：　　：　（庚）初，嘆德
　　    　：　　：　　：　　：　　：　　：　次，述請
　　D003　：　　：　　：　　：　　：　　：　（辛）初，總述疑請
　　    　：　　：　　：　　：　　：　　：　　：　次，別述二難
　　D004　：　　：　　：　　：　　：　　：　　：　（壬）初，從陰入處界起理違事難
　　D005　：　　：　　：　　：　　：　　：　　：　　：　次，從七大起相違性難
　　D006　：　　：　　：　　：　　：　　：　　：　三，請佛開示
　　D007　：　　：　　：　　：　次，許宣
　　    　：　　：　　：　　：　三，正說*
　　    　：　　：　　：　　：　（己）初，答迷真起妄以釋理違事難*
　　    　：　　：　　：　　：　　：　（庚）初，總辨真覺*
　　D008　：　　：　　：　　：　　：　　：　（辛）初，直指覺性本來寂照*
　　D009　：　　：　　：　　：　　：　　：　　：　次，雙破覺非明與不明*
　　    　：　　：　　：　　：　　：　　：　次，別明迷悟*
　　    　：　　：　　：　　：　　：　　：　（辛）初，明眾生迷真成妄*
　　D010　：　　：　　：　　：　　：　　：　　：　（壬）初，明所起妄因
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，明所感妄果
　　D011　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，牒上略明
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，廣顯三種相續
　　D012　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明世界相續
　　D013　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明眾生相續之因
　　D014　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明業果相續
　　D015　：　　：　　：　　：　　：　　：　　：　　：　三，結果歸因
　　    　：　　：　　：　　：　　：　　：　　：　次，明諸佛悟妄唯真*
　　D016　：　　：　　：　　：　　：　　：　　：　（壬）初，領義起疑
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，舉喻答釋
　　D017　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，喻妄因妄果其體本真
　　D019　：　　：　　：　　：　　：　　：　　：　　：　　：　次，喻真智真斷不重起妄
　　    　：　　：　　：　　：　　：　次，答相隨性得以釋相違性難*
　　D020　：　　：　　：　　：　　：　（庚）初，牒問
　　    　：　　：　　：　　：　　：　　：　次，正答
　　D021　：　　：　　：　　：　　：　　：　（辛）初，舉喻
　　D022　：　　：　　：　　：　　：　　：　　：　次，法合
　　    　：　　：　　：　　：　　：　　：　　：　（壬）初，正合上喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，重明理性
　　D023　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，明不變隨緣用
　　    　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明隨緣不變體
　　D025　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，明隨緣不變如實空義
　　D027　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，明隨緣不變如實不空義
　　D029　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　三，明隨緣不變遮照同時義
　　D030　：　　：　　：　　：　　：　　：　　：　　：　　：　三，結責迷情
　　    　：　　：　　：　次，明迷悟因緣無性*
　　    　：　　：　　：　（戊）初，答滿慈重徵妄因*
　　D031　：　　：　　：　　：　（己）初，牒問
　　    　：　　：　　：　　：　　：　次，答
　　    　：　　：　　：　　：　　：　（庚）初，明妄本無因
　　D032　：　　：　　：　　：　　：　　：　（辛）初，立喻
　　D033　：　　：　　：　　：　　：　　：　　：　次，顯法
　　D034　：　　：　　：　　：　　：　　：　　：　三，結合
　　    　：　　：　　：　　：　　：　　：　次，明真亦無得
　　D035　：　　：　　：　　：　　：　　：　（辛）初，法說
　　D036　：　　：　　：　　：　　：　　：　　：　次，喻合
　　    　：　　：　　：　　：　次，答阿難再執妄緣*
　　D037　：　　：　　：　　：　（己）初，疑問
　　    　：　　：　　：　　：　　：　次，示答
　　    　：　　：　　：　　：　　：　（庚）初，破疑
　　    　：　　：　　：　　：　　：　　：　（辛）初，即喻推破
　　D038　：　　：　　：　　：　　：　　：　　：　（壬）初，立喻
　　    　：　　：　　：　　：　　：　　：　　：　　：　次，破二執
　　    　：　　：　　：　　：　　：　　：　　：　　：　（癸）初，正破二執
　　D039　：　　：　　：　　：　　：　　：　　：　　：　　：　（子）初，約頭破
　　D040　：　　：　　：　　：　　：　　：　　：　　：　　：　　：　次，約狂破
　　D041　：　　：　　：　　：　　：　　：　　：　　：　　：　次，悟本俱非
　　    　：　　：　　：　　：　　：　　：　　：　次，合法結顯
　　D042　：　　：　　：　　：　　：　　：　　：　（壬）初，直結法
　　D043　：　　：　　：　　：　　：　　：　　：　　：　次，重簡非
　　D045　：　　：　　：　　：　　：　　：　　：　　：　三，正指是
　　    　：　　：　　：　　：　　：　　：　次，誡勸
　　D046　：　　：　　：　　：　　：　　：　（辛）初，誡徒聞無功
　　D047　：　　：　　：　　：　　：　　：　　：　次，勸真修有益
// 正宗分之一竟。`;
