parts[6] =
`// 正宗分之六。
卷九    （乙）六，借無聞比丘為語端明五陰魔境*
　　    　：　（丙）初，正明禪境*
　　I019　：　　：　（丁）初，結前生後
　　I020　：　　：　　：　次，時眾佇誨
　　    　：　　：　　：　三，總別開示*
　　    　：　　：　　：　（戊）初，總明魔事之由*
　　I021　：　　：　　：　　：　（己）初，正明魔動之由
　　    　：　　：　　：　　：　　：　次，勸誡迷悟得失
　　I023　：　　：　　：　　：　　：　（庚）初，勸悟則成得
　　I024　：　　：　　：　　：　　：　　：　次，誡迷則成失
　　    　：　　：　　：　　：　次，別明境發之相*
　　    　：　　：　　：　　：　（己）初，明色陰*
　　    　：　　：　　：　　：　　：　（庚）初，總示陰相
　　I025　：　　：　　：　　：　　：　　：　（辛）初，牒示圓通正行
　　I026　：　　：　　：　　：　　：　　：　　：　次，正示色陰區宇
　　I027　：　　：　　：　　：　　：　　：　　：　三，懸示色陰盡相
　　I028　：　　：　　：　　：　　：　　：　　：　四，結示本惟妄想
　　    　：　　：　　：　　：　　：　　：　次，別明發相
　　I029　：　　：　　：　　：　　：　　：　（辛）初，精明外溢身能出礙
　　I030　：　　：　　：　　：　　：　　：　　：　次，精明內溢拾出蟯蛔
　　I031　：　　：　　：　　：　　：　　：　　：　三，精魄合離空中聞法
　　I032　：　　：　　：　　：　　：　　：　　：　四，心魂染悟現佛踞台
　　I033　：　　：　　：　　：　　：　　：　　：　五，精明逼現空成寶色
　　I034　：　　：　　：　　：　　：　　：　　：　六，心見密澄暗室睹物
　　I035　：　　：　　：　　：　　：　　：　　：　七，塵並入純燒斬無礙
　　I036　：　　：　　：　　：　　：　　：　　：　八，凝想化現遍見諸界
　　I037　：　　：　　：　　：　　：　　：　　：　九，逼心飛出夜見遠方
　　I038　：　　：　　：　　：　　：　　：　　：　十，邪心含魅妄見妄說
　　I039　：　　：　　：　　：　　：　　：　三，結過勸示
　　    　：　　：　　：　　：　　：　次，明受明境*
　　    　：　　：　　：　　：　　：　（庚）初，總示陰相
　　I040　：　　：　　：　　：　　：　　：　（辛）初，結前色陰盡相
　　I041　：　　：　　：　　：　　：　　：　　：　次，正示受陰區宇
　　I042　：　　：　　：　　：　　：　　：　　：　三，懸示受陰盡相
　　I043　：　　：　　：　　：　　：　　：　　：　四，結示本惟妄想
　　    　：　　：　　：　　：　　：　　：　次，別明發相
　　I044　：　　：　　：　　：　　：　　：　（辛）初，過抑生悲
　　I045　：　　：　　：　　：　　：　　：　　：　次，感激生勇
　　I046　：　　：　　：　　：　　：　　：　　：　三，智衰生憶
　　I047　：　　：　　：　　：　　：　　：　　：　四，慧勝成劣
　　I048　：　　：　　：　　：　　：　　：　　：　五，失守生憂
　　I049　：　　：　　：　　：　　：　　：　　：　六，慧劣成喜
　　I050　：　　：　　：　　：　　：　　：　　：　七，見勝成慢
　　I051　：　　：　　：　　：　　：　　：　　：　八，輕安自足
　　I052　：　　：　　：　　：　　：　　：　　：　九，空解成斷
　　I053　：　　：　　：　　：　　：　　：　　：　十，愛極成貪
　　I054　：　　：　　：　　：　　：　　：　三，結過勸示
　　    　：　　：　　：　　：　　：　三，明想陰境*
　　    　：　　：　　：　　：　　：　（庚）初，總示陰相
　　I055　：　　：　　：　　：　　：　　：　（辛）初，結前受陰盡相
　　I056　：　　：　　：　　：　　：　　：　　：　次，正示想陰區宇
　　I057　：　　：　　：　　：　　：　　：　　：　三，懸示想陰盡相
　　I058　：　　：　　：　　：　　：　　：　　：　四，結示本惟妄想
　　    　：　　：　　：　　：　　：　　：　次，別明發相
　　I059　：　　：　　：　　：　　：　　：　（辛）初，貪善巧想
　　I061　：　　：　　：　　：　　：　　：　　：　次，貪經歷想
　　I063　：　　：　　：　　：　　：　　：　　：　三，貪契合想
　　I065　：　　：　　：　　：　　：　　：　　：　四，貪辨析想
　　I067　：　　：　　：　　：　　：　　：　　：　五，貪冥感想
　　I069　：　　：　　：　　：　　：　　：　　：　六，貪靜謐想。此科應作貪求宿命想
　　I070　：　　：　　：　　：　　：　　：　　：　七，貪宿命想。應作貪靜謐想
　　I072　：　　：　　：　　：　　：　　：　　：　八，貪神通想
　　I074　：　　：　　：　　：　　：　　：　　：　九，貪深空想
　　I075　：　　：　　：　　：　　：　　：　　：　十，貪長壽想
　　    　：　　：　　：　　：　　：　　：　三，結過勸示
　　I077　：　　：　　：　　：　　：　　：　（辛）初，結十魔過惡
　　I079　：　　：　　：　　：　　：　　：　　：　次，結想陰所招
卷十    　：　　：　　：　　：　　：　四，明行陰境*
　　    　：　　：　　：　　：　　：　（庚）初，總示陰相
　　J001　：　　：　　：　　：　　：　　：　（辛）初，結前想陰盡相
　　J002　：　　：　　：　　：　　：　　：　　：　次，正示行陰區宇
　　J003　：　　：　　：　　：　　：　　：　　：　三，懸示行陰盡相
　　J004　：　　：　　：　　：　　：　　：　　：　四，結示本惟妄想
　　    　：　　：　　：　　：　　：　　：　次，別明發相
　　J005　：　　：　　：　　：　　：　　：　（辛）初，計二無因
　　J008　：　　：　　：　　：　　：　　：　　：　次，計四遍常
　　J013　：　　：　　：　　：　　：　　：　　：　三，計一分常
　　J019　：　　：　　：　　：　　：　　：　　：　四，計四有邊
　　J025　：　　：　　：　　：　　：　　：　　：　五，計矯亂論
　　J031　：　　：　　：　　：　　：　　：　　：　六，計十六有相
　　J033　：　　：　　：　　：　　：　　：　　：　七，計八無相
　　J035　：　　：　　：　　：　　：　　：　　：　八，計八俱非
　　J037　：　　：　　：　　：　　：　　：　　：　九，計七斷滅
　　J038　：　　：　　：　　：　　：　　：　　：　十，計五現涅槃
　　J039　：　　：　　：　　：　　：　　：　三，結過勸示
　　    　：　　：　　：　　：　　：　五，明識陰境*
　　    　：　　：　　：　　：　　：　（庚）初，總示陰相
　　J040　：　　：　　：　　：　　：　　：　（辛）初，結前行陰盡相
　　J041　：　　：　　：　　：　　：　　：　　：　次，正明識陰區宇
　　J042　：　　：　　：　　：　　：　　：　　：　三，懸示識陰盡相
　　J043　：　　：　　：　　：　　：　　：　　：　四，結示本惟妄想
　　    　：　　：　　：　　：　　：　　：　次，別明發相
　　J044　：　　：　　：　　：　　：　　：　（辛）初，因所因執
　　J045　：　　：　　：　　：　　：　　：　　：　次，能非能執
　　J046　：　　：　　：　　：　　：　　：　　：　三，常非常執
　　J047　：　　：　　：　　：　　：　　：　　：　四，知無知執
　　J048　：　　：　　：　　：　　：　　：　　：　五，生無生執
　　J049　：　　：　　：　　：　　：　　：　　：　六，歸無歸執
　　J050　：　　：　　：　　：　　：　　：　　：　七，貪非貪執
　　J051　：　　：　　：　　：　　：　　：　　：　八，真非真執
　　J052　：　　：　　：　　：　　：　　：　　：　九，定性聲聞
　　J053　：　　：　　：　　：　　：　　：　　：　十，定性緣覺
　　    　：　　：　　：　　：　　：　　：　三，斥邪結正
　　J054　：　　：　　：　　：　　：　　：　（辛）初，斥邪
　　J055　：　　：　　：　　：　　：　　：　　：　次，勸傳
　　J056　：　　：　　：　　：　　：　　：　　：　三，結正
　　J057　：　　：　　：　　：　三，勸示欽誨遵修
　　    　：　　：　次，更斷餘疑，此科從第九卷來*
　　    　：　　：　（丁）初，疑問
　　J058　：　　：　　：　（戊）初，領前法
　　    　：　　：　　：　　：　次，騰三問
　　J059　：　　：　　：　　：　（己）初，問陰本妄想
　　J060　：　　：　　：　　：　　：　次，問並銷次第
　　J061　：　　：　　：　　：　　：　三，問詣何為界
　　J062　：　　：　　：　　：　三，總請答
　　    　：　　：　　：　次，答釋
　　    　：　　：　　：　（戊）初，正答所問
　　    　：　　：　　：　　：　（己）初，廣答陰本妄想
　　J063　：　　：　　：　　：　　：　（庚）初，總明
　　    　：　　：　　：　　：　　：　　：　次，別示
　　J064　：　　：　　：　　：　　：　　：　（辛）初，明色陰惟是堅固妄想
　　J065　：　　：　　：　　：　　：　　：　　：　次，受陰惟是虛明妄想
　　J066　：　　：　　：　　：　　：　　：　　：　三，明想陰惟是融通妄想
　　J067　：　　：　　：　　：　　：　　：　　：　四，明行陰惟是幽隱妄想
　　J068　：　　：　　：　　：　　：　　：　　：　五，明識陰惟是顛倒妄想
　　J069　：　　：　　：　　：　　：　　：　三，結成
　　J070　：　　：　　：　　：　　：　次，超答詣何為界
　　J071　：　　：　　：　　：　　：　三，追答並銷次第
　　J072　：　　：　　：　　：　次，結勸傳示
// 正宗分之六竟。`;
