const parts = [];

parts[0] =
`// 全經科判。正宗分僅留標題，具體科判分列於各部。
　　    （甲）初，序分*
卷一    　：　（乙）初，通序*
　　A001　：　　：　（丙）初，標聞說時處
　　    　：　　：　　：　次，引大眾同聞
　　    　：　　：　　：　（丁）初，聲聞眾
　　A002　：　　：　　：　　：　（戊）初，示類標數
　　A003　：　　：　　：　　：　　：　次，顯位嘆德
　　A004　：　　：　　：　　：　　：　三，列上首名
　　A005　：　　：　　：　　：　次，緣覺眾
　　    　：　　：　　：　　：　三，菩薩眾
　　A006　：　　：　　：　　：　（戊）初，夏終時集
　　A007　：　　：　　：　　：　　：　次，聞音遠集
　　    　：　　：　次，別序*
　　    　：　　：　（丙）初，示墮因緣*
　　A008　：　　：　　：　（丁）初，佛僧應供
　　A009　：　　：　　：　　：　次，阿難等乞
　　A013　：　　：　　：　　：　三，婬室誤墮
　　    　：　　：　　：　次，神咒護攝*
　　A014　：　　：　　：　（丁）初，大悲鑒物恒不忘念
　　A015　：　　：　　：　　：　次，放光說咒表示密因
　　A016　：　　：　　：　　：　三，文殊往救破邪歸正
　　    　：　次，正宗分*
　　    　：　（乙）初，<a href="?part=1&terse=1">顯如來藏妙真如性圓三諦理</a>*
卷四    　：　　：　次，<a href="?part=2&terse=1">示不生滅為本修因妙三觀門</a>*
卷七    　：　　：　三，<a href="?part=3&terse=1">明正助合行所成伏斷圓三德位</a>*
卷八    　：　　：　四，<a href="?part=4&terse=1">結成經名以彰圓體圓宗圓用</a>*
　　    　：　　：　五，<a href="?part=5&terse=1">借破戒惡心為問端廣示七趣差別</a>*
卷九    　：　　：　六，<a href="?part=6&terse=1">借無聞比丘為語端明五陰魔境</a>*
　　    　：　三，流通分*
卷十    　：　（乙）初，如來嘆述*
　　J073　：　　：　（丙）初，明滅惡力用*
　　J075　：　　：　　：　次，明生善力用*
　　J076　：　　：　次，大眾歡喜*
// 全經科判竟。`
