var HaiRenVerses = // 海仁法師
`
A001: 如是我聞，一時佛在室羅筏城，祇桓精舍，
A002: 與大比丘眾千二百五十人俱，
A003: 皆是無漏大阿羅漢，佛子住持，善超諸有。能於國土，成就威儀，從佛轉輪，妙堪遺囑。嚴淨毗尼，弘範三界；應身無量，度脫眾生，拔濟未來，越諸塵累。
A004: 其名曰：大智舍利弗，摩訶目犍連，摩訶拘稀羅，富樓那彌多羅尼子，須菩提，優波尼沙陀等，而為上首。
A005: 復有無量辟支無學，並其初心，同來佛所。屬諸比丘，休夏自恣。
A006: 十方菩薩，咨決心疑；欽奉慈嚴，將求密義。即時如來，敷座宴安，為諸會中，宣示深奧；法筵清眾，得未曾有。
A007: 迦陵仙音，遍十方界，恒沙菩薩，來聚道場，文殊師利而為上首。
A008: 時波斯匿王，為其父王諱日營齋，請佛宮掖；自迎如來，廣設珍羞，無上妙味，兼復親延諸大菩薩。
      城中復有長者居士，同時飯僧，佇佛來應；佛敕文殊，分領菩薩及阿羅漢，應諸齋主。
A009: 唯有阿難，先受別請，遠遊未還，不遑僧次。既無上座，及阿闍黎。途中獨歸，其日無供。即時阿難，執持應器，於所遊城，次第循乞。
A010: 心中初求，最後檀越，以為齋主。無問淨穢，剎利尊姓，及旃陀羅。方行等慈，不擇微賤，發意圓成，一切眾生，無量功德。
A011: 阿難已知，如來世尊，訶須菩提，及大迦葉，為阿羅漢，心不均平。欽仰如來，開闡無遮，度諸疑謗。
A012: 經彼城隍，徐步郭門，嚴整威儀，肅恭齋法。
A013: 爾時阿難，因乞食次，經歷婬室，遭大幻術。摩登伽女，以娑毗迦羅先梵天咒，攝入婬席，婬躬撫摩，將毀戒體。
A014: 如來知彼婬術所加，齋畢旋歸。王及大臣、長者、居士，俱來隨佛，願聞法要。
A015: 於時世尊，頂放百寶無畏光明。光中出生千葉寶蓮；有佛化身，結跏趺坐，宣說神咒。
A016: 敕文殊師利，將咒往護；惡咒消滅，提將阿難及摩登伽，歸來佛所。
A017: 阿難見佛，頂禮悲泣，恨無始來，一向多聞，未全道力。殷勤啟請十方如來，得成菩提，妙奢摩他，三摩禪那，最初方便。
A018: 於時復有恒沙菩薩，及諸十方大阿羅漢、辟支佛等，俱願樂聞，退坐默然，承受聖旨。
A019: 佛告阿難，汝我同氣，情均天倫；當初發心，於我法中，見何勝相，頓捨世間深重恩愛。
A020: 阿難白佛，我見如來三十二相，勝妙殊絕，形體映徹，猶如琉璃。常自思惟，此相非是欲愛所生。何以故？
      欲氣麤濁，腥臊交遘，膿血雜亂，不能發生，勝淨妙明，紫金光聚。是以渴仰，從佛剃落。
A021: 佛言：善哉，阿難，汝等當知，一切眾生，從無始來，生死相續，皆由不知常住真心，性淨明體；用諸妄想，此想不真，故有輪轉。
A022: 汝今欲研無上菩提，真發明性，應當直心，酬我所問。十方如來同一道故，出離生死，皆以直心；心言直故，如是乃至終始地位，中間永無諸委曲相。
A023: 阿難，我今問汝：當汝發心，緣於如來三十二相，將何所見？誰為愛樂？阿難白佛言：世尊，如是愛樂，用我心目；
      由目觀見如來勝相，心生愛樂；故我發心，願捨生死。
A024: 佛告阿難，如汝所說，真所愛樂，因於心目。若不識知心目所在，則不能得降伏塵勞。
      譬如國王，為賊所侵，發兵討除，是兵要當知賊所在；使汝流轉，心目為咎。
A025: 吾今問汝，唯心與目，今何所在？阿難白佛言：世尊，一切世間十種異生，同將識心居在身內；縱觀如來青蓮華眼，亦在佛面。
      我今觀此浮根四塵，祇在我面；如是識心，實居身內。
A026: 佛告阿難，汝今現坐如來講堂，觀祇陀林，今何所在？世尊！此大重閣，清淨講堂，在給孤園；今祇陀林，實在堂外。阿難！汝今堂中，先何所見？
      世尊！我在堂中，先見如來，次觀大眾，如是外望，方矚林園。阿難，汝矚林園，因何有見？世尊！此大講堂，戶牖開豁，故我在堂，得遠瞻見。
A027: 爾時世尊，在大眾中，舒金色臂，摩阿難頂，告示阿難，及諸大眾：有三摩提，名大佛頂首楞嚴王，具足萬行。
      十方如來，一門超出妙莊嚴路。汝今諦聽。阿難頂禮，伏受慈旨。
A028: 佛告阿難：如汝所言，身在講堂，戶牖開豁，遠矚林園。亦有眾生，在此堂中，不見如來，見堂外者？
      阿難答言：世尊！在堂不見如來，能見林泉，無有是處。
A029: 阿難，汝亦如是。汝之心靈，一切明了。若汝現前，所明了心，實在身內，爾時先合，了知內身。頗有眾生，先見身中，後觀外物。
      縱不能見，心、肝、脾、胃，爪生、髮長、筋轉、脈搖，誠合明了，如何不知？必不內知，云何知外？是故應知，汝言覺了能知之心住在身內，無有是處。
A030: 阿難稽首而白佛言：我聞如來如是法音，悟知我心，實居身外。所以者何？譬如燈光，然於室中，是燈必能先照室內；從其室門，後及庭際。
      一切眾生，不見身中，獨見身外，亦如燈光，居在室外，不能照室。是義必明，將無所惑，同佛了義，得無妄耶？
A031: 佛告阿難：是諸比丘，適來從我室羅筏城，循乞搏食；歸祇陀林，我已宿齋。汝觀比丘，一人食時，諸人飽不？
      阿難答言：不也，世尊，何以故？是諸比丘，雖阿羅漢，軀命不同，云何一人能令眾飽？
A032: 佛告阿難：若汝覺了知見之心實在身外，身心相外，自不相干，則心所知，身不能覺；覺在身際，心不能知。我今示汝兜羅綿手，汝眼見時，心分別不？
      阿難答言：如是，世尊！佛告阿難：若相知者，云何在外？是故應知，汝言覺了能知之心住在身外，無有是處。
A033: 阿難白佛言：世尊！如佛所言，不見內故，不居身內；身心相知，不相離故，不在身外。我今思惟，知在一處。佛言：處今何在？
      阿難言：此了知心，既不知內，而能見外，如我思忖，潛伏根裏。猶如有人，取琉璃碗，合其兩眼，雖有物合，而不留礙；彼根隨見，隨即分別。
      然我覺了能知之心，不見內者，為在根故；分明矚外，無障礙者，潛根內故。
A034: 佛告阿難，如汝所言，潛根內者，猶如琉璃；彼人當以琉璃籠眼，當見山河，見琉璃不？如是，世尊！是人當以琉璃籠眼，實見琉璃。
A035: 佛告阿難，汝心若同琉璃合者，當見山河，何不見眼？若見眼者，眼即同境，不得成隨。若不能見，云何說言，此了知心潛在根內，如琉璃合？
      是故當知：汝言覺了能知之心潛伏根裏，如琉璃合，無有是處。
A036: 阿難白佛言：世尊！我今又作如是思惟：是眾生身，腑藏在中，竅穴居外。有藏則暗，有竅則明。
      今我對佛，開眼見明，名為見外；閉眼見暗，名為見內，是義云何？
A037: 佛告阿難：汝當閉眼見暗之時，此暗境界，為與眼對？為不對眼？若與眼對，暗在眼前，云何成內？
      若成內者，居暗室中，無日、月、燈，此室暗中，皆汝焦腑；若不對者，云何成見！
A038: 若離外見，內對所成，合眼見暗，名為身中。開眼見明，何不見面？若不見面，內對不成；見面若成，此了知心及與眼根乃在虛空，何成在內？
A039: 若在虛空，自非汝體，即應如來，今見汝面，亦是汝身。汝眼已知，身合非覺。
A040: 必汝執言，身眼兩覺，應有二知，即汝一身，應成兩佛。
A041: 是故當知，汝言見暗名見內者，無有是處。
A042: 阿難言：我常聞佛，開示四眾：由心生故，種種法生；由法生故，種種心生。我今思惟：即思惟體，實我心性。隨所合處，心則隨有，亦非內外中間三處。
A043: 佛告阿難：汝今說言，由法生故，種種心生；隨所合處，心隨有者。
A044: 是心無體，則無所合；若無有體，而能合者，則十九界，因七塵合，是義不然。
A045: 若有體者，如汝以手自挃其體，汝所知心，為復內出？為從外入？若復內出，還見身中；若從外來，先合見面。
      阿難言：見是其眼，心知非眼，為見非義。佛言：若眼能見，汝在室中，門能見不。則諸已死，尚有眼存，應皆見物；若見物者，云何名死？
A046: 阿難，又汝覺了能知之心，若必有體，為復一體？為有多體？今在汝身，為復遍體？為不遍體？
      若一體者，則汝以手挃一支時，四支應覺；若咸覺者，挃應無在；若挃有所，則汝一體，自不能成。若多體者，則成多人，何體為汝？
      若遍體者，同前所挃。若不遍者，當汝觸頭，亦觸其足，頭有所覺，足應無知，今汝不然。
A047: 是故應知，隨所合處心則隨有，無有是處。
A048: 阿難白佛言：世尊！我亦聞佛與文殊等諸法王子談實相時，世尊亦言，心不在內，亦不在外，如我思惟：內無所見，外不相知，內無知故，在內不成；
      身心相知，在外非義。今相知故，復內無見，當在中間。
A049: 佛言：汝言中間，中必不迷，非無所在。今汝推中，中何為在？為復在處？為當在身？若在身者，在邊非中，在中同內。
      若在處者，為有所表？為無所表？無表同無，表則無定。何以故？如人以表，表為中時，東看則西，南觀成北，表體既混，心應雜亂。
A050: 阿難言：我所說中，非此二種。如世尊言：眼色為緣，生於眼識；眼有分別，色塵無知，識生其中，則為心在。
A051: 佛言：汝心若在根塵之中，此之心體，為復兼二？為不兼二？若兼二者，物體雜亂，物非體知，成敵兩立，云何為中？
      兼二不成，非知不知，即無體性，中何為相？是故應知，當在中間，無有是處。
A052: 阿難白佛言：世尊！我昔見佛，與大目連、須菩提、富樓那、舍利弗，四大弟子，共轉法輪。
      常言：覺知分別心性，既不在內，亦不在外，不在中間，俱無所在，一切無著，名之為心。則我無著，名為心不？
A053: 佛告阿難：汝言覺知分別心性，俱無在者，世間虛空，水陸飛行，諸所物象，名為一切，汝不著者，為在為無？無則同於龜毛、兔角，云何不著？
      有不著者，不可名無。無相則無，非無則相，相有則在，云何無著？是故應知，一切無著名覺知心，無有是處。
A054: 爾時阿難，在大眾中，即從座起，偏袒右肩，右膝著地，合掌恭敬，而白佛言：我是如來最小之弟，蒙佛慈愛，雖今出家，猶恃憍憐，
      所以多聞，未得無漏；不能折伏娑毗羅咒，為彼所轉，溺於婬舍。當由不知，真際所詣！
      唯願世尊，大慈哀愍，開示我等，奢摩他路，令諸闡提，隳彌戾車。作是語已，五體投地。及諸大眾，傾渴翹佇，欽聞示誨。
A055: 爾時世尊，從其面門放種種光，其光晃耀，如百千日。普佛世界，六種震動。如是十方微塵國土，一時開現；佛之威神，令諸世界合成一界。
      其世界中，所有一切諸大菩薩，皆住本國，合掌承聽。
A056: 佛告阿難：一切眾生，從無始來，種種顛倒，業種自然，如惡叉聚。諸修行人，不能得成無上菩提，乃至別成聲聞、緣覺，
      及成外道、諸天魔王，及魔眷屬。皆由不知二種根本，錯亂修習。猶如煮沙，欲成嘉饌，縱經塵劫，終不能得。
A057: 云何二種？阿難，一者無始生死根本；則汝今者，與諸眾生，用攀緣心為自性者。
                      二者無始菩提涅槃，元清淨體；則汝今者，識精元明，能生諸緣，緣所遺者。
      由諸眾生遺此本明，雖終日行而不自覺，枉入諸趣。
A058: 阿難，汝今欲知奢摩他路，願出生死，今復問汝。即時如來，舉金色臂，屈五輪指，語阿難言：汝今見不？阿難言：見。佛言：汝何所見？
      阿難言：我見如來，舉臂屈指為光明拳，耀我心目。佛言：汝將誰見？阿難言：我與大眾同將眼見。
A059: 佛告阿難：汝今答我，如來屈指為光明拳，耀汝心目；汝目可見，以何為心，當我拳耀？
      阿難言；如來現今徵心所在，而我以心推窮尋逐，即能推者，我將為心。
      佛言：咄！阿難，此非汝心。阿難矍然！避座合掌，起立白佛：此非我心，當名何等？
      佛告阿難：此是前塵虛妄相想，惑汝真性；由汝無始，至於今生，認賊為子，失汝元常，故受輪轉。
A060: 阿難白佛言：世尊！我佛寵弟，心愛佛故，令我出家。我心何獨供養如來；乃至遍歷恒沙國土，承事諸佛及善知識，發大勇猛，
      行諸一切難行法事，皆用此心；縱令謗法，永退善根，亦因此心。若此發明不是心者，我乃無心，同諸土木。
      離此覺知，更無所有；云何如來說此非心？我實驚怖，兼此大眾，無不疑惑。惟垂大悲，開示未悟。
A061: 爾時世尊，開示阿難及諸大眾，欲令心入無生法忍。於師子座，摩阿難頂而告之言：如來常說諸法所生，唯心所現；一切因果，世界微塵，因心成體。
      阿難！若諸世界，一切所有，其中乃至草葉縷結，詰其根元，咸有體性，縱令虛空，亦有名貌。何況清淨妙淨明心，性一切心，而無自體？
A062: 若汝執吝分別覺觀，所了知性，必為心者；此心即應離諸一切色、香、味、觸，諸塵事業，別有全性。如汝今者，承聽我法，此則因聲，而有分別。
      縱滅一切見、聞、覺、知，內守幽閑，猶為法塵分別影事。我非敕汝執為非心，但汝於心微細揣摩，若離前塵有分別性，即真汝心。
      若分別性，離塵無體，斯則前塵，分別影事。塵非常住，若變滅時，此心則同龜毛兔角，則汝法身同於斷滅；其誰修證無生法忍？
      即時阿難，與諸大眾，默然自失！
A063: 佛告阿難，世間一切諸修學人，現前雖成九次第定，不得漏盡，成阿羅漢。皆由執此生死妄想，誤為真實。是故汝今雖得多聞，不成聖果。
A064: 阿難聞已，重復悲淚，五體投地，長跪合掌而白佛言：自我從佛發心出家，恃佛威神，常自思惟，無勞我修，將謂如來惠我三昧；
      不知身心本不相代，失我本心，雖身出家，心不入道；譬如窮子，捨父逃逝。今日乃知，雖有多聞，若不修行，與不聞等；如人說食，終不能飽。
      世尊！我等今者，二障所纏，良由不知寂常心性。惟願如來哀愍窮露，發妙明心，開我道眼。
A065: 即時如來，從胸卍字，涌出寶光，其光晃昱有百千色。十方微塵，普佛世界，一時周遍。遍灌十方所有寶剎諸如來頂，旋至阿難及諸大眾。
      告阿難言：吾今為汝建大法幢；亦令十方一切眾生，獲妙微密性淨明心，得清淨眼。
A066: 阿難，汝先答我見光明拳。此拳光明，因何所有？云何成拳？汝將誰見？
      阿難言：由佛全體，閻浮檀金，赩如寶山，清淨所生，故有光明；我實眼觀，五輪指端，屈握示人，故有拳相。
A067: 佛告阿難：如來今日實言告汝，諸有智者，要以譬喻，而得開悟。
      阿難，譬如我拳，若無我手，不成我拳；若無汝眼，不成汝見，以汝眼根，例我拳理，其義均不？
      阿難言：唯然，世尊！既無我眼，不成我見；以我眼根，例如來拳，事義相類。
A068: 佛告阿難：汝言相類，是義不然。何以故？如無手人，拳畢竟滅；彼無眼者，非見全無。所以者何？汝試於途詢問盲人，汝何所見？
      彼諸盲人必來答汝，我今眼前唯見黑暗，更無他矚；以是義觀，前塵自暗，見何虧損。阿難言：諸盲眼前唯睹黑暗，云何成見？
      佛告阿難：諸盲無眼唯睹黑暗，與有眼人處於暗室，二黑有別？為無有別？如是，世尊，此暗中人，與彼群盲，二黑較量，曾無有異。
A069: 阿難！若無眼人，全見前黑，忽得眼光，還於前塵見種種色，名眼見者；彼暗中人，全見前黑，忽獲燈光，亦於前塵見種種色，應名燈見。
      若燈見者，燈能有見，自不名燈。又則燈觀，何關汝事？是故當知，燈能顯色，如是見者，是眼非燈；眼能顯色，如是見性，是心非眼。
A070: 阿難雖復得聞是言，與諸大眾，口已默然，心未開悟；猶冀如來，慈音宣示。合掌清心，佇佛悲誨。
A071: 爾時世尊，舒兜羅綿網相光手，開五輪指，誨敕阿難，及諸大眾：我初成道，於鹿園中，為阿若多五比丘等及汝四眾言：一切眾生不成菩提及阿羅漢，
      皆由客塵煩惱所誤。汝等當時因何開悟，今成聖果？
A072: 時憍陳那起立白佛：我今長老，於大眾中獨得解名，因悟客塵二字成果。世尊！譬如行客，投寄旅亭，或宿或食；宿食事畢，俶裝前途，不遑安住。
      若實主人，自無攸往。如是思惟，不住名客，住名主人，以不住者，名為客義。又如新霽，清陽升天，光入隙中，發明空中，諸有塵相。
      塵質搖動，虛空寂然。如是思惟，澄寂名空，搖動名塵，以搖動者，名為塵義。
A073: 佛言：如是。
A074: 即時如來於大眾中，屈五輪指，屈已復開，開已又屈，謂阿難言：汝今何見？阿難言：我見如來百寶輪掌，眾中開合。
      佛告阿難：汝見我手眾中開合，為是我手有開有合？為復汝見，有開有合？阿難言：世尊寶手眾中開合，我見如來手自開合，非我見性，有開有合。
      佛言：誰動？誰靜？阿難言：佛手不住，而我見性，尚無有靜，誰為無住？佛言：如是。
A075: 如來於是從輪掌中飛一寶光在阿難右，即時阿難，回首右盼；又放一光在阿難左，阿難又則回首左盼。佛告阿難：汝頭今日，何因搖動？
      阿難言：我見如來出妙寶光，來我左右，故左右觀，頭自搖動。阿難，汝盼佛光，左右動頭，為汝頭動？為復見動？
      世尊！我頭自動，而我見性，尚無有止，誰為搖動？佛言：如是。
A076: 於是如來普告大眾：若復眾生，以搖動者，名之為塵；以不住者，名之為客。汝觀阿難，頭自動搖，見無所動。又汝觀我，手自開合，見無舒卷。
A077: 云何汝今以動為身？以動為境？從始洎終，念念生滅，遺失真性，顛倒行事。性心失真，認物為己，輪迴是中，自取流轉。

B001: 爾時阿難及諸大眾，聞佛示誨，身心泰然。念無始來失卻本心，妄認緣塵分別影事；今日開悟，如失乳兒忽遇慈母，合掌禮佛。
      願聞如來顯出身心、真妄虛實、現前生滅，與不生滅、二發明性。
B002: 時波斯匿王起立白佛：我昔未承諸佛誨敕；見迦旃延、毗羅胝子，咸言此身死後斷滅，名為涅槃。我雖值佛，今猶狐疑，云何發揮證知此心不生滅地？
      今此大眾、諸有漏者，咸皆願聞。
B003: 佛告大王：汝身現在，今復問汝：汝此肉身，為同金剛，常住不朽？為復變壞？世尊！我今此身，終從變滅。佛言：大王！汝未曾滅，云何知滅？
      世尊！我此無常變壞之身，雖未曾滅，我觀現前念念遷謝，新新不住，如火成灰，漸漸銷殞，殞亡不息，決知此身當從滅盡。佛言：如是。
B004: 大王！汝今生齡已從衰老，顏貌何如童子之時？世尊！我昔孩孺，膚腠潤澤；年至長成，血氣充滿；而今頹齡，迫於衰耄，
      形色枯悴，精神昏昧，髮白面皺，逮將不久，如何見比，充盛之時？
B005: 佛言大王：汝之形容應不頓朽。王言：世尊！變化密移，我誠不覺，寒暑遷流，漸至於此。何以故？
      我年二十，雖號年少，顏貌已老初十歲時；三十之年，又衰二十；於今六十，又過於二，觀五十時，宛然強壯。
      世尊！我見密移，雖此殞落，其間流易，且限十年；若復令我微細思惟，其變寧唯一紀二紀，實為年變。
      豈唯年變？亦兼月化；何直月化？兼又日遷。沈思諦觀，剎那剎那，念念之間，不得停住，故知我身，終從變滅。
B006: 佛告大王：汝見變化，遷改不停，悟知汝滅；亦於滅時，汝知身中，有不滅耶？波斯匿王，合掌白佛：我實不知。佛言：我今示汝，不生滅性。
      大王！汝年幾時，見恒河水？王言：我生三歲，慈母攜我，謁耆婆天，經過此流，爾時即知，是恒河水。
      佛言：大王！如汝所說，二十之時，衰於十歲，乃至六十，日月歲時，念念遷變，則汝三歲，見此河時，至年十三，其水云何？
      王言：如三歲時，宛然無異；乃至於今，年六十二，亦無有異。
B007: 佛言：汝今自傷髮白面皺，其面必定皺於童年。則汝今時觀此恒河，與昔童時觀河之見，有童耄不？王言：不也，世尊！
      佛言：大王！汝面雖皺，而此見精，性未曾皺。皺者為變，不皺非變，變者受滅，彼不變者，元無生滅，云何於中，受汝生死？
      而猶引彼末伽黎等，都言此身死後全滅。
B008: 王聞是言，信知身後捨生趣生；與諸大眾踊躍歡喜，得未曾有！
B009: 阿難即從座起，禮佛合掌，長跪白佛：世尊！若此見聞，必不生滅；云何世尊名我等輩遺失真性、顛倒行事？願興慈悲，洗我塵垢。
B010: 即時如來，垂金色臂，輪手下指，示阿難言：汝今見我，母陀羅手，為正為倒？阿難言：世間眾生以此為倒，而我不知誰正誰倒。
      佛告阿難：若世間人以此為倒，即世間人將何為正？阿難言：如來豎臂，兜羅綿手，上指於空，則名為正。
      佛即豎臂，告阿難言：若此顛倒，首尾相換，諸世間人，一倍瞻視！
B011: 則知汝身，與諸如來，清淨法身，比類發明。如來之身，名正遍知；汝等之身，號性顛倒。
B012: 隨汝諦觀，汝身佛身，稱顛倒者，名字何處號為顛倒？於時阿難與諸大眾，瞪瞢瞻佛，目睛不瞬，不知身心顛倒所在。
B013: 佛興慈悲，哀愍阿難及諸大眾，發海潮音，遍告同會：諸善男子，我常說言，色心諸緣及心所使，諸所緣法，唯心所現。
      汝身汝心皆是妙明，真精妙心中所現物。
B014: 云何汝等遺失本妙、圓妙明心、寶明妙性，認悟中迷？晦昧為空，空晦暗中，結暗為色；色雜妄想，想相為身。
      聚緣內搖，趣外奔逸，昏擾擾相，以為心性。一迷為心，決定惑為色身之內。不知色身，外洎山河，虛空大地，咸是妙明真心中物。
      譬如澄清百千大海，棄之，惟認一浮漚體，目為全潮，窮盡瀛渤。汝等即是迷中倍人，如我垂手，等無差別，如來說為可憐愍者。
B015: 阿難承佛悲救深誨，垂泣叉手，而白佛言：我雖承佛如是妙音，悟妙明心，元所圓滿常住心地。而我悟佛現說法音，現以緣心，允所瞻仰。
      徒獲此心，未敢認為本元心地。願佛哀愍，宣示圓音，拔我疑根，歸無上道。
B016: 佛告阿難，汝等尚以緣心聽法，此法亦緣，非得法性。如人以手指月示人，彼人因指，當應看月。若復觀指，以為月體；此人豈唯亡失月輪，亦亡其指。
      何以故？以所標指，為明月故。豈唯亡指，亦復不識明之與暗，何以故？即以指體為月明性，明暗二性無所了故。汝亦如是！
B017: 若以分別我說法音，為汝心者；此心自應離分別音，有分別性。譬如有客，寄宿旅亭，暫止便去，終不常住；而掌亭人，都無所去，名為亭主。
      此亦如是，若真汝心，則無所去，云何離聲無分別性？
B018: 斯則豈唯聲分別心，分別我容，離諸色相，無分別性。如是乃至分別都無，非色非空，拘捨離等昧為冥諦。
      離諸法緣無分別性。則汝心性各有所還，云何為主？
B019: 阿難言：若我心性各有所還；則如來說妙明元心，云何無還？惟垂哀愍，為我宣說。
B020: 佛告阿難：且汝見我，見精明元，此見雖非妙精明心，如第二月，非是月影。
B021: 汝應諦聽，今當示汝無所還地。阿難！此大講堂洞開，東方日輪升天，則有明耀；中夜黑月，雲霧晦暝，則復昏暗。
      戶牖之隙，則復見通；牆宇之間，則復觀壅。分別之處，則復見緣；頑虛之中，遍是空性。鬱孛之象，則紆昏塵；澄霽斂氛，又觀清淨。
      阿難，汝咸看此諸變化相，吾今各還本所因處。云何本因？阿難！此諸變化，明還日輪；何以故？
      無日不明，明因屬日，是故還日。暗還黑月，通還戶牖，壅還牆宇，緣還分別，頑虛還空，鬱孛還塵，清明還霽。
      則諸世間一切所有，不出斯類。汝見八種見精明性，當欲誰還？何以故？若還於明，則不明時，無復見暗；雖明暗等，種種差別，見無差別。
B022: 諸可還者，自然非汝；不汝還者，非汝而誰？則知汝心，本妙明淨；汝自迷悶，喪本受淪。於生死中常被漂溺，是故如來名可憐愍！
B023: 阿難言：我雖識此見性無還，云何得知，是我真性？
B024: 佛告阿難：吾今問汝，今汝未得無漏清淨，承佛神力見於初禪，得無障礙；而阿那律見閻浮提，如觀掌中菴摩羅果。
      諸菩薩等見百千界；十方如來，窮盡微塵，清淨國土，無所不矚；眾生洞視，不過分寸。
B025: 阿難！且吾與汝，觀四天王所住宮殿，中間遍覽，水陸空行，雖有昏明，種種形像，無非前塵分別留礙。汝應於此分別自他，今吾將汝擇於見中，
      誰是我體？誰為物象？阿難極汝見源，從日月宮，是物非汝；至七金山，周遍諦觀，雖種種光，亦物非汝；漸漸更觀，雲騰鳥飛，風動塵起，樹木山川，
      草芥人畜，咸物非汝。阿難！是諸近遠，諸有物性，雖復差殊，同汝見精，清淨所矚。則諸物類自有差別；見性無殊，此精妙明，誠汝見性。
B026: 若見是物，則汝亦可見吾之見？若同見者，名為見吾；吾不見時，何不見吾不見之處？
      若見不見，自然非彼不見之相；若不見吾不見之地，自然非物，云何非汝？又則汝今見物之時，汝既見物，物亦見汝。
      體性紛雜，則汝與我，並諸世間，不成安立。阿難！若汝見時，是汝非我；見性周遍，非汝而誰？云何自疑，汝之真性；性汝不真，取我求實？
B027: 阿難白佛言：世尊！若此見性必我非餘；我與如來，觀四天王勝藏寶殿，居日月宮，此見周圓遍娑婆國，退歸精舍，祇見伽藍，清心戶堂，但瞻簷廡。
      世尊！此見如是，其體本來周遍一界，今在室中，唯滿一室？為復此見，縮大為小？為當牆宇夾令斷絕？我今不知斯義所在，願垂弘慈，為我敷演。
B028: 佛告阿難：一切世間，大小內外，諸所事業，各屬前塵。不應說言，見有舒縮。譬如方器，中見方空。
      吾復問汝：此方器中，所見方空，為復定方，為不定方。若定方者，別安圓器，空應不圓；若不定者，在方器中應無方空。
      汝言：不知斯義所在，義性如是，云何為在？
B029: 阿難，若復欲令入無方圓，但除器方，空體無方。不應說言，更除虛空方相所在。
      若如汝問，入室之時，縮見令小；仰觀日時，汝豈挽見，齊於日面；若築牆宇，能夾見斷；穿為小竇，寧無續跡？是義不然。
B030: 一切眾生從無始來，迷己為物，失於本心，為物所轉；故於是中觀大觀小。若能轉物，則同如來。身心圓明，不動道場；於一毛端，遍能含受十方國土。
B031: 阿難白佛言：世尊！若此見精，必我妙性，今此妙性，現在我前。見必我真；我今身心，復是何物？而今身心，分別有實；彼見無別，分辨我身。
      若實我心，令我今見；見性實我，而身非我？何殊如來先所難言：物能見我。惟垂大慈，開發未悟。
B032: 佛告阿難：今汝所言，見在汝前，是義非實。若實汝前，汝實見者，則此見精，既有方所，非無指示。
      且今與汝，坐祇陀林，遍觀林渠，及與殿堂，上至日月，前對恒河，汝今於我師子座前，舉手指陳是種種相：
      陰者是林，明者是日，礙者是壁，通者是空，如是乃至草樹纖毫，大小雖殊，但可有形，無不指著。若必其見，現在汝前，汝應以手確實指陳，何者是見？
      阿難當知：若空是見，既已成見，何者是空；若物是見，既已是見，何者為物？汝可微細披剝萬象，析出精明，淨妙見元，指陳示我。同彼諸物，分明無惑。
B033: 阿難言：我今於此重閣講堂，遠洎恒河，上觀日月，舉手所指，縱目所觀，指皆是物，無是見者。
      世尊！如佛所說，況我有漏初學聲聞，乃至菩薩，亦不能於萬物象前，剖出精見，離一切物，別有自性。佛言：如是！如是！
B034: 佛復告阿難：如汝所言，無有見精，離一切物，別有自性；則汝所指，是物之中，無是見者。
      今復告汝：汝與如來坐祇陀林，更觀林苑，乃至日月，種種象殊，必無見精受汝所指；汝又發明，此諸物中何者非見？
      阿難言：我實遍見此祇陀林，不知是中何者非見。何以故？若樹非見，云何見樹？若樹即見，復云何樹？如是乃至，若空非見，云何見空？
      若空即見，復云何空？我又思惟：是萬象中，微細發明，無非見者。佛言：如是！如是！
B035: 於是大眾非無學者，聞佛此言，茫然不知是義終始。一時惶悚，失其所守。
B036: 如來知其魂慮變懾，心生憐愍，安慰阿難及諸大眾：諸善男子，無上法王，是真實語，如所如說，不誑不妄。
      非末伽黎，四種不死，矯亂論議。汝諦思惟，無忝哀慕。
B037: 是時文殊師利法王子，愍諸四眾，在大眾中，即從座起，頂禮佛足，合掌恭敬，而白佛言：世尊！此諸大眾，不悟如來，發明二種精見色空，是、非是義。
      世尊！若此前緣，色空等象，若是見者，應有所指；若非見者，應無所矚。而今不知，是義所歸，故有驚怖！非是疇昔，善根輕鮮。
      惟願如來，大慈發明，此諸物象，與此見精，元是何物？於其中間，無是、非是？
B038: 佛告文殊及諸大眾：十方如來及大菩薩，於其自住三摩地中，見與見緣，並所想相，如虛空華，本無所有。
      此見及緣，元是菩提，妙淨明體，云何於中，有是、非是？
B039: 文殊，吾今問汝：如汝文殊，更有文殊，是文殊者，為無文殊？如是世尊！我真文殊，無是文殊。何以故？若有是者，則二文殊。然我今日，非無文殊。
      於中實無是非二相。佛言：此見妙明，與諸空塵，亦復如是。本是妙明，無上菩提，淨圓真心，妄為色空及與聞見。如第二月，誰為是月？又誰非月？
      文殊，但一月真，中間自無是月、非月。
B040: 是以汝今觀見與塵，種種發明，名為妄想，不能於中出是、非是。由是真精妙覺明性，故能令汝出指、非指。
B041: 阿難白佛言：世尊！誠如法王所說，覺緣遍十方界，湛然常住，性非生滅。
      與先梵志、娑毗迦羅，所談冥諦，及投灰等諸外道種說有真我、遍滿十方，有何差別？
      世尊亦曾於楞伽山，為大慧等敷演斯義：彼外道等常說自然，我說因緣，非彼境界。
      我今觀此：覺性自然，非生非滅，遠離一切虛妄顛倒，似非因緣，與彼自然；云何開示，不入群邪，獲真實心，妙覺明性？
B042: 佛告阿難：我今如是開示方便，真實告汝，汝猶未悟，惑為自然！阿難！若必自然，自須甄明有自然體。汝且觀此妙明見中，以何為自。
      此見為復以明為自？以暗為自？以空為自？以塞為自？
      阿難！若明為自，應不見暗；若復以空為自體者，應不見塞；如是乃至諸暗等相以為自者，則於明時，見性斷滅，云何見明？
B043: 阿難言：必此妙見，性非自然；我今發明，是因緣生。心猶未明，咨詢如來，是義云何，合因緣性？
B044: 佛言：汝言因緣，吾復問汝；汝今因見，見性現前；此見為復因明有見？因暗有見？因空有見？因塞有見？
B045: 阿難！若因明有，應不見暗；如因暗有，應不見明；如是乃至因空因塞，同於明暗。
B046: 復次，阿難！此見又復緣明有見？緣暗有見？緣空有見？緣塞有見？
      阿難！若緣空有，應不見塞；若緣塞有，應不見空；如是乃至緣明緣暗，同於空塞。
B047: 當知如是精覺妙明，非因非緣，亦非自然；非不自然，無非不非，無是非是。離一切相，即一切法。
B048: 汝今云何，於中措心，以諸世間，戲論名相而得分別？如以手掌撮摩虛空；祇益自勞，虛空云何隨汝執捉？
B049: 阿難白佛言：世尊！必妙覺性，非因非緣，世尊云何常與比丘宣說：見性具四種緣？所謂因空、因明、因心、因眼，是義云何？
B050: 佛言：阿難！我說世間諸因緣相，非第一義。
B051: 阿難！吾復問汝：諸世間人說我能見，云何名見？云何不見？阿難言：世人因於日、月、燈光，見種種相，名之為見；若復無此三種光明，則不能見。
      阿難！若無明時，名不見者，應不見暗！若必見暗，此但無明，云何無見？
      阿難！若在暗時，不見明故，名為不見；今在明時，不見暗相，還名不見！如是二相，俱名不見。
      若復二相，自相陵奪，非汝見性，於中暫無；如是則知，二俱名見，云何不見？
B052: 是故阿難！汝今當知：見明之時，見非是明；見暗之時，見非是暗；見空之時，見非是空；見塞之時，見非是塞。四義成就！
      汝復應知：見見之時，見非是見，見猶離見，見不能及。云何復說因綠、自然，及和合相？汝等聲聞，狹劣無識，不能通達清淨實相。
      吾今誨汝，當善思惟，無得疲怠妙菩提路。
B053: 阿難白佛言：世尊，如佛世尊為我等輩宣說因緣及與自然、諸和合相與不和合，心猶未開；而今更聞見見非見，重增迷悶。
      伏願弘慈施大慧目，開示我等，覺心明淨。作是語已，悲淚頂禮，承受聖旨。
B054: 爾時世尊憐愍阿難及諸大眾，將欲敷演大陀羅尼、諸三摩提、妙修行路。
B055: 告阿難言：汝雖強記，但益多聞；於奢摩他微密觀照，心猶未了。汝今諦聽，吾當為汝分別開示；亦令將來諸有漏者獲菩提果。
B056: 阿難，一切眾生輪轉世間，由二顛倒，分別見妄，當處發生，當業輪轉。云何二見，一者眾生別業妄見，二者眾生同分妄見。
B057: 云何名為別業妄見，阿難，如世間人，目有赤眚，夜見燈光，別有圓影，五色重疊。
B058: 於意云何，此夜燈明所現圓光，為是燈色？為當見色？阿難，此若燈色，則非眚人，何不同見，而此圓影，唯眚之觀。
      若是見色，見已成色，則彼眚人，見圓影者，名為何等。
B059: 復次阿難，若此圓影，離燈別有，則合傍觀，屏帳幾筵，有圓影出。離見別有，應非眼矚，云何眚人，目見圓影。
B060: 是故當知，色實在燈，見病為影；影見俱眚，見眚非病。終不應言，是燈是見，於是中有，非燈非見。
      如第二月，非體非影；何以故？第二之觀，捏所成故。諸有智者，不應說言，此捏根元，是形非形，離見非見。
      此亦如是，目眚所成，今欲名誰，是燈是見；何況分別，非燈非見。
B061: 云何名為同分妄見？阿難，此閻浮提除大海水，中間平陸，有三千洲。正中大洲，東西括量，大國凡有二千三百，其餘小洲在諸海中，其間或有三兩百國，
      或一或二、至於三十、四十、五十。阿難，若復此中，有一小洲，祇有兩國，唯一國人，同感惡緣，則彼小洲當土眾生，睹諸一切不祥境界。
      或見二日，或見兩月，其中乃至暈適珮玦，彗孛飛流，負耳虹霓，種種惡相。但此國見，彼國眾生，本所不見，亦復不聞。
B062: 阿難，吾今為汝以此二事，進退合明。
B063: 阿難，如彼眾生，別業妄見，矚燈光中所現圓影，雖現似境，終彼見者，目眚所成。眚即見勞，非色所造；然見眚者，終無見咎。
B064: 例汝今日，以目觀見山河國土及諸眾生，皆是無始見病所成。見與見緣，似現前境，元我覺明。見所緣眚，覺見即眚；本覺明心，覺緣非眚。
      覺所覺眚，覺非眚中。此實見見，云何復名覺聞知見？是故汝今見我及汝，並諸世間十類眾生，皆即見眚，非見眚者；彼見真精，性非眚者，故不名見。
B065: 阿難，如彼眾生同分妄見，例彼妄見別業一人，一病目人，同彼一國。
      彼見圓影，眚妄所生；此眾同分，所見不祥，同見業中，瘴惡所起；俱是無始，見妄所生。
      例閻浮提，三千洲中，兼四大海，娑婆世界，並洎十方諸有漏國，及諸家眾生，同是覺明無漏妙心，見聞覺知，虛妄病緣。和合妄生，和合妄死。
B066: 若能遠離諸和合緣及不和合，則復滅除諸生死因，圓滿菩提，不生滅性；清淨本心，本覺常住。
B067: 阿難，汝雖先悟本覺妙明，性非因緣，非自然性；而猶未明如是覺元，非和合生及不和合。
B068: 阿難，吾今復以前塵問汝，汝今猶以一切世間妄想、和合諸因緣性而自疑惑，證菩提心，和合起者。
B069: 則汝今者妙淨見精，為與明和？為與暗和？為與通和？為與塞和？若明和者，且汝觀明，當明現前，何處雜見？見相可辨，雜何形像？
      若非見者，云何見明？若即見者，云何見見？必見圓滿，何處和明？若明圓滿，不合見和。
      見必異明，雜則失彼性明名字，雜失明性，和明非義。彼暗與通，及諸群塞，亦復如是。
B070: 復次阿難，又汝今者妙淨見精，為與明合？為與暗合？為與通合？為與塞合？若明合者，至於暗時，明相已滅，此見即不與諸暗合，云何見暗？
      若見暗時，不與暗合，與明合者，應非見明。既不見明，云何明合，了明非暗？彼暗與通，及諸群塞，亦復如是。
B071: 阿難白佛言，世尊，如我思惟，此妙覺元，與諸緣塵及心念慮，非和合耶？
B072: 佛言，汝今又言覺非和合。吾復問汝，此妙見精，非和合者，為非明和？為非暗和？為非通和？為非塞和？若非明和，則見與明，必有邊畔。
      汝且諦觀，何處是明？何處是見？在見在明，自何為畔？阿難，若明際中，必無見者，則不相及，自不知其明相所在，畔云何成？
      彼暗與通，及諸群塞，亦復如是。
B073: 又妙見精，非和合者，為非明合？為非暗合？為非通合？為非塞合？若非明合，則見與明，性相乖角；如耳與明，了不相觸。
      見且不知，明相所在，云何甄明，合非合理？彼暗與明，及諸群塞，亦復如是。
B074: 阿難，汝猶未明一切浮塵諸幻化相，當處出生，隨處滅盡，幻妄稱相；其性真為，妙覺明體。
      如是乃至五陰六入，從十二處，至十八界。因緣和合，虛妄有生。因緣別離，虛妄名滅。
      殊不能知，生滅去來，本如來藏，常住妙明，不動周圓，妙真如性。性真常中，求於去來迷悟生死，了無所得。
B075: 阿難，云何五陰本如來藏，妙真如性？
B076: 阿難，譬如有人以清淨目觀晴明空；唯一晴虛，迥無所有。
      其人無故不動目睛，瞪以發勞，則於虛空別見狂華，復有一切狂亂非相，色陰當知，亦復如是。
B077: 阿難，是諸狂華，非從空來，非從目出。如是阿難，若空來者，既從空來，還從空入；若有出入，即非虛空。
      空若非空，自不容其華相起滅，如阿難體，不容阿難。
B078: 若目出者，既從目出，還從目入；即此華性，從目出故，當合有見。若有見者，去既華空，旋合見眼？
      若無見者，出既翳空，旋當翳眼。又見華時，目應無翳，云何晴空，號清淨眼？
B079: 是故當知，色陰虛妄，本非因緣，非自然性。
B080: 阿難，譬如有人，手足宴安，百骸調適，忽如忘生，性無違順。其人無故以二手掌於空相摩；於二手中，妄生澀滑冷熱諸相，受陰當知，亦復如是。
B081: 阿難，是諸幻觸不從空來，不從掌出。如是阿難，若空來者，既能觸掌，何不觸身？不應虛空，選擇來觸。若從掌出，應非待合；
      又掌出故，合則掌知，離則觸入，臂腕骨髓，應亦覺知入時蹤跡。必有覺心，知出知入，自有一物，身中往來，何待合知，要名為觸？
B082: 是故當知，受陰虛妄，本非因緣，非自然性。
B083: 阿難，譬喻有人談說酢梅，口中水出；思蹋懸崖，足心酸澀。想陰當知，亦復如是。
B084: 阿難，如是酢說，不從梅生，非從口入。如是阿難，若梅生者，梅合自談，何待人說？若從口入，自合口聞，何須待耳？
      若獨耳聞，此水何不耳中而出？思蹋懸崖，與說相類。
B085: 是故當知，想陰虛妄，本非因緣，非自然性。
B086: 阿難，譬如暴流，波浪相續，前際後際，不相逾越，行陰當知，亦復如是。
B087: 阿難，如是流性，不因空生，不因水有，亦非水性，非離空水。如是阿難，若因空生，則諸十方，無盡虛空，成無盡流；世界自然，俱受淪溺。
      若因水有，則此暴流，性應非水，有所有相，今應現在。若即水性，則澄清時，應非水體；若離空水，空非有外，水外無流。
B088: 是故當知，行陰虛妄，本非因緣，非自然性。
B089: 阿難，譬如有人取頻伽瓶，塞其兩孔，滿中擎空；千里遠行，用餉他國。識陰當知，亦復如是。
B090: 阿難，如是虛空，非彼方來，非此方入。如是阿難，若彼方來，則本瓶中既貯空去，於本瓶地，應少虛空；若此方入，開孔倒瓶，應見空出。
B091: 是故當知，識陰虛妄，本非因緣，非自然性。

C001: 復次阿難，云何六入本如來藏妙真如性？
C002: 阿難，即彼目睛，瞪發勞者；兼目與勞，同是菩提，瞪發勞相。因於明暗二種妄塵，發見居中，吸取塵象，名為見性。
C003: 此見離彼明暗二塵，畢竟無體。如是阿難，當知是見，非明暗來，非於根出，不於空生。何以故？若從明來，暗即隨滅，應非見暗；
      若從暗來，明即隨滅，應無見明；若從根生，必無明暗，如是見精，本無自性；若於空出，前矚塵象，歸當見根；又空自觀，何關汝入？
C004: 是故當知，眼入虛妄，本非因緣，非自然性。
C005: 阿難，譬如有人，以兩手指，急塞其耳；耳根勞故，頭中作聲。兼耳與勞，同是菩提，瞪發勞相。因於動靜二種妄塵，發聞居中，吸此塵象，名聽聞性。
C006: 此聞離彼動靜二塵，畢竟無體。如是阿難，當知是聞，非動靜來，非於根出，不於空生。何以故？若從靜來，動即隨滅，應非聞動。
      若從動來，靜即隨滅，應無覺靜。若從根生，必無動靜，如是聞體本無自性。若於空出，有聞成性，即非虛空；又空自聞，何關汝入？
C007: 是故當知，耳入虛妄，本非因緣，非自然性。
C008: 阿難，譬喻有人，急畜其鼻，畜久成勞，則於鼻中，聞有冷觸。因觸分別，通塞虛實，如是乃至，諸香臭氣。兼鼻與勞，同是菩提，瞪發勞相。
      因於通塞二種妄塵，發聞居中，吸取塵象，名嗅聞性。
C009: 此聞離彼通塞二塵，畢竟無體。當知是聞，非通塞來，非於根出，不於空生。何以故？若從通來，塞則聞滅，云何知塞？
      如因塞有，通則無聞，云何發明，香臭等觸？若從根生，必無通塞；如是聞機，本無自性。若從空出，是聞自當回嗅汝鼻；空自有聞，何關汝入？
C010: 是故當知，鼻入虛妄，本非因緣，非自然性。
C011: 阿難，譬如有人，以舌舐吻，熟舐令勞。其人若病，則有苦味；無病之人，微有甜觸。由甜與苦，顯此舌根，不動之時，淡性常在。
      兼舌與勞，同是菩提，瞪發勞相。因甜苦淡，二種妄塵，發知居中，吸此塵象，名知味性。
C012: 此知味性，離彼甜苦及淡二塵，畢竟無體。如是阿難，當知如是嘗苦淡知，非甜苦來，非因淡有，又非根出，不於空生。
      何以故，若甜苦來，淡則知滅，云何知淡？若從淡出，甜即知亡，復云何知，甜苦二相？若從舌生，必無甜淡，及與苦塵，斯知味根，本無自性。
      若於空出，虛空自味，非汝口知。又空自知，何關汝入？
C013: 是故當知，舌入虛妄，本非因緣，非自然性。
C014: 阿難譬如有人，以一冷手，觸於熱手，若冷勢多，熱者從冷；若熱功勝，冷者成熱。如是以此合覺之觸，顯於離知，涉勢若成，因於勞觸；
      兼身與勞，同是菩提，瞪發勞相。因於離合二種妄塵，發覺居中，吸此塵象，名知覺性。
C015: 此知覺體，離彼離合，違順二塵，畢竟無體。如是阿難，當知是覺，非離合來；非違順有；不於根出；又非空生。何以故？
      若合時來，離當已滅，云何覺離？違順二相，亦復如是。若從根出，必無離合違順四相；則汝身知，元無自性。必於空生，空自知覺，何關汝入？
C016: 是故當知，身入虛妄，本非因緣，非自然性。
C017: 阿難，譬如有人，勞倦則眠，睡熟便寤；覽塵斯憶，失憶為忘；是其顛倒，生住異滅，吸習中歸，不相逾越，稱意知根。
      兼意與勞，同是菩提，瞪發勞相。因於生滅，二種妄塵，集知居中；吸撮內塵，見聞逆流，流不及地，名覺知性。
C018: 此覺知性，離彼寤寐生滅二塵，畢竟無體。如是阿難，當知如是覺知之根，非寤寐來，非生滅有，不於根出，亦非空生。
      何以故？若從寤來，寐即隨滅，將何為寐？必生時有，滅即同無，令誰受滅？若從滅有，生即滅無，誰知生者？
      若從根出，寤寐二相，隨身開合，離斯二體，此覺知者，同於空華，畢竟無性。若從空生，自是空知，何關汝入？
C019: 是故當知，意入虛妄，本非因緣，非自然性。
C020: 復次阿難，云何十二處，本如來藏妙真如性？
C021: 阿難，汝且觀此祇陀樹林，及諸泉池。
C022: 於意云何？此等為是，色生眼見？眼生色相？阿難，若復眼根生色相者，見空非色，色性應銷，銷則顯發一切都無；色相既無，誰明空質？
      空亦如是。若復色塵，生眼見者，觀空非色，見即銷亡；亡則都無，誰明空色？是故當知，見與色空，俱無處所。
C023: 即色與見，二處虛妄；本非因緣，非自然性。
C024: 阿難，汝更聽此，祇陀園中，食辦擊鼓，眾集撞鐘，鐘鼓音聲，前後相續。
C025: 於意云何？此等為是聲來耳邊？耳往聲處？阿難，若復此聲來於耳邊，如我乞食，室羅筏城，在祇陀林，則無有我。
      此聲必來阿難耳處，目連迦葉，應不俱聞；何況其中，一千二百五十沙門，一聞鐘聲，同來食處。
      若復汝耳，往彼聲邊，如我歸住，祇陀林中，在室羅城，則無有我。汝聞鼓聲，其耳已往擊鼓之處；鐘聲齊出，應不俱聞。
      何況其中，象馬牛羊，種種音聲？若無來往，亦復無聞。是故當知，聽與音聲，俱無處所。
C026: 即聽與聲，二處虛妄；本非因緣，非自然性。
C027: 阿難，汝又嗅此，爐中栴檀，此香若復然於一銖，室羅筏城，四十里內，同時聞氣。
C028: 於意云何，此香為復生栴檀木？生於汝鼻？為生於空？阿難，若復此香，生於汝鼻，稱鼻所生，當從鼻出；鼻非栴檀，云何鼻中，有栴檀氣？
      稱汝聞香，當於鼻入，鼻中出香，說聞非義。若生於空，空性常恒，香應常在；何藉爐中，爇此枯木？
      若生於木，則此香質，因爇成煙，若鼻得聞，合蒙煙氣；其煙騰空，未及遙遠，四十里內，云何已聞？是故當知，香鼻與聞，俱無處所。
C029: 即嗅與香，二處虛妄；本非因緣，非自然性。
C030: 阿難，汝常二時，眾中持缽，其間或遇，酥酪醍醐，名為上味。
C031: 於意云何？此味為復生於空中？生於舌中？為生食中？阿難，若復此味，生於汝舌，在汝口中，祇有一舌，其舌爾時，已成酥味；遇黑石蜜，應不推移。
      若不變移，不名知味；若變移者，舌非多體，云何多味，一舌之知？若生於食，食非有識，云何自知？又食自知，即同他食，何預於汝，名味之知？
      若生於空，汝噉虛空，當作何味？必其虛空，若作咸味，既咸汝舌，亦咸汝面，則此界人，同於海魚。既常受咸，了不知淡；若不識淡，亦不覺咸；
      必無所知，云何名味？是故當知，味舌與嘗，俱無處所。
C032: 即嘗與味，二俱虛妄；本非因緣，非自然性。
C033: 阿難，汝常晨朝，以手摩頭。
C034: 於意云何？此摩所知，誰為能觸？能為在手？為復在頭？若在於手，頭則無知，云何成觸？若在於頭，手則無用，云何名觸？
      若各各有，則汝阿難，應有二身。若頭與手，一觸所生，則手與頭，當為一體。若一體者，觸則無成。若二體者，觸誰為在？
      在能非所，在所非能。不應虛空，與汝成觸？是故當知，覺觸與身，俱無處所。
C035: 即身與觸，二俱虛妄；本非因緣，非自然性。
C036: 阿難，汝常意中，所緣善、惡、無記三性，生成法則。
C037: 此法為復即心所生？為當離心別有方所？阿難，若即心者，法則非塵，非心所緣，云何成處？若離於心，別有方所，則法自性，為知非知？
      知則名心，異汝非塵，同他心量；即汝即心，云何汝心，更二於汝？若非知者，此塵既非色聲香味，離合冷暖，及虛空相，當於何在？
      今於色空，都無表示，不應人間，更有空外。心非所緣，處從誰立？是故當知，法則與心，俱無處所。
C038: 則意與法，二俱虛妄；本非因緣，非自然性。
C039: 復次阿難，云何十八界，本如來藏，妙真如性。
C040: 阿難，如汝所明，眼色為緣，生於眼識。
C041: 此識為復因眼所生，以眼為界；因色所生，以色為界。
C042: 阿難，若因眼生，既無色空，無可分別，縱有汝識，欲將何用？汝見又非青黃赤白，無所表示，從何立界？
      若因色生，空無色時，汝識應滅，云何識知是虛空性？若色變時，汝亦識其色相遷變，汝識不遷，界從何立？
      從變則變，界相自無；不變則恒。既從色生，應不識知，虛空所在。若兼二種眼色共生，合則中離，離則兩合，體性雜亂，云何成界？
C043: 是故當知，眼色為緣，生眼識界，三處都無。則眼與色，及色界三，本非因緣，非自然性。
C044: 阿難，又汝所明，耳聲為緣，生於耳識。
C045: 此識為復，因耳所生，以耳為界；因聲所生，以聲為界。
C046: 阿難，若因耳生，動靜二相，既不現前，根不成知；必無所知，知尚無成，識何形貌？若取耳聞，無動靜故，聞無所成。
      云何耳形，雜色觸塵，名為識界；則耳識界，復從誰立？若生於聲，識因聲有，則不關聞；無聞則亡聲相所在。
      識從聲生，許聲因聞，而有聲相，聞應聞識，不聞非界。聞則同聲，識已被聞，誰知聞識？若無知者，終如草木。
      不應聲聞，雜成中界，界無中位；則內外相，復從何成？
C047: 是故當知，耳聲為緣，生耳識界，三處都無；則耳與聲，及聲界三，本非因緣，非自然性。
C048: 阿難，又汝所明，鼻香為緣，生於鼻識。
C049: 此識為復因鼻所生，以鼻為界；因香所生，以香為界。
C050: 阿難，若因鼻生，則汝心中，以何為鼻？為取肉形雙爪之相？為取嗅知動搖之性？
      若取肉形，肉質乃身，身知即觸，名身非鼻，名觸即塵；鼻尚無名，云何立界？
      若取嗅知，又汝心中，以何為知？以肉為知，則肉之知，元觸非鼻。以空為知，空則自知，肉應非覺；如是則應虛空是汝，汝身非知；
      今日阿難，應無所在。以香為知，知自屬香，何預於汝？若香臭氣，必生汝鼻，則彼香臭二種流氣，不生伊蘭，及栴檀木；二物不來，
      汝自嗅鼻，為香為臭？臭則非香，香應非臭。若香臭二俱能聞者，則汝一人，應有兩鼻；對我問道，有二阿難，誰為汝體？
      若鼻是一，香臭無二，臭既為香，香復成臭，二性不有，界從誰立？
C051: 若因香生，識因香有；如眼有見，不能觀眼；因香有故，應不知香。知即非生，不知非識；香非知有，香界不成。識不知香，因界則非從香建立。
      既無中間，不成內外；彼諸聞性，畢竟虛妄。
C052: 是故當知，鼻香為緣，生鼻識界，三處都無。則鼻與香，及香界三，本非因緣，非自然性。
C053: 阿難，又汝所明，舌味為緣，生於舌識。
C054: 此識為復因舌所生，以舌為界，因味所生，以味為界。
C055: 阿難，若因舌生，則諸世間，甘蔗烏梅，黃連石鹽，細辛姜桂，都無有味。
      汝自嘗舌，為甜為苦，若舌性苦？誰來嘗舌，舌不自嘗；孰為知覺？舌性非苦，味自不生，云何立界？
C056: 若因味生，識自為味，同於舌根，應不自嘗，云何識知是味非味？又一切味，非一物生，味既多生，識應多體；
      識體若一，體必味生，鹹淡甘辛和合俱生，諸變異相，同為一味，應無分別。分別既無，則不名識，云何復名，舌味識界？
C057: 不應虛空，生汝心識。舌味和合，即於是中，更無自性，云何界生？
C058: 是故當知，舌味為緣，生舌識界，三處都無。則舌與味，及舌界三，本非因緣，非自然性。
C059: 阿難，又汝所明，身觸為緣，生於身識。
C060: 此識為復，因身所生，以身為界；因觸所生，以觸為界。
C061: 阿難，若因身生，必無合離二覺觀緣，身何所識？若因觸生，必無汝身，誰有非身，知合離者？
C062: 阿難，物不觸知，身知有觸；知身即觸，知觸即身；即觸非身，即身非觸。身觸二相，元無處所；合身即為身自體性，離身即是虛空等相，
      內外不成，中云何立！中不復立，內外性空，則汝識生，從誰立界？
C063: 是故當知，身觸為緣，生身識界，三處都無。則身與觸，及身界三，本非因緣，非自然性。
C064: 阿難，又汝所明，意法為緣，生於意識。
C065: 此識為復因意所生，以意為界；因法所生，以法為界。
C066: 阿難，若因意生，於汝意中，必有所思，發明汝意。若無前法，意無所生，離緣無形，識將何用？又汝識心，與諸思量，兼了別性，為同為異？
      同意即意，云何所生？異意不同，應無所識，若無所識，云何意生？若有所識，云何識意？唯同與異，二性無成，界云何立？
C067: 若因法生，世間諸法，不離五塵。汝觀色法，及諸聲法、香法、味法，及與觸法，相狀分明，以對五根，非意所攝。
      汝識決定依於法生，汝今諦觀，法法何狀。若離色空，動靜通塞，合離生滅，越此諸相，終無所得。
      生則色空諸法等生；滅則色空諸法等滅。所因既無，因生有識，作何形相？相狀不有，界云何生？
C068: 是故當知，意法為緣，生意識界，三處都無。則意與法，及意界三，本非因緣，非自然性。
C069: 阿難白佛言：世尊，如來常說和合因緣，一切世間種種變化，皆因四大和合發明。云何如來，因緣自然，二俱排擯？
      我今不知斯義所屬，惟垂哀愍，開示眾生，中道了義，無戲論法。
C070: 爾時世尊，告阿難言：汝先厭離聲聞緣覺、諸小乘法；發心勤求無上菩提，故我今時為汝開示，第一義諦。如何復將世間戲論，妄想因緣，而自纏繞。
      汝雖多聞，如說藥人，真藥現前，不能分別；如來說為真可憐愍。汝今諦聽，我當為汝分別開示；亦令當來修大乘者，通達實相。阿難默然，承佛聖旨。
C071: 阿難，如汝所言，四大和合發明世間種種變化。阿難，若彼大性體非和合，則不能與諸大雜和；猶如虛空，不和諸色。
      若和合者，同於變化，始終相成，生滅相續；生死死生，生生死死，如旋火輪，未有休息。
C072: 阿難，如水成冰，冰還成水。
C073: 汝觀地性：麤為大地，細為微塵；至鄰虛塵，析彼極微，色邊際相，七分所成，更析鄰虛，即實空性。阿難，若此鄰虛析成虛空；當知虛空，出生色相。
      汝今問言：由和合故，出生世間，諸變化相。汝且觀此：一鄰虛塵，用幾虛空，和合而有？不應鄰虛，合成鄰虛。
      又鄰虛塵，析入空者，用幾色相，合成虛空？若色合時，合色非空；若空合時，合空非色；色猶可析，空云何合？
C074: 汝元不知：如來藏中，性色真空，性空真色。清淨本然，周遍法界；隨眾生心，應所知量，循業發規。
C075: 世間無知，惑為因緣，及自然性。皆是識心，分別計度，但有言說，都無實義。
C076: 阿難，火性無我，寄於諸緣。汝觀城中未食之家，欲炊爨時，手執陽燧，日前求火。
C077: 阿難！名和合者，如我與汝，一千二百五十比丘，今為一眾；眾雖為一，詰其根本，各各有身，皆有所生氏族名字。如舍利弗、婆羅門種、
      優樓頻螺、迦葉波種、乃至阿難，瞿曇種姓。阿難！若此火性，因和合有；彼手執鏡，於日求火，此火為從鏡中而出？為從艾出？為於日來？
C078: 阿難！若日來者，自能燒汝手中之艾，來處林木，皆應受焚；若鏡中出，自能於鏡，出然於艾，鏡何不熔？紆汝手執，尚無熱相，云何融泮？
      若生於艾，何藉日鏡，光明相接，然後火生？汝又諦觀：鏡因手執，日從天來，艾本地生，火從何方遊歷於此？日鏡相遠，非和非合，不應火光，無從自有？
C079: 汝猶不知：如來藏中，性火真空，性空真火。清淨本然，周遍法界；隨眾生心，應所知量。阿難，當知世人，一處執鏡，一處火生；遍法界執，滿世間起。
      起遍世間，寧有方所？循業發現。
C080: 世間無知，惑為因緣，及自然性；皆是識心，分別計度，但有言說，都無實義。
C081: 阿難，水性不定，流息無恒。如室羅城、迦毗羅仙、斫迦羅仙、及缽頭摩、訶薩多等，諸大幻師，求太陰精，用和幻藥；
      是諸師等，於白月晝，手執方諸，承月中水。
C082: 此水為復從珠中出？空中自有，為從月來，阿難！若從月來，尚能遠方，令珠出水；所經林木，皆應吐流，流則何待方諸所出？不流，明水非從月降。
      若從珠出，則此珠中，常應流水，何待中宵承白月晝？若從空生，空性無邊，水當無際，從人洎天，皆同滔溺；云何復有水陸空行？
      汝更諦觀：月從天陟，珠因手持，承珠水盤，本人敷設，水從何方，流注於此？月、珠相遠，非和非合；不應水精，無從自有！
C083: 汝尚不知：如來藏中，性水真空，性空真水。清淨本然，周遍法界；隨眾生心，應所知量。
      一處執珠，一處出水；遍法界執，滿法界生，生滿世間，寧有方所？循業發現。
C084: 世間無知，惑為因緣，及自然性。皆是識心，分別計度，但有言說，都無實義。
C085: 阿難！風性無體，動靜不常；汝常整衣，入於大眾，僧伽梨角，動及傍人，則有微風，拂彼人面。
C086: 此風為復出袈裟角？發於虛空？生彼人面？阿難！此風若復出袈裟角，汝乃披風；其衣飛搖，應離汝體。我今說法，會中垂衣；汝看我衣，風何所在？
      不應衣中，有藏風地。若生虛空，汝衣不動，何因無拂？空性常住，風應常生，若無風時，虛空當滅；滅風可見，滅空何狀？
      若有生滅，不名虛空；名為虛空，云何風出？若風自生，被拂之面，從彼面生，當應拂汝；自汝整衣，云何倒拂？
      汝審諦觀：整衣在汝，面屬彼人，虛空寂然，不曾流動，風自誰方，鼓動來此？風空性隔；非和非合，不應風性無從自有？
C087: 汝宛不知：如來藏中，性風真空，性空真風。清淨本然，周遍法界；隨眾生心，應所知量。
      阿難！如汝一人，微動服衣，有微風出；遍法界拂，滿國土生，周遍世間，寧有方所？循業發現。
C088: 世間無知，惑為因緣，及自然性。皆是識心，分別計度，但有言說，都無實義。
C089: 阿難，空性無形，因色顯發；如室羅城，去河遙處，諸剎利種，及婆羅門，毗舍、首陀、兼頗羅墮、栴陀羅等。
      新立安居，鑿井求水，出土一尺，於中則有一尺虛空，如是乃至，出土一丈，中間還得一丈虛空，虛空淺深，隨出多少。
C090: 此空為當因土所出？因鑿所有？無因自生？阿難，若復此空，無因自生；未鑿土前，何不無礙？唯見大地，迥無通達。
      若因土出，則土出時，應見空入；若土先出，無空入者，云何虛空，因土而出？若無出入，則應空土，元無異因；無異則同，則土出時，空何不出？
      若因鑿出，則鑿出空，應非出土？不因鑿出，鑿自出土，云何見空？
C091: 汝更審諦，諦審諦觀：鑿從人手，隨方運轉，土因地移，如是虛空，因何所出？鑿、空虛實，不相為用，非和非合；不應虛空，無從自出。
C092: 若此虛空，性圓周遍，本不動搖，當知現前，地、水、火、風，均名五大。性真圓融，皆如來藏，本無生滅。
      阿難！汝心昏迷，不悟四大，元如來藏，當觀虛空：為出？為入？為非出入？
C093: 汝全不知：如來藏中，性覺真空，性空真覺。清淨本然，周遍法界；隨眾生心，應所知量。
      阿難，如一井空，空生一井；十方虛空，亦復如是。圓滿十方，寧有方所，循業發現。
C094: 世間無知，惑為因緣，及自然性；皆是識心，分別計度，但有言說，都無實義。
C095: 阿難！見覺無知，因色空有。如汝今者在祇陀林，朝明夕昏；設居中宵，白月則光，黑月便暗，則明暗等，因見分析。
C096: 此見為復與明暗相，並太虛空，為同一體？為非一體？或同非同？或異非異？
      阿難！此見若復與明與暗，及與虛空，元一體者，則明與暗，二體相亡；暗時無明，明時無暗。若與暗一，明則見亡；必一於明，暗時當滅。
      滅則云何見明見暗？若明暗殊，見無生滅，一云何成？若此見精，與暗與明，非一體者，汝離明暗，及與虛空，分析見元，作何形相？
      離明離暗，及離虛空，是見元同龜毛兔角；明、暗、虛空三事俱異，從何立見？
C097: 明暗相背，云何或同？離三元無，云何或異？分空分見，本無邊畔，云何非同？見暗見明，性非遷改，云何非異？
C098: 汝更細審，微細審詳，審諦審觀：明從太陽，暗隨黑月，通屬虛空，壅歸大地，如是見精，因何所出？見覺空頑，非和非合；不應見精，無從自出？
C099: 若見聞知，性圓周遍，本不動搖，當知無邊不動虛空，並其動搖地、水、火、風，均名六大；性真圓融，皆如來藏，本無生滅。
      阿難！汝性沈淪，不悟汝之見聞覺知，本如來藏；汝當觀此見聞覺知，為生為滅？為同為異？為非生滅？為非同異？
C100: 汝曾不知：如來藏中，性見覺明，覺精明見；清淨本然，周遍法界；隨眾生心，應所知量。
      如一見根，見周法界；聽嗅嘗觸，覺觸覺知，妙德瑩然，遍周法界，圓滿十虛，寧有方所？循業發現。
C101: 世間無知，惑為因緣，及自然性；皆是識心，分別計度，但有言說，都無實義。
C102: 阿難，識性無源，因於六種根塵妄出。汝今遍觀：此會聖眾，用目循歷，其目周視，但如鏡中，無別分析；
      汝識於中，次第標指，此是文殊，此富樓那，此目犍連，此須菩提，此舍利弗。
C103: 此識了知，為生於見？為生於相？為生虛空？為無所因突然而出？
      阿難！若汝識性生於見中，如無明暗，及與色空，四種必無，元無汝見，見性尚無，從何發識？
C104: 若汝識性，生於相中，不從見生，既不見明，亦不見暗，明暗不矚，即無色空；彼相尚無，識從何發？
      若生於空，非相非見；非見無辨，自不能知，明暗色空。非相滅緣，見聞覺知，無處安立。處此二非，空則同無，有非同物，縱發汝識，欲何分別？
      若無所因，突然而生，何不曰中，別識明月？
C105: 汝更細詳，微細詳審：見托汝睛，相推前境，可狀成有，不相成無，如是識緣，因何所出？
      識動見澄，非和非合；聞聽覺知，亦復如是。不應識緣，無從自出。
C106: 若此識心，本無所從，當知了別，見聞覺知，圓滿湛然，性非從所，兼彼虛空，地水火風，均名七大，性真圓融，皆如來藏，本無生滅。
      阿難！汝心麤浮，不悟見聞，發明了知，本如來藏。汝應觀此：六處識心，為同為異？為空為有？為非同異？為非空有？
C107: 汝元不知：如來藏中，性識明知，覺明真識；妙覺湛然，遍周法界。含吐十虛，寧有方所？循業發現。
C108: 世間無知，惑為因緣，及自然性；皆是識心，分別計度，但有言說，都無實義。
C109: 爾時阿難，及諸大眾，蒙佛如來，微妙開示，身心蕩然，得無掛礙。
C110: 是諸大眾，各各自知，心遍十方；見十方空，如觀手中，所持葉物。
C111: 一切世間，諸所有物，皆即菩提，妙明元心，心精遍圓，含裹十方。
C112: 反觀父母所生之身，猶彼十方虛空之中，吹一微塵，若存若亡；如湛巨海，流一浮漚，起滅無從。
C113: 了然自知，獲本妙心，常住不滅。
C114: 禮佛合掌，得未曾有！於如來前，說偈贊佛。
C115: 妙湛總持不動尊，首楞嚴王世希有！
C116: 銷我億劫顛倒想，不歷僧祇獲法身。
C117: 願今得果成寶王，還度如是恒沙眾；將此深心奉塵剎，是則名為報佛恩。伏請世尊為證明，五濁惡世誓先入；如一眾生未成佛，終不於此取泥洹。
C118: 大雄大力大慈悲，希更審除微細惑；令我早登無上覺，於十方界坐道場。
C119: 舜若多性可銷亡，爍迦羅心無動轉。

D001: 爾時富樓那彌多羅尼子，在大眾中，即從座起，偏袒右肩，右膝著地，合掌恭敬，而白佛言。
D002: 大威德世尊！善為眾生，敷演如來第一義諦。
D003: 世尊常推說法人中，我為第一。今聞如來微妙法音；猶如聾人，逾百步外，聆於蚊蚋，本所不見，何況得聞？佛雖宣明，令我除惑。
      今猶未詳斯義究竟，無疑惑地。世尊！如阿難輩，雖則開悟，習漏未除。我等會中，登無漏者，雖盡諸漏，今聞如來，所說法音，尚紆疑悔。
D004: 世尊！若復世間，一切根塵，陰處界等，皆如來藏，清淨本然，云何忽生山河大地、諸有為相？次第遷流、終而復始？
D005: 又如來說：地水火風，本性圓融，周遍法界，湛然常住。世尊！若地性遍，云何容水？
      水性周遍，火則不生，復云何明水火二性，俱遍虛空、不相陵滅？世尊！地性障礙，空性虛通，云何二俱周遍法界？
D006: 而我不知，是義攸往，惟願如來，宣流大慈，開我迷雲，及諸大眾。作是語已，五體投地，欽渴如來，無上慈誨。
D007: 爾時世尊，告富樓那及諸會中漏盡無學諸阿羅漢：如來今日，普為此會，宣勝義中，真勝義性。令汝會中，定性聲聞，及諸一切未得二空，
      迴向上乘，阿羅漢等，皆獲一乘，寂滅場地，真阿練若正修行處。汝今諦聽，當為汝說。富樓那等，欽佛法音，默然承聽。
D008: 佛言富樓那：如汝所言，清淨本然，云何忽生山河大地？汝常不聞，如來宣說，性覺妙明，本覺明妙。富樓那言，唯然，世尊，我常聞佛宣說斯義。
D009: 佛言：汝稱覺明，為復性明，稱名為覺？為覺不明，稱為明覺？富樓那言：若此不明，名為覺者，則無所明。
      佛言：若無所明，則無明覺，有所非覺；無所非明，無明又非覺湛明性。
D010: 性覺必明，妄為明覺；覺非所明，因明立所。所既妄立，生汝妄能。無同異中，熾然成異；異彼所異，因異立同，同異發明；
      因此復立，無同無異，如是擾亂。相待生勞，勞久發塵，自相渾濁，由是引起塵勞煩惱。
D011: 起為世界，靜成虛空，虛空為同，世界為異；彼無同異，真有為法。
D012: 覺明空昧，相待成搖，故有風輪，執持世界。因空生搖，堅明立礙，彼金寶者，明覺立堅；故有金輪，保持國土。
      堅覺寶成，搖明風出，風金相摩，故有火光為變化性。寶明生潤，火光上蒸，故有水輪，含十方界。火騰水降，交發立堅；濕為巨海，乾為洲潬。
      以是義故，彼大海中，火光常起，彼洲潬中，江河常注。水勢劣火，結為高山；是故山石，擊則成焰，融則成水。土勢劣水，抽為草木；
      是故林藪，遇燒成土，因絞成水。交妄發生，遞相為種，以是因緣，世界相續。
D013: 復次富樓那，明妄非他，覺明為咎。所妄既立，明理不逾；以是因緣，聽不出聲，見不超色。色香味觸，六妄成就，由是分開，見覺聞知。
      同業相纏，合離成化。見明色發，明見想成。異見成憎，同想成愛，流愛為種，納想為胎；交遘發生，吸引同業，故有因緣生羯羅藍、遏蒲曇等。
      胎卵濕化，隨其所應；卵唯想生，胎因情有，濕以合感，化以離應。情想合離，更相變易，所有受業，逐其飛沈，以是因緣，眾生相續。
D014: 富樓那，想愛同結，愛不能離，則諸世間，父母子孫，相生不斷。是等則以欲貪為本。貪愛同滋，貪不能止，則諸世間，卵化濕胎，隨力強弱，遞相吞食，
      是等則以殺貪為本。以人食羊，羊死為人，人死為羊。如是乃至，十全之類，死死生生，互來相噉，惡業俱生，窮未來際，是等則以盜貪為本。
      汝負我命，我還汝債；以是因緣，經百千劫，常在生死。汝愛我心，我憐汝色；以是因緣，經百千劫，常在纏縛。唯殺盜婬三為根本，以是因緣，業果相續。
D015: 富樓那，如是三種，顛倒相續，皆是覺明，明了知性，因了發相。從妄見生，山河大地，諸有為相，次第遷流，因此虛妄，終而復始。
D016: 富樓那言：若此妙覺，本妙覺明，與如來心，不增不減；無狀忽生，山河大地，諸有為相。如來今得妙空明覺，山河大地，有為習漏，何當復生？
D017: 佛告富樓那：譬如迷人，於一聚落，惑南為北。此迷為復因迷而有？因悟所出？富樓那言：如是迷人，亦不因迷，又不因悟。何以故？
      迷本無根，云何因迷？悟非生迷，云何因悟？佛言：彼之迷人，正在迷時，焂有悟人，指示令悟。富樓那！於意云何？此人縱迷，於此聚落，更生迷不？
      不也！世尊。富樓那！十方如來，亦復如是。
D018: 此迷無本，性畢竟空；昔本無迷，似有迷覺，覺迷迷滅，覺不生迷。亦如翳人，見空中華，翳病若除，華於空滅。忽有愚人，於彼空華，所滅空地，
      待華更生，汝觀是人，為愚為慧？富樓那言：空元無華，妄見生滅，見華滅空，已是顛倒，敕令更出，斯實狂癡，云何更名如是狂人為愚為慧？
      佛言：如汝所解，云何問言：諸佛如來，妙覺明空，何當更出山河大地？
D019: 又如金礦，雜於精金，其金一純，更不成雜。如木成灰，不重為木。諸佛如來，菩提涅槃，亦復如是。
D020: 富樓那！又汝問言：地水火風，本性圓融，周遍法界；疑水火性，不相陵滅。又徵虛空，及諸大地，俱遍法界，不合相容。
D021: 富樓那！譬如虛空，體非群相，而不拒彼諸相發揮。所以者何？
      富樓那！彼太虛空，日照則明，雲屯則暗，風搖則動，霽澄則清，氣凝則濁，土積成霾，水澄成映。於意云何？如是殊方，諸有為相，為因彼生？
      為復空有？若彼所生，富樓那，且日照時，既是日明，十方世界，同為日色，云何空中，更見圓日？
      若是空明，空應自照，云何中宵，雲霧之時，不生光耀？當知是明，非日非空，不異空日。
D022: 觀相元妄，無可指陳，猶邀空華，結為空果，云何結其相陵滅義？觀性元真，唯妙覺明。妙覺明心，先非水火，云何復問，不相容者。
      真妙覺明，亦復如是。汝以空明，則有空現：地水火風，各各發明，則各各現；若俱發明，則有俱現。云何俱現？富樓那！如一水中！
      現於日影，兩人同觀，水中之日，東西各行，則各有日隨二人去。一東一西先無准的。不應難言：此日是一，云何各行？各日既雙，云何現一？
      宛轉虛妄，無可憑據。
D023: 富樓那！汝以色空，相傾相奪，於如來藏；而如來藏，隨為色空周遍法界；是故於中風動空澄，日明雲暗。眾生迷悶，背覺合塵，故發塵勞，有世間相。
D024: 我以妙明，不滅不生，合如來藏；而如來藏，唯妙覺明，圓照法界。是故於中，一為無量，無量為一，小中現大，大中現小；
      不動道場，遍十方界，身含十方，無盡虛空；於一毛端，現寶王剎，坐微塵裏，轉大法輪。滅塵合覺，故發真如妙覺明性。
D025: 而如來藏，本妙圓心，非心、非空、非地、非水、非風、非火；非眼、非耳、鼻、舌、身、意；非色、非聲、香、味、觸、法；
      非眼識界，如是乃至、非意識界。非明、無明、明無明盡；如是乃至，非老、非死，非老死盡。非苦、非集，非滅、非道；非智、非得。
      非檀那、非尸羅，非毗梨耶，非羼提，非禪那，非般剌若，非波羅蜜多。如是乃至，非怛闥阿竭、非阿羅訶、非三耶三菩、非大涅槃、
      非常、非樂、非我、非淨。
D026: 以是俱非，世出世故。
D027: 即如來藏，元明心妙，即心、即空、即地、即水、即風、即火；即眼、即耳、鼻，舌、身，意；即色、即聲、香、味、觸、法；
      即眼識界、如是乃至，即意識界。即明、無明，明無明盡，如是乃至，即老、即死，即老死盡。
      即苦，即集，即滅，即道，即智，即得。即檀那，即尸羅，即毗梨耶，即羼提，即禪那，即般剌若，即波羅蜜多。
      如是乃至即怛闥訶竭，即阿羅訶，三耶三菩，即大涅槃，即常、即樂、即我、即淨。
D028: 以是俱即，世出世故。
D029: 即如來藏，妙明心元，離即離非，是即非即。
D030: 如何世間，三有眾生，及出世間，聲聞緣覺，以所知心，測度如來，無上菩提。用世間語言入佛知見。
      譬喻琴、瑟、箜篌、琵琶，雖有妙音，若無妙指，終不能發。汝與眾生，亦復如是。
      寶覺真心，各各圓滿；如我按指，海印發光；汝暫舉心，塵勞先起。由不勤求，無上覺道，愛念小乘，得少為足。
D031: 富樓那言：我與如來，寶覺圓明，真妙淨心，無二圓滿。而我昔遭無始妄想，久在輪迴，今得聖乘，猶未究竟；世尊諸妄，一切圓滅，獨妙真常。
      敢問如來：一切眾生何因有妄，自蔽妙明，受此淪溺？
D032: 佛告富樓那：汝雖除疑，餘惑未盡，我以世間現前諸事，今復問汝：汝豈不聞，室羅城中，演若達多，忽於晨朝，以鏡照面，愛鏡中頭，眉目可見；
      瞋責己頭，不見面目；以為魑魅，無狀狂走。於意云何？此人何因，無故狂走？富樓那言：是人心狂，更無他故。
D033: 佛言：妙覺明圓，本圓明妙。既稱為妄，云何有因？若有所因，云何名妄？自諸妄想，展轉相因，從迷積迷，以歷塵劫；雖佛發明，猶不能返。
      如是迷因，因迷自有，識迷無因，妄無所依，尚無有生，欲何為滅？得菩提者，如寤時人，說夢中事；心縱精明，欲何因緣，取夢中物？
D034: 況復無因，本無所有。如彼城中，演若達多，豈有因緣，自怖頭走？忽然狂歇，頭非外得；縱未歇狂，亦何遺失？富樓那！妄性如是，因何為在？
D035: 汝但不隨分別，世間、業果、眾生，三種相續，三緣斷故，三因不生；則汝心中，演若達多，狂性自歇，歇即菩提。
      勝淨明心，本周法界，不從人得；何藉劬勞，肯綮修證。
D036: 譬喻有人：於自衣中，系如意珠，不自覺知；窮露他方，乞食馳走，雖實貧窮，珠不曾失。
      忽有智者，指示其珠，所願從心，致大饒富。方悟神珠，非從外得。
D037: 即時阿難，在大眾中，頂禮佛足，起立白佛：世尊，現說殺、盜、婬業，三緣斷故，三因不生。心中達多，狂性自歇，歇即菩提，不從人得；
      斯則因緣，皎然明白，云何如來，頓棄因緣？我從因緣，心得開悟。世尊！此義何獨我等年少，有學聲聞。今此會中，大目犍連，及舍利弗，
      須菩提等，從老梵志，聞佛因緣，發心開悟，得成無漏。今說菩提，不從因緣；則王舍城，拘舍梨等，所說自然，成第一義。惟垂大悲，開發迷悶。
D038: 佛告阿難：即如城中，演若達多，狂性因緣，若得滅除；則不狂性，自然而出，因緣自然，理窮於是。
D039: 阿難！演若達多，頭本自然，本自其然，無然非自，何因緣故，怖頭狂走。若自然頭，因緣故狂，何不自然，因緣故失？
      本頭不失，狂怖妄出，曾無變易，何藉因緣？
D040: 本狂自然，本有狂怖；未狂之際，狂何所潛？不狂自然，頭本無妄，何為狂走？
D041: 若悟本頭，識知狂走，因緣、自然，俱為戲論。
D042: 是故我言，三緣斷故，即菩提心。
D043: 菩提心生，生滅心滅，此但生滅；滅生俱盡，無功用道。若有自然，如是則明自然心生，生滅心滅；此亦生滅。
      無生滅者，名為自然；猶如世間，諸相雜和成一體者，名和合性。非和合者，稱本然性。
D044: 本然非然，和合非合。
D045: 合然俱離，離合俱非，此句方名，無戲論法。
D046: 菩提涅槃，尚在遙遠，非汝歷劫，辛勤修證。雖復憶持，十方如來，十二部經，清淨妙理，如恒河沙，祇益戲論。
      汝雖談說，因緣、自然，決定明了；人間稱汝，多聞第一。以此積劫多聞熏習，不能免離摩登伽難。
      何須待我佛頂神咒摩登伽心婬火頓歇，得阿那含；於我法中，成精進林，愛河乾枯，令汝解脫？
D047: 是故阿難，汝雖歷劫憶持，如來秘密妙嚴，不如一日，修無漏業，遠離世間，憎愛二苦。
      如摩登伽，宿為婬女，由咒神力，銷其愛欲，法中今名性比丘尼。與羅侯母，耶輸陀羅，同悟宿因。
      知歷世因貪愛為苦！一念熏修無漏善故，或得出纏，或蒙授記，如何自欺，尚留觀聽。
D048: 阿難及諸眾，聞佛示誨，疑惑銷除，心悟實相，身意輕安，得未曾有。重復悲淚！頂禮佛足，長跪合掌，而白佛言：
      無上大悲，清淨寶王，善開我心，能以如是種種因緣，方便提獎，引諸沈冥，出於苦海。
D049: 世尊！我今雖承，如是法音，知如來藏，妙覺明心，遍十方界；含育如來十方國土，清淨寶嚴，妙覺王剎。如來復責，多聞無功，不逮修習。
      我今猶如旅泊之人，忽蒙天王，賜與華屋，雖獲大宅，要因門入。
D050: 惟願如來，不捨大悲，示我在會諸蒙暗者，捐捨小乘，畢獲如來無餘涅槃，本發心路。令有學者，從何攝伏，疇昔攀緣，得陀羅尼，入佛知見！
      作是語已，五體投地。在會一心，佇佛慈旨。
D051: 爾時世尊，哀愍會中，緣覺聲聞，於菩提心未自在者，及為當來，佛滅度後，末法眾生，發菩堤心，開無上乘，妙修行路；宣示阿難，及諸大眾。
D052: 汝等決定發菩提心，於佛如來妙三摩提，不生疲倦；應當先明發覺初心，二決定義。云何初心，二義決定？
D053: 阿難！第一義者，汝等若欲捐聲聞，修菩薩乘，入佛知見。應當審觀因地發心，與果地覺，為同為異。
      阿難，若於因地，以生滅心為本修因，而求佛乘不生不滅，無有是處。
D054: 以是義故，汝當照明，諸器世間可作之法，皆從變滅。阿難！汝觀世間可作之法，誰為不壞？然終不聞，爛壞虛空。
      何以故？空非可作，由是始終，無壞滅故。
D055: 則汝身中，堅相為地，潤濕為水，暖觸為火，動搖為風。由此四纏，分汝湛圓妙覺明心，為視、為聽、為覺、為察，從始入終，五疊渾濁。
D056: 云何為濁？阿難！譬如清水，清潔本然，即彼塵土灰沙之倫，本質留礙，二體法爾，性不相循。
      有世間人，取彼土塵，投於淨水；土失留礙，水亡清潔，容貌汩然，名之為濁。汝濁五重，亦復如是。
D057: 阿難！汝見虛空，遍十方界，空見不分。有空無體，有見無覺，相織妄成，是第一重，名為劫濁。
D058: 汝身現摶，四大為體，見聞覺知，壅令留礙。水火風土，旋令覺知，相織妄成，是第二重，名為見濁。
D059: 又汝心中，憶識誦習，性發知見，容現六塵。離塵無相，離覺無性，相織妄成，是第三重，名煩惱濁。
D060: 又汝朝夕，生滅不停，知見每欲留於世間，業運每常遷於國土，相織妄成，是第四重，名眾生濁。
D061: 汝等見聞，元無異性，眾塵隔越，無狀異生；性中相知，用中相背，同異失准，相織妄成，是第五重，名為命濁。
D062: 阿難！汝今令見、聞、覺、知，遠契如來，常、樂、我、淨。應當先擇，生死根本；依不生滅，圓湛性成。以湛旋其虛妄滅生，伏還元覺；
      得元明覺，無生滅性，為因地心。然後圓成，果地修證。
D063: 如澄濁水，貯於靜器；靜深不動，沙土自沈。清水現前，名為初伏客塵煩惱；去泥純水，名為永斷根本無明。
      明相精純，一切變現，不為煩惱，皆合涅槃清淨妙德。
D064: 第二義者：汝等必欲發菩提心，於菩薩乘，生大勇猛，決定棄捐諸有為相；應當審詳煩惱根本。此無始來，發業潤生，誰作誰受；
      阿難！汝修菩提，若不審觀煩惱根本，則不能知虛妄根塵何處顛倒。處尚不知，云何降伏，取如來位？
D065: 阿難！汝觀世間解結之人，不見所結，云何知解？不聞虛空，被汝隳裂。何以故？空無形相，無結解故。
D066: 則汝現前，眼、耳、鼻、舌，及與身、心，六為賊媒，自劫家寶。由此無始眾生世界，生纏縛故，於器世間，不能超越。
D067: 阿難！云何名為眾生世界？世為遷流，界為方位。汝今當知，東西南北，東南西南，東北西北，上下為界，過去未來，現在為世；方位有十，流數有三。
      一切眾生，織妄相成，身中貿遷，世界相涉；而此界性，設雖十方，定位可明，世間祇目東西南北，上下無位，中無定方。
      四數必明，與世相涉，三四四三，宛轉十二，流變三疊，一十百千。
D068: 總括始終，六根之中，各各功德有千二百。
D069: 阿難，汝復於中，克定優劣。
D070: 如眼觀見，後暗前明，前方全明，後方全暗，左右旁觀，三分之二，統論所作，功德不全，三分言功，一分無德，當知眼唯八百功德。
D071: 如耳周聽，十方無遺，動若邇遙，靜無邊際，當知耳根，圓滿一千二百功德。
D072: 如鼻嗅聞，通出入息，有出有入，而闕中交，驗於鼻根，三分闕一，當知鼻唯八百功德。
D073: 如舌宣揚，盡諸世間，出世間智；言有方分，理無窮盡，當知舌根，圓滿一千二百功德。
D074: 如身覺觸，識於違順，合時能覺，離中不知，離一合雙。驗於身根，三分闕一，當知身唯八百功德。
D075: 如意默容，十方三世，一切世間，出世間法，唯聖與凡，無不包容，盡其涯際，當知意根，圓滿一千二百功德。
D076: 阿難！汝今欲逆生死欲流，返窮流根，至不生滅，當驗此等六受用根：誰合誰離？誰深誰淺？誰為圓通？誰不圓滿？若能於此悟圓通根，
      逆彼無始織妄業流，得循圓通，與不圓根，日劫相倍。我今備顯六湛圓明，本所功德，數量如是；隨汝詳擇其可入者，吾當發明，令汝增進。
D077: 十方如來，於十八界，一一修行，皆得圓滿，無上菩提，於其中間，亦無優劣。但汝下劣，未能於中，圓自在慧，故我宣揚，令汝但於一門深入。
      入一無妄，彼六知根，一時清淨。
D078: 阿難白佛言：世尊！云何逆流，深入一門，能令六根，一時清淨？
D079: 佛告阿難：汝今已得須陀洹果，已滅三界眾生世間見所斷惑。然猶未知，根中積生無始虛習，彼習要因修所斷得。何況此中，生住異滅，分劑頭數？
D080: 今汝且觀：現前六根，為一為六？阿難，若言一者，耳何不見？目何不聞？頭奚不履？足奚無語？
      若此六根，決定成六，如我今會，與汝宣揚，微妙法門，汝之六根，誰來領受？阿難言：我用耳聞。
      佛言：汝耳自聞，何關身口？口來問義，身起欽承？是故應知，非一終六，非六終一，終不汝根，元一元六。
D081: 阿難，當知是根，非一非六，由無始來顛倒淪替，故於圓湛一六義生。汝須陀洹，雖得六銷，猶未亡一。
D082: 如太虛空，參合群器，由器形異，名之異空；除器觀空，說空為一。彼太虛空，云何為汝，成同不同？何況更名，是一非一？
D083: 則汝了知，六受用根，亦復如是。
D084: 由明暗等，二種相形，於妙圓中黏湛發見；見精映色。結色成根。根元目為，清淨四大，因名眼體；如蒲萄朵，浮根四塵，流逸奔色。
D085: 由動靜等，二種相擊，於妙圓中黏湛發聽；聽精映聲，卷聲成根。根元目為，清淨四大，因名耳體；如新卷葉，浮根四塵，流逸奔聲。
D086: 由通塞等，二種相發，於妙圓中黏湛發嗅；嗅精映香，納香成根。根元目為，清淨四大，因名鼻體；如雙垂爪，浮根四塵，流逸奔香。
D087: 由恬變等，二種相參，於妙圓中黏湛發嘗；嘗精映味，絞味成根。根元目為，清淨四大，因名舌體；如初偃月，浮根四塵，流逸奔味。
D088: 由離合等，二種相摩，於妙圓中黏湛發覺；覺精映觸，摶觸成根。根元目為，清淨四大，因名身體；如腰鼓顙，浮根四塵，流逸奔觸。
D089: 由生滅等，二種相續，於妙圓中黏湛發知；知精映法，攬法成根。根元目為，清淨四大，因名意思；如幽室見，浮根四塵，流逸奔法。
D090: 阿難！如是六根，由彼覺明，有明明覺；失彼精了，黏妄發光。是以汝今，離暗離明，無有見體；離動離靜，元無聽質；無通無塞，嗅性不生；
      非變非恬，嘗無所出；不離不合，覺觸本無；無滅無生，了知安寄？
D091: 汝但不循，動、靜、合、離，恬、變、通、塞，生、滅、明、暗，如是十二諸有為相；隨拔一根，脫黏內伏，伏歸元真，發本明耀。
      耀性發明，諸餘五黏，應拔圓脫
D092: 不由前塵，所起知見，明不循根，寄根明發；由是六根互相為用。阿難！汝豈不知？今此會中，阿那律陀，無目而見；跋難陀龍，無耳而聽；
      殑伽神女，非鼻聞香；驕梵砵提，異舌知味；舜若多神，無身覺觸；如來光中，映令暫現，既為風質，其體元無。
      諸滅盡定，得寂聲聞，如此會中摩訶迦葉，久滅意根，圓明了知，不因心念？
D093: 阿難！汝今諸根，若圓拔已，內瑩發光，如是浮塵，及器世間諸變化相，如湯銷冰，應念化成，無上知覺。
D094: 阿難！如彼世人，聚見於眼，若令急合，暗相現前，六根暗然，頭足相類。彼人以手，循體外繞，彼雖不見，頭足一辨，知覺是同。
D095: 緣見因明，暗成無見；不明自發，則諸暗相，永不能昏。根塵既銷，云何覺明，不成圓妙？
D096: 阿難白佛言：世尊！如佛說言：因地覺心，欲求常住，要與果位，名目相應。世尊！如果位中，菩提、涅槃、真如、佛性、菴摩羅識，
      空如來藏，大圓鏡智，是七種名，稱謂雖別，清淨圓滿，體性堅凝，如金剛王，常住不壞。
D097: 若此見聽，離於明、暗、動、靜、通、塞，畢竟無體。猶如念心，離於前塵，本無所有。云何將此畢竟斷滅，以為修因，欲獲如來，七常住果？
D098: 世尊！若離明暗，見畢竟空；如無前塵，念自性滅。進退循環，微細推求，本無我心，及我心所，將誰立因，求無上覺？如來先說：湛精圓常；違越誠言，終成戲論。云何如來，真實語者？惟垂大慈，開我蒙吝！
D099: 佛告阿難：汝學多聞，未盡諸漏；心中徒知顛倒所因，真倒現前，實未能識。恐汝誠心，猶未信伏，吾今試將塵俗諸事，當除汝疑。
D100: 即時如來，敕羅侯羅，擊鐘一聲，問阿難言：汝今聞不？阿難、大眾俱言：我聞。鐘歇無聲，佛又問言：汝今聞不？阿難、大眾俱言：不聞。
      時羅侯羅，又擊一聲，佛又問言：汝今聞不？阿難大眾，又言：俱聞。佛問阿難：汝云何聞？云何不聞？
      阿難大眾，俱白佛言，鐘聲若擊；則我得聞；擊久聲銷，音響雙絕，則名無聞。
D101: 如來又敕，羅侯羅擊鐘，問阿難言，汝今聲不？阿難、大眾俱言：有聲。少選聲銷，佛又問言：爾今聲不？阿難、大眾答言：無聲。
      有頃，羅侯羅更來撞鐘。佛又問言：爾今聲不？阿難、大眾俱言：有聲。佛問阿難：汝云何聲？云何無聲？
      阿難大眾，俱白佛言：鐘聲若擊，則名有聲；擊久聲銷，音響雙絕，則名無聲。
D102: 佛語阿難及諸大眾：汝今云何自語矯亂？大眾阿難俱時問佛：我今云何名為矯亂？
      佛言：我問汝聞，汝則言聞；又問汝聲，汝則言聲；唯聞與聲，報答無定，如是云何不名矯亂？
D103: 阿難！聲銷無響，汝說無聞；若實無聞，聞性已滅，同於枯木，鐘聲更擊，汝云何知？知有知無，自是聲塵，或無或有；豈彼聞性，為汝有無？
      聞實云無，誰知無者？是故阿難！聲於聞中，自有生滅；非為汝聞聲生聲滅，令汝聞性為有為無。汝尚顛倒，惑聲為聞；何怪昏迷，以常為斷？
      終不應言：離諸動靜、閉塞、開通，說聞無性。
D104: 如重睡人，眠熟床枕。其家有人，於彼睡時，搗練舂米；其人夢中聞舂搗聲，別作他物，或為擊鼓，或為撞鐘，即於夢時，自怪其鐘，為木石響。
      於時忽寤，遄知杵音，自告家人，我正夢時，惑此舂音，將為鼓響。阿難，是人夢中，豈憶靜搖開閉通塞？其形雖寐，聞性不昏。
      縱汝形銷，命光遷謝，此性云何，為汝銷滅？
D105: 以諸眾生，從無始來，循諸色聲，逐念流轉；曾不開悟，性淨妙常。不循所常，逐諸生滅，由是生生，雜染流轉。
D106: 若棄生滅，守於真常；常光現前，根塵識心應時銷落。想相為塵，識情為垢，二俱遠離；則汝法眼，應時清明，云何不成無上知覺。

E001: 阿難白佛言：世尊！如來雖說第二義門。今觀世間解結之人，若不知其所結之元，我信是人，終不能解。世尊！我及會中有學聲聞，亦復如是。
      從無始際，與諸無明，俱滋滅俱生，雖得如是多聞善根，名為出家，猶隔日瘧！惟願大慈，哀愍淪溺，今日身心，云何是結？從何名解？
      亦令未來苦難眾生，得免輪迴，不落三有。作是語已，普及大眾，五體投地，雨淚翹誠，佇佛如來，無上開示。
E002: 爾時世尊憐愍阿難及諸會中諸有學者，亦為未來一切眾生，為出世因，作將來眼。
      以閻浮檀紫金光手摩阿難頂，即時十方普佛世界六種震動。微塵如來住世界者，各有寶光，從其頂出。
      其光同時於彼世界，來祇陀林，灌如來頂。是諸大眾，得未曾有！
E003: 於是阿難及諸大眾，俱聞十方微塵如來，異口同音告阿難言：善哉，阿難！汝欲識知俱生無明，使汝輪轉生死結根，唯汝六根，更無他物；
      汝復欲知無上菩提，令汝速證安樂解脫，寂靜妙常，亦汝六根，更非他物。
E004: 阿難雖聞如是法音，心猶未明，稽首白佛：云何令我生死輪迴，安樂妙常，同是六根，更非他物？
E005: 佛告阿難：根塵同源，縛脫無二，識性虛妄，猶如空華。阿難！由塵發知，因根有相，相見無性，同於交蘆。
      是故汝今知見立知，即無明本，知見無見，斯即涅槃無漏真淨，云何是中更容他物？
E006: 爾時世尊，欲重宣此義，而說偈言：真性有為空，緣生故如幻；無為無起滅，不實如空華。言妄顯諸真，妄真同二妄，猶非真非真，云何見所見？
      中間無實性，是故若交蘆。結解同所因，聖凡無二路；汝觀交中性，空有二俱非。迷悔即無明，發明便解脫。
E007: 解結因次第，六解一亦亡；根選擇圓通，入流成正覺。
E008: 陀那微細識，習氣成瀑流；真非真恐迷，我常不開演。自心取自心，非幻成幻法；不取無非幻，非幻尚不生，幻法云何立？
E009: 是名妙蓮華，金剛王寶覺，如幻三摩提，彈指超無學，此阿毗達磨，十方薄伽梵，一路涅槃門。
E010: 於是阿難及諸大眾，聞佛如來無上慈誨，祇夜伽陀，雜糅精瑩，妙理清徹，心目開明，嘆未曾有。
E011: 阿難合掌，頂禮白佛：我今聞佛，無遮大悲，性淨妙常，真實法句。心猶未達，六解一亡，舒結倫次。
      惟垂大慈，再愍斯會，及與將來，施以法音，洗滌沈垢。
E012: 即時如來，於師子座，整涅槃僧，斂僧伽梨，攬七寶几，引手於几，取劫波羅天所奉華巾，於大眾前綰成一結，示阿難言：此名何等？
      阿難大眾，俱白佛言：此名為結。於是如來綰疊華巾，又成一結，重問阿難：此名何等？阿難大眾又白佛言：此亦名結。如是倫次綰疊華巾，總成六結。
      一一結成，皆取手中所成之結，持問阿難：此名何等？阿難大眾，亦復如是，次第詶佛，此名為結。
E013: 佛告阿難：我初綰巾，汝名為結。此疊華巾，先實一條，第二第三，云何汝曹，復名為結？阿難白佛言：世尊！此寶疊華緝織成巾，雖本一體，如我思惟：
      如來一綰，得一結名，若百綰成，終名百結。何況此巾，祇有六結，終不至七，亦不停五，云何如來，祇許初時、第二、第三，不名為結？
      佛告阿難：此寶華巾，汝知此巾，元止一條，我六綰時，名有六結。汝審觀察：巾體是同，因結有異。於意云何？
      初綰結成，名為第一，如是乃至，第六結生。我今欲將第六結名，成第一不？
      不也，世尊！六結若存，斯第六名，終非第一。縱我歷生，盡其明辯，如何令是，六結亂名？
E014: 佛言：如是，六結不同，循顧本因，一巾所造，令其雜亂，終不得成。則汝六根，亦復如是，畢竟同中，生畢竟異。
E015: 佛告阿難：汝必嫌此，六結不成，願樂一成，復云何得？阿難言：此結若存，是非鋒起，於中自生，此結非彼，彼結非此；
      如來今日，若總解除，結若不生，則無彼此，尚不名一，六云何成？
E016: 佛言：六解一亡，亦復如是。由汝無始心性狂亂，知見妄發，發妄不息，勞見發塵；如勞目睛，則有狂華，於湛精明，無因亂起。
      一切世間，山河大地，生死涅槃，皆即狂勞顛倒華相。
E017: 阿難言：此勞同結，云何解除？如來以手，將所結巾，偏掣其左，問阿難言：如是解不？不也，世尊。旋復以手，偏牽右邊，又問阿難：
      如是解不？不也，世尊。佛告阿難：我今以手，左右各牽，竟不能解，汝設方便，云何解成？阿難白佛言：世尊！當於結心解即分散。
      佛告阿難：如是！如是！若欲除結，當於結心。
E018: 阿難！我說佛法，從因緣生，非取世間和合麤相。如來發明，世出世法，知其本因隨所緣出。如是乃至恒沙界外，一滴之雨，亦知頭數；
      現前種種，松直棘曲，鵠白烏玄，皆了元由。是故阿難！隨汝心中，選擇六根，根結若除，塵相自滅，諸妄銷亡，不真何待？
E019: 阿難！我今問汝：此劫波羅巾，六結現前。同時解縈，得同除不。不也，世尊。是結本以次第綰生，今日當須次第而解；
      六結同體，結不同時，則結解時，云何同除？
      佛言：六根解除，亦復如是。此根初解，先得人空；空性圓明，成法解脫；解脫法已，俱空不生。是名菩薩，從三摩地，得無生忍。
E020: 阿難及諸大眾，蒙佛開示，慧覺圓通，得無疑惑。一時合掌，頂禮雙足，而白佛言：我等今日，身心皎然，快得無礙！雖復悟知
      ，一六亡義，然猶未達，圓通本根。世尊！我輩飄零，積劫孤露，何心何慮，預佛天倫，如失乳兒，忽遇慈母；若復因此，際會道成，所得密言；
      還同本悟，則與未聞，無有差別。惟垂大悲，惠我密嚴，成就如來，最後開示。作是語已，五體投地，退藏密機，冀佛冥授。
E021: 爾時世尊，普告眾中諸大菩薩，及諸無漏大阿羅漢：汝等菩薩，及阿羅漢，生我法中，得成無學。
      我今問汝：最初發心悟十八界，誰為圓通？從何方便，入三摩地？
E022: 憍陳那五比丘，即從座起頂禮佛足，而白佛言：我在鹿苑及於雞園，觀見如來最初成道；於佛音聲，悟明四諦。
      佛問比丘，我初稱解，如來印我，名阿若多。妙音密圓，我於音聲，得阿羅漢。佛問圓通，如我所證，音聲為上。
E023: 優波尼沙陀，即從座起，頂禮佛足，而白佛言：我亦觀佛，最初成道。觀不淨相，生大厭離，悟諸色性，以從不淨，白骨微塵，歸於虛空，
      空色二無，成無學道。如來印我，名尼沙陀，塵色既盡，妙色密圓。我從色相，得阿羅漢。佛問圓通，如我所證，色因為上。
E024: 香嚴童子，即從座起，頂禮佛足，而白佛言：我聞如來，教我諦觀，諸有為相。我時辭佛，宴晦清齋；見諸比丘，燒沈水香，香氣寂然，來入鼻中。
      我觀此氣，非木、非空、非煙、非火，去無所著，來無所從；由是意銷，發明無漏。如來印我，得香嚴號。塵氣倏滅，妙香密圓。我從香嚴，得阿羅漢。
      佛問圓通，如我所證，香嚴為上。
E025: 藥王藥上，二法王子，並在會中五百梵天，即從座起，頂禮佛足，而白佛言：我無始劫為世良醫，口中嘗此裟婆世界，草木金石，名數凡有十萬八千。
      如是悉知苦、酢、鹹、淡、甘、辛等味，並諸和合、俱生變異。是冷、是熱、有毒、無毒，悉能遍知。
      承事如來，了知味性，非空，非有，非即身心，非離身心。分別味因，從是開悟。蒙佛如來，印我昆季，藥王、藥上二菩薩名。
      今於會中，為法王子；因味覺明，位登菩薩。佛問圓通，如我所證；味因為上。
E026: 跋陀婆羅並其同伴十六開士，即從座起，頂禮佛足，而白佛言：我等先於威音王佛，聞法出家；於浴僧時，隨例入室，忽悟水因，既不洗塵，亦不洗體，
      中間安然，得無所有。宿習無忘，乃至今時，從佛出家，令得無學，彼佛名我跋陀婆羅，妙觸宣明，成佛子住。佛問圓通，如我所證，觸因為上。
E027: 摩訶迦葉，及紫金光比丘尼等，即從座起，頂禮佛足，而白佛言：我於往劫，於此界中，有佛出世，名日月燈，我得親近，聞法修學；佛滅度後，
      供養舍利，燃燈續明，以紫金光，塗佛形像，自爾以來，世世生生，身常圓滿紫金光聚；此紫金光比丘尼等，即我眷屬，同時發心。我觀世間，六塵變壞，
      唯以空寂修於滅盡，身心乃能度百千劫，猶如彈指。我以空法，成阿羅漢。世尊說我，頭陀為最，妙法開明，銷滅諸漏。佛問圓通，如我所證，法因為上。
E028: 阿那律陀，即從座起，頂禮佛足，而白佛言：我初出家，常樂睡眠，如來訶我，為畜生類。我聞佛訶，啼泣自責，七日不眠，失其雙目。
      世尊示我樂見照明金剛三昧。我不因眼，觀見十方，精真洞然，如觀掌果。如來印我，成阿羅漢。佛問圓通，如我所證，旋見循元，斯為第一。
E029: 周利槃特迦，即從座起，頂禮佛足，而白佛言：我闕誦持，無多聞性，最初值佛，聞法出家，憶持如來，一句伽陀，於一百日，得前遺後，得後遺前。
      佛愍我愚，教我安居，調出入息，我時觀息，微細窮盡，生住異滅，諸行剎那。其心豁然，得大無礙，乃至漏盡，成阿羅漢。住佛座下，印成無學。
      佛問圓通，如我所證，反息循空，斯為第一。
E030: 憍梵缽提，即從座起，頂禮佛足，而白佛言：我有口業，於過去劫，輕弄沙門，世世生生，有牛呵病。如來示我，一味清淨，心地法門，我得滅心，入三摩地，
      觀味之知，非體非物，應念得超世間諸漏。內脫身心，外遺世界，遠離三有，如鳥出籠，離垢銷塵，法眼清淨，成阿羅漢。如來親印登無學道。
      佛問圓通，如我所證，還味旋知，斯為第一。
E031: 畢陵伽婆蹉，即從座起，頂禮佛足，而白佛言：我初發心，從佛入道，數聞如來，說諸世間，不可樂事。
      乞食城中，心思法門，不覺路中，毒刺傷足，舉身疼痛！我念有知，知此深痛；雖覺覺痛，覺清淨心，無痛痛覺。
      我又思惟，如是一身，寧有雙覺，攝念未久，身心忽空，三七日中，諸漏虛盡，成阿羅漢，得親印記，發明無學。
      佛問圓通，如我所證，純覺遺身，斯為第一。
E032: 須菩提，即從座起，頂禮佛足，而白佛言：我曠劫來，心得無礙，自憶受生，如恒河沙，初在母胎，即知空寂，如是乃至，十方成空；
      亦令眾生，證得空性。蒙如來發性覺真空，空性圓明，得阿羅漢。頓入如來，寶明空海，同佛知見；印成無學，解脫性空，我為無上。
      佛問圓通，如我所證，諸相入非，非所非盡，旋法歸無，斯為第一。
E033: 舍利弗，即從座起，頂禮佛足，而白佛言：我曠劫來，心見清淨，如是受生，如恒河沙。世出世間，種種變化，一見則通，獲無障礙。
      我於路中，逢迦葉波，兄弟相逐，宣說因緣，悟心無際；從佛出家，見覺明圓，得大無畏，成阿羅漢，為佛長子，從佛口生，從法化生。
      佛問圓通；如我所證，心見發光，光極知見，斯為第一。
E034: 普賢菩薩，即從座起，頂禮佛足，而白佛言：我已曾與恒沙如來為法王子，十方如來教其弟子，菩薩根者，修普賢行，從我立名。
      世尊！我用心聞，分別眾生，所有知見；若於他方恒沙界外，有一眾生，心中發明普賢行者，我於爾時，乘六牙象，分身百千，皆至其處。
      縱彼障深，未得見我；我與其人，暗中摩頂，擁護安慰，令其成就。佛問圓通，我說本因，心聞發明，分別自在，斯為第一。
E035: 孫陀羅難陀，即從座起，頂禮佛足，而白佛言：我初出家，從佛入道，雖具戒律，於三摩地，心常散動，未獲無漏。世尊教我，及拘絺羅，觀鼻端白。
      我初諦觀，經三七日，見鼻中氣，出入如煙，身心內明，圓洞世界；遍成虛淨，猶如琉璃，煙相漸消，鼻息成白。心開漏盡，諸出入息，化為光明，
      照十方界，得阿羅漢。世尊記我，當得菩提。佛問圓通，我以銷息，息久發明，明圓滅漏，斯為第一。
E036: 富樓那彌多羅尼子，即從座起，頂禮佛足，而白佛言：我曠劫來，辯才無礙，宣說苦空，深達實相。如是乃至，恒沙如來，秘密法門，我於眾中，
      微妙開示，得無所畏。世尊知我，有大辯才，以音聲輪，教我發揚。我於佛前，助佛轉輪，因師子吼，成阿羅漢。世尊印我，說法無上。佛問圓通，
      我以法音，降伏魔怨，銷滅諸漏，斯為第一。
E037: 優波離即從座起，頂禮佛足，而白佛言：我親隨佛，逾城出家，親觀如來，六年勤苦；親見如來，降伏諸魔，制諸外道，解脫世間，貪欲諸漏。
      承佛教戒，如是乃至，三千威儀，八萬微細，性業遮業，悉皆清淨，身心寂滅，成阿羅漢。我是如來眾中綱紀，親印我心，持戒修身，眾推為上。
      佛問圓通，我以執身，身得自在；次第執心，心得通達，然後身心一切通利，斯為第一。
E038: 大目犍連，即從座起，頂禮佛足，而白佛言：我初於路乞食，逢遇優樓頻螺，伽耶、那提三迦葉波，宣說如來，因緣深義，我頓發心，得大通達。
      如來惠我，袈裟著身，鬚髮自落。我遊十方，得無掛礙，神通發明，推為無上，成阿羅漢。寧唯世尊，十方如來，嘆我神力，圓明清淨，自在無畏。
      佛問圓通，我以旋湛心光發宣，如澄濁流，久成清瑩，斯為第一。
E039: 烏芻瑟摩，於如來前，合掌頂禮佛之雙足，而白佛言：我常先憶，久遠劫前，性多貪欲。有佛出世，名曰空王。說多婬人，成猛火聚；教我遍觀，
      百骸四肢，諸冷暖氣。神光內凝，化多婬心，成智慧火。從是諸佛，皆呼召我，名為火頭。我以火光三昧力故，成阿羅漢。心發大願，諸佛成道，
      我為力士，親伏魔怨。佛問圓通，我以諦觀身心暖觸，無礙流通，諸漏既銷，生大寶焰，登無上覺，斯為第一。
E040: 持地菩薩，即從座起，頂禮佛足，而白佛言：我念往昔，普光如來，出現於世，我為比丘，常於一切要路津口，田地險隘，有不如法，妨損車馬，
      我皆平填。或作橋梁，或負沙土。如是勤苦，經無量佛，出現於世。或有眾生，於闤闠處，要人擎物，我先為擎，至其所詣，放物即行不取其值。
      毗捨浮佛，現在世時，世多飢荒，我為負人，無問遠近，唯取一錢，或有車牛，被於泥溺，我有神力，為其推輪，拔其苦惱。
E041: 時國大王，延佛設齋。我於爾時，平地待佛。毗舍如來，摩頂謂我，當平心地，則世界地；一切皆平。我即心開，見身微塵，與造世界，所有微塵，
      等無差別。微塵自性，不相觸摩，乃至刀兵，亦無所觸。我於法性，悟無生忍，成阿羅漢，回心今入菩薩位中。聞諸如來，宣妙蓮華，佛知見地；
      我先證明，而為上首。佛問圓通，我以諦觀，身界二塵，等無差別，本如來藏，虛妄發塵，塵銷智圓，成無上道，斯為第一。
E042: 月光童子，即從座起，頂禮佛足，而白佛言：我憶往昔，恒河沙劫，有佛出世，名為水天。教諸菩薩，修習水觀，入三摩地。
      觀於身中水性無奪，初從涕唾，如是窮盡津液精血，大小便利，身中旋復水性一同。見水身中，與世界外浮幢王剎，諸香水海，等無差別。
      我於是時，初成此觀，但見其水，未得無身。
E043: 當為比丘，室中安禪，我有弟子，窺窗觀室；唯見清水，遍在室中，了無所見。童稚無知，取一瓦礫投於水內，激水作聲，顧盼而去。我出定後，
      頓覺心痛，如舍利弗，遭違害鬼。我自思惟：今我已得阿羅漢道，久離病緣，云何今日，忽生心痛，將無退失？爾時童子，捷來我前，說如上事。
      我即告言：汝更見水，可即開門，入此水中，除去瓦礫。童子奉教，後入定時，還復見水，瓦礫宛然，開門除出。我後出定，身質如初。
E044: 逢無量佛，如是至於山海自在通王如來，方得亡身，與十方界，諸香水海，性合真空，無二無別。今於如來，得童真名，預菩薩會。
      佛問圓通，我以水性，一味流通，得無生忍，圓滿菩提，斯為第一。
E045: 琉璃光法王子，即從座起，頂禮佛足，而白佛言：我憶往昔，經恒沙劫，有佛出世，名無量聲。開示菩薩，本覺妙明；觀此世界，及眾生身；
      皆是妄緣，風力所轉。我於爾時，觀界安立，觀世動時，觀身動止，觀心動念，諸動無二，等無差別。我時覺了，此群動性，來無所從，去無所至，
      十方微塵，顛倒眾生，同一虛妄。如是乃至，三千大千，一世界內，所有眾生，如一器中，貯百蚊蚋，啾啾亂鳴；於分寸中，鼓發狂鬧。
E046: 逢佛未幾，得無生忍。爾時心開，乃見東方不動佛國，為法王子，事十方佛；身心發光，洞徹無礙。
      佛問圓通，我以觀察風力無依，悟菩提心，入三摩地，合十方佛，傳一妙心，斯為第一。
E047: 虛空藏菩薩，即從座起，頂禮佛足，而白佛言：我與如來，定光佛所，得無邊身。爾時手執四大寶珠，照明十方，微塵佛剎，化成虛空。
      又於自心，現大圓鏡，內放十種微妙寶光，流灌十方，盡虛空際。諸幢王剎，來入鏡內，涉入我身，身同虛空，不相妨礙。
      身能善入，微塵國土，廣行佛事，得大隨順。此大神力，由我諦觀：四大無依，妄想生滅，虛空無二，佛國本同，於同發明，得無生忍。
      佛問圓通，我以觀察虛空無邊，入三摩地，妙力圓明，斯為第一。
E048: 彌勒菩薩，即從座起，頂禮佛足，而白佛言：我憶往昔，經微塵劫，有佛出世；名日月燈明。我從彼佛，而得出家，心重世名，好遊族姓。
      爾時世尊，教我修習，唯心識定，入三摩地。歷劫已來，以此三昧，事恒沙佛，求世名心，歇滅無有。
E049: 至燃燈佛，出現於世；我乃得成，無上妙圓，識心三昧。乃至盡空如來國土，淨穢有無，皆是我心變化所現。世尊，我了如是，唯心識故；
      識性流出，無量如來，今得授記，次補佛處。佛問圓通，我以諦觀，十方唯識，識心圓明，入圓成實，遠離依他，及遍計執，得無生忍，斯為第一。
E050: 大勢至法王子，與其同倫五十二菩薩，即從座起，頂禮佛足，而白佛言：我憶往昔，恒河沙劫，有佛出世，名無量光，十二如來，相繼一劫，
      其最後佛，名超日月光；彼佛教我，念佛三昧，譬如有人，一專為憶，一人專忘，如是二人，若逢不逢，或見非見。
      二人相憶，二憶念深，如是乃至從生至生，同於形影，不相乖異。
E051: 十方如來，憐念眾生，如母憶子；若子逃逝，雖憶何為？子若憶母，如母憶時，母子歷生，不相違遠。
      若眾生心憶佛念佛，現前當來，必定見佛，去佛不遠。不假方便自得心開，如染香人，身有香氣；此則名曰：香光莊嚴。
E052: 我本因地，以念佛心入無生忍。今於此界，攝念佛人歸於淨土。佛問圓通，我無選擇，都攝六根，淨念相繼，得三摩地，斯為第一。

F001: 爾時觀世音菩薩，即從座起，頂禮佛足，而白佛言：世尊！憶念我昔無數恒河沙劫，於時有佛，出現於世，名觀世音。
      我於彼佛，發菩提心，彼佛教我，從聞、思、修，入三摩地。
F002: 初於聞中，入流亡所。
F003: 所入既寂，動靜二相，了然不生。
F004: 如是漸增，聞所聞盡。
F005: 盡聞不住，覺所覺空。
F006: 空覺極圓，空所空滅，生滅既滅，寂滅現前。
F007: 忽然超越，世出世間，十方圓明，獲二殊勝。一者上合十方諸佛本妙覺心，與佛如來，同一慈力；二者，下合十方一切六道眾生，與諸眾生，同一悲仰。
F008: 世尊！由我供養，觀音如來，蒙彼如來，授我如幻、聞薰聞修、金剛三昧，與佛如來，同慈力故，令我身成三十二應，入諸國土。
F009: 世尊！若諸菩薩，入三摩地，進修無漏，勝解現圓，我現佛身而為說法，令其解脫。若諸有學寂靜妙明，勝妙現圓；
      我於彼前，現獨覺身而為說法，令其解脫。若諸有學，斷十二緣，緣斷勝性，勝妙現圓；我於彼前，現緣覺身而為說法，令其解脫。
      若諸有學，得四諦空，修道入滅，勝性現圓；我於彼前，現聲聞身而為說法，令其解脫。
F010: 若諸眾生，欲心明悟，不犯欲塵，欲身清淨，我於彼前，現梵王身而為說法，令其解脫。
F011: 若諸眾生，欲為天主，統領諸天；我於彼前，現帝釋身而為說法，令其成就。
F012: 若諸眾生，欲身自在，遊行十方；我於彼前，現自在天身而為說法，令其成就。
F013: 若諸眾生，欲身自在，飛行虛空，我於彼前，現大自在天身而為說法，令其成就。
F014: 若諸眾生，愛統鬼神，救護國土；我於彼前，現天大將軍身而為說法，令其成就。
F015: 若諸眾生，愛統世界，保護眾生；我於彼前，現四天王身而為說法，令其成就
F016: 若諸眾生，愛生天宮，驅使鬼神；我於彼前，現四天王國太子身而為說法，令其成就。
F017: 若諸眾生，樂為人王；我於彼前，現人王身而為說法，令其成就。
F018: 若諸眾生，愛主族姓，世間推讓，我於彼前現長者身，而為說法，令其成就。
F019: 若有眾生，愛談名言，清淨自居，我於彼前現居士身，而為說法，令其成就。
F020: 若有眾生，愛治國土，剖斷邦邑；我於彼前現宰官身，而為說法，令其成就。
F021: 若諸眾生，愛諸數術，攝衛自居；我於彼前現婆羅門身，而為說法，令其成就。
F022: 若有男子，好學出家，持諸戒律；我於彼前現比丘身，而為說法，令其成就。
F023: 若有女人，好學出家，持諸禁戒；我於彼前現比丘尼身，而為說法，令其成就。
F024: 若有男子，樂持五戒。我於彼前，現優婆塞身而為說法，令其成就。若有女子，五戒自居，我於彼前現優婆夷身，而為說法，令其成就。
F025: 若有女人，內政立身，以修家國，我於彼前現女主身、及國夫人、命婦大家，而為說法，令其成就。
F026: 若有眾生，不壞男根，我於彼前現童男身，而為說法，令其成就。若有處女，愛樂處身，不求侵暴，我於彼前現童女身，而為說法，令其成就。
F027: 若有諸天，樂出天倫，我現天身而為說法，令其成就。
F028: 若有諸龍，樂出龍倫，我現龍身而為說法，令其成就。
F029: 若有藥叉，樂度本倫；我於彼前現藥叉身，而為說法，令其成就。
F030: 若乾闥婆，樂脫其倫，我於彼前現乾闥婆身，而為說法，令其成就。
F031: 若阿修羅，樂脫其倫；我於彼前現阿修羅身，而為說法，令其成就。
F032: 若緊那羅，樂脫其倫，我於彼前現緊那羅身，而為說法，令其成就。
F033: 若摩呼羅伽，樂脫其倫；我於彼前現摩呼羅伽身，而為說法，令其成就。
F034: 若諸眾生，樂人修人，我現人身而為說法，令其成就。
F035: 若諸非人，有形無形，有想無想，樂脫其倫；我於彼前皆現其身，而為說法，令其成就。
F036: 是名妙淨，三十二應，入國土身；皆以三昧聞熏聞修，無作妙力，自在成就。
F037: 世尊！我復以此聞熏聞修，金剛三昧，無作妙力，與諸十方三世六道一切眾生，同悲仰故；令諸眾生，於我身心，獲十四種無畏功德。
F038: 一者，由我不自觀音，以觀觀者；令彼十方苦惱眾生，觀其音聲，即得解脫。
F039: 二者，知見旋復，令諸眾生，設入大火，火不能燒。
F040: 三者，觀聽旋復，令諸眾生，大水所漂，水不能溺。
F041: 四者，斷滅妄想，心無殺害；令諸眾生，入諸鬼國，鬼不能害。
F042: 五者，熏聞成聞，六根銷復，同於聲聽。能令眾生，臨當被害，刀段段壞；使其兵戈，猶如割水，亦如吹光，性無搖動。
F043: 六者，聞薰精明，明遍法界，則諸幽暗，性不能全，能令眾生，藥叉羅剎，鳩槃茶鬼，及毗舍遮，富單那等，雖近其傍，目不能視。
F044: 七者，音性圓銷，觀聽返入，離諸塵妄；能令眾生，禁系枷鎖，所不能著。
F045: 八者，滅音圓聞，遍生慈力，能令眾生，經過險路，賊不能劫。
F046: 九者，熏聞離塵，色所不劫，能令一切多婬眾生，遠離貪欲。
F047: 十者，純音無塵，根境圓融，無對所對；能令一切忿恨眾生，離諸瞋恚。
F048: 十一者，銷塵旋明，法界身心，猶如琉璃，朗徹無礙；能令一切昏鈍性障，諸阿顛迦，永離癡暗。
F049: 十二者，融形復聞，不動道場涉入世間，不壞世界。能遍十方，供養微塵諸佛如來；各各佛邊，為法王子。
      能令法界，無子眾生，欲求男者，誕生福德智慧之男。
F050: 十三者，六根圓通，明照無二，含十方界，立大圓鏡，空如來藏。承順十方，微塵如來秘密法門，受領無失；能令法界無子眾生；
      欲求女者，誕生端正福德柔順，眾人愛敬有相之女。
F051: 十四者，此三千大千世界，百億日月，現住世間諸法王子，有六十二恒河沙數，修法垂範，教化眾生；隨順眾生，方便智慧，各各不同。
      由我所得圓通本根，發妙耳門，然後身心微妙含容，周遍法界，能令眾生持我名號，與彼共持六十二恒河沙諸法王子，二人福德，正等無異。
      世尊：我一名號，與彼眾多名號無異，由我修習，得真圓通。
F052: 是名十四無畏力，福備眾生。
F053: 世尊，我又獲是圓通，修證無上道故，又能善獲四不思議無作妙德。
F054: 一者，由我初獲妙妙聞心，心精遺聞，見聞覺知，不能分隔，成一圓融清淨寶覺，故我能現眾多妙容，能說無邊秘密神咒。
F055: 其中或現，一首三首，五首七首，九首十一首，如是乃至一百八首，千首萬首，八萬四千爍迦羅首。二臂四臂，六臂八臂，十臂十二臂，
      十四十六十八，二十至二十四，如是乃至一百八臂，千臂萬臂，八萬四千母陀羅臂。二目三目，四目九目，如是乃至一百八目，千目萬目，
      八萬四千清淨寶目。或慈或威，或定或慧，救護眾生，得大自在。
F056: 二者，由我聞思，脫出六塵；如聲度垣，不能為礙。故我妙能現一一形，誦一一咒；其形其咒，能以無畏，施諸眾生。
      是故十方微塵國土，皆名我為施無畏者。
F057: 三者，由我修習本妙圓通，清淨本根；所遊世界，皆令眾生，捨身珍寶，求我哀愍。
F058: 四者，我得佛心，證於究竟。能以珍寶種種，供養十方如來；傍及法界六道眾生。
      求妻得妻，求子得子，求三昧得三昧，求長壽得長壽，如是乃至，求大涅槃得大涅槃。
F059: 佛問圓通，我從耳門圓照三昧，緣心自在；因入流相，得三摩地，成就菩提，斯為第一。
F060: 世尊，彼佛如來，嘆我善得圓通法門，於大會中，授記我為觀世音號。由我觀聽十方圓明，故觀音名，遍十方界。
F061: 爾時世尊，於師子座，從其五體，同放寶光，遠灌十方微塵如來，及法王子諸菩薩頂，彼諸如來，亦於五體同放寶光，從微塵方來灌佛頂，
      並灌會中諸大菩薩，及阿羅漢。
F062: 林木池沼，皆演法音，交光相羅，如寶絲網，是諸大眾，得未曾有，一切普獲金剛三昧。
F063: 即時天雨，百寶蓮華，青黃赤白，間錯紛糅，十方虛空，成七寶色。此娑婆界，大地山河，俱時不現；
      唯見十方，微塵國土，合成一界，梵唄詠歌，自然敷奏。
F064: 於是如來，告文殊師利法王子，汝今觀此二十五無學，諸大菩薩，及阿羅漢，各說最初成道方便，皆言修習，真實圓通；彼等修行，實無優劣，前後差別。
      我今欲令阿難開悟，二十五行，誰當其根；兼我滅後，此界眾生，入菩薩乘，求無上道，何方便門，得易成就？
F065: 文殊師利法王子，奉佛慈旨，即從座起，頂禮佛足，承佛威神，說偈對佛。
F066: 覺海性澄圓，圓澄覺元妙。
F067: 元明照生所，所立照性亡；迷妄有虛空，依空立世界，想澄成國土，知覺乃眾生。
F068: 空生大覺中，如海一漚發，有漏微塵國，皆依空所生；漚滅空本無，況復諸三有。
F069: 歸元性無二，方便有多門，勝性無不通，順逆皆方便；初心入三昧，遲速不同倫。
F070: 色想結成塵，精了不能徹；如何不明徹，於是獲圓通。音聲雜語言，但伊名句味；一非含一切，云何獲圓通？
      香以合中知，離則元無有；不恒其所覺，云何獲圓通？味性非本然，要以味時有；其覺不恒一，云何獲圓通？
      觸以所觸明，無所不明觸；合離性非定，云何獲圓通？法稱為內塵，憑塵必有所；能所非遍涉，云何獲圓通？
F071: 見性雖洞然，明前不明後；四維虧一半，云何獲圓通？鼻息出入通，現前無交氣；支離匪涉入，云何獲圓通？
      舌非入無端，因味生覺了；味亡了無有，云何獲圓通？身與所觸同，各非圓覺觀；涯量不冥會，云何獲圓通？
      知根雜亂思，湛了終無見；想念不可脫，云何獲圓通？
F072: 識見雜三和，詰本稱非相；自體先無定，云何獲圓通？心聞洞十方，生於大因力；初心不能入，云何獲圓通？
      鼻想本權機，祇令攝心住；住成心所住，云何獲圓通？說法弄音文，開悟先成者；名句非無漏，云何獲圓通？
      持犯但束身，非身無所束；元非遍一切，云何獲圓通？神通本宿因，何關法分別？念緣非離物，云何獲圓通？
F073: 若以地性觀，堅礙非通達；有為非勝性，云何獲圓通？若以水性觀，想念非真實；如如非覺觀，云何獲圓通？
      若以火性觀，厭有非真離；非初心方便，云何獲圓通？若以風性觀，動寂非無對，對非無上覺，云何獲圓通？
      若以空性觀，昏鈍先非覺；無覺異菩提，云何獲圓通？若以識性觀，觀識非常住；存心乃虛妄，云何獲圓通？
      諸行是無常，念性元生滅；因果今殊感，云何獲圓通？
F074: 我今白世尊：佛出裟婆界，此方真教體，清淨在音聞；欲取三摩提，實以聞中入。
F075: 離苦得解脫，良哉觀世音；於恒沙劫中，入微塵佛國；得大自在力，無畏施眾生。
      妙音觀世音，梵音海潮音，救世悉安寧，出世獲常住。
F076: 我今啟如來，如觀音所說，譬如人靜居，十方俱擊鼓，十處一時聞，此則圓真實。
F077: 目非觀障外，口鼻亦復然，身以合方知，心念紛無緒；隔垣聽音響，遐邇俱可聞，五根所不齊，是則通真實。
F078: 音聲性動靜，聞中為有無，無聲號無聞，非實聞無性；聲無既無滅，聲有亦非生，生滅二圓離，是則常真實。
      縱令在夢想，不為不思無，覺觀出思惟，身心不能及。
F079: 今此娑婆國，聲論得宣明，眾生迷本聞，循聲故流轉。阿難縱強記，不免落邪思，豈非隨所淪，旋流獲無妄？
F080: 阿難汝諦聽，我承佛威力，宣說金剛王，如幻不思議，佛母真三昧。
      汝聞微塵佛，一切秘密門；欲漏不先除，蓄聞成過誤。將聞持佛佛，何不自聞聞？
      聞非自然生，因聲有名字，旋聞與聲脫，能脫欲誰名？一根既返源，六根成解脫。
F081: 見聞如幻翳，三界若空華，聞復翳根除，塵銷覺圓淨。
      淨極光通達，寂照含虛空；卻來觀世間，猶如夢中事，摩登伽在夢，誰能留汝形？
F082: 如世巧幻師，幻作諸男女，雖見諸根動，要以一機抽；息機歸寂然，諸幻成無性。
      六根亦如是，元依一精明，分成六和合；一處成休復，六用皆不成；
      塵垢應念銷，成圓明淨妙，餘塵尚諸學，明極即如來。
F083: 大眾及阿難，旋汝倒聞機，反聞聞自性，性成無上道，圓通實如是。
F084: 此是微塵佛，一路涅槃門，過去諸如來，斯門已成就。現在諸菩薩，今各入圓明；
      未來修學人，當依如是法。我亦從中證，非惟觀世音。
F085: 誠如佛世尊，詢我諸方便，以救諸末劫，求出世間人，成就涅槃心，觀世音為最。
      自餘諸方便，皆是佛威神，即事捨塵勞，非是長修學，淺深同說法。
F086: 頂禮如來藏，無漏不思議；願加被未來，於此門無惑，方便易成就。
      堪以教阿難，及末劫沈淪，但以此根修，圓通超餘者，真實心如是。
F087: 於是阿難及諸大眾，身心了然，得大開示，觀佛菩提，及大涅槃；
      猶如有人，因事遠遊，未得歸還，明了其家，所歸道路。
      普會大眾，天龍八部，有學二乘，及諸一切，新發心菩薩，其數凡有十恒河沙，皆得本心，遠塵離垢，獲法眼淨。
      性比丘尼，聞說偈已，成阿羅漢。無量眾生；皆發無等等阿耨多羅三藐三菩提心。
F088: 阿難整衣，於大眾中，合掌頂禮，心跡圓明，悲欣交集，欲益未來，諸眾生故，稽首白佛，大悲世尊，
      我今已悟成佛法門，是中修行，得無疑惑。
      常聞如來說如是言，自未得度，先度人者，菩薩發心；自覺已圓，能覺他者，如來應世。我雖未度，願度末劫一切眾生。
      世尊，此諸眾生，去佛漸遠，邪師說法，如恒河沙，欲攝其心，入三摩地，云何令其，安立道場，遠諸魔事？於菩提心，得無退屈？
F089: 爾時世尊，於大眾中稱讚阿難：善哉善哉，如汝所問，安立道場，救護眾生，末劫沈溺，汝今諦聽，當為汝說。阿難大眾，唯然奉教。
F090: 佛告阿難：汝常聞我毗奈耶中，宣說修行，三決定義。所謂攝心為戒，因戒生定，因定發慧，是則名為三無漏學。
F091: 阿難，云何攝心，我名為戒？
F092: 若諸世界，六道眾生，其心不婬，則不隨其生死相績。汝修三昧，本出塵勞，婬心不除，塵不可出。
      縱有多智，禪定現前，如不斷婬，必落魔道。
      上品魔王；中品魔民，下品魔女，彼等諸魔，亦有徒眾，各各自謂成無上道。
      我滅度後，末法之中，多此魔民，熾盛世間。
      廣行貪婬，為善知識，令諸眾生，落愛見坑，失菩提路。
F093: 汝教世人修三摩地，先斷心婬，是名如來，先佛世尊，第一決定清淨明誨。
F094: 是故阿難，若不斷婬，修禪定者，如蒸砂石，欲其成飯，經百千劫，祇名熱砂，何以故？此非飯本，砂石成故。
F095: 汝以婬身，求佛妙果，縱得妙悟，皆是婬根，根本成婬，輪轉三塗，必不能出；如來涅槃，何路修證？
F096: 必使婬機，身心俱斷，斷性亦無，於佛菩提，斯可希冀。如我此說，名為佛說；不如此說，即波旬說。
F097: 阿難，又諸世界，六道眾生，其心不殺，則不隨其生死相續。汝修三昧，本出塵勞，殺心不除，塵不可出；
      縱有多智，禪定現前，如不斷殺，必落神道。
      上品之人，為大力鬼；中品則為飛行夜叉諸鬼帥等；下品當為地行羅剎。彼諸鬼神，亦有徒眾，各各自謂成無上道。
      我滅度後，末法之中多此鬼神熾盛世間，自言食肉得菩提路。
F098: 阿難，我令比丘食五淨肉，此肉皆我神力化生，本來命根；汝婆羅門，地多蒸濕，加以砂石，草菜不生，我以大悲神力所加，
      因大慈悲，假名為肉，汝得其味。奈何如來滅度之後，食眾生肉，名為釋子。
F099: 汝等當知，是食肉人，縱得心開，似三摩地，皆大羅剎，報終必沈生死苦海，非佛弟子。如是之人，相殺相吞，相食未已，云何是人得出三界？
F100: 汝教世人，修三摩地，次斷殺生，是名如來先佛世尊，第二決定清淨明誨。
F101: 是故阿難，若不斷殺，修禪定者；譬如有人，自塞其耳，高聲大叫，求人不聞，此等名為欲隱彌露。
F102: 清淨比丘，及諸菩薩，於歧路行，不蹋生草，況以手拔？云何大悲，取諸眾生血肉充食？若諸比丘，不服東方絲綿絹帛，及是此土，
      靴履裘毳，乳酩醍醐；如是比丘，於世真脫，酬還宿債，不遊三界。何以故？服其身分，皆為彼緣，如人食其地中百谷，足不離地。
F103: 必使身心，於諸眾生，若身身分，身心二塗，不服不食，我說是人，真解脫者。如我此說，名為佛說，不如此說，即波旬說。
F104: 阿難，又復世界，六道眾生，其心不偷，則不隨其生死相續。汝修三昧，本出塵勞，偷心不除，塵不可出。縱有多智，禪定現前，如不斷偷，必落邪道；
      上品精靈，中品妖魅，下品邪人。諸魅所著，彼等群邪，亦有徒眾，各各自謂，成無上道。我滅度後，末法之中，多此妖邪，熾盛世間，潛匿奸欺，
      稍善知識，各自為己，得上人法，誘惑無識，恐令失心，所過之處，其家耗散。
F105: 我教比丘，循方乞食，令其捨貪，成菩提道。諸比丘等，不自熟食，寄於殘生，旅泊三界，示一往還，去已無返。
      云何賊人，假我衣服，裨販如來，造種種業，皆言佛法？卻非出家具戒比丘，為小乘道，由是疑誤，無量眾生，墮無間獄。
F106: 若我滅後，其有比丘，發心決定，修三摩提，能於如來形像之前，身燃一燈，燒一指節，及於身上，爇一香炷。我說是人，無始宿債，一時酬畢，
      長揖世間，永脫諸漏，雖未即明無上覺路，是人於法已決定心。若不為此捨身微因，縱成無為，必還生人；酬其宿債，如我馬麥，正等無異。
F107: 汝教世人，修三摩地，後斷偷盜，是名如來先佛世尊；第三決定清淨明誨。
F108: 是故阿難，若不斷偷，修禪定者，譬如有人，水灌漏卮，欲求其滿，縱經塵劫，終無平復。
F109: 若諸比丘，衣缽之餘，分寸不蓄，乞食餘分，施餓眾生。於大集會，合掌禮眾。有人捶詈，同於稱讚，必使身心，二俱捐捨，身肉骨血，與眾生共。
      不將如來，不了義說，迴為己解，以誤初學，佛印是人，得真三昧。如我所說，名為佛說，不如此說，即波旬說。
F110: 阿難！如是世界，六道眾生，雖則身心，無殺盜婬，三行已圓，若大妄語，即三摩地，不得清淨。成愛見魔，失如來種，所謂未得謂得，未證言證；
      為求世間尊勝第一。謂前人言，我今已得須陀洹果，斯陀含果，阿那含果，阿羅漢道，辟支佛乘，十地地前，諸位菩薩。
      求彼禮懺，貪其供養，是一顛迦，消滅佛種；如人以刀斷多羅木，佛記是人，永殞善根，無復知見，沈三苦海，不成三昧。
F111: 我滅度後，敕諸菩薩，及阿羅漢，應身生彼末法之中，作種種形，度諸輪轉。或作沙門，白衣居士，人王宰官，童男童女，如是乃至，
      婬女寡婦，奸偷屠販，與其同事，稱讚佛乘，令其身心，入三摩地；終不自言，我真菩薩，真阿羅漢，泄佛密因，輕言末學。
      唯除命終，陰有遺付，云何是人，惑亂眾生，成大妄語。
F112: 汝教世人修三摩地，後復斷除，諸大妄語，是名如來，先佛世尊，第四決定清淨明誨。
F113: 是故阿難，若不斷其大妄語者，如刻人糞，為栴檀形，欲求香氣，無有是處。
F114: 我教比丘，直心道場，於四威儀，一切行中，尚無虛假，云何自稱，得上人法？譬如窮人，妄號帝王，自取誅滅；況復法王，如何妄竊？
      因地不真，果招迂曲，求佛菩提，如噬臍人，欲誰成就？
F115: 若諸比丘，心如直弦，一切真實，入三摩地，永無魔事。我印是人，成就菩薩，無上知覺。如我此說，名為佛說；不如此說，即波旬說。

G001: 阿難，汝問攝心，我今先說入三摩地，修學妙門，求菩薩道，要先持此四種律儀，皎如冰霜，自不能生一切枝葉，心三口四，生必無因。
      阿難，如是四事，若不遺失，心尚不緣色香味觸；一切魔事，云何發生？
G002: 若有宿習，不能滅除，汝教是人，一心誦我佛頂光明，摩訶薩怛多般怛羅無上神咒。斯是如來，無見頂相，無為心佛，從頂發輝，坐寶蓮華，所說神咒。
G003: 且汝宿世，與摩登伽，歷劫因緣，恩愛習氣，非是一生，及與一劫。我一宣揚，愛心永脫，成阿羅漢。彼尚婬女，無心修行；神力冥資，速登無學。
      云何汝等，在會聲聞，求最上乘，決定成佛，譬如以塵揚於順風，有何艱險？
G004: 若有末世，欲坐道場，先持比丘，清淨禁戒，要當選擇戒清淨者，第一沙門，以為其師。若其不遇，真清淨僧，汝戒律儀，必不成就。
      戒成已後，著新淨衣，然香閑居，誦此心佛所說神咒，一百八遍。
G005: 然後結界，建立道楊，求於十方現住國土無上如來，放大悲光來灌其頂。阿難！如是末世清淨比丘，若比丘尼，白衣檀越，心滅貪婬，持佛淨戒，
      於道場中，發菩薩願，出入澡浴，六時行道。如是不寐，經三七日，我自現身，至其人前，摩頂安慰，令其開悟。
G006: 阿難白佛言：世尊！我蒙如來無上悲誨，心已開悟，自知修證，無學道成；末法修行，建立道場，云何結界，合佛世尊，清淨軌則？
G007: 佛告阿難，若末世人，願立道場，先取雪山大力白牛，食其山中肥膩香草，此牛唯飲雪山清水，其糞微細，可取其糞，和合栴檀，以泥其地。
      若非雪山，其牛臭穢，不堪塗地；別於平原，穿去地皮，五尺以下，取其黃土，和上栴檀、沈水、蘇合，薰陸、郁金、白膠、青木、零陵、甘松，
      及雞舌香，以此十種，細羅為粉，合土成泥，以塗場地，方圓丈六，為八角壇。
G008: 壇心置一金銀銅木所造蓮華，華中安砵，砵中先盛八月露水，水中隨安所有華葉。取八圓鏡，各安其方，圍繞華砵。
      鏡外建立十六蓮華，十六香爐，間華鋪設，莊嚴香爐，純燒沈水，無令見火。
G009: 取白牛乳，置十六器，乳為煎餅，並諸砂糖，油餅，乳糜，蘇合，蜜姜，純酥，純蜜，於蓮華外，各各十六，圍繞華外，以奉諸佛，及大菩薩。
      每以食時，若在中夜，取蜜半升，用酥三合，壇前別安一小火爐。
      以兜樓婆香，煎取香水，沐浴其炭，然令猛熾，投是酥蜜，於炎爐內，燒令煙盡，享佛菩薩。
G010: 令其四外，遍懸旛華，於壇室中，四壁敷設十方如來，及諸菩薩所有形像。應於當陽，張盧舍那、釋迦、彌勒、阿閦、彌陀，諸大變化，觀音形像。
      兼金剛藏，安其左右。帝釋梵王，烏芻瑟摩，並藍地迦，諸軍茶利，與毗俱胝，四天王等，頻那夜迦，張於門側，左右安置。
      又取八鏡，覆懸虛空，與壇場中，所安之鏡，方面相對，使其形影，重重相涉。
G011: 於初七中，至誠頂禮，十方如來，諸大菩薩，阿羅漢號。恒於六時，誦咒圍壇，至心行道，一時常行一百八遍。第二七中，一向專心，
      發菩薩願，心無間斷，我毗奈耶，先有願教。第三七中，於十二時，一向持佛，般怛羅咒；至第七日，十方如來，一時出現，鏡交光處，承佛摩頂。
G012: 即於道場，修三摩地，能令如是末世修學，身心明淨，猶如琉璃。
G013: 阿難，若此比丘，本受戒師，及同會中，十比丘等，其中有一不清淨者，如是道場，多不成就。
G014: 從三七後，端坐安居，經一百日，有利根者，不起於座，得須陀洹；縱其身心，聖果未成，決定自知成佛不謬。
G015: 汝問道場，建立如是。
G016: 阿難頂禮佛足，而白佛言：自我出家，恃佛憍愛，求多聞故，未證無為。遭彼梵天，邪術所禁，心雖明了，力不自由；賴遇文殊，令我解脫。
      雖蒙如來，佛頂神咒，冥獲其力，尚未親聞。
G017: 惟願大慈，重為宣說，悲救此會，諸修行輩，末及當來，在輪迴者，承佛密音，身意解脫。於時會中，一切大眾，普皆作禮，佇聞如來，秘密章句。
G018: 爾時世尊，從肉髻中，涌百寶光，光中涌出，千葉寶蓮，有化如來，坐寶華中，頂放十道，百寶光明；
      一一光明，皆遍示現，十恒河沙，金剛密跡，擎山持杵，遍虛空界。
      大眾仰觀，畏愛兼抱，求佛哀佑，一心聽佛，無見頂相，放光如來，宣說神咒。
G019: 阿難，是佛頂光聚，悉怛多般怛囉秘密伽陀，微妙章句，出生十方一切諸佛。
G020: 十方如來，因此咒心，得成無上正遍知覺；
      十方如來，執此咒心，降伏諸魔，制諸外道；十方如來，乘此咒心，坐寶蓮華，應微塵國；
      十方如來，含此咒心，於微塵國，轉大法輪；
      十方如來，持此咒心，能於十方，摩頂授記；自果未成，亦於十方，蒙佛授記。
G021: 十方如來，依此咒心，能於十方，拔濟群苦；所謂地獄，餓鬼，畜生，盲聾喑啞，怨憎會苦，愛別離苦，求不得苦，五陰熾盛，大小諸橫，同時解脫。
      賊難兵難，王難獄難，風火水難，飢渴貧窮，應念消散。
G022: 十方如來，隨此咒心，能於十方，事善知識，四威儀中，供養如意；恒沙如來會中，推為大法王子。
G023: 十方如來，行此咒心，能於十方，攝受親因；令諸小乘，聞秘密藏，不生驚怖。
G024: 十方如來，誦此咒心，成無上覺；坐菩提樹，入大涅槃。
G025: 十方如來，傳此咒心，於滅度後，付佛法事，究竟住持，嚴淨戒律，悉得清淨。
G026: 若我說是佛頂光聚般怛羅咒，從旦至暮，音聲相聯，字句中間，亦不重疊，經恒沙劫，終不能盡；亦說此咒，名如來頂。
G027: 汝等有學，未盡輪迴，發心至誠，取阿羅漢。不持此咒，而坐道場，令其身心，遠諸魔事，無有是處。
G028: 阿難，若諸世界，隨所國土，所有眾生，隨國所生，樺皮貝葉，紙素白氈，書寫此咒，貯於香囊。是人心昏，未能誦憶，或帶身上，或書宅中，
      當知是人，盡其生年，一切諸毒，所不能害。
G029: 阿難，我今為汝，更說此咒，救護世間，得大無畏；成就眾生，出世間智。
G030: 若我滅後，末世眾生，有能自誦，若教他誦，當知如是誦持眾生，火不能燒，水不能溺，大毒小毒，所不能害。
      如是乃至，天龍鬼神，精祇魔魅，所有惡咒，皆不能著。心得正受，一切咒詛，厭蠱毒藥，金毒銀毒，草木蟲蛇，萬物毒氣，入此人口，成甘露味；
      一切惡星，並諸鬼神，磣心毒人，於如是人，不能起惡。頻那夜迦，諸惡鬼王，並其眷屬，皆領深恩，常加守護。
G031: 阿難，當知是咒，常有八萬四千，那由他恒河沙俱胝，金剛藏王菩薩種族，一一皆有諸金剛眾，而為眷屬，晝夜隨侍。
      設有眾生，於散亂心，非三摩地，心憶口持，是金剛王，常隨從彼諸善男子，何況決定菩提心者。此諸金剛菩薩藏王，精心陰速，發彼神識；
      是人應時，心能記憶，八萬四千恒河沙劫，周遍了知，得無疑惑。
G032: 從第一劫，乃至後身，生生不生藥叉羅剎，及富單那，迦吒富單那，鳩槃茶，毗舍遮等，並諸餓鬼，有形無形，有想無想，如是惡處。
      是善男子，若讀若誦，若書若寫，若帶若藏，諸色供養，劫劫不生，貧窮下賤，不可樂處。
G033: 此諸眾生，縱其自身，不作福業，十方如來所有功德，悉與此人。由是得於恒河沙阿僧祇不可說不可說劫，常與諸佛，同生一處。
      無量功德，如惡叉聚，同處熏修，永無分散。是故能令破戒之人，戒根清淨；未得戒者，令其得戒；未精進者，令得精進；無智慧者，令得智慧；
      不清淨者，速得清淨；不持齋戒，自成齋戒。
G034: 阿難，是善男子，持此咒時，設犯禁戒於未受時，持咒之後，眾破戒罪，無問輕重，一時銷滅。縱經飲酒，食噉五辛，種種不淨，一切諸佛菩薩，
      金剛天仙鬼神，不將為過；設著不淨，破弊衣服，一行一住，悉同清淨。縱不作壇，不入道場，亦不行道；誦持此咒，還同入壇，行道功德，無有異也。
      若造五逆，無間重罪，及諸比丘、比丘尼，四棄八棄，誦此咒已，如是重業，猶如猛風，吹散沙聚，悉皆滅除，更無毫髮。
G035: 阿難，若有眾生，從無量無數劫來，所有一切輕重罪障，從前世來，未及懺悔；若能讀誦，書寫此咒，身上帶持，若安住處，莊宅園館；
      如是積業，猶湯銷雪，不久皆得悟無生忍。
G036: 復次阿難，若有女人，未生男女，欲求孕者；若能至心憶念斯咒，或能身上帶此，悉怛多般怛囉者，便生福德智慧男女。求長命者，即得長命；
      欲求果報，速圓滿者，速得圓滿。身命色力，亦復如是。命終之後，隨願往生十方國土，必定不生邊地下賤，何況雜形。
G037: 阿難，若諸國土，州縣聚落；飢荒疫癘，或復刀兵賊難鬥諍，兼餘一切厄難之地，寫此神咒安城四門，並諸支提，或脫闍上；
      令其國土，所有眾生，奉迎斯咒，禮拜恭敬，一心供養；令其人民，各各身佩，或各各安所居宅地，一切災厄，悉皆消滅。
      阿難！在在處處國土眾生，隨有此咒，天龍歡喜，風雨順時，五谷豐殷，兆庶安樂。
G038: 亦復能鎮一切惡星，隨方變怪，災障不起；人無橫夭，杻械枷鎖，不著其身，晝夜安眠，常無惡夢。
      阿難！是娑婆界，有八萬四千災變惡星，二十八大惡星，而為上首；復有八大惡星，以為其主。
      作種種形，出現世時，能生眾生，種種災異；有此咒地，悉皆消滅。十二由旬，成結界地；諸惡災祥，永不能入。
G039: 是故如來宣示此咒，於未來世，保護初學諸修行者，入三摩地，身心泰然，得大安隱。更無一切諸魔鬼神，及無始來，冤橫宿殃，舊業陳債，來相惱害。
      汝及眾中，諸有學人，及未來世諸修行者，依我壇場，如法持戒，所受戒主，逢清淨僧；持此咒心，不生疑悔。
      是善男子，於此父母所生之身，不得心通，十方如來，便成妄語。
G040: 說是語已，會中無量百千金剛，一時佛前合掌頂禮，而白佛言：如佛所說，我當誠心，保護如是修菩提者。
G041: 爾時梵王，並天帝釋，四大天王，亦於佛前，同時頂禮，而白佛言：審有如是修學善人，我當盡心，至誠保護，令其一生，所作如願。
G042: 復有無量藥叉大將，諸羅剎王，富單那王，鳩槃茶王，毗舍遮王，頻那夜迦，諸大鬼王；
      及諸鬼帥，亦於佛前，合掌頂禮，我亦誓願，護持是人，令菩提心，速得圓滿。
G043: 復有無量，日月天子，風師雨師，雲師雷師，並電伯等，年歲巡官，諸星眷屬，亦於會中，頂禮佛足，而白佛言：
      我亦保護，是修行人，安立道場，得無所畏。
G044: 復有無量，山神海神，一切土地，水陸空行，萬物精祇，並風神王，無色界天，於如來前，同時稽首，而白佛言：我亦保護是修行人，得成菩提，永無魔事。
G045: 爾時八萬四千那由他，恒河沙俱胝，金剛藏王菩薩，在大會中，即從座起，頂禮佛足，而白佛言：
      世尊，如我等輩，所修功業，久成菩提，不取涅槃；常隨此咒，救護末世，修三摩提，正修行者。
G046: 世尊！如是修心求正定人，若在道場，及餘經行，乃至散心遊戲聚落；我等徒眾，常當隨從侍衛此人，縱令魔王，大自在天，求其方便，終不可得。
      諸小鬼神，去此善人十由旬外；除彼發心，樂修禪者。
G047: 世尊！如是惡魔，若魔眷屬，欲來侵擾是善人者，我以寶杵，殞碎其首；猶如微塵，恒令此人，所作如願。
G048: 阿難即從座起，頂禮佛足，而白佛言：我輩愚鈍，好為多聞，於諸漏心，未求出離；蒙佛慈誨，得正熏修，身心快然，獲大饒益。
      世尊！如是修證佛三摩地，未到涅槃，云何名為，乾慧之地；四十四心，至何漸次，得修行目；詣何方所，名入地中；云何名為，等覺菩薩。
      作是語已，五體投地，大眾一心，佇佛慈音，瞪瞢瞻仰。
G049: 爾時世尊，讚阿難言，善哉善哉，汝等乃能普為大眾，及諸末世一切眾生，修三摩地，求大乘者，從於凡夫，終大涅槃，懸示無上正修行路；
      汝今諦聽，當為汝說。阿難大眾，合掌刳心，默然受教。
G050: 佛言，阿難當知，妙性圓明，離諸名相，本來無有世界眾生。
G051: 因妄有生，因生有滅，生滅名妄；滅妄名真。是稱如來無上菩提，及大涅槃，二轉依號。
G052: 阿難，汝今欲修真三摩地，直詣如來大涅槃者；先當識此眾生世界二顛倒因。顛倒不生，斯則如來真三摩地。
G053: 阿難！云何名為眾生顛倒，阿難，由性明心，性明圓故；因明發性，性妄見生，從畢竟無，成究竟有。此有所有，非因所因；
      住所住相，了無根本，本此無住，建立世界，及諸眾生。
G054: 迷本圓明，是生虛妄，妄性無體，非有所依；將欲復真，欲真已非，真真如性，非真求復，宛成非相。
G055: 非生非住，非心非法；展轉發生，生力發明，熏以成業，同業相感。因有感業，相滅相生，由是故有眾生顛倒。
G056: 阿難！云何名為世界顛倒。是有所有，分段妄生，因此界立；非因所因，無住所住，遷流不住，因此世成。三世四方，和合相涉，變化眾生，成十二類。
G057: 是故世界，因動有聲，因聲有色，因色有香，因香有觸，因觸有味，因味知法，六亂妄想，成業性故，十二區分，由此輪轉。
G058: 是故世間，聲香味觸，窮十二變，為一旋復。
      乘此輪轉，顛倒相故，是有世界，卵生、胎生、濕生、化生、有色、無色、有想、無想、若非有色、若非無色、若非有想、若非無想。
G059: 阿難！
      由因世界虛妄輪迴，動顛倒故；和合氣成，八萬四千飛沈亂想；如是故有，卵羯邏藍，流轉國土；魚鳥龜蛇，其類充塞。
G060: 由因世界雜染輪迴，欲顛倒故；和合滋成，八萬四千橫豎亂想。如是故有胎遏蒲曇，流轉國土；人畜龍仙，其類充塞。
G061: 由因世界執著輪迴，趣顛倒故；和合暖成，八萬四千翻覆亂想。如是故有濕相蔽尸，流轉國土；含蠢蝡動，其類充塞。
G062: 由因世界變易輪迴，假顛倒故；和合觸成，八萬四千新故亂想。如是故有化相羯南，流轉國土；轉蛻飛行，其類充塞。
G063: 由因世界留礙輪迴，障顛倒故；和合著成，八萬四千精耀亂想。如是故有色相羯南，流轉國土；休咎精明，其類充塞。
G064: 由因世界銷散輪迴，惑顛倒故；和合暗成，八萬四千陰隱亂想。如是故有無色羯南，流轉國土；空散銷沈，其類充塞。
G065: 由因世界罔象輪迴，影顛倒故；和合憶成，八萬四千潛結亂想。如是故有想相羯南，流轉國土；神鬼精靈，其類充塞。
G066: 由因世界愚鈍輪迴，癡顛倒故；和合頑成，八萬四千枯槁亂想。如是故有無想羯南，流轉國土；精神化為土木金石，其類充塞。
G067: 由因世界相待輪迴，偽顛倒故；和合染成，八萬四千因依亂想。如是故有非有色相，成色羯南，流轉國土，諸水母等；以蝦為目，其類充塞。
G068: 由因世界相引輪迴，性顛倒故；和合咒成，八萬四千呼召亂想。由是故有非無色相，無色羯南，流轉國土；咒詛厭生，其類充塞。
G069: 由因世界合妄輪迴，罔顛倒故；和合異成，八萬四千回互亂想。如是故有非有想相，成想羯南，流轉國土；彼蒲盧等，異質相成，其類充塞。
G070: 由因世界怨害輪迴，殺顛倒故；和合怪成，八萬四千食父母想。如是故有非無想相，無想羯南，流轉國土。如土梟等，附塊為兒；
      及破鏡鳥，以毒樹果；抱為其子，子成，父母皆遭其食，其類充塞。
G071: 是名眾生，十二種類。

H001: 阿難！如是眾生，一一類中，亦各各具十二顛倒；猶如捏目，亂華發生；顛倒妙圓真淨明心，具足如斯，虛妄亂想。
H002: 汝今修證佛三摩地，於是本因，元所亂想；立三漸次，方得除滅。如淨器中，除去毒蜜，以諸湯水，並雜灰香，洗滌其器，後貯甘露。
H003: 云何名為三種漸次。一者修習，除其助因；二者真修，刳其正性；三者增進，違其現業。
H004: 云何助因？阿難！如是世界，十二類生，不能自全，依四食住，所謂段食，觸食，思食，識食。是故佛說，一切眾生，皆依食住。
      阿難！一切眾生，食甘故生，食毒故死。是諸眾生，求三摩地，當斷世間，五種辛菜。
H005: 是五種辛，熟食發婬，生噉增恚。如是世界，食辛之人，縱能宣說，十二部經；十方天仙，嫌其臭穢，咸皆遠離。
      諸餓鬼等，因彼食次，舐其唇吻，常與鬼住；福德日消，長無利益。是食辛人，修三摩地，菩薩天仙，十方善神，不來守護；
      大力魔王，得其方便，現作佛身，來為說法。非毀禁戒，讚婬怒癡，命終自為魔王眷屬，受魔福盡，墮無間獄。
H006: 阿難，修菩提者，永斷五辛，是則名為，第一增進修行漸次。
H007: 云何正性？阿難！如是眾生，入三摩地，要先嚴持清淨戒律，永斷婬心，不食酒肉；以火淨食，無噉生氣。
      阿難！是修行人，若不斷婬，及與殺生，出三界者，無有是處。
H008: 當觀婬欲，猶如毒蛇，如見怨賊。先持聲聞四棄八棄，執身不動；後行菩薩清淨律儀，執心不起。禁戒成就，則於世間，永無相生相殺之業；
      偷劫不行，無相負累，亦於世間，不還宿債。是清淨人，修三摩地，父母肉身，不須天眼，自然觀見，十方世界，睹佛聞法，親奉聖旨；
      得大神通，遊十方界，宿命清淨，得無艱險。是則名為，第二增進修行漸次。
H009: 云何現業？阿難！如是清淨持禁戒人，心無貪婬，於外六塵，不多流逸；因不流逸，旋元自歸。塵既不緣，根無所偶，反流全一，六用不行；
      十方國土，皎然清淨。譬如琉璃，內懸明月，身心快然，妙圓平等，獲大安隱；一切如來，密圓淨妙，皆現其中。
H010: 是人即獲無生法忍，從是漸修，隨所發行，安立聖位，是則名為，第三增進修行漸次。
H011: 阿難！是善男子，欲愛乾枯，根境不偶，現前殘質，不復續生。執心虛明，純是智慧，慧性明圓，瑩十方界，乾有其慧，名乾慧地。
      欲習初乾，未與如來，法流水接。
H012: 即以此心，中中流入，圓妙開敷；從真妙圓，重發真妙，妙信常住。一切妄想，滅盡無餘，中道純真，名信心住。
H013: 真信明了，一切圓通，陰處界三，不能為礙。如是乃至，過去未來，無數劫中，捨身受身，一切習氣，皆現在前；
      是善男子，皆能憶念，得無遺忘，名念心住。
H014: 妙圓純真，真精發化，無始習氣，通一精明。唯以精明，進趣真淨，名精進心。
H015: 心精現前，純以智慧，名慧心住。
H016: 執持智明，周遍寂湛，寂妙常凝，名定心住。
H017: 定光發明，明性深入，唯進無退，名不退心。
H018: 心進安然，保持不失。十方如來，氣分交接，名護法心。
H019: 覺明保持，能以妙力，回佛慈光，向佛安住。猶如雙鏡，光明相對，其中妙影，重重相入，名迴向心。
H020: 心光密迴，獲佛常凝無上妙淨，安住無為，得無遺失，名戒心住。
H021: 住戒自在，能遊十方，所去隨緣，名曰心住。
H022: 阿難！是善男予，以真方便，發此十心。心精發暉，十用涉入，圓成一心，名發心住。
H023: 心中發明，如淨琉璃，內現精金，以前妙心；履以成地，名治地住。
H024: 心地涉知，俱得明了，遊履十方，得無留礙，名修行住。
H025: 行與佛同，受佛氣分；如中陰身，自求父母，陰信冥通，入如來種，名生貴住。
H026: 既遊道胎，親奉覺胤；如胎已成，人相不缺，名方便具足住。
H027: 容貌如佛，心相亦同，名正心住。
H028: 身心合成，日益增長，名不退住。
H029: 十身靈相，一時具足，名童真住。
H030: 形成出胎，親為佛子，名法王子住。
H031: 表以成人，如國大王，以諸國事，分委太子；彼剎利王，世子長成，陳列灌頂，名灌頂住。
H032: 阿難！是善男子，成佛子已，具足無量，如來妙德；十方隨順，名歡喜行。
H033: 善能利益，一切眾生，名饒益行。
H034: 自覺覺他，得無違拒，名無瞋恨行。
H035: 種類出生，窮未來際，三世平等，十方通達，名無盡行。
H036: 一切合同，種種法門，得無差誤，名離癡亂行。
H037: 則於同中，顯現群異；一一異相，各各見同，名善現行。
H038: 如是乃至，十方虛空，滿足微塵；一一塵中，現十方界，現塵現界，不相留礙，名無著行。
H039: 種種現前，咸是第一波羅蜜多，名尊重行。
H040: 如是圓融，能成十方，諸佛軌則，名善法行。
H041: 一一皆是清淨無漏，一真無為，性本然故，名真實行。
H042: 阿難！是善男子，滿足神通，成佛事已，純潔精真，遠諸留患。當度眾生，滅除度相，回無為心，向涅槃路，名救護一切眾生，離眾生相迴向。
H043: 壞其可壞，遠離諸離，名不壞迴向。
H044: 本覺湛然，覺齊佛覺，名等一切佛迴向。
H045: 精真發明，地如佛地，名至一切處迴向。
H046: 世界如來，互相涉入，得無掛礙，名無盡功德藏迴向。
H047: 於同佛地，地中各各生清淨因；依因發揮，取涅槃道，名隨順平等善根迴向。
H048: 真根既成，十方眾生，皆我本性；性圓成就，不失眾生，名隨順等觀一切眾生迴向。
H049: 即一切法，離一切相，唯即與離，二無所著，名真如相迴向。
H050: 真得所知，十方無礙，名無縛解脫迴向。
H051: 性德圓成，法界量滅，名法界無量迴向。
H052: 阿難！是善男子，盡是清淨，四十一心；次成四種，妙圓加行。即以佛覺用為己心，若出未出，猶如鑽火，欲然其木，名為暖地。
      又以己心，成佛所履，若依非依；如登高山，身入虛空，下有微礙，名為頂地。心佛二同，善得中道；如忍事人，非懷非出，名為忍地。
      數量銷滅，迷覺中道，二無所目，名世第一地。
H053: 阿難！是善男子，於大菩提，善得通達，覺通如來，盡佛境界，名歡喜地。
H054: 異性入同，同性亦滅，名離垢地。
H055: 淨極明生，名發光地。
H056: 明極覺滿，名焰慧地。
H057: 一切同異，所不能至，名難勝地。
H058: 無為真如，性淨明露，名現前地。
H059: 盡真如際，名遠行地。
H060: 一真如心，名不動地。
H061: 發真如用，名善慧地。
H062: 阿難！是諸菩薩，從此已往，修習畢功，功德圓滿。亦目此地，名修習位。
H063: 慈蔭妙雲，覆涅槃海，名法雲地。
H064: 如來逆流，如是菩薩順行而至，覺際入交，名為等覺。
H065: 阿難！從乾慧心，至等覺已，是覺始獲金剛心中，初乾慧地；如是重重，單復十二，方盡妙覺，成無上道。
H066: 是種種地，皆以金剛觀察如幻十種深喻，奢摩他中，用諸如來毗婆舍那，清淨修證，漸次深入。
H067: 阿難！如是皆以三增進故，善能成就五十五位真菩提路。
H068: 作是觀者，名為正觀；若他觀者，名為邪觀。
H069: 爾時文殊師利法主子，在大眾中，即從座起，頂禮佛足，而白佛言：當何名是經，我及眾生云何奉持。
H070: 佛告文殊師利：是經名大佛頂悉怛多般怛囉，無上寶印，十方如來清淨海眼。亦名救護親因，度脫阿難及此會中性比丘尼，得菩提心，入遍知海。
      亦名如來密因修證了義。亦名大方廣妙蓮華王，十方佛母陀羅尼咒。亦名灌頂章句諸菩薩萬行首楞嚴。
H071: 汝當奉持。
H072: 說是語已，即時阿難及諸大眾，得蒙如來開示密印般怛羅義，兼聞此經，了義名目，
      頓悟禪那，修進聖位，增上妙理，心慮虛凝，斷除三界修心，六品微細煩惱。
H073: 即從座起，頂禮佛足，合掌恭敬，而白佛言：大威德世尊，慈音無遮，善開眾生，微細沈惑；令我今日，身心快然，得大饒益。
H074: 世尊！若此妙明真淨妙心，本來遍圓，如是乃至，大地草木，蠕動含靈，本元真如，即是如來，成佛真體；
      佛體真實，云何復有，地獄餓鬼，畜生修羅，人天等道？世尊！此道為復，本來自有；為是眾生，妄習生起。
H075: 世尊！如寶蓮香比丘尼，持菩薩戒，私行婬欲，妄言行婬，非殺非偷，無有業報；發是語已，先於女根，生大猛火，後於節節，猛火燒然，墮無間獄。
      琉璃大王，善星比丘，琉璃為誅瞿曇族姓，善星妄說，一切法空，生身陷入，阿鼻地獄。此諸地獄，為有定處；為復自然，彼彼發業，各各私受。
H076: 惟垂大慈，開發童蒙；令諸一切持戒眾生，聞決定義，歡喜頂戴，謹潔無犯。
H077: 佛告阿難：快哉此問，令諸眾生，不入邪見，汝今諦聽，當為汝說。
H078: 阿難！一切眾生，實本清淨；因彼妄見，有妄習生，因此分開，內分外分。
H079: 阿難！內分即是眾生分內，因諸愛染，發起妄情；情積不休，能生愛水。是故眾生，心憶珍羞，口中水出；心憶前人，或憐或恨，目中淚盈。
      貪求財寶，心發愛涎，舉體光潤；心著行婬，男女二根，自然流液。阿難：諸愛雖別，流結是同；潤濕不升，自然從墜；此名內分。
H080: 阿難！外分即是眾生分外。因諸渴仰，發明虛想，想積不休，能生勝氣。是故眾生，心持禁戒，舉身輕清；心持咒印，顧盼雄毅；
      心欲生天，夢想飛舉；心存佛國，聖境冥現；事善知識，自輕身命。阿難！諸想雖別，輕舉是同；飛動不沈，自然超越，此名外分。
H081: 阿難！一切世間生死相續，生從順習，死從變流。臨命終時，未捨暖觸，一生善惡，俱時頓現。
      死逆生順，二習相交，純想即飛，必生天上，若飛心中，兼福兼慧，及與淨願；自然心開，見十方佛，一切淨土，隨願往生。
      情少想多，輕舉非遠，即為飛仙，大力鬼王，飛行夜叉，地行羅剎，遊於四天，所去無礙。
      其中若有善願善心，護持我法，或護禁戒，隨持戒人；或護神咒，隨持咒者；或護禪定，保綏法忍，是等親住，如來座下。
H082: 情想均等，不飛不墜，生於人間，想明斯聰，情幽斯鈍。情多想少，流入橫生，重為毛群，輕為羽族。
      七情三想，沈下水輪，生於火際，受氣猛火，身為餓鬼，常被焚燒；水能害己，無食無飲，經百千劫。
      九情一想，下洞火輪，身入風火，二交過地；輕生有間，重生無間，二種地獄。
      純情即沈，入阿鼻獄；若沈心中，有謗大乘，毀佛禁戒，誑妄說法，虛貪信施，濫膺恭敬，五逆十重，更生十方，阿鼻地獄。
H083: 循造惡業，雖則自招；眾同分中，兼有元地。
H084: 阿難！此等皆是，彼諸眾生，自業所感，造十習因，受六交報。
H085: 云何十因？阿難！
      一者婬習交接，發於相磨，研磨不休，如是故有，大猛火光，於中發動。
      如人以手，自相摩觸，暖相現前；二習相然，故有鐵床銅柱諸事。是故十方一切如來，色目行婬，同名欲火；菩薩見欲，如避火坑。
H086: 二者貪習交計，發於相吸；吸攬不止，如是故有積寒堅冰，於中凍冽。如人以口吸縮風氣，有冷觸生。
      二習相陵，故有吒吒波波羅羅，青赤白蓮，寒冰等事。是故十方，一切如來，色目多求，同名貪水；菩薩見貪，如避瘴海。
H087: 三者慢習交陵，發於相持；馳流不息，如是故有騰逸奔波，積波為水。如人口舌自相綿味，因而水發。
      二習相鼓，故有血河、灰河、熱沙、毒海、融銅、灌吞諸事。是故十方一切如來，色目我慢，名飲癡水；菩薩見慢，如避巨溺。
H088: 四者，瞋習交沖，發於相忤；懺結不息，心熱發火，鑄氣為金，如是故有，刀山鐵橛，劍樹劍輪，斧鉞槍鋸。
      如人銜冤，殺氣飛動，二習相擊，故有宮割、斬斫、剉刺、槌擊諸事。是故十方一切如來，色目瞋恚，名利刀劍；菩薩見瞋，如避誅戮。
H089: 五者，詐習交誘，發於相調；引起不住，如是故有，繩木絞校。如水浸田，草木生長；二習相延，故有杻械枷鎖，鞭杖槌棒諸事。
      是故十方一切如來，色目奸偽，同名讒賊；菩薩見詐，如畏豺狼。
H090: 六者，誑習交欺，發於相罔；誣罔不止，飛心造奸，如是故有塵土屎尿，穢污不淨。如塵隨風，各無所見；二習相加，故有沒溺，騰擲飛墜，漂淪諸事。
      是故十方一切如來，色目欺誑，同名劫殺；菩薩見誑，如踐蛇虺。
H091: 七者，怨習交嫌，發於銜恨；如是故有，飛石投大礫，匣貯車檻，瓮盛囊撲。如陰毒人，懷抱畜惡；二習相吞，故有投擲擒捉擊射拋撮諸事。
      是故十方一切如來，色目怨家，名違害鬼；菩薩見怨，如飲鴆酒。
H092: 八者，見習交明，如薩迦耶見、戒禁取，邪悟諸業，發於違拒，出生相反。如是故有，王使主吏，證執文籍。
      如行路人，來往相見；二習相交，故有勘問，權詐考訊，推鞫察訪，披究照明，善惡童子，手執文簿，辭辯諸事。
      是故十方一切如來，色目惡見，同名見坑；菩薩見諸虛妄偏執，如臨毒壑。
H093: 九者，枉習交加，發於誣謗；如是故有，合山合石，碾碨耕磨。如讒賊人，逼枉良善；二習相排，故有押捺、槌按，蹙漉衡度諸事。
      是故十方一切如來，色目怨謗，同名讒虎；菩薩見枉，如遭霹靂。
H094: 十者，訟習交諠，發於藏覆；如是故有，鑒見照燭。如於日中，不能藏影。二習相陳，故有惡友，業鏡火珠，披露宿業，對驗諸事。
      是故十方一切如來，色目覆藏，同名陰賊；菩薩見覆，如載高山，履於巨海。
H095: 云何六報？阿難！一切眾生，六識造業，所招惡報，從六根出。
H096: 云何惡報，從六根出？一者見報，招引惡果。此見業交，則臨終時先見猛火，滿十方界；亡者神識，飛墜乘煙，入無間獄。
      發明二相：一者明見，則能遍見種種惡物，生無量畏；二者暗見，寂然不見，生無量恐。如是見火，燒聽，能為鑊湯烊銅；
      燒息，能為黑煙紫焰；燒味，能為焦丸鐵糜；燒觸，能為熱灰爐炭；燒心，能生星火迸灑，煽鼓空界。
H097: 二者聞報，招引惡果。此聞業交，則臨終時，先見波濤沒溺天地，亡者神識，降注乘流，入無間獄。
      發明二相：一者開聽，聽種種鬧，精神茅亂；二者閉聽，寂無所聞，幽魄沈沒。如是聞波，注聞，則能為責為詰；
      註見，則能為雷為吼，為惡毒氣；注息，則能為雨為田，灑諸毒蟲；周滿身體；注味，則能為膿為血，種種雜穢；
      注觸，則能為畜為鬼，為糞為尿；注意，則能為電為雹，摧碎心魄。
H098: 三者嗅報，招引惡果。此嗅業交，則臨終時，先見毒氣，充塞遠近，亡者神識，從地涌出，入無間獄。
      發明二相：一者通聞，被諸惡氣，熏極心擾；二者塞聞，氣掩不通，悶絕於地。如是嗅氣，沖息，則能為質為履；
      沖見，則能為火為炬；沖聽，則能為沒為溺，為洋為沸；沖味，則能為餒為爽；沖觸，則能為綻為爛，為大肉山。
      有百千眼，無量咂食；沖思，則能為灰為瘴，為飛沙礫，擊碎身體。
H099: 四者味報，招引惡果。此味業交，則臨終時，先見鐵網，猛焰熾烈，周覆世界；亡者神識，下透掛網，倒懸其頭，入無間獄。
      發明二相：一者吸氣，結成寒冰，凍冽身肉；二者吐氣，飛為猛火，焦爛骨髓。如是嘗味：歷嘗，則能為承為忍；歷見，則為然金石；
      歷聽，則能為利兵刃；歷息，則能為大鐵籠，彌覆國土；歷觸，則能為弓為箭，為弩為射；歷思，則能為飛熱鐵，從空雨下。
H100: 五者觸報，招引惡果。此觸業交，則臨終時，先見大山，四面來合，無復出路。亡者神識，見大鐵城，火蛇火狗，虎狼師子，牛頭獄卒，馬頭羅剎，
      手執槍茅，驅入城門，向無間獄。發明二相：一者合觸，合山逼體，骨肉血潰；二者離觸，刀劍觸身，心肝屠裂。
      如是合觸，歷觸，則能為道為觀，為廳為案；歷見，則能為燒為爇；歷聽，則能為撞為擊，為剚為射；歷息，則能為括為袋，為考為縛；
      歷嘗，則為耕為鉗，為斬為截；歷思，則能為墜為飛，為煎，為炙。
H101: 六者思報，招引惡果。此思業交，則臨終時，先見惡風，吹壞國土，亡者神識，被吹上空，旋落乘風，墮無間獄。
      發明二相；一者不覺，迷極則慌，奔走不息；二者不迷，覺知則苦，無量煎燒，痛深難忍。如是邪思、結思，則能為方為所；結見，則能為鑒為證；
      結聽，則能為大合石，為冰為霜，為土為霧；結息，則能為大火車，火船火檻；結嘗，則能為大叫喚，為悔為泣；
      結觸，則能為大為小，為一日中萬生萬死，為偃為仰。
H102: 阿難！是名地獄，十因六果，皆是眾生迷妄所造。
H103: 若諸眾生，惡業同造，入阿鼻獄，受無量苦，經無量劫。六根各造，及彼所作兼境兼根，是人則入八無間獄。身口意三，作殺盜婬；是人則入十八地獄。
      三業不兼，中間或為一殺一盜，是人則入三十六地獄。見見一根，單犯一業；是人則入，一百八地獄。由是眾生，別作別造，於世界中，入同分地。
      妄想發生，非本來有。
H104: 復次阿難！是諸眾生，非破律儀，犯菩薩戒，毀佛涅槃；諸餘雜業，歷劫燒然。後還罪畢，受諸鬼形。
H105: 若於本因，貪物為罪，是人罪畢，遇物成形，名為怪鬼。貪色為罪，是人罪畢，遇風成形，名為魃鬼。貪惑為罪，是人罪畢，遇畜成形，名為魅鬼。
      貪恨為罪，是人罪畢，遇蟲為形，名蠱毒鬼。貪憶為罪，是人罪畢，遇衰成形，名為厲鬼。貪傲為罪，是人罪畢，遇氣成形，名為餓鬼。
      貪罔為罪，是人罪畢，遇幽為形，名為魘鬼。貪明為罪，是人罪畢，遇精為形，名魍魎鬼。貪成為罪，是人罪畢，遇明為形，名役使鬼。
      貪黨為罪，是人罪畢，遇人為形，名傳送鬼。
H106: 阿難！是人皆以純情墜落，業火燒乾，上出為鬼。此等皆是，自妄想業，之所招引，若悟菩提，則妙圓明，本無所有。
H107: 復次阿難！鬼業既盡，則情與想，二俱成空；方於世間，與元負人，怨對相值，身為畜生，酬其宿債。
H108: 物怪之鬼，物銷報盡；生於世間，多為梟類。風魃之鬼，風銷報盡，生於世間，多為咎徵，一切異類。畜魅之鬼，畜死報盡；生於世間，多為狐類。
      蟲蠱之鬼，蠱滅報盡；生於世間，多為毒類。衰厲之鬼，衰窮報盡；生於世間，多為蛔類。受氣之鬼，氣銷報盡；生於世間，多為食類。
      綿幽之鬼，幽銷報盡；生於世間，多為服類。和精之鬼，和銷報盡；生於世間，多為應類。明靈之鬼，明滅報盡；生於世間，多為休徵，一切諸類。
      依人之鬼，人亡報盡；生於世間，多為循類。
H109: 阿難！是等皆以，業火乾枯，酬其宿債，傍為畜生。此等亦皆自虛妄業之所招引。若悟菩提，則此妄緣，本無所有。
      如汝所言，寶蓮香等，及琉璃王，善星比丘，如是惡業，本自發明，非從天降，亦非地出，亦非人與。
      自妄所招，還自來受，菩提心中，皆為浮虛，妄想凝結。
H110: 復次阿難！從是畜生，酬償先債；若彼酬者，分越所酬，此等眾生，還復為人，反徵其剩。如彼有力，兼有福德，則於人中，不捨人身，酬還彼力；
      若無福者，還為畜生，償彼餘直。阿難當知：若用錢物，或役其力，償足自停。如於中間，殺彼身命，或食其肉，如是乃至，經微塵劫，相食相誅，
      猶如轉輪，互為高下，無有休息。除奢摩他，及佛出世，不可停寢。
H111: 汝今應知，彼梟倫者，酬足復形；生人道中，參合頑類。彼咎徵者，酬足復形；生人道中，參合異類。彼狐倫者，酬足復形；生人道中，參合庸類。
      彼毒倫者，酬足復形；生人道中，參合狠類。彼蛔倫者，酬足復形；生人道中，參合微類。彼食倫者，酬足復形；生人道中，參合柔類。
      彼服倫者，酬足復形；生人道中，參合勞類。彼應倫者，酬足復形；生人道中，參於文類。彼休徵者，酬足復形，生人道中，參合明類。
      彼循倫者，酬足復形，生人道中，參於達類。
H112: 阿難！是等皆以宿債畢酬；復形人道，皆無始來，業計顛倒，相生相殺。不遇如來，不聞正法；於塵勞中，法爾輪轉。此輩名為，可憐愍者。
H113: 阿難！復有從人，不依正覺，修三摩地；別修妄念，存想固形，遊於山林，人不及處，有十種仙。
H114: 阿難！彼諸眾生，
      堅固服餌，而不休息；食道圓成，名地行仙。堅固草木，而不休息；藥道圓成，名飛行仙。堅固金石，而不休息；化道圓成，名遊行仙。
      堅固動止，而不休息；氣精圓成，名空行仙。堅固津液，而不休息；潤德圓成，名天行仙。堅固精色，而不休息；吸粹圓成，名通行仙。
      堅固咒禁，而不休息；術法圓成，名道行仙。堅固思念，而不休息；思憶圓成，名照行仙。堅固交遘，而不休息；感應圓成，名精行仙。
      堅固變化而不休息；覺悟圓成，名絕行仙。
H115: 阿難！是等皆於人中練心，不修正覺，別得生理，壽千萬歲。休止深山，或大海島，絕於人境。斯亦輪迴，妄想流轉；不修三昧，報盡還來，散入諸趣。
H116: 阿難！諸世間人，不求常住，未能捨諸妻妾恩愛。
H117: 於邪婬中，心不流逸，澄瑩生明；命終之後，鄰於日月，如是一類名四天王天。
H118: 於己妻房，婬愛微薄；於靜居時，不得全味。命終之後，超日月明，居人間頂，如是一類，名忉利天。
H119: 逢欲暫交，去無思憶；於人間世，動少靜多。命終之後，於虛空中，朗然安住，日月光明，上昭不及，是諸人等，自有光明，如是一類，名須焰摩天。
H120: 一切時靜，有應觸來，未能違戾。命終之後，上升精微，不接下界，諸人天境，乃至劫壞，三災不及，如是一類，名兜率陀天。
H121: 我無欲心，應汝行事；於橫陳時，味如嚼蜡。命終之後，生越化地，如是一類，名樂變化天。
H122: 無世間心，同世行事；於行事交，了然超越。命終之後，遍能出超，化無化境，如是一類，名他化自在天。
H123: 阿難，如是六天，形雖出動，心跡尚交；自此以還，名為欲界。

I001: 阿難！世間一切，所修心人，不假禪那，無有智慧，但能執身，不行婬欲，若行若坐，想念俱無。
I002: 愛染不生，無留欲界；是人應念，身為梵侶，如是一類，名梵眾天。欲習既除，離欲心現，於諸律儀，愛樂隨順；
      是人應時，能行梵德，如是一類，名梵輔天。身心妙圓，威儀不缺，清淨禁戒，加以明悟；是人應時，能統梵眾，為大梵王，如是一類，名大梵天。
      阿難！此三勝流，一切苦惱，所不能逼，雖非正修真三摩地，清淨心中，諸漏不動，名為初禪。
I003: 阿難！其次梵天，統攝梵人，圓滿梵行，澄心不動，寂湛生光，如是一類，名少光天。
      光光相然，照耀無盡，映十方界，遍成琉璃，如是一類，名無量光天。
      吸持圓光，成就教體，發化清淨，應用無盡，如是一類，名光音天。
      阿難！此三勝流，一切憂懸，所不能逼；雖非正修真三摩地，清淨心中，麤漏已伏，名為二禪。
I004: 阿難！如是天人，圓光成音，披音露妙，發成精行，通寂滅樂，如是一類，名少淨天。
      淨空現前，引發無際，身心輕安，成寂滅樂，如是一類，名無量淨天。世界身心，一切圓淨，淨德成就，勝托現前，歸寂滅樂，如是一類，名遍淨天。
      阿難！此三勝流，具大隨順，身心安隱，得無量樂。雖非正得真三摩地，安隱心中，歡喜畢具，名為三禪。
I005: 阿難！復次天人，不逼身心，苦因已盡。樂非常住，久必壞生；苦樂二心，俱時頓捨，麤重相滅，淨福性生，如是一類，名福生天。
      捨心圓融，勝解清淨；福無遮中，得妙隨順，窮未來際，如是一類，名福愛天。阿難！從是天中，有二岐路，若於先心，無量淨光，福德圓明，修證而住，
      如是一類，名廣果天。若於先心，雙厭苦樂，精研捨心，相續不斷，圓窮捨道，身心俱滅，心慮灰凝，經五百劫；是人既以生滅為因，不能發明不生滅性，
      初半劫滅，後半劫生，如是一類，名無想天。阿難！此四勝流，一切世間，諸苦樂境，所不能動；雖非無為真不動地，有所得心，功用純熟，名為四禪。
I006: 阿難！此中復有，五不還天。於下界中，九品習氣，俱時滅盡，苦樂雙亡，下無卜居，故於捨心，眾同分中，安立居處。
      阿難！苦樂兩滅，鬥心不交，如是一類，名無煩天。機括獨行，研交無地，如是一類，名無熱天。
      十方世界，妙見圓澄，更無塵象，一切沈垢，如是一類，名善見天。精見現前，陶鑄無礙，如是一類，名善現天。
      究竟群幾，究色性性，入無邊際，如是一類，名色究竟天。
      阿難！此不還天，彼諸四禪，四位天王，獨有欽聞，不能知見。如今世間，曠野深山，聖道場地，皆有阿羅漢，所住持故，世間麤人，所不能見。
I007: 阿難！是十八天，獨行無交，未盡形累，自此已還，名為色界。
I008: 復次阿難！從是有頂，色邊際中，其間復有二種歧路。若於捨心，發明智慧，慧光圓通，便出塵界，成阿羅漢，入菩薩乘，如是一類，名為回心大阿羅漢。
I009: 若在捨心，捨厭成就，覺身為礙，銷礙入空，如是一類，名為空處。諸礙既銷，無礙無滅，其中唯留阿賴耶識，全於末那半分微細，如是一類，名為識處。
      空色既亡，識心都滅，十方寂然，迥無攸往。如是一類，名無所有處。
      識性不動，以滅窮研，於無盡中，發宣盡性，如存不存，若盡非盡，如是一類，名為非想非非想處。
I010: 此等窮空，不盡空理，從不還天，聖道窮者，如是一類，名不回心鈍阿羅漢。若從無想諸外道天，窮空不歸，迷漏無聞，便入輪轉。
I011: 阿難！是諸天上，各各天人，則是凡夫，業果酬答，答盡入輪；彼之天王，即是菩薩，遊三摩地，漸次增進，迴向聖倫，所修行路。
I012: 阿難！是四空天，身心滅盡，定性現前，無業果色，從此逮終，名無色界。
I013: 此皆不了妙覺明心，積妄發生，妄有三界；中間妄隨七趣沈溺，補特伽羅，各從其類。
I014: 復次阿難！是三界中，復有四種阿修羅類。若於鬼道，以護法力，乘通入空，此阿修羅，從卵而生，鬼趣所攝。
      若於天中，降德貶墜，其所卜居，鄰於日月；此阿修羅，從胎而出，人趣所攝。有修羅王，執持世界，力洞無畏，能與梵王，及天帝釋，四天爭權；
      此阿修羅，因變化有，天趣所攝。阿難！別有一分，下劣修羅，生大海心，沈水穴口，旦遊虛空，暮歸水宿；此阿修羅，因濕氣有，畜生趣攝。
I015: 阿難！如是地獄餓鬼畜生，人及神仙，天洎修羅，精研七趣，皆是昏沈諸有為相，妄想受生。
      妄想隨業，於妙圓明，無作本心；皆如空華，元無所著，但一虛妄，更無根緒。
I016: 阿難！此等眾生，不識本心，受此輪迴，經無量劫，不得真淨。皆由隨順殺盜婬故，反此三種，又則出生無殺盜婬。
      有名鬼倫，無名天趣，有無相傾，起輪迴性。
I017: 若得妙發三摩提者，則妙常寂，有無二無，無二亦滅；尚無不殺不偷不婬，云何更隨殺盜婬事。
I018: 阿難！不斷三業，各各有私。因各各私，眾私同分，非無定處。自妄發生，生妄無因，無可尋究。汝勖修行，欲得菩提，要除三惑。
      不盡三惑，縱得神通，皆是世間有為功用；習氣不滅，落於魔道。雖欲除妄，倍加虛偽，如來說為可哀憐者。
      汝妄自造，非菩提咎，作是說者，名為正說，若他說者，即魔王說。
I019: 即時如來，將罷法座，於師子床，攬七寶几，回紫金山，再來仉倚。普告大眾，及阿難言：汝等有學緣覺聲聞，今日回心，趣大菩提，無上妙覺；
      我今已說真修行法。汝猶未識，修奢摩他，毗婆舍那，微細魔事；魔境現前，汝不能識，洗心非正，落於邪見。或汝陰魔，或復天魔，或著鬼神，
      或遭魑魅，心中不明，認賊為子。又復於中，得少為足，如第四禪，無聞比丘，妄言證聖；天報已畢，衰相現前，謗阿羅漢，身遭後有，墮阿鼻獄。
      汝應諦聽，吾今為汝，仔細分別。
I020: 阿難起立，並其會中，同有學者，歡喜頂禮，伏聽慈誨。
I021: 佛告阿難，及諸大眾，汝等當知，有漏世界，十二類生，本覺妙明，覺圓心體，與十方佛，無二無別。由汝妄想，迷理為咎。
      癡愛發生，生發遍迷，故有空性；化迷不息，有世界生。則此十方，微塵國土，非無漏者，皆是迷頑妄想安立。
      當知虛空，生汝心內，猶如片雲點太清裏，況諸世界在虛空耶？汝等一人，發真歸元，此十方空，皆悉銷殞，云何空中所有國土而不振裂。
I022: 汝輩修禪，飾三摩地；十方菩薩，及諸無漏大阿羅漢，心精通吻，當處湛然。
      一切魔王，及與鬼神，諸凡夫天，見其宮殿，無故崩裂，大地振坼，水陸飛騰，無不驚懾。
      凡夫昏暗，不覺遷訛，彼等咸得五種神通，唯除漏盡。戀此塵勞，如何令汝摧裂其處。是故鬼神，及諸天魔，魍魎妖精，於三昧時，僉來惱汝。
I023: 然彼諸魔，雖有大怒，彼塵勞內，汝妙覺中，如風吹光，如刀斷水，了不相觸。汝如沸湯，彼如堅冰，暖氣漸鄰，不日銷殞，徒恃神力。
      但為其客，成就破亂，由汝心中，五陰主人；主人若迷，客得其便。當處禪那，覺悟無惑；則彼魔事，無奈汝何。
      陰銷入明，則彼群邪，咸受幽氣；明能破暗，近自銷殞，如何取留，擾亂禪定。
I024: 若不明悟，被陰所迷，則汝阿難必為魔子，成就魔人。如摩登伽，殊為眇劣，彼唯咒汝，破佛律儀，八萬行中，祇毀一戒；心清淨故，尚未淪溺。
      此乃隳汝寶覺全身，如宰臣家，忽逢籍沒，宛轉零落，無可哀救。
I025: 阿難當知！汝坐道場，銷落諸念；其念若盡，則諸離念。一切精明，動靜不移，憶忘如一；當住此處，入三摩地。
I026: 如明目人，處大幽暗；精性妙淨，心未發光，此則名為色陰區宇。
I027: 若目明朗，十方洞開，無復幽暗；名色陰盡，是人則能超越劫濁。
I028: 觀其所由，堅固妄想，以為其本。
I029: 阿難！當在此中，精研妙明，四大不織；少選之間，身能出礙，此名精明流溢前境；斯但功用，暫得如是，非為聖證。
      不作聖心，名善境界；若作聖解，即受群邪。
I030: 阿難！復以此心，精研妙明，其身內徹；是人忽然於其身內，拾出蟯蛔，身相宛然，亦無傷毀。
      此名精明流溢形體，斯但精行，暫得如是，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I031: 又以此心，內外精研，其時魂魄。意志精神，除執受身，餘皆涉入，互為賓主；忽於空中，聞說法音，或聞十方同敷密義。
      此名精魄，遞相離合，成就善種，暫得如是，非為勝證。不作聖心；名善境界；若作聖解，即受群邪。
I032: 又以此心，澄露皎徹，內光發明；十方遍作，閻浮檀色，一切種類，化為如來。
      於時忽見，毗盧遮那，踞天光台，千佛圍繞，百億國土，及與蓮華，俱時出現。
      此名心魂，靈悟所染，心光研明，照諸世界，暫得如是，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I033: 又以此心，精研妙明，觀察不停，抑按降伏；制止超越，於時忽然，十方虛空，成七寶色，或百寶色，同時遍滿，不相留礙。
      青黃赤白，各各純現；此名抑按功力逾分，暫得如是，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I034: 又以此心，研究澄徹，精光不亂。忽於夜半，在暗室中，見種種物，不殊白晝，而暗室物，亦不除滅；
      此名心細，密澄其見，所視洞幽，暫得如是，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I035: 又以此心圓入虛融，四肢忽然同於草木。火燒刀斫，曾無所覺，又則火光，不能燒爇；縱割其肉，猶如削木。
      此名塵並，排四大性，一向入純，暫得如是，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I036: 又以此心，成就清淨，淨心功極。忽見大地，十方山河，皆成佛國，具足七寶，光明遍滿；又見恒沙，諸佛如來，遍滿空界，樓殿華麗；
      下見地獄，上觀天宮，得無障礙。此名欣厭凝想日深，想久化成，非為聖證。不作聖心，名善境界；若作聖解，即受群邪。
I037: 又以此心，研究深遠，忽於中夜，遙見遠方，市井街巷，親族眷屬，或聞其語；此名迫心，逼極飛出，故多隔見，非為聖證。
      不作聖心，名善境界；若作聖解，即受群邪。
I038: 又以此心，研究精極，見善知識，形體變移，少選無端種種遷改。此名邪心，含受魑魅；或遭天魔，入其心腹，無端說法，通達妙義，非為聖證。
      不作聖心，魔事銷歇；若作聖解，即受群邪。
I039: 阿難！如是十種禪那現境，皆是色陰，用心交互，故現斯事。眾生頑迷，不自忖量，逢此因緣，迷不自識，謂言登聖；大妄語成，墮無間獄。
      汝等當依，如來滅後，於末法中，宣示斯義；無令天魔，得其方便，保持覆護，成無上道。
I040: 阿難！彼善男子，修三摩提，奢摩他中，色陰盡者，見諸佛心，如明鏡中，顯現其像。
I041: 若有所得，而未能用。猶如魘人，手足宛然，見聞不惑；心觸客邪，而不能動。此則名為受陰區宇。
I042: 若魘咎歇，其心離身，返觀其面，去住自由，無復留礙，名受陰盡。是人則能超越見濁。
I043: 觀其所由，虛明妄想，以為其本。
I044: 阿難！彼善男子，當在此中，得大光耀。其心發明，內抑過分；忽於其處，發無窮悲。如是乃至，觀見蚊蟲，猶如赤子，心生憐愍，不覺流淚。
      此名功用，抑摧過越，悟則無咎，非為聖證；覺了不迷，久自銷歇。若作聖解，則有悲魔，入其心腑；見人則悲，啼泣無限，失於正受，當從淪墜。
I045: 阿難！又彼定中諸善男子，見色陰銷，受陰明白，勝相現前。感激過分，忽於其中，生無限勇；其心猛利，志齊諸佛，謂三僧祇，一念能越。
      此名功用，陵率過越，悟則無咎，非為聖證；覺了不迷，久自銷歇。
      若作聖解，則有狂魔，入其心腑；見人則夸，我慢無比，其心乃至，上不見佛，下不見人，失於正受，當從淪墜。
I046: 又彼定中諸善男子，見色陰銷，受陰明白，前無新證，歸失故居。智力衰微，入中隳地，迥無所見；心中忽然，生大枯渴。
      於一切時，沈憶不散；將此以為勤精進相。
      此名修心，無慧自失；悟則無咎，非為聖證。若作聖解，則有情魔，入其心腑；旦夕撮心，懸在一處，失於正受，當從淪墜。
I047: 又彼定中諸善男子，見色陰銷，受陰明白；慧力過定，失於猛利，以諸聖性，懷於心中，自心已疑，是盧舍那，得少為足。
      此名用心，忘失恒審，溺於知見，悟則無名，非為聖證。若作聖解，則有下劣，易知足魔，入其心腑。
      見人自言，我得無上第一義諦；失於正受，當從淪墜。
I048: 又彼定中諸善男子，見色陰銷，受陰明白；新證未獲，故心已亡，歷覽二際，自生艱險。於心忽然，生無盡憂，如坐鐵床，如飲毒藥，心不欲活；
      常求於人，令害其命，早取解脫。此名修行失於方便，悟則無咎，非為聖證；若作聖解，則有一分常憂愁魔，入其心腑。
      手執刀劍，自割其肉，欣其捨壽；或常憂愁，走入山林，不耐見人，失於正受，當從淪墜。
I049: 又彼定中諸善男予，見色陰銷，受陰明白，處清淨中。心安隱後，忽然自有無限喜生；心中歡悅，不能自止。
      此名輕安，無慧自禁，悟則無咎，非為聖證。若作聖解，則有一分好喜樂魔，入其心腑。
      見人則笑，於衢路傍，自歌自舞，自謂已得，無礙解脫，失於正受，當從淪墜。
I050: 又彼定中諸善男子，見色陰銷，受陰明白，自謂已足。忽有無端，大我慢起；如是乃至，慢與過慢，及慢過慢，或增上慢，或卑劣慢，一時俱發。
      心中尚輕十方如來，何況下位聲聞、緣覺，此名見勝無慧自救，悟則無咎，非為聖證。若作聖解，則有一分大我慢魔入其心腑；不禮塔廟，摧毀經像。
      謂檀越言：此是金銅，或是土木，經是樹葉，或是氈華；肉身真常，不自恭敬，卻崇土木，實為顛倒。
      其深信者，從其毀碎，埋棄地中；疑誤眾生，入無間獄，失於正受，當從淪墜。
I051: 又彼定中諸善男子，見色陰銷，受陰明白，於精明中，圓悟精理，得大隨順。其心忽生，無量輕安，己言成聖，得大自在。此名因慧，獲諸輕清，
      悟則無咎，非為聖證。若作聖解，則有一分好輕清魔，入其心腑；自謂滿足，更不求進。此等多作無聞比丘，疑誤眾生，墮阿鼻獄，失於正受，當從淪墜。
I052: 又彼定中諸善男子，見色陰銷，受陰明白，於明悟中，得虛明性。其中忽然，歸向永滅，撥無因果，一向入空；空心現前，乃至心生，長斷滅解，
      悟則無咎，非為聖證。若作聖解，則有空魔，入其心腑；乃謗持戒，名為小乘，菩薩悟空，有何持犯。其人常於信心檀越，飲酒噉肉，廣行婬穢，
      因魔力故，攝其前人，不生疑謗。鬼心久入，或食屎尿，與酒肉等，一種俱空。破佛律儀，誤人入罪，失於正受，當從淪墜。
I053: 又彼定中諸善男子，見色陰銷，受陰明白，味其虛明，深入心骨。其心忽有無限愛生，愛極發狂，便為貪欲。
      此名定境，安順入心，無慧自持，誤入諸欲，悟則無咎、非為聖證。若作聖解，則有欲魔，入其心腑。
      一向說欲為菩提道，化諸白衣，平等行欲，其行婬者，名持法子。神鬼力故，於末世中，攝其凡愚，其數至百，如是乃至，
      一百二百，或五六百，多滿千萬。魔心生厭，離其身體；威德既無，陷於王難，疑誤眾生，入無間獄，失於正受，當從淪墜。
I054: 阿難！如是十種禪那現境，皆是受陰用心交互，故現斯事。眾生頑迷，不自忖量，逢此因緣，迷不自識，謂言登聖，大妄語成，墮無間獄。
      汝等亦當，將如來語，於我滅後，傳示末法，遍令眾生，開悟斯義；無令天魔，得其方便，保持覆護，成無上道。
I055: 阿難！彼善男子，修三摩提，受陰盡者，雖未漏盡，心離其形；如鳥出籠，已能成就，從是凡身，上歷菩薩，六十聖位，得意生身，隨往無礙。
I056: 譬如有人，熟寐寱言，是人雖則無別所知，其言已成音韻倫次，令不寐者，咸悟其語，此則名為想陰區宇。
I057: 若動念盡，浮想銷除，於覺明心，如去塵垢。一倫生死，首尾圓照；名想陰盡，是人則能超煩惱濁。
I058: 觀其所由，融通妄想，以為其本。
I059: 阿難！彼善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛圓明，銳其精思，貪求善巧。
      爾時天魔，候得其便，飛精附人，口說經法；其人不覺，是其魔著，自言謂得無上涅槃。
      來彼求巧善男子處，敷座說法；其形斯須，或作比丘，令彼人見，或為帝釋，或為婦女，或比丘尼，或寢暗室，身有光明。
I060: 是人愚迷，惑為菩薩，信其教化；搖蕩其心，破佛律儀，潛行貪欲。口中好言，災祥變異；或言如來，某處出世；或言劫火，或說刀兵，恐怖於人；
      令其家資，無故耗散。此名怪鬼，年老成魔，惱亂是人；厭足心生，去彼人體，弟子與師，俱陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I061: 阿難！又善男子，受陰虛妙，不遭邪慮；圓定發明；三摩地中，心愛遊蕩，飛其精思，貪求經歷。
      爾時天魔，候得其便，飛精附人，口說經法；其人亦不覺知魔著，亦言自得無上涅槃。
      來彼求遊善男子處，敷座說法；自形無變，其聽法者，忽自見身，坐寶蓮華，全體化成紫金光聚，一眾聽人，各各如是，得未曾有。
I062: 是人愚迷，惑為菩薩，婬逸其心，破佛律儀，潛行貪欲；口中好言，諸佛應世，某處某人，當是某佛，化身來此，某人即是某菩薩等，來化人間。
      其人見故，心生渴仰，邪見密興，種智銷滅。此名魃鬼，年老成魔，惱亂是人；厭足心生，去彼人體；弟子與師，俱陷王難。
      汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I063: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛綿吻，澄其精思，貪求契合。爾時天魔，候得其便，飛精附人，口說經法；
      其人實不覺知魔著，亦言自得無上涅槃。來彼求合善男子處，敷座說法，其形及彼聽法之人，外無遷變。
      令其聽者，未聞法前，心自開悟，念念移易，或得宿命，或有他心，或見地獄，或知人間好惡諸事，或口說偈，或自誦經，各各歡娛，得未曾有。
I064: 是人愚迷，惑為菩薩，綿愛其心，破佛律儀，潛行貪欲。口中好言，佛有大小。某佛先佛，某佛後佛，其中亦有真佛假佛，男佛女佛，菩薩亦然。
      其人見故，洗滌本心，易入邪悟。此名魅鬼，年老成魔，惱亂是人；厭足心生，去彼人體，弟子與師，俱陷王難。
      汝當先覺，不入輪迴，迷惑不知，墮無間獄。
I065: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛根本，窮覽物化，性之始終，精爽其心，貪求辨析。
      爾時天魔，候得其便，飛精附人，口說經法；其人先不覺知魔著，亦言自得無上涅槃。
      來彼求元善男子處，敷座說法，身有威神，摧伏求者，令其座下，雖未聞法，自然心伏。
      是諸人等，將佛涅槃菩提法身，即是現前我肉身上，父父子子，遞代相生，即是法身，常住不絕。都指現在，即為佛國，無別淨居，及金色相。
      其人信受，亡失先心，身命歸依，得未曾有。
I066: 是等愚迷，惑為菩薩，推究其心，破佛律儀，潛行貪欲。口中好言，眼耳鼻舌，皆為淨土；男女二根，即是菩提涅槃真處；彼無知者，信是穢言。
      此名蠱毒魘勝惡鬼，年老成魔，惱亂是人。厭足心生，去彼人體，弟子與師，俱陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I067: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛懸應，周流精研，貪求冥感。爾時天魔，候得其便，飛精附人，口說經法；
      其人元不覺知魔著，亦言自得無上涅槃。來彼求應善男子處，敷座說法；能令聽眾，暫見其身，如百千歲，心生愛染，不能捨離。
      身為奴仆，四事供養，不覺疲勞，各各令其座下人心，知是先師本善知識，別生法愛，黏如膠漆，得未曾有。
I068: 是人愚迷，惑為菩薩，親近其心，破佛律儀，潛行貪欲。口中好言，我於前世，於某生中，先度某人；
      當時是我妻妾兄弟，今來相度，與汝相隨，歸某世界，供養某佛。或言別有，大光明天，佛於中住；
      一切如來，所休居地。彼無知者，信是虛誑，遺失本心。此名癘鬼，年老成魔，惱亂是人。
      厭足心生，去彼人體，弟子與師，俱陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I069: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛深入，克己辛勤，樂處陰寂，貪求靜謐。爾時天魔，候得其便，飛精附人，口說經法；
      其人本不覺知魔著，亦言自得無上涅槃。來彼求陰善男子處，敷座說法，令其聽人各知本業；或於其處，語一人言，汝今未死，已作畜生，
      敕使一人於後蹋尾，頓令其人起不能得。於是一眾，傾心欽伏，有人起心，已知其肇；佛律儀外，重加精苦，誹謗比丘，罵詈徒眾，訐露人事，不避譏嫌。
      口中好言，未然禍福，及至其時，毫髮無失。此大力鬼，年老成魔，惱亂是人；厭足心生，去彼人體，弟子與師，俱陷王難。
      汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I070: 又善男子受陰虛妙，不遭邪慮，固定發明；三摩地中，心愛知見，勤苦研尋，貪求宿命。爾時天魔，候得其便，飛精附人，口說經法；
      其人殊不覺知魔著，亦言自得無上涅槃。來彼求知善男子處，敷座說法。是人無端，於說法處，得大寶珠；其魔或時，化為畜生，
      口銜其珠，及雜珍寶，簡冊符牘，諸奇異物，先授彼人，後著其體；或誘聽人，藏於地下，有明月珠，照耀其處。是諸聽者，得未曾有。
I071: 多食藥草，不餐嘉饌，或時日餐一麻一麥，其形肥充，魔力持故。誹謗比丘，罵詈徒眾，不避譏嫌。口中好言，他方寶藏；
      十方聖賢，潛匿之處，隨其後者，往往見有奇異之人。此名山林，土地城隍，川岳鬼神，年老成魔；或有宣婬，破佛戒律，與承事者，潛行五欲。
      或有精進，純食草木，無定行事，惱亂是人。厭足心生，去彼人體，弟子與師，俱陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I072: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛神通，種種變化，研究化元，貪取神力。爾時天魔，候得其便，飛精附人，口說經法。
      其人誠不覺知魔著，亦言自得無上涅槃。來彼求通善男子處，敷座說法。是人或復手執火光，手撮其光，分於所聽四眾頭上；
      是諸聽人，頂上火光，皆長數尺，亦無熱性，曾不焚燒。或水上行，如履平地；或於空中，安坐不動；或入瓶內，或處囊中，越牖透垣，曾無障礙。
      唯於刀兵，不得自在。自言是佛，身著白衣，受比丘禮；誹謗禪律，罵詈徒眾，訐露人事，不避譏嫌。
I073: 口中常說，神通自在；或復令人，傍見佛土；鬼力惑人，非有真實。讚嘆行婬，不毀麤行，將諸猥媟，以為傳法。此名天地大力：
      山精、海精、風精、河精、土精、一切草木，積劫精魅；或復龍魅；或壽終仙，再活為魅；或仙期終，計年應死，其形不化，他怪所附，
      年老成魔，惱亂是人。厭足心生，去彼人體，弟子與師，多陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I074: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛入滅，研究化性，貪求深空。爾時天魔，候得其便，飛精附人，口說經法。
      其人終不覺知魔著，亦言自得無上涅槃。來彼求空善男子處，敷座說法；於大眾內，其形忽空，眾無所見，還從虛空，突然而出，存沒自在。
      或現其身，洞如琉璃；或垂手足，作旃檀氣；或大小便，如厚石蜜。誹謗戒律，輕賤出家。口中常說，無因無果，一死永滅，無復後身，及諸凡聖。
      雖得空寂，潛行貪欲，受其欲者，亦得空心，撥無因果。此名日月，薄蝕精氣，金玉芝草，麟鳳龜鶴，經千萬年，不死為靈，出生國土，年老成魔，
      惱亂是人。厭足心生，去彼人體，弟子与師，多陷王難。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I075: 又善男子，受陰虛妙，不遭邪慮，圓定發明；三摩地中，心愛長壽，辛苦研幾，貪求永歲，棄分段生，頓希變易，細相常住。
      爾時天魔，候得其便，飛精附人，口說經法；其人竟不覺知魔著，亦言自得無上涅槃。來彼求生善男子處，敷座說法。好言他方，往還無滯；
      或經萬里，瞬息再來，皆於彼方，取得其物。或於一處，在一宅中，數步之間，令其從東詣至西壁，是人急行，累年不到。因此心信，疑佛現前。
I076: 口中常說，十方眾生，皆是吾子；我生諸佛；我出世界；我是元佛；出世自然，不因修得。此名住世自在天魔，使其眷屬，如遮文茶，
      及四天王毗捨童子，未發心者；利其虛明，食彼精氣。或不因師，其修行人，親自觀見，稱執金剛，與汝長命；現美女身，盛行貪欲，未逾年歲，
      肝腦枯竭。口兼獨言，聽若妖魅，前人未詳，多陷王難。未及遇刑，先已乾死，惱亂彼人，以至殂殞。汝當先覺，不入輪迴；迷惑不知，墮無間獄。
I077: 阿難當知，是十種魔，於末世時，在我法中，出家修道；或附人體，或自現形，皆言已成正遍知覺。讚嘆婬欲，破佛律儀。
      先惡魔師，與魔弟子，婬婬相傳。如是邪精，魅其心腑，近則九生，多逾百世。令真修行，總為魔眷。命終之後，必為魔民，失正遍知，墮無間獄。
I078: 汝今未須先取寂滅，縱得無學，留願入彼末法之中；起大慈悲，救度正心，深信眾生，令不著魔，得正知見。我今度汝，已出生死；汝遵佛語，名報佛恩。
I079: 阿難，如是十種，禪那現境，皆是想陰，用心交互，故現斯事。眾生頑迷，不自忖量，逢此因緣，迷不自識，謂言登聖；大妄語成，墮無間獄。
      汝等必須將如來語，於我滅後傳示末法；遍令眾生開悟斯義，無令天魔得其方便；保持覆護成無上道。

J001: 阿難！彼善男子，修三摩地，想陰盡者，是人平常，夢想銷滅，寤寐恒一，覺明虛靜；猶如晴空，無復麤重前塵影事。
      觀諸世間，大地山河，如鏡鑒明，來無所黏，過無蹤跡，虛受照應，了罔陳習，唯一精真。
J002: 生滅根元，從此披露，見諸十方，十二眾生，畢殫其類。雖未通其各命由緒，見同生基，猶如野馬。
      熠熠清擾，為浮根塵，究竟樞穴；此則名為行陰區宇。
J003: 若此清擾，熠熠元性，性入元澄，一澄元習，如波瀾滅，化為澄水，名行陰盡，是人則能超眾生濁。
J004: 觀其所由，幽隱妄想，以為其本。
J005: 阿難當知：是得正知，奢摩他中，諸善男子，凝明正心，十類天魔，不得其便。方得精研，窮生類本。
      於本類中，生元露者，觀彼幽清，圓擾動元，於圓元中，起計度者，是人墜入二無因論。
J006: 一者，是人見本無因。何以故？是人既得生機全破，乘於眼根，八百功德，見八萬劫所有眾生，業流灣環，死此生彼，祇見眾生，輪迴其處，
      八萬劫外，冥無所觀。便作是解：此等世間，十方眾生，八萬劫來，無因自有。由此計度，亡正遍知，墮落外道，惑菩提性。
J007: 二者，是人見末無因。何以故？是人於生，既見其根，知人生人，悟鳥生鳥，烏從來黑，鵠從來白，人天本豎，畜生本橫，白非洗成，黑非染造；
      從八萬劫，無復改移。今盡此形，亦復如是。而我本來，不見菩提，云何更有成菩薩事？當知今日，一切物象，皆本無因。
      由此計度，亡正遍知，墮落外道，惑菩提性。是則名為第一外道，立無因論。
J008: 阿難！是三摩中，諸善男子，凝明正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於圓常中，起計度者；是人墜入四遍常論。
J009: 一者，是人窮心境性。二處無因，修習能知，二萬劫中，十方眾生，所有生滅，咸皆循環，不曾散失，計以為常。
J010: 二者，是人窮四大元。四性常住，修習能知，四萬劫中，十方眾生，所有生滅，咸皆體恒，不曾散失，計以為常。
J011: 三者，是人窮盡六根，末那執受；心意識中，本元由處，性常恒故。修習能知，八萬劫中，一切眾生，循環不失，本來常住，窮不失性，計以為常。
J012: 四者，是人既盡想元，生理更無流止運轉，生滅想心，今已永滅，理中自然，成不生滅。因心所度，計以為常。
      由此計常，亡正遍知，墮落外道，惑菩提性，是則名為第二外道，立圓常論。
J013: 又三摩中諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元，於自他中，起計度者，是人墜入四顛倒見，一分無常，一分常論。
J014: 一者，是人觀妙明心，遍十方界，湛然以為究竟神我。從是則計我遍十方，凝明不動；一切眾生，於我心中，自生自死。
      則我心性，名之為常，彼生滅者，真無常性。
J015: 二者，是人不觀其心，遍觀十方，恒沙國土。見劫壞處，名為究竟無常種性；劫不壞處，名究竟常。
J016: 三者，是人別觀我心，精細微密；猶如微塵，流轉十方，性無移改。能令此身，即生即滅，其不壞性，名我性常；一切生死，從我流出，名無常性。
J017: 四者，是人知想陰盡，見行陰流，行陰常流，計為常性，色受想等，今已滅盡。名無常性。
J018: 由此計度，一分無常，一分常故，墮落外道，惑菩提性；是則名為第三外道，一分常論。
J019: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於分位中，生計度者，是人墜入四有邊論。
J020: 一者，是人心計生元，流用不息。計過未者，名為有邊。計相續心，名為無邊。
J021: 二者，是人觀八萬劫，則見眾生；八萬劫前，寂無聞見。無聞見處，名為無邊；有眾生處，名為有邊。
J022: 三者，是人計我遍知，得無邊性。彼一切人，現我知中；我曾不知彼之知性，名彼不得無邊之心，但有邊性。
J023: 四者，是人窮行陰空，以其所見，心路籌度，一切眾生，一身之中，計其咸皆半生半滅；明其世界，一切所有，一半有邊，一半無邊。
J024: 由此計度，有邊無邊，墮落外道，惑菩提性，是則名為第四外道，立有邊論。
J025: 又三摩中，諸善男子，堅凝正心，魔不得便。窮生類本，觀彼幽清，常擾動元。於知見中，生計度者，是人墜入四種顛倒，不死矯亂，遍計虛論。
J026: 一者，是人觀變化元，見遷流處，名之為變；見相續處，名之為恒；見所見處，名之為生；不見見處，名之為滅。
      相續之因，性不斷處，名之為增；正相續中，中所離處，名之為減；各各生處，名之為有；互互亡處，名之為無。
      以理都觀，用心別見。有求法人，來問其義，答言：我今亦生亦滅，亦有亦無，亦增亦減；於一切時，皆亂其語，令彼前人，遺失章句。
J027: 二者，是人諦觀其心，互互無處，因無得證。有人來問，唯答一字，但言其無。除無之餘，無所言說。
J028: 三者，是人諦觀其心，各各有處，因有得證。有人來問，唯答一字，但言其是，除是之餘，無所言說。
J029: 四者，是人有無俱見，其境枝故，其心亦亂。有人來問，答言亦有，即是亦無；亦無之中，不是亦有。一切矯亂，無容窮詰。
J030: 由此計度，矯亂虛無，墮落外道，惑菩提性。是則名為第五外道，四顛倒性，不死矯亂，遍計虛論。
J031: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於無盡流，生計度者；是人墜入死後有相，發心顛倒。
      或自固身，云色是我。或見我圓，含遍國土，云我有色。或彼前緣，隨我回復，云色屬我。或復我依，行中相繼，云我在色。
J032: 皆計度言，死後有相，如是循環，有十六相。從此或計，畢竟煩惱，畢竟菩提，兩性並驅，各不相觸。由此計度，死後有故；墮落外道，惑菩提性。
      是則名為第六外道，立五陰中，死後有相，心顛倒論。
J033: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於先除滅，色受想中，生計度者；是人墜入死後無相，發心顛倒。
      見其色滅，形無所因；觀其想滅，心無所系；知其受滅，無復連綴；陰性銷散，縱有生理，而無受想，與草木同。
      此質現前，猶不可得，死後云何更有諸相？因之勘校，死後相無，如是循環，有八無相。
J034: 從此或計，涅槃因果，一切皆空，徒有名字，究竟斷滅。由此計度，死後無故，墮落外道，惑菩提性。
      是則名為第七外道，立五陰中，死後無相，心顛倒論。
J035: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。
      於行存中，兼受想滅，雙計有無，自體相破；是人墜入死後俱非，起顛倒論。
J036: 色受想中，見有非有；行遷流內，觀無不無。如是循環，窮盡陰界，八俱非相；
      隨得一緣，皆言死後，有相無相。又計諸行，性遷訛故，心發通悟，有無俱非，虛實失措。
      由此計度，死後俱非，後際昏瞢，無可道故；墮落外道，惑菩提性。是則名為第八外道，立五陰中，死後俱非，心倒顛論。
J037: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於後後無，生計度者，是人墜入七斷滅論。
      或計身滅，或欲盡滅，或苦盡滅，或極樂滅，或極捨滅。如是循環，窮盡七際，現前銷滅，滅已無復。由此計度，死後斷滅；墮落外道，惑菩提性。
      是則名為第九外道，立五陰中，死後斷滅，心顛倒論。
J038: 又三摩中，諸善男子，堅凝正心，魔不得便；窮生類本，觀彼幽清，常擾動元。於後後有，生計度者，是人墜入五涅槃論。
      或以欲界，為正轉依，觀見圓明，生愛慕故；或以初禪性無憂故；或以二禪心無苦故；或以三禪極悅隨故；或以四禪苦樂二亡，不受輪迴，生滅性故。
      迷有漏天，作無為解，五處安隱，為勝淨依，如是循環，五處究竟。
      由此計度，五現涅槃，墮落外道，惑菩提性；是則名為第十外道，立五陰中，五現涅槃，心顛倒論。
J039: 阿難！如是十種禪那狂解，皆是行陰，用心交互，故現斯悟。眾生頑迷，不自忖量，逢此現前，以迷為解，自言登聖，大妄語成，墮無間獄。
      汝等必須將如來語，於我滅後，傳示末法，遍令眾生覺了斯義；無令心魔，自起深孽，保持覆護，銷息邪見。
      教其身心，開覺真義，於無上道，不遭枝歧；勿令心祈，得少為足，作大覺王，清淨標指。
J040: 阿難！彼善男子，修三摩地，行陰盡者，諸世間性，幽清擾動，同分生機，倏然隳裂，沈細綱紐，補特伽羅，酬業深脈，感應懸絕。
J041: 於涅槃天，將大明悟，如雞後鳴，瞻顧東方，已有精色。六根虛靜，無復馳逸，內外湛明，入無所入。
      深達十方，十二種類，受命元由，觀由執元，諸類不召；於十方界，已獲其同，精色不沈，顯現幽秘。此則名為識陰區宇。
J042: 若於群召，已獲同中，銷磨六門，合開成就，見聞通鄰，互用清淨。十方世界，及與身心，如吠琉璃，內外明徹；名識陰盡，是人則能超越命濁。
J043: 觀其所由，罔象虛無，顛倒妄想，以為其本。
J044: 阿難當知：是善男子，窮諸行空；於識還元，已滅生滅，而於寂滅，精妙未圓。能令己身，根隔合開；亦與十方，諸類通覺，覺知通曶，能入圓元。
      若於所歸，立真常用，生勝解者，是人則墮因所因執。娑毗迦羅，所歸冥諦，成其伴侶。迷佛菩提，亡失知見。
      是名第一，立所得心，成所歸果，違遠圓通，背涅槃城，生外道種。
J045: 阿難！又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於所歸，覽為自體，盡虛空界，十二類內，所有眾生，皆我身中，一類流出，生勝解者，
      是人則墮能非能執；摩醯首羅，現無邊身，成其伴侶。迷佛菩提，亡失知見。
      是名第二，立能為心，成能事果，違遠圓通，背涅槃城，生大慢天，我遍圓種。
J046: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於所歸，有所歸依，自疑身心，從彼流出，十方虛空，咸其生起。
      即於都起，所宣流地，作真常身，無生滅解。在生滅中，早計常住；既惑不生，亦迷生滅，安住沈迷，生勝解者；
      是人則墮常非常執，計自在天，成其伴侶。迷佛菩提，亡失知見。是名第三，立因依心，成妄計果，違遠圓通，背涅槃城，生倒圓種。
J047: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於所知，知遍圓故，因知立解；十方草木，皆稱有情，與人無異。
      草木為人，人死還成十方草樹，無擇遍知。生勝解者，是人則墮知無知執。婆吒散尼，執一切覺，成其伴侶。迷佛菩提，亡失知見。
      是名第四，計圓知心，成虛謬果，違遠圓通，背涅槃城，生倒知種。
J048: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於圓融，根互用中，已得隨順；便於圓化，一切發生，求火光明，樂水清淨，愛風周流，
      觀塵成就，各各崇事；以此群塵，發作本因，立常住解，是人則墮生無生執。諸迦葉波，並婆羅門，勤心役身，事火崇水，求出生死，成其伴侶。
      迷佛菩提；亡失知見。是名第五，計著崇事，迷心從物，立妄求因，求妄冀果；違遠圓通，背涅槃城，生顛化種。
J049: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於圓明，計明中虛，非滅群化，以永滅依，為所歸依，生勝解者。
      是人則墮歸無歸執；無想天中，諸舜若多，成其伴侶。迷佛菩提，亡失知見。是名第六，圓虛無心，成空亡果，違遠圓通，背涅槃城，生斷滅種。
J050: 又善男子，窮諸行空，已滅生滅；而於寂滅；精妙未圓。若於圓常，固身常住，同於精圓，長不傾逝，生勝解者；是人則墮貪非貪執。
      諸阿斯陀，求長命者，成其伴侶；迷佛菩提，亡失知見。是名第七，執著命元，立固妄因，趣長勞果，違遠圓通，背涅槃城，生妄延種。
J051: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。觀命互通，卻留塵勞，恐其銷盡；便於此際，坐蓮華宮，廣化七珍，多增寶媛，恣縱其心，
      生勝解者，是人則墮真無真執，吒枳、迦羅，成其伴侶，迷佛菩提，亡失知見。是名第八，發邪思因，立熾塵果。違遠圓通，背涅槃城，生天魔種。
J052: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。於命明中，分別精麤，疏決真偽，因果相酬，唯求感應，背清淨道，所謂：
      見苦斷集，證滅修道。居滅已休，更不前進，生勝解者，是人則墮定性聲聞。諸無聞僧，增上慢者，成其伴侶。
      迷佛菩提，亡失知見，是名第九，圓精應心，成趣寂果，違遠圓通，背涅槃城，生纏空種。
J053: 又善男子，窮諸行空，已滅生滅；而於寂滅，精妙未圓。若於圓融，清淨覺明，發研深妙，即立涅槃，而不前進，生勝解者；是人則墮，定性僻支。
      諸緣獨倫，不回心者，為其伴侶。迷佛菩提，亡失知見。是名第十，圓覺曶心，成湛明果，違遠圓通，背涅槃城，生覺圓明，不化圓種。
J054: 阿難！如是十種禪那，中塗成狂，因依迷惑，於未足中，生滿足證；皆是識陰，用心交互，故生斯位。眾生頑迷，不自忖量，逢此現前，各以所愛，
      先習迷心，而自休息，將為畢竟，所歸寧地。自言滿足，無上菩提，大妄語成，外道邪魔，所感業盡，墮無間獄；聲聞緣覺，不成增進。
J055: 汝等存心，秉如來道，將此法門，於我滅後，傳示末世；普令眾生，覺了斯義。
      無令見魔，自作沈孽，保綏哀救，銷息邪緣，令其身心，入佛知見，從始成就，不遭歧路。
J056: 如是法門，先過去世，恒沙劫中，微塵如來，乘此心開，得無上道。
      識陰若盡，則汝現前，諸根互用；從互用中，能入菩薩，金剛乾慧，圓明精心，於中發化。如淨琉璃，內含寶月，如是乃至，
      超十信、十住、十行、十迴向、四加行心，菩薩所行金剛十地，等覺圓明，入於如來，妙莊嚴海，圓滿菩提，歸無所得。
J057: 此是過去，先佛世尊，奢摩他中，毗婆舍那，覺明分析、微細魔事，魔境現前，汝能諳識，心垢洗除，不落邪見。
      陰魔銷滅，天魔摧碎，大力鬼神，褫魄逃逝，魑魅魍魎，無復出生；直至菩提，無諸少乏。下劣增進，於大涅槃，心不迷悶。
      若諸末世，愚鈍眾生，未識禪那，不知說法，樂修三昧，汝恐同邪，一心勸令，持我佛頂陀羅尼咒。若未能誦，寫於禪堂，或帶身上；
      一切諸魔，所不能動。汝當恭欽，十方如來，究竟修進，最後垂範。
J058: 阿難即從座起，聞佛示誨，頂禮欽奉，憶持無失，於大眾中，重復白佛。
J059: 如佛所言，五陰相中，五種虛妄，為本想心，我等平常，未蒙如來微妙開示。
J060: 又此五陰，為並銷除，為次第盡？
J061: 如是五重，詣何為界？
J062: 惟願如來，發宣大慈，為此大眾，清明心目，以為末世，一切眾生，作將來眼。
J063: 佛告阿難：精真妙明，本覺圓淨，非留死生，及諸塵垢。乃至虛空，皆因妄想之所生起。斯元本覺，妙明精真，妄以發生，諸器世間。
      如演若多，迷頭認影，妄元無因，於妄想中，立因緣性；迷因緣者，稱為自然。彼虛空性，猶實幻生，因緣、自然，皆是眾生，妄心計度。
      阿難！知妄所起，說妄因緣。若妄元無，說妄因緣，元無所有，何況不知，推自然者？是故如來，與汝發明，五陰本因，同是妄想。
J064: 汝體先因，父母想生，汝心非想，則不能來，想中傳命。如我先言：心想醋味，口中涎出，心想登高，足心酸起。
      懸崖不有，醋物未來，汝體必非，虛妄通倫，口水如何，因談醋出？是故當知，汝現色身，名為堅固，第一妄想。
J065: 即此所說，臨高想心，能令汝形，真受酸澀；由因受生，能動色體。汝今現前，順益違損，二現驅馳；名為虛明，第二妄想。
J066: 由汝念慮，使汝色身；身非念倫，汝身何因，隨念所使，種種取像，心生形取，與念相應。
      寤即想心，寐為諸夢；則汝想念，搖動妄情，名為融通，第三妄想。
J067: 化理不住，運運密移；甲長髮生，氣銷容皺，日夜相代，曾無覺悟。阿難！此若非汝，云何體遷；如必是真，汝何無覺？
      則汝諸行，念念不停，名為幽隱，第四妄想。
J068: 又汝精明，湛不搖處，名恒常者，於身不出見聞覺知。若實精真，不容習妄；何因汝等，曾於昔年，睹一奇物，經歷年歲，憶忘俱無；於後忽然，
      覆睹前異，記憶宛然，曾不遺夫。則此精了湛不搖中，念念受熏，有何籌算。阿難當知，此湛非真，如急流水，望如恬靜，流急不見，非是無流。
      若非想元，寧受妄習，非汝六根，互用開合。此之妄想，無時得滅；故汝現在，見聞覺知，中串習幾，則湛了內，罔象虛無，第五顛倒，微細精想。
J069: 阿難，是五受陰，五妄想成。
J070: 汝今欲知，因界淺深，唯色與空，是色邊際；唯觸及離，是受邊際；唯記與忘，是想邊際；唯滅與生，是行邊際；湛入合湛，歸識邊際。
J071: 此五陰元，重疊生起；生因識有，滅從色除。理則頓悟，乘悟並銷；事非頓除，因次第盡。我已示汝，劫波巾結，何所不明，再此詢問。
J072: 汝應將此，妄想根元、心得開通。傳示將來，末法之中，諸修行者；令識虛妄，深厭自生，知有涅槃，不戀三界。
J073: 阿難！若復有人，遍滿十方，所有虛空，盈滿七寶，持以奉上，微塵諸佛，承事供養，心無虛度，於意云何，是人以此施佛因緣，得福多不。
      阿難答言：虛空無盡，珍寶無邊，昔有眾生，施佛七錢，捨身猶獲轉輪王位；況復現前虛空既窮，
      佛土充遍，皆施珍寶，窮劫思議，尚不能及，是福云何更有邊際。
J074: 佛告阿難：諸佛如來，語無虛妄，若復有人，身具四重，十波羅夷，瞬息即經此方他方，阿鼻地獄，乃至窮盡十方無間，靡不經歷；
      能以一念，將此法門，於末劫中，開示未學。是人罪障，應念銷滅；變其所受，地獄苦因，成安樂國。
      得福超越，前之施人，百倍千倍，千萬億倍，如是乃至，算數譬喻，所不能及。
J075: 阿難！若有眾生，能誦此經，能持此咒，如我廣說，窮劫不盡；依我教言，如教行道，直成菩提，無復魔業。
J076: 佛說此經已，比丘，比丘尼，優婆塞，優婆夷，一切世間，天人阿修羅，及諸他方菩薩，二乘聖仙童子，並初發心大力鬼神，皆大歡喜，作禮而去。
`;

var HaiRenVersesObj;

function getHaiRenVerses() {
  if (!HaiRenVersesObj) {
    HaiRenVersesObj = {};
    var lastKey, a = HaiRenVerses.split('\n');
    for (var i in a) {
      var ln = a[i].trim();
      if (ln.length == 0) continue;
      var idx = ln.indexOf(':');
      if (idx > 0) {
        lastKey = ln.substring(0,idx).trim();
        HaiRenVersesObj[lastKey] = ln.substring(idx+1).trim();
      } else {
        HaiRenVersesObj[lastKey] += ln;
      }
    }
  }
  return HaiRenVersesObj;
}

