var lines = [];

lines.push(
`　    　[引子]
一  1:　　〇　佛菩薩休夏自咨。波斯匿王城中營齋　　　　　　.
一 30:　　〇　阿難獨乞　　　　　　　　　　　　　　　　　　.
一 40:　　　　　　遭摩登伽咒迷　　　　　　　　　　　　　　.
一 41:　　　　　　將毀戒體　　　　　　　　　　　　　　　　.
一 42:　　　　佛知齋畢歸　　　　　　　　　　　　　　　　　.
一 44:　　　　　放寶光宣神咒　　　　　　　　　　　　　　　.
一 45:　　　　敕文殊菩薩神咒　　　　　　　　　　　　　　　.
一 46:　　　　　往提阿難暨摩女回　　　　　　　　　　　　　.
一 47:　　〇　阿難悲悔　　　　　　　　　　　　　　　　　　.
一 48:　　　　　　發願求菩提道　　　　　　　　　　　　　　.
一 49:　　　　　　　　　妙奢摩他　　　　　　　　　　　　　.
一 50:　　　　　　　　　三摩禪那　　　　　　　　　　　　　.
一 51:　　　　　　　　　最初方便　　　　　　　　　　　　　.
一 52:　　〇　楞嚴會始　　　　　　　　　　　　　　　　　　.
　    　[引子/終]

一 53:　　　　佛：問阿難何以出家　　　　　　　　　　　　　.
一 55:　　　　難：觀佛相好　　　　　　　　　　　　　　　　.
一 57:　　眾生不知常住真心性淨明體用諸妄想　　　　　　　　.
一 58:　　故有輪轉　　　　　　　　　　　　　　　　　　　　.
一 59:　　直心　　　　　　　　　　　　　　　　　　　　　　.

一 62:　[HR] 廣破七番妄計【徵心何在，唯破未立】有七
一 62:　　　　佛：徵誰見誰樂　　　　　　　　　　　　　　　.
一 63:　　　　難：心目　　　　　　　　　　　　　　　　　　.
一 64:　　　　佛：不知心目所在，不能降伏塵勞　　　　　　　.
一 68:　[HR] 　正破內計（七之一）
一 68:　　　　難：識心（見性）居身內　　　　　　　　　　　.
一 70:　（辯）佛：堂內先何所見　　　　　　　　　　　　　　.
一 72:　　〇　佛摩難頂　　　　　　　　　　　　　　　　　　.
一 73:　　　　　：有三摩提名大佛頂首楞嚴王　　　　　　　　.
一 74:　　　　　　具足萬行十方如來一門超出妙莊嚴路　　　　.
一 76:　（辯）佛：在內不見如來而見外者　難：不能　　　　　.
一 79:　（辯）　　（遂破內計）　　　　　　　　　　　　　　.
一 80:　[HR] 　破轉計在外（七之二）
一 80:　　　　難：識心（見性）居身外　　　　　　　　　　　.
一 83:　（辯）佛：一人食令諸人飽　難：不能　　　　　　　　.
一 84:　（辯）佛：心知身覺相類　　　　　　　　　　　　　　.
一 85:　（辯）佛示手以證二俱（遂破外計）　　　　　　　　　.
一 88:　[HR] 　破轉計潛根（七之三）
一 88:　　　　難：識心（見性）潛根。如取琉璃合眼　　　　　.
一 90:　（辯）佛：琉璃籠眼見山河時見琉璃不　　　　　　　　.
一 91:　（辯）難：是　　　　　　　　　　　　　　　　　　　.
一 92:　（辯）佛：心若合琉璃何不見若見眼者眼即同境　　　　.
一 93:　（辯）　　（遂破潛根計）　　　　　　　　　　　　　.
一 94:　[HR] 　破轉計見內（七之四）
一 94:　　　　難：識心（見性）見暗名見內　　　　　　　　　.
一 95:　（辯）佛：暗境眼對不　　　　　　　　　　　　　　　.
一 96:　　　　　　若對暗在眼前云何成內　　　　　　　　　　.
一 97:　　　　　　若內暗室皆汝焦腑　　　　　　　　　　　　.
一 98:　　　　　　若不對者云何成見　　　　　　　　　　　　.
一 99:　（辯）　　若合眼轉內開時何不見面故內對不成　　　　.
一100:　　　　　　若見面此心與根在空非內非體　　　　　　　.
一101:　　　　　　則人見汝面即是汝身而汝自己身非覺　　　　.
一102:　　　　　　身眼兩覺應有二知即汝一身應成二佛　　　　.
一103:　（辯）　　（遂破見內計）　　　　　　　　　　　　　.
一105:　[HR] 　破轉計隨生（七之五）
一105:　　　　難：識心（見性）隨所合處心則隨有　　　　　　.
一106:　（辯）佛：心隨有者是心無體則無所合　　　　　　　　.
一107:　　　　　　若無體能合則十九界因七塵合是義不然　　　.
一108:　　　　　　若有體者如汝手挃自體知心內出外入耶　　　.
一109:　（辯）難：心知非眼為見非義　　　　　　　　　　　　.
一110:　（辯）佛：若眼能見門能見不死眼見不　　　　　　　　.
一111:　　　　　　又汝知心一體抑或多體遍體不遍體　　　　　.
一114:　　　　　　（俱破之。遂破隨生計）　　　　　　　　　.
一116:　[HR] 　破轉計中間（七之六）
一116:　　　　難：識心（見性）在中　　　　　　　　　　　　.
一117:　（辯）佛：中何為在身外身上　　　　　　　　　　　　.
一120:　（辯）難：我中非此二乃根塵之間　　　　　　　　　　.
一121:　（辯）佛：心體為復兼二為不兼二　　　　　　　　　　.
一122:　　　　　　若兼二者成敵兩立云何為中　　　　　　　　.
一123:　　　　　　兼二不成非知不知即無體性中何為相　　　　.
一124:　（辯）　　（遂破在中計）　　　　　　　　　　　　　.
一126:　[HR] 　破轉計無著（七之七）
一126:　　　　難：識心（見性）無著名為心不　　　　　　　　.
一127:　（辯）佛：汝不著者為在為無　　　　　　　　　　　　.
一128:　　　　　　無則同於龜毛兔角不著云何　　　　　　　　.
　    　　　　　　非無即相相有則在云何無著　　　　　　　　.
一129:　（辯）　　（遂破無著計）　　　　　　　　　　　　　.
　    　[HR] 廣破七番妄計/終

一130:　[HR] 明萬法唯心
一130:　[HR] 　二本不離一心
一134:　　修行人不成無上菩提　　　　　　　　　　　　　　　.
　    　　成聲聞緣覺外道諸天魔王魔眷屬　　　　　　　　　　.
一135:　　皆由不知二種根本錯亂修習　　　　　　　　　　　　.
一136:　　一者無始生死根本用攀緣心為自性者　　　　　　　　.
一137:　　二者無始菩提涅槃元清淨體　　　　　　　　　　　　.
一134:　　　　佛：汝今識精元明能生諸緣緣所遺者　　　　　　.
一139:　　　　　　　　遺此本明而不自覺枉入諸趣　　　　　　.

一141:　[HR] 　心使不同妄執
一141:　　〇　如來舉金色臂屈五輪指　　　　　　　　　　　　.
一144:　　　　　：以何為心當我拳耀　　　　　　　　　　　　.
一145:　　　　難：推窮尋逐者將為心　　　　　　　　　　　　.
一146:　　　　佛：此非汝心　　　　　　　　　　　　　　　　.
一151:　　諸法所生唯心所現　　　　　　　　　　　　　　　　.
一152:　　一切因果世界微塵因心成體　　　　　　　　　　　　.
一153:　　一切所有咸有體性縱令虛空亦有名貌　　　　　　　　.
　    　　何況清淨妙淨明心性一切心而自無體　　　　　　　　.
一156:　　若離前塵有分別性即真汝心　　　　　　　　　　　　.
　    　　離塵無體斯則前塵分別影事　　　　　　　　　　　　.
一157:　　塵非常住若變滅時此心則同龜毛兔角　　　　　　　　.
　    　　則汝法身同於斷滅其誰修證無生法忍　　　　　　　　.

一165:　[HR] 　就見精顯性　有十
一165:　[HR] 　　見性是心非眼（十之一）
一165:　　〇　即時如來從胸卍字湧出寶光周遍普佛世界　　　　.
　    　　　　遍灌十方寶剎諸如來頂旋至阿難及諸大眾　　　　.
一167:　　〇　作光明拳問因何所有云何成拳汝將誰見　　　　　.
一169:　　　　佛：若無我手不成我拳若無汝眼不成汝見　　　　.
　    　　　　　　以汝眼根例我拳理其義均不　　　　　　　　.
一170:　　　　難：既無我眼不成我見　　　　　　　　　　　　.
　    　　　　　　以我眼根例如來拳事義相類　　　　　　　　.
一171:　　　　佛：汝言相類是義不然　　　　　　　　　　　　.
　    　　　　　　彼無眼者非見全無　　　　　　　　　　　　.
一173:　　　　　　如是見性是心非眼　　　　　　　　　　　　.
一175:　　　　　　不成菩提阿羅漢皆由客塵煩惱所誤　　　　　.
　    　　　　　　我初成道汝等當時因何開悟今成聖果　　　　.
一176:　　　　憍陳那：悟客塵二字成果　　　　　　　　　　　.
一177:　　　　　　　　不住名客　　　　　　　　　　　　　　.
一178:　　　　　　　　搖動名塵　　　　　　　　　　　　　　.

一179:　[HR] 　　約客塵顯見性不動（十之二）
一179:　　〇　佛屈五輪指已復開開已又屈　　　　　　　　　　.
一180:　　　　佛：為是我手有開有合為復汝見有開有合　　　　.
　    　　　　難：我見如來手自開合非我見性有開有合　　　　.
一181:　　　　佛：誰動誰靜　　　　　　　　　　　　　　　　.
　    　　　　難：佛手不住而我見性尚無有靜誰為無住　　　　.
一182:　　　　佛：如是　　　　　　　　　　　　　　　　　　.
一183:　　〇　佛飛一光在難右難右盼　　　　　　　　　　　　.
一184:　　　　又放一光在難左難左盼　　　　　　　　　　　　.
　    　　　　難：我頭自動而我見性尚無有止誰為搖動　　　　.
一185:　　　　佛：如是　　　　　　　　　　　　　　　　　　.
一186:　　　　　　以搖動者名之為塵以不住者名之為客　　　　.
一187:　　　　　　云何汝今以動為身以動為境　　　　　　　　.
　    　　　　　　從始洎終念念生滅遺失真性顛倒行事　　　　.
　    　　　　　　性心失真認物為己輪迴是中自取流轉　　.`);
