lines.push(
`二  1:　[HR] 　　約觀河顯見性無遷（十之三）
二  1:　　〇　阿難大眾合掌禮佛　　　　　　　　　　　　　　.
　    　　　　願聞如來顯出身心真妄虛實現前生滅　　　　　　.
　    　　　　與不生滅二發明性　　　　　　　　　　　　　　.
二  2:　　〇　波斯匿王：　　　　　　　　　　　　　　　　　.
二  3:　　　　　　　　　云何發揮證知此心不生滅地　　　　　.
二 10:　　　　佛：汝見變化悟知汝滅　　　　　　　　　　　　.
　    　　　　　　亦於滅時身中有不滅耶　　　　　　　　　　.
二 14:　　　　佛：變者受滅彼不變者元無生滅不受生死　　　　.

二 16:　[HR] 　　約垂手顯見性無滅（十之四）
二 16:　　　　難：云何名我輩遺失真性顛倒行事　　　　　　　.
二 17:　　〇　如來輪手下指：我手為正為倒　　　　　　　　　.
二 21:　　　　佛：如來之身名正遍知汝等之身號性顛倒　　　　.
　    　　　　阿難與大眾不知身心顛倒所在　　　　　　　　　.
二 22:　　色心諸緣及心所使諸所緣法唯心所現　　　　　　　　.
　    　　汝身汝心皆是妙明真精妙心中所現物　　　　　　　　.
二 23:　　云何汝等遺失本妙圓妙明心寶明妙性認悟中迷　　　　.
二 24:　　晦昧為空　　　　　　　　　　　　　　　　　　　　.
　    　　空晦暗中結暗為色　　　　　　　　　　　　　　　　.
　    　　色雜妄想想相為身　　　　　　　　　　　　　　　　.
二 25:　　聚緣內搖趣外奔逸昏擾擾相以為心性　　　　　　　　.
二 26:　　一迷為心決定惑為色身之內　　　　　　　　　　　　.
　    　　不知色身外洎山河虛空大地咸是妙明真心中物　　　　.
二 28:　　汝等迷中倍人如來說為可憐愍者　　　　　　　　　　.

二 33:　[HR] 　　約標指顯見性無還（十之五）
二 33:　　若真汝心則無所去云何離聲無分別性　　　　　　　　.
二 34:　　斯則豈唯聲分別心分別我容離諸色相無分別性　　　　.
　    　　如是乃至分別都無非色非空　　　　　　　　　　　　.
二 35:　　則汝心性各有所還云何為主　　　　　　　　　　　　.
二 36:　　　　難：妙明元心云何無還　　　　　　　　　　　　.
二 39:　　明暗通壅緣頑虛鬱孛清明各還本所因處　　　　　　　.
　    　　世間一切不出斯類　　　　　　　　　　　　　　　　.
二 40:　　八種見精明性當欲誰還　　　　　　　　　　　　　　.
　    　　種種差別見無差別　　　　　　　　　　　　　　　　.
二 41:　　諸可還者自然非汝不汝還者非汝而誰　　　　　　　　.
二 42:　　則知汝心本妙明淨　　　　　　　　　　　　　　　　.

二 43:　[HR] 　　約周遍顯見性非物（十之六）
二 43:　　　　難：云何得知是我真性　　　　　　　　　　　　.
二 44:　　汝未得無漏清淨承佛神力見於初禪得無障礙　　　　　.
　    　　阿那律見閻浮提如觀掌中菴摩羅果　　　　　　　　　.
　    　　諸菩薩等見百千界　　　　　　　　　　　　　　　　.
　    　　十方如來窮盡微塵清淨國土無所不矚　　　　　　　　.
　    　　眾生洞視不過分寸　　　　　　　　　　　　　　　　.
二 45:　　汝觀種種無非前塵分別留礙汝應於此分別自他　　　　.
二 46:　　今吾將汝擇於見中誰是我體誰為物象咸物非汝　　　　.
二 47:　　則諸物類自有差別見性無殊此精妙明誠汝見性　　　　.
二 53:　　若汝見時是汝非我見性周遍非汝而誰　　　　　　　　.
二 54:　　云何自疑汝之真性性汝不真取我求實　　　　　　　　.
二 55:　　　　難：若此見性必我非餘　　　　　　　　　　　　.
二 55:　　　　　　此見其體本遍一界今在室中唯滿一室　　　　.
二 55:　　　　　　此見縮大為小為牆夾令斷絕　　　　　　　　.
二 56:　　一切世間大小內外諸所事業各屬前塵　　　　　　　　.
　    　　不應說言見有舒縮　　　　　　　　　　　　　　　　.
二 61:　　一切眾生迷己為物失於本心為物所轉　　　　　　　　.
　    　　故於是中觀大觀小若能轉物則同如來　　　　　　　　.
　    　　身心圓明不動道場於一毛端遍受十方國土　　　　　　.

二 62:　[HR] 　　約無是非是顯見性唯真（十之七）
二 62:　　　　難：若此見精必我妙性今此妙性現在我前　　　　.
　    　　　　　　見必我真我今身心復是何物　　　　　　　　.
　    　　　　　　而今身心分別有實彼見無別分辨我身　　　　.
　    　　　　　　若實我心令我今見見性實我而身非我　　　　.
二 63:　　　　佛：見在汝前是義非實　　　　　　　　　　　　.
二 64:　　　　　　汝今指陳是種種相但可有形無不指著　　　　.
二 65:　　　　　　若必其見現在汝前汝應以手確實指陳　　　　.
　    　　　　　　若空是見既已成見何者是空　　　　　　　　.
　    　　　　　　若物是見既已是見何者為物　　　　　　　　.
二 67:　　　　難：舉手所指縱目所觀指皆是物無是見者　　　　.
二 68:　　　　　　不能於萬物象前剖出精見離物別有自性　　　.
二 69:　　　　佛：如是如是　　　　　　　　　　　　　　　　.
二 70:　　　　佛：種種像殊必無見精受汝所指　　　　　　　　.
二 71:　　　　難：我實遍見此祇陀林不知是中何者非見　　　　.
二 72:　　　　佛：如是如是　　　　　　　　　　　　　　　　.
二 73:　於是非無學者茫然不知是義終始一時惶悚失其所守　　　.
二 74:　如來安慰：無上法王是真實語如所如說不誑不妄　　　　.
二 75:　　　　文殊法王子：大眾不悟如來發明　　　　　　　　.
　    　　　　　　　　　　二種精見色空是非是義　　　　　　.
二 76:　　　　　　　　　　惟願如來大慈發明　　　　　　　　.
　    　　　　　　　　　　此諸物象與此見精元是何物　　　　.
　    　　　　　　　　　　於其中間無是非是　　　　　　　　.
二 77:　十方如來及大菩薩於其自住三摩地中　　　　　　　　　.
　    　見與見緣並所想相如虛空華本無所有　　　　　　　　　.
　    　此見及緣元是菩提妙淨明體云何於中有是非是　　　　　.
二 78:　吾今問汝如汝文殊更有文殊是文殊者為無文殊　　　　　.
二 79:　　　　文殊法王子：如是世尊我真文殊無是文殊　　　　.
　    　　　　　　　　　　於中實無是非二相　　　　　　　　.
二 80:　　　　佛：此見妙明與諸空塵亦復如是　　　　　　　　.
二 81:　妄為色空及與聞見如第二月誰為是月又誰非月　　　　　.
　    　但一月真中間自無是月非月　　　　　　　　　　　　　.
二 82:　是以汝今觀見與塵種種發明名為妄想　　　　　　　　　.
　    　不能於中出是非是　　　　　　　　　　　　　　　　　.
　    　由是真精妙覺明性故能令汝出指非指　　　　　　　　　.

二 83:　[HR] 　　約外道世諦對簡顯見性非因緣自然（十之八）
二 83:　　　　難：如佛言覺緣遍十方界湛然常住性非生滅　　　.
二 84:　　　　　　與外道說有真我遍滿十方有何差別　　　　　.
二 85:　　　　　　世尊於楞伽山言　　　　　　　　　　　　　.
　    　　　　　　彼外道等常說自然我說因緣非彼境界　　　　.
　    　　　　　　我今觀此覺性自然非生非滅　　　　　　　　.
　    　　　　　　遠離一切虛妄顛倒似非因緣與彼自然　　　　.
二 86:　　　　佛：若必自然自須甄明有自然體　　　　　　　　.
　    　　　　　　汝且觀此妙明見中以何為自　　　　　　　　.
二 87:　　　　　　若明為自應不見暗　　　　　　　　　　　　.
二 88:　　　　難：必此妙見性非自然我今發明是因緣生　　　　.
二 89:　　　　佛：汝今因見見性現前　　　　　　　　　　　　.
　    　　　　　　此見為復因明有見因暗有見　　　　　　　　.
　    　　　　　　若因明有應不見暗如因暗有應不見明　　　　.
二 90:　　　　　　此見又復緣空有見緣塞有見　　　　　　　　.
　    　　　　　　若緣空有應不見塞若緣塞有應不見空　　　　.
二 91:　　　　　　當知如是精覺妙明　　　　　　　　　　　　.
　    　　　　　　非因非緣亦非自然非不自然　　　　　　　　.
　    　　　　　　無非不非無是非是　　　　　　　　　　　　.
二   　　　　　 　離一切相即一切法　　　　　　　　　　　　.
二 92:　　　　　　汝今云何於中措心　　　　　　　　　　　　.
二   　　　　　 　以諸世間戲論名相而得分別　　　　　　　　.

二 93:　[HR] 　　約二妄合明顯見性非見（十之九）
二 93:　　　　難：世尊何云見性具四種緣　　　　　　　　　　.
　    　　　　　　所謂因空因明因心因眼是義云何　　　　　　.
二 94:　　　　佛：我說世間諸因緣相非第一義　　　　　　　　.
二 95:　　　　　　如是則知二俱（明暗）名見云何不見　　　　.
二 96:　　　　　　見明暗空塞時見非是明暗空塞四義成就　　　.
　    　　　　　　見見之時見非是見見猶離見見不能及　　　　.
　    　　　　　　云何復說因緣自然及和合相　　　　　　　　.
二 98:　　　　難：佛為我等宣說因緣及與自然　　　　　　　　.
　    　　　　　　諸和合相與不和合心猶未開　　　　　　　　.
　    　　　　　　而今更聞見見非見重增迷悶　　　　　　　　.
　    　　　　　　伏願弘慈施大慧目開示我等覺心明淨　　　　.
二100:　　　　佛：一切眾生輪迴世間　　　　　　　　　　　　.
　  　　　　  　　由二顛倒分別見妄當處發生當業輪轉　　　　.
　    　　　　　　一者眾生別業妄見二者眾生同分妄見　　　　.
二101:　　別業妄見　　　　　　　　　　　　　　　　　　　　.
　    　　　　如世間人目有赤眚　　　　　　　　　　　　　　.
二105:　　　　色實在燈見病為影影見俱眚見眚非病　　　　　　.
二106:　　　　如第二月非體非影第二之觀捏所成故　　　　　　.
二108:　　同分妄見　　　　　　　　　　　　　　　　　　　　.
　    　　　　若一小洲甲乙兩國　　　　　　　　　　　　　　.
二109:　　　　甲人同感惡緣當土眾生睹諸一切不祥境界　　　　.
二110:　　　　乙人本所不見亦復不聞　　　　　　　　　　　　.
二113:　　汝今觀見山河國土及諸眾生　　　　　　　　　　　　.
二114:　　皆是無始見病所成　　　　　　　　　　　　　　　　.
　    　　　　見與見緣似現前境　　　　　　　　　　　　　　.
　    　　　　元我覺明見所緣眚覺見即眚　　　　　　　　　　.
　    　　　　本覺明心覺緣非眚　　　　　　　　　　　　　　.
二115:　　覺所覺眚覺非眚中此實見見云何復名覺聞知見　　　　.
　    　　汝今見我汝十類眾生皆即見眚非見眚者　　　　　　　.
　    　　彼見真精性非眚者故不名見　　　　　　　　　　　　.
二116:　　同分妄見例彼妄見別業一人　　　　　　　　　　　　.
二117:　　一病目人同彼一國彼見圓影眚妄所生　　　　　　　　.
　    　　此眾同分所見不祥同見業中瘴惡所起　　　　　　　　.
　    　　俱是無始見妄所生　　　　　　　　　　　　　　　　.
二118:　　諸有漏國及諸眾生同是覺明無漏妙心　　　　　　　　.
　    　　見聞覺知虛妄病緣和合妄生和合妄死　　　　　　　　.
二119:　　若能遠離諸和合緣及不和合則復滅除諸生死因　　　　.
　    　　圓滿菩提不生滅性清淨本心本覺常住　　　　　　　　.

二120:　[HR] 　　破和合不和合餘疑顯見性離過絕非法爾現證（十之十）
二120:　　　　佛：汝雖先悟本覺妙明性非因緣非自然性　　　　.
　    　　　　　　而猶未明如是覺元非和合生及不和合　　　　.
二121:　　　　　：吾今復問妙淨見精為與明暗通塞和　　　　　.
二122:　　　　　：若明和者且汝觀明當明現前何處雜見　　　　.
　    　　　　　　見相可辨雜何形像　　　　　　　　　　　　.
　    　　　　　　若非見者云何見明　　　　　　　　　　　　.
　    　　　　　　若即見者云何見見　　　　　　　　　　　　.
　    　　　　　　必見圓滿何處和明　　　　　　　　　　　　.
　    　　　　　　若明圓滿不合見和　　　　　　　　　　　　.
　    　　　　　　見必異明雜則失彼性明名字雜失明性　　　　.
　    　　　　　　和明非義　　　　　　　　　　　　　　　　.
二124:　　　　　：又汝今者妙淨見精為與明暗通塞合　　　　　.
二125:　　　　　：若明合者暗時明滅　　　　　　　　　　　　.
　    　　　　　　此見即不與諸暗合云何見暗　　　　　　　　.
　    　　　　　　若見暗時不與暗合與明合者應非見明　　　　.
　    　　　　　　既不見明云何明合了明非暗　　　　　　　　.
二126:　　　　難：此妙覺元與諸緣塵及心念慮非和合耶　　　　.
二127:　　　　佛：汝今又言覺非和合　　　　　　　　　　　　.
　    　　　　　：吾復問汝此妙見精非明暗通塞和　　　　　　.
二128:　　　　　　若非明和則見與明必有邊畔　　　　　　　　.
　    　　　　　　何處是明何處是見在見在明自何為畔　　　　.
　    　　　　　　若明際中必無見者則不相及　　　　　　　　.
　    　　　　　　自不知其明相所在畔云何成　　　　　　　　.
二130:　　　　　：又妙見精為非明暗通塞合　　　　　　　　　.
　    　　　　　　若非明合則見與明性相乖角　　　　　　　　.
　    　　　　　　如耳與明了不相觸　　　　　　　　　　　　.
　    　　　　　　見且不知明相所在云何甄明合非合理　　　　.
　    　[HR] 　就見精顯性/終

二132:　[HR] 　遍歷陰入處界會理
二132:　　一切浮塵諸幻化相當處出生隨處滅盡　　　　　　　　.
　    　　幻妄稱相其性真為妙覺明體　　　　　　　　　　　　.
二133:　　如是乃至五陰六入從十二處至十八界　　　　　　　　.
　    　　因緣和合虛妄有生因緣別離虛妄名滅　　　　　　　　.
　    　　生滅去來本如來藏常住妙明不動周圓妙真如性　　　　.
　    　　性真常中求於去來迷悟生死了無所得　　　　　　　　.

二135:　[HR] 　　明五陰即藏性
二135:　　譬如有人以清淨目觀晴明空唯一晴虛迥無所有　　　　.
　    　　　　其人無故不動目睛瞪以發勞則　　　　　　　　　.
　    　　　　於虛空別見狂華復有一切狂亂非相　　　　　　　.
　    　　　　色陰當知亦復如是　　　　　　　　　　　　　　.
二136:　　　　是諸狂華非從空來非從目出　　　　　　　　　　.
二139:　　當知色陰虛妄本非因緣非自然性　　　　　　　　　　.

二140:　　譬如有人手足宴安百骸調適　　　　　　　　　　　　.
　  　　  　　忽如忘生性無違順其人無故以二手掌　　　　　　.
　    　　　　於空相摩於二手中妄生澀滑冷熱諸相　　　　　　.
　    　　　　受陰當知亦復如是　　　　　　　　　　　　　　.
二141:　　　　是諸幻觸不從空來不從掌出　　　　　　　　　　.
二143:　　當知受陰虛妄本非因緣非自然性　　　　　　　　　　.

二144:　　譬如有人談說酢梅口中水出思蹋懸崖足心酸澀　　　　.
　    　　　　想陰當知亦復如是　　　　　　　　　　　　　　.
二145:　　　　如是酢說不從梅生非從口入　　　　　　　　　　.
二147:　　當知想陰虛妄本非因緣非自然性　　　　　　　　　　.

二148:　　譬如瀑流波浪相續前際後際不相踰越　　　　　　　　.
　    　　　　行陰當知亦復如是　　　　　　　　　　　　　　.
二149:　　　　如是流性不因空生不因水有　　　　　　　　　　.
　    　　　　亦非水性非離空水　　　　　　　　　　　　　　.
二152:　　當知行陰虛妄本非因緣非自然性　　　　　　　　　　.

二153:　　譬如有人取頻伽瓶塞其兩孔滿中擎空　　　　　　　　.
　 　　   　　千里遠行用餉他國　　　　　　　　　　　　　　.
　    　　　　識陰當知亦復如是　　　　　　　　　　　　　　.
二154:　　　　如是虛空非彼方來非此方入　　　　　　　　　　.
二157:　　當知識陰虛妄本非因緣非自然性　　　　　　　　.`);
