lines.push(
`四  1:　[HR] 明事理性相本融
四  1:　　〇　爾時富樓那彌多羅尼子在大眾中即從座起　　　　.
四  4:　　　　富：一切根塵陰處界等皆如來藏清淨本然　　　　.
　    　　　　　　云何忽生山河大地諸有為相　　　　　　　　.
　    　　　　　　　　次第遷流終而復始　　　　　　　　　　.
四  5:　　　　　：又如來說地水火風　　　　　　　　　　　　.
　    　　　　　　本性圓融周遍法界湛然常住　　　　　　　　.
　    　　　　　　復云何明水火二性俱遍虛空不相陵滅　　　　.
　    　　　　　　地性障礙空性虛通云何二俱周遍法界　　　　.
四  7:　　　　佛：如來今日普為此會宣勝義中真勝義性　　　　.
　    　　　　　　令汝會中定性聲聞及　　　　　　　　　　　.
　    　　　　　　諸一切未得二空回向上乘阿羅漢等　　　　　.
　    　　　　　　皆獲一乘寂滅場地真阿練若正修行處　　　　.
四  8:　　　　佛：如來宣說性覺妙明本覺明妙　　　　　　　　.
四  9:　　　　　　汝稱覺明為復性明稱名為覺　　　　　　　　.
　    　　　　　　　　　　為覺不明稱為明覺　　　　　　　　.
　    　　　　富：若此不明名為覺者則無所明　　　　　　　　.
四 10:　　　　佛：若無所明則無明覺　　　　　　　　　　　　.
四 10:　　　　　　有所非覺無所非明無明又非覺湛明性　　　　.
四 11:　　　　　　性覺必明妄為明覺　　　　　　　　　　　　.
四 12:　[HR] 　明眾生迷真成妄
四 12:　　覺非所明因明立所所既妄立生汝妄能　　　　　　　　.
　    　　無同異中熾然成異異彼所異因異立同　　　　　　　　.
　    　　同異發明因此復立無同無異　　　　　　　　　　　　.
四 13:　　如是擾亂相待生勞勞久發塵自相渾濁　　　　　　　　.
　    　　由是引起塵勞煩惱　　　　　　　　　　　　　　　　.
　    　　起為世界靜成虛空虛空為同世界為異　　　　　　　　.
　    　　彼無同異真有為法　　　　　　　　　　　　　　　　.
四 14:　[HR] 　　明世界相續
四 14:　　覺明空昧相待成搖故有風輪執持世界　　　　　　　　.
　    　　因空生搖堅明立礙彼金寶者明覺立堅　　　　　　　　.
　    　　　　故有金輪保持國土　　　　　　　　　　　　　　.
　    　　堅覺寶成搖明風出風金相摩　　　　　　　　　　　　.
　    　　　　故有火光為變化性　　　　　　　　　　　　　　.
　    　　寶明生潤火光上蒸　　　　　　　　　　　　　　　　.
　    　　　　故有水輪含十方界　　　　　　　　　　　　　　.
四 15:　　火騰水降交發立堅濕為巨海乾為洲潬　　　　　　　　.
　    　　以是義故彼大海中火光常起彼洲潬中江河常注　　　　.
　    　　水勢劣火結為高山是故山石擊則成焰融則成水　　　　.
　    　　土勢劣水抽為草木是故林藪遇燒成土因絞成水　　　　.
四 16:　　交妄發生遞相為種以是因緣世界相續　　　　　　　　.
四 17:　[HR] 　　明眾生相續
四 17:　　明妄非他覺明為咎所妄既立明理不踰　　　　　　　　.
　    　　　　以是因緣聽不出聲見不超色　　　　　　　　　　.
　    　　色香味觸六妄成就由是分開見覺聞知　　　　　　　　.
四 18:　　同業相纏合離成化見明色發明見想成　　　　　　　　.
　    　　異見成憎同想成愛流愛為種納想為胎　　　　　　　　.
　    　　　　交遘發生吸引同業　　　　　　　　　　　　　　.
　    　　故有因緣生羯羅藍遏蒲曇等胎卵濕化隨其所應　　　　.
　    　　　　　　卵唯想生胎因情有濕以合感化以離應　　　　.
四 19:　　情想合離更相變易所有受業逐其飛沈　　　　　　　　.
　    　　　　以是因緣眾生相續　　　　　　　　　　　　　　.
四 20:　[HR] 　　明業果相續
四 20:　　想愛同結愛不能離則諸世間父母子孫相生不斷　　　　.
　    　　　　是等則以欲貪為本　　　　　　　　　　　　　　.
四 21:　　貪愛同滋貪不能止　　　　　　　　　　　　　　　　.
　    　　則諸世間卵化濕胎隨力強弱遞相吞食　　　　　　　　.
　    　　　　是等則以殺貪為本　　　　　　　　　　　　　　.
四 22:　　十生之類死死生生互來相噉惡業俱生窮未來際　　　　.
　    　　　　是等則以盜貪為本　　　　　　　　　　　　　　.
四 23:　　汝負我命我還汝債以是因緣經百千劫常在生死　　　　.
　    　　汝愛我心我憐汝色以是因緣經百千劫常在纏縛　　　　.
四 24:　　唯殺盜婬三為根本以是因緣業果相續　　　　　　　　.
四 25:　　如是三種顛倒相續皆是覺明明瞭知性因了發相　　　　.
　    　　從妄見生山河大地諸有為相次第遷流　　　　　　　　.
　    　　因此虛妄終而復始　　　　　　　　　　　　　　　　.
四 26:　　　　富：若此妙覺本妙覺明與如來心不增不減　　　　.
　    　　　　　　無狀忽生山河大地諸有為相　　　　　　　　.
　    　　　　　　如來今得妙空明覺　　　　　　　　　　　　.
　    　　　　　　山河大地有為習漏何當復生　　　　　　　　.
四 27:　　　　佛：譬如迷人於一聚落惑南為北　　　　　　　　.
　    　　　　　　此迷為復因迷而有因悟所出　　　　　　　　.
　    　　　　富：如是迷人亦不因迷又不因悟何以故　　　　　.
　    　　　　　　迷本無根云何因迷　　　　　　　　　　　　.
　    　　　　　　悟非生迷云何因悟　　　　　　　　　　　　.
四 28:　　　　佛：彼之迷人正在迷時焂有悟人指示令悟　　　　.
　    　　　　　　於意云何此人縱迷於此聚落更生迷不　　　　.
　    　　　　富：不也世尊　　　　　　　　　　　　　　　　.
四 29:　　　　佛：十方如來亦復如是此迷無本性畢竟空　　　　.
　    　　　　　　昔本無迷似有迷覺覺迷迷滅覺不生迷　　　　.
四 30:　　　　　：亦如翳人見空中華翳病若除華於空滅　　　　.
四 31:　　　　　　忽有愚人於彼空華所滅空地待華更生　　　　.
　    　　　　　　汝觀是人為愚為慧　　　　　　　　　　　　.
　    　　　　富：空元無華妄見生滅見華滅空已是顛倒　　　　.
　    　　　　　　敕令更出斯實狂癡　　　　　　　　　　　　.
　    　　　　　　云何更名如是狂人為愚為慧　　　　　　　　.
四 32:　　　　佛：如汝所解云何問言　　　　　　　　　　　　.
　    　　　　　　諸佛如來妙覺明空何當更出山河大地　　　　.
　    　[HR] 　明眾生迷真成妄/終


四 34:　[HR] 　答相隨性得以釋相違性難
四 34:　　　　　：又汝問言地水火風本性圓融周遍法界　　　　.
　    　　　　　　疑水火性不相陵滅　　　　　　　　　　　　.
　    　　　　　　又徵虛空及諸大地俱遍法界不合相容　　　　.
四 37:　　　　　：觀相元妄無可指陳猶邀空華結為空果　　　　.
　    　　　　　　云何詰其相陵滅義　　　　　　　　　　　　.
　    　　　　　　觀性元真唯妙覺明妙覺明心先非水火　　　　.
　    　　　　　　云何復問不相容者真妙覺明亦復如是　　　　.
四 38:　　　　　：汝以空明則有空現　　　　　　　　　　　　.
　    　　　　　　地水火風各各發明則各各現　　　　　　　　.
　    　　　　　　若俱發明則有俱現　　　　　　　　　　　　.
四 40:　　　　　：汝以色空相傾相奪於如來藏　　　　　　　　.
　    　　　　　　而如來藏隨為色空周遍法界　　　　　　　　.
　    　　　　　　是故於中風動空澄日明雲暗　　　　　　　　.
　    　　　　　　眾生迷悶背覺合塵故發塵勞有世間相　　　　.
四 41:　　　　　　而如來藏唯妙覺明圓照法界　　　　　　　　.
四 42:　　　　　　而如來藏本妙圓心以是俱非世出世故　　　　.
四 43:　　　　　　即如來藏元明心妙以是俱即世出世故　　　　.
四 44:　　　　　　即如來藏妙明心元離即離非是即非即　　　　.
四 45:　　　　　　如何世間三有眾生及出世間聲聞緣覺　　　　.
　    　　　　　　以所知心測度如來無上菩提　　　　　　　　.
　    　　　　　　用世語言入佛知見　　　　　　　　　　　　.
　    　　　　　　寶覺真心各各圓滿如我按指海印發光　　　　.
　    　　　　　　汝暫舉心塵勞先起由不勤求無上覺道　　　　.
　    　　　　　　愛念小乘得少為足　　　　　　　　　　　　.
　    　[HR] 　答相隨性得以釋相違性難/終
　    　[HR] 明事理性相本融/終

四 46:　[HR] 明迷悟因緣無性，答滿慈重徵妄因
四 46:　　　　富：一切眾生何因有妄自蔽妙明受此淪溺　　　　.
四 47:　　　　佛：汝雖除疑餘惑未盡　　　　　　　　　　　　.
　    　　　　　　吾以世間現前諸事今復問汝　　　　　　　　.
四 48:　　　　　　室羅城中演若達多　　　　　　　　　　　　.
　    　　　　　　忽於晨朝以鏡照面愛鏡中頭眉目可見　　　　.
　    　　　　　　瞋責己頭不見面目以為魑魅無狀狂走　　　　.
　    　　　　　　於意云何此人何因無故狂走　　　　　　　　.
　    　　　　富：是人心狂更無他故　　　　　　　　　　　　.
四 49:　　　　佛：妙覺明圓本圓明妙既稱為妄云何有因　　　　.
　    　　　　　　若有所因云何名妄　　　　　　　　　　　　.
四 50:　　　　　　自諸妄想展轉相因從迷積迷以歷塵劫　　　　.
　    　　　　　　雖佛發明猶不能返　　　　　　　　　　　　.
四 51:　　　　　：如是迷因因迷自有識迷無因妄無所依　　　　.
　    　　　　　　尚無有生欲何為滅　　　　　　　　　　　　.
四 52:　　　　　：得菩提者如寤時人說夢中事　　　　　　　　.
　    　　　　　　心縱精明欲何因緣取夢中物　　　　　　　　.
　    　　　　　　況復無因本無所有　　　　　　　　　　　　.
四 53:　　　　　：汝但不隨分別世間業果眾生三種相續　　　　.
　    　　　　　　三緣斷故三因不生　　　　　　　　　　　　.
　    　　　　　　則汝心中演若達多狂性自歇歇即菩提　　　　.
　    　　　　　　勝淨明心本周法界　　　　　　　　　　　　.
　    　　　　　　不從人得何藉劬勞肯綮修證　　　　　　　　.

四 54:　[HR] 明迷悟因緣無性，答阿難再執妄緣
四 54:　　〇　即時阿難在大眾中頂禮佛足起立白佛　　　　　　.
四 55:　　　　難：殺盜婬業三緣斷故三因不生　　　　　　　　.
　    　　　　　　心中達多狂性自歇歇即菩提不從人得　　　　.
　    　　　　　　斯則因緣皎然明白云何如來頓棄因緣　　　　.
四 57:　　　　佛：即如城中演若達多狂性因緣　　　　　　　　.
　    　　　　　　若得除滅則不狂性自然而出　　　　　　　　.
　    　　　　　　因緣自然理窮於是　　　　　　　　　　　　.
四 58:　　　　　：演若達多頭本自然本自其然無然非自　　　　.
　    　　　　　　何因緣故怖頭狂走　　　　　　　　　　　　.
四 59:　　　　　：若自然頭因緣故狂何不自然因緣故失　　　　.
　    　　　　　　本頭不失狂怖妄出曾無變易何藉因緣　　　　.
四 60:　　　　　：本狂自然本有狂怖未狂之際狂何所潛　　　　.
四 61:　　　　　　不狂自然頭本無妄何為狂走　　　　　　　　.
四 62:　　　　　：若悟本頭識知狂走因緣自然俱為戲論　　　　.
　    　　　　　　是故我言三緣斷故即菩提心　　　　　　　　.
四 63:　　菩提心生生滅心滅此但生滅　　　　　　　　　　　　.
　    　　滅生俱盡無功用道　　　　　　　　　　　　　　　　.
　    　　若有自然如是則明自然心生生滅心滅此亦生滅　　　　.
　    　　無生滅者名為自然　　　　　　　　　　　　　　　　.
　    　　猶如世間諸相雜和成一體者名和合性　　　　　　　　.
　    　　非和合者稱本然性　　　　　　　　　　　　　　　　.
　    　　本然非然和合非合合然俱離離合俱非　　　　　　　　.
　    　　此句方名無戲論法　　　　　　　　　　　　　　　　.
四 64:　　菩提涅槃尚在遙遠非汝歷劫辛勤修證　　　　　　　　.
　    　　雖復憶持十方如來十二部經　　　　　　　　　　　　.
　    　　清淨妙理如恒河沙祇益戲論　　　　　　　　　　　　.
四 66:　　　　　：歷劫憶持如來秘密妙嚴　　　　　　　　　　.
　　    　　　　　不如一日修無漏業遠離世間憎愛二苦　　　　.
四 67:　　　　　：如摩登伽宿為婬女由神咒力銷其愛欲　　　　.
　　    　　　　　法中今名性比丘尼　　　　　　　　　　　　.

四 68:　[HR] 示不生滅為本修因妙三觀門
四 68:　　〇　阿難大眾聞佛示誨疑惑銷除心悟實相　　　　　　.
　　    　　　身意輕安得未曾有　　　　　　　　　　　　　　.
四 71:　　　　難：惟願如來慈示我等　　　　　　　　　　　　.
　　    　　　　　捐捨小乘畢獲如來無餘涅槃本發心路　　　　.
　　    　　　　　令有學者從何攝伏疇昔攀緣　　　　　　　　.
　　    　　　　　得陀羅尼入佛知見　　　　　　　　　　　　.
四 72:　　　　難：汝等決定發菩提心於佛如來妙三摩提　　　　.
　　    　　　　　不生疲倦應當先明發覺初心二決定義　　　　.
四 73:　　第一義者汝等若欲捐捨聲聞修菩薩乘入佛知見　　　　.
　　    　　　　　應當審觀因地發心與果地覺為同為異　　　　.
四 74:　　　　佛：若於因地以生滅心為本修因　　　　　　　　.
　　    　　　　　而求佛乘不生不滅無有是處　　　　　　　　.
四 75:　　　　　　汝當照明諸器世間可作之法皆從變滅　　　　.
　　    　　　　　汝觀世間可作之法誰為不壞　　　　　　　　.
　　    　　　　　然終不聞爛壞虛空何以故　　　　　　　　　.
　　    　　　　　空非可作由是始終無壞滅故　　　　　　　　.
四 76:　　　　　：則汝身中　　　　　　　　　　　　　　　　.
　　    　　　　　堅相為地潤濕為水暖觸為火動搖為風　　　　.
　　  　　　　　　由此四纏　　　　　　　　　　　　　　　　.
　　    　　　　　分汝湛圓妙覺明心為視為聽為覺為察　　　　.
四 77:　　　　　　從始入終五疊渾濁云何為濁　　　　　　　　.
　　  　　　　　：取彼土塵投於淨水土失留礙水亡清潔　　　　.
　　  　　　　　　容貌汩然名之為濁汝濁五重亦復如是　　　　.
四 78:　　汝見虛空遍十方界空見不分　　　　　　　　　　　　.
　　  　　有空無體有見無覺相織妄成　　　　　　　　　　　　.
　　  　　　　是第一重名為劫濁　　　　　　　　　　　　　　.
四 79:　　汝身現摶四大為體見聞覺知壅令留礙　　　　　　　　.
　　  　　水火風土旋令覺知相織妄成　　　　　　　　　　　　.
　　  　　　　是第二重名為見濁　　　　　　　　　　　　　　.
四 80:　　又汝心中憶識誦習性發知見　　　　　　　　　　　　.
　　  　　容現六塵離塵無相離覺無性相織妄成　　　　　　　　.
　　  　　　　是第三重名煩惱濁　　　　　　　　　　　　　　.
四 81:　　又汝朝夕生滅不停知見每欲留於世間　　　　　　　　.
　　  　　業運每常遷於國土相織妄成　　　　　　　　　　　　.
　　  　　　　是第四重名眾生濁　　　　　　　　　　　　　　.
四 82:　　汝等見聞元無異性眾塵隔越無狀異生　　　　　　　　.
　　  　　性中相知用中相背同異失準相織妄成　　　　　　　　.
　　  　　　　是第五重名為命濁　　　　　　　　　　　　　　.
四 83:　　　　　：汝今欲令見聞覺知遠契如來常樂我淨　　　　.
　　  　　　　　　應當先擇死生根本依不生滅圓湛性成　　　　.
　　  　　　　　　以湛旋其虛妄滅生伏還元覺　　　　　　　　.
　　  　　　　　　得元明覺無生滅性為因地心　　　　　　　　.
　　  　　　　　　然後圓成果地修證　　　　　　　　　　　　.
四 84:　　　　　　如澄濁水貯於靜器靜深不動　　　　　　　　.
　　  　　　　　　沙土自沈清水現前　　　　　　　　　　　　.
　　  　　　　　　名為初伏客塵煩惱　　　　　　　　　　　　.
　　  　　　　　　去泥純水名為永斷根本無明　　　　　　　　.
　　  　　　　　　明相精純一切變現不為煩惱　　　　　　　　.
　　  　　　　　　皆合涅槃清淨妙德　　　　　　　　　　　　.
四 85:　　第二義者汝等必欲發菩提心於菩薩乘生大勇猛　　　　.
　　    　　　　　決定棄捐諸有為相應當審詳煩惱根本　　　　.
　　    　　　　　此無始來發業潤生誰作誰受　　　　　　　　.
四 86:　　　　　：汝修菩提若不審觀煩惱根本　　　　　　　　.
　　    　　　　　則不能知虛妄根塵何處顛倒　　　　　　　　.
　　    　　　　　處尚不知云何降伏取如來位　　　　　　　　.
四 87:　　　　　：則汝現前眼耳鼻舌及與身心　　　　　　　　.
　　    　　　　　六為賊媒自劫家寶　　　　　　　　　　　　.
　　    　　　　　由此無始眾生世界生纏縛故　　　　　　　　.
　　    　　　　　於器世間不能超越　　　　　　　　　　　　.
四 90:　　　　　：六根之中各各功德有千二百　　　　　　　　.
四 91:　　　　　　阿難汝復於中克定優劣　　　　　　　　　　.
四 92:　　如眼觀見後暗前明前方全明後方全暗　　　　　　　　.
　　    　　　左右旁觀三分之二　　　　　　　　　　　　　　.
　　    　　　統論所作功德不全三分言功一分無德　　　　　　.
　　    　　　當知眼唯八百功德　　　　　　　　　　　　　　.
四 93:　　如耳周聽十方無遺動若邇遙靜無邊際　　　　　　　　.
　　    　　　當知耳根圓滿一千二百功德　　　　　　　　　　.
四 94:　　如鼻嗅聞通出入息有出有入　　　　　　　　　　　　.
　　    　　　而闕中交驗於鼻根三分闕一　　　　　　　　　　.
　　    　　　當知鼻唯八百功德　　　　　　　　　　　　　　.
四 95:　　如舌宣揚盡諸世間出世間智言有方分理無窮盡　　　　.
　　    　　　當知舌根圓滿一千二百功德　　　　　　　　　　.
四 96:　　如身覺觸識於違順合時能覺　　　　　　　　　　　　.
　　    　　　離中不知離一合雙驗於身根三分闕一　　　　　　.
　　    　　　當知身唯八百功德　　　　　　　　　　　　　　.
四 97:　　如意默容十方三世一切世間出世間法　　　　　　　　.
　　    　　　唯聖與凡無不包容盡其涯際　　　　　　　　　　.
　　    　　　當知意根圓滿一千二百功德　　　　　　　　　　.
四 98:　　　　　：汝今欲逆生死欲流返窮流根至不生滅　　　　.
　　    　　　　　當驗此等六受用根　　　　　　　　　　　　.
　　    　　　　　誰合誰離誰深誰淺誰為圓通誰不圓滿　　　　.
　　    　　　　　若能於此悟圓通根逆彼無始織妄業流　　　　.
　　    　　　　　得循圓通與不圓根日劫相倍　　　　　　　　.
四 99:　　　　　：我今備顯六湛圓明本所功德數量如是　　　　.
　　    　　　　　隨汝詳擇其可入者吾當發明令汝增進　　　　.
　　    　　　　　十方如來於十八界一一修行　　　　　　　　.
　　    　　　　　皆得圓滿無上菩提於其中間亦無優劣　　　　.
　　    　　　　　但汝下劣未能於中圓自在慧　　　　　　　　.
　　    　　　　　故我宣揚令汝但於一門深入　　　　　　　　.
　　    　　　　　入一無妄彼六知根一時清淨　　　　　　　　.
四100:　　　　難：云何逆流深入一門能令六根一時清淨　　　　.
四101:　　　　佛：汝今已得須陀洹果已滅世間見所斷惑　　　　.
　　    　　　　　未知根中積生無始虛習要因修所斷得　　　　.
　　    　　　　　何況此中生住異滅分劑頭數　　　　　　　　.
　    　　　　　　今汝且觀現前六根為一為六　　　　　　　　.
　　    　　　　　阿難若言一者，耳何不見目何不聞　　　　　.
　　    　　　　　頭奚不履足奚無語　　　　　　　　　　　　.
　　    　　　　　若此六根決定成六如我今會與汝宣揚　　　　.
　　    　　　　　微妙法門汝之六根誰來領受　　　　　　　　.
　    　　　　難：我用耳聞　　　　　　　　　　　　　　　　.
　    　　　　佛：汝耳自聞何關身口口來問義身起欽承　　　　.
　　    　　　　　是故應知非一終六非六終一　　　　　　　　.
　　    　　　　　　　　　終不汝根元一元六　　　　　　　　.
四103:　　　　　　是根非一非六由無始來顛倒淪替　　　　　　.
　　    　　　　　故於圓湛一六義生　　　　　　　　　　　　.
　　    　　　　　汝須陀洹雖得六銷猶未亡一　　　　　　　　.
四104:　　　　　：如太虛空參合群器由器形異名之異空　　　　.
　　    　　　　　除器觀空說空為一　　　　　　　　　　　　.
　　    　　　　　彼太虛空云何為汝成同不同　　　　　　　　.
　　    　　　　　何況更名是一非一　　　　　　　　　　　　.
四105:　　　　　　則汝了知六受用根亦復如是　　　　　　　　.
四106:　　由明暗等二種相形於妙圓中黏湛發見　　　　　　　　.
　　    　見精映色結色成根根元目為清淨四大　　　　　　　　.
　　    　因名眼體如葡萄朵浮根四塵流逸奔色　　　　　　　　.
四107:　　由動靜等二種相擊於妙圓中黏湛發聽　　　　　　　　.
　　    　聽精映聲卷聲成根根元目為清淨四大　　　　　　　　.
　　    　因名耳體如新卷葉浮根四塵流逸奔聲　　　　　　　　.
四108:　　由通塞等二種相發於妙圓中黏湛發嗅　　　　　　　　.
　　    　嗅精映香納香成根根元目為清淨四大　　　　　　　　.
　　    　因名鼻體如雙垂爪浮根四塵流逸奔香　　　　　　　　.
四109:　　由恬變等二種相參於妙圓中黏湛發嘗　　　　　　　　.
　　    　嘗精映味絞味成根根元目為清淨四大　　　　　　　　.
　　    　因名舌體如初偃月浮根四塵流逸奔味　　　　　　　　.
四110:　　由離合等二種相摩於妙圓中黏湛發覺　　　　　　　　.
　　    　覺精映觸摶觸成根根元目為清淨四大　　　　　　　　.
　　    　因名身如體腰鼓顙浮根四塵流逸奔觸　　　　　　　　.
四111:　　由生滅等二種相續於妙圓中黏湛發知　　　　　　　　.
　　    　知精映法攬法成根根元目為清淨四大　　　　　　　　.
　　    　因名意思如幽室見浮根四塵流逸奔法　　　　　　　　.
四112:　　　　　：如是六根由彼覺明　　　　　　　　　　　　.
　    　　　　　　有明明覺失彼精了黏妄發光　　　　　　　　.
　    　　　　　　是以汝今離暗離明無有見體　　　　　　　　.
　    　　　　　　　　　　離動離靜元無聽質　　　　　　　　.
　    　　　　　　　　　　無通無塞嗅性不生　　　　　　　　.
　    　　　　　　　　　　非變非恬嘗無所出　　　　　　　　.
　    　　　　　　　　　　不離不合覺觸本無　　　　　　　　.
　    　　　　　　　　　　無滅無生了知安寄　　　　　　　　.
四113:　　　　　：汝但不循動靜合離恬變通塞生滅明暗　　　　.
　    　　　　　　如是十二諸有為相　　　　　　　　　　　　.
　    　　　　　　隨拔一根脫黏內伏伏歸元真發本明耀　　　　.
　    　　　　　　耀性發明諸餘五黏應拔圓脫　　　　　　　　.
　    　　　　　　不由前塵所起知見　　　　　　　　　　　　.
四114:　　　　　　明不循根寄根明發由是六根互相為用　　　　.
四116:　　　　　：今汝諸根若圓拔已內瑩發光　　　　　　　　.
　    　　　　　　如是浮塵及器世間諸變化相　　　　　　　　.
　    　　　　　　如湯銷冰應念化成無上知覺　　　　　　　　.
四117:　　　　　：如彼世人聚見於眼若令急合暗相現前　　　　.
　    　　　　　　六根黯然頭足相類彼人以手循體外繞　　　　.
　    　　　　　　彼雖不見頭足一辨知覺是同　　　　　　　　.
　    　　　　　　緣見因明暗成無見不明自發　　　　　　　　.
　    　　　　　　則諸暗相永不能昏根塵既銷　　　　　　　　.
　    　　　　　　云何覺明不成圓妙　　　　　　　　　　　　.

四118:　[HR] 明因果俱常決通初疑
四118:　　　　難：如佛說言　　　　　　　　　　　　　　　　.
　    　　　　　　因地覺心欲求常住要與果位名目相應　　　　.
　    　　　　　　如果位中菩提涅槃真如佛性菴摩羅識　　　　.
　    　　　　　　　　　　空如來藏大圓鏡智　　　　　　　　.
　    　　　　　　是七種名稱謂雖別清淨圓滿體性堅凝　　　　.
　    　　　　　　如金剛王常住不壞　　　　　　　　　　　　.
　    　　　　　　若此見聽離於明暗動靜通塞畢竟無體　　　　.
　    　　　　　　猶如念心離於前塵本無所有　　　　　　　　.
　    　　　　　　云何將此畢竟斷滅以為修因　　　　　　　　.
　    　　　　　　　　欲獲如來七常住果　　　　　　　　　　.
四119:　　　　　：若離明暗見畢竟空如無前塵念自性滅　　　　.
　    　　　　　　進退循環微細推求本無我心及我心所　　　　.
　    　　　　　　將誰立因求無上覺　　　　　　　　　　　　.
　    　　　　　：如來先說湛精圓常違越誠言終成戲論　　　　.
　    　　　　　　云何如來真實語者　　　　　　　　　　　　.
四121:　　　　佛：汝學多聞未盡諸漏心中徒知顛倒所因　　　　.
　    　　　　　　真倒現前實未能識恐汝誠心猶未信伏　　　　.
　    　　　　　：吾今試將塵俗諸事當除汝疑　　　　　　　　.
四122:　　〇　如來敕羅侯羅擊鐘以示其理　　　　　　　　　　.
四126:　　　　佛：汝今云何自語矯亂　　　　　　　　　　　　.
四126:　　〇　大眾阿難俱時問佛我今云何名為矯亂　　　　　　.
四126:　　　　佛：我問汝聞汝則言聞又問汝聲汝則言聲　　　　.
　    　　　　　　唯聞與聲報答無定如是云何不名矯亂　　　　.
四127:　　　　　：聲銷無響汝說無聞　　　　　　　　　　　　.
　    　　　　　　若實無聞聞性已滅同於枯木　　　　　　　　.
　    　　　　　　鐘聲更擊汝云何知　　　　　　　　　　　　.
　    　　　　　　知有知無自是聲塵　　　　　　　　　　　　.
　    　　　　　　或無或有豈彼聞性　　　　　　　　　　　　.
　    　　　　　　為汝有無聞實云無誰知無者　　　　　　　　.
四132:　　　　　：以諸眾生從無始來循諸色聲逐念流轉　　　　.
　    　　　　　　曾不開悟性淨妙常　　　　　　　　　　　　.
　    　　　　　　不循所常逐諸生滅由是生生雜染流轉　　　　.
四133:　　　　　：若棄生滅守於真常常光現前　　　　　　　　.
　    　　　　　　根塵識心應時銷落　　　　　　　　　　　　.
　    　　　　　　想相為塵識情為垢　　　　　　　　　　　　.
　    　　　　　　二俱遠離則汝法眼應時清明　　　　　　　　.
　    　　　　　　云何不成無上知覺　　　　　　　　　　.`);
