lines.push(
`五  1:　[HR] 明結解無二決通次義
五  1:　　　　難：如來雖說第二義門　　　　　　　　　　　　.
　    　　　　　　今觀世間解結之人若不知其所結之元　　　　.
　    　　　　　　我信是人終不能解　　　　　　　　　　　　.
五  2:　　　　　　我及會中有學聲聞亦復如是　　　　　　　　.
　    　　　　　　從無始際與諸無明俱滅俱生　　　　　　　　.
　    　　　　　　雖得如是多聞善根名為出家猶隔日瘧　　　　.
　    　　　　　　惟願大慈哀愍淪溺今日身心　　　　　　　　.
　    　　　　　　云何是結從何名解　　　　　　　　　　　　.
　    　　　　　　亦令未來苦難眾生得免輪迴不落三有　　　　.
五  4:　　〇　爾時世尊憐愍阿難及諸會中諸有學者　　　　　　.
　    　　　　亦為未來一切眾生為出世因作將來眼　　　　　　.
　    　　　　以閻浮檀紫金光手摩阿難頂　　　　　　　　　　.
五  5:　　〇　即時十方普佛世界六種震動　　　　　　　　　　.
　    　　　　微塵如來住世界者各有寶光從其頂出　　　　　　.
　    　　　　其光同時於彼世界來祇陀林灌如來頂　　　　　　.
五  6:　　十方微塵如來異口同音告阿難言善哉阿難　　　　　　.
　    　　汝欲識知俱生無明使汝輪轉生死結根　　　　　　　　.
　    　　唯汝六根更無他物　　　　　　　　　　　　　　　　.
　    　　汝復欲知無上菩提令汝速證安樂解脫寂靜妙常　　　　.
　    　　亦汝六根更非他物　　　　　　　　　　　　　　　　.
五  7:　　　　難：云何令我生死輪迴安樂妙常　　　　　　　　.
　    　　　　　　同是六根更非他物　　　　　　　　　　　　.
五  8:　　　　佛：根塵同源縛脫無二識性虛妄猶如空華　　　　.
　    　　　　　　由塵發知因根有相相見無性同於交蘆　　　　.
　    　　　　　　是故汝今知見立知即無明本　　　　　　　　.
　    　　　　　　知見無見斯即涅槃無漏真淨　　　　　　　　.
　    　　　　　　云何是中更容他物　　　　　　　　　　　　.
五  9:　　〇　爾時世尊欲重宣此義而說偈言　　　　　　　　　.
　    　　　　　　真性有為空　緣生故如幻　　　　　　　　　.
　    　　　　　　無為無起滅　不實如空華　　　　　　　　　.
　    　　　　　　言妄顯諸真　妄真同二妄　　　　　　　　　.
五 10:　　　　　　猶非真非真　云何見所見　　　　　　　　　.
　    　　　　　　中間無實性　是故若交蘆　　　　　　　　　.
　    　　　　　　結解同所因　聖凡無二路　　　　　　　　　.
五 11:　　　　　　汝觀交中性　空有二俱非　　　　　　　　　.
　    　　　　　　迷晦即無明　發明便解脫　　　　　　　　　.
五 12:　　　　　　解結因次第　六解一亦亡　　　　　　　　　.
　    　　　　　　根選擇圓通　入流成正覺　　　　　　　　　.
五 13:　　　　　　陀那微細識　習氣成瀑流　　　　　　　　　.
　    　　　　　　真非真恐迷　我常不開演　　　　　　　　　.
五 14:　　　　　　自心取自心　非幻成幻法　　　　　　　　　.
　    　　　　　　不取無非幻　非幻尚不生　　　　　　　　　.
　    　　　　　　幻法云何立　是名妙蓮華　　　　　　　　　.
　    　　　　　　金剛王寶覺　如幻三摩提　彈指超無學　　　.
五 15:　　　　　　此阿毗達磨　十方薄伽梵　一路涅槃門　　　.
五 17:　　　　難：云何令我生死輪迴安樂妙常真實法句　　　　.
　    　　　　　　心猶未達六解一亡舒結倫次　　　　　　　　.
　    　　　　　　惟垂大慈再愍斯會及與將來　　　　　　　　.
　    　　　　　　施以法音洗滌沈垢　　　　　　　　　　　　.
五 18:　　〇　即時如來取劫波羅天所奉華巾　　　　　　　　　.
五 19:　　　　綰成一結示阿難言此名何等難眾言結　　　　　　.
　    　　　　如是倫次總綰六結　　　　　　　　　　　　　　.
五 21:　　　　佛：此寶華巾汝知此巾元止一條　　　　　　　　.
　    　　　　　　我六綰時名有六結　　　　　　　　　　　　.
　    　　　　　　汝審觀察巾體是同因結有異於意云何　　　　.
　   　　 　　　　初綰結成名為第一如是乃至第六結生　　　　.
　   　　 　　　　吾今欲將第六結名成第一不　　　　　　　　.
　    　　　　難：不也世尊六結若存斯第六名終非第一　　　　.
　   　　 　　　　縱我歷生盡其明辯如何令是六結亂名　　　　.
　    　　　　佛：如是六結不同循顧本因一巾所造　　　　　　.
　   　　 　　　　令其雜亂終不得成　　　　　　　　　　　　.
　   　　 　　　　則汝六根亦復如是畢竟同中生畢竟異　　　　.
五 22:　　　　　：汝必嫌此六結不成願樂一成復云何得　　　　.
　    　　　　難：此結若存是非鋒起於中自生　　　　　　　　.
　   　　 　　　　此結非彼彼結非此　　　　　　　　　　　　.
　   　　 　　　　如來今日若總解除結若不生則無彼此　　　　.
　   　　 　　　　尚不名一六云何成　　　　　　　　　　　　.
　    　　　　佛：六解一亡亦復如是　　　　　　　　　　　　.
五 23:　　　　　　由汝無始心性狂亂知見妄發　　　　　　　　.
五 24:　　　　　　發妄不息勞見發塵　　　　　　　　　　　　.
　   　　 　　　　如勞目睛則有狂華於湛精明無因亂起　　　　.
　   　　 　　　　一切世間山河大地生死涅槃　　　　　　　　.
　   　　 　　　　皆即狂勞顛倒華相　　　　　　　　　　　　.
五 25:　　　　難：此勞同結云何解除　　　　　　　　　　　　.
五 26:　　　　佛：吾今以手左右各牽竟不能解　　　　　　　　.
　   　　 　　　　汝設方便云何解成　　　　　　　　　　　　.
　    　　　　難：當於結心解即分散　　　　　　　　　　　　.
　    　　　　佛：如是如是若欲除結當於結心　　　　　　　　.
五 27:　　　　　：我說佛法從因緣生非取世間和合粗相　　　　.
　   　　 　　　　如來發明世出世法知其本因隨所緣出　　　　.
　   　　 　　　　如是乃至恒沙界外一滴之雨亦知頭數　　　　.
　   　　 　　　　現前種種松直棘曲鵠白烏玄皆了元由　　　　.
五 28:　　　　　：隨汝心中選擇六根根結若除塵相自滅　　　　.
　   　　 　　　　諸妄銷亡不真何待　　　　　　　　　　　　.
五 29:　　　　　：吾今問汝此劫波羅巾　　　　　　　　　　　.
　   　　 　　　　六結現前同時解縈得同除不　　　　　　　　.
　    　　　　難：不也世尊　　　　　　　　　　　　　　　　.
　   　　 　　　　是結本以次第綰生今日當須次第而解　　　　.
　   　　 　　　　六結同體結不同時則結解時云何同除　　　　.
五 30:　　　　佛：六根解除亦復如是　　　　　　　　　　　　.
　   　　 　　　　此根初解先得人空空性圓明　　　　　　　　.
　   　　 　　　　成法解脫解脫法已俱空不生　　　　　　　　.
　   　　 　　　　是名菩薩從三摩地得無生忍　　　　　　　　.

五 31:　[HR] 別顯修證
五 31:　　〇　阿難及諸大眾蒙佛開示慧覺圓通得無疑惑　　　　.
五 32:　　　　難：我等今日身心皎然快得無礙　　　　　　　　.
　   　　 　　　　雖復悟知一六亡義然猶未達圓通本根　　　　.
五 33:　　　　　　我輩飄零積劫孤露何心何慮預佛天倫　　　　.
　   　　 　　　　若復因此際會道成所得密言還同本悟　　　　.
　   　　 　　　　則與未聞無有差別　　　　　　　　　　　　.
五 34:　　　　　　惟垂大悲惠我秘嚴成就如來最後開示　　　　.
五 35:　　〇　爾時世尊普告眾中　　　　　　　　　　　　　　.
　   　　 　　諸大菩薩及諸漏盡大阿羅漢　　　　　　　　　　.
　   　　 　　汝等菩薩及阿羅漢生我法中得成無學　　　　　　.
　   　　 　　吾今問汝最初發心悟十八界誰為圓通　　　　　　.
　   　　 　　從何方便入三摩地　　　　　　　　　　　　　　.
五 36:　[HR] 　觀六塵
五 55:　[HR] 　觀五根
五 70:　[HR] 　觀六識
五 93:　[HR] 　觀七大`);
