lines.push(
`六  1:　[HR] 　觀耳根
六  1:　　〇　爾時觀世音菩薩頂禮佛足而白佛言　　　　　　　.
六  2:　　我昔無數恒沙劫時有佛出世名觀世音　　　　　　　　.
　    　　我於彼佛發菩提心彼佛教我從聞思修入三摩地　　　　.
六  3:　[HR] 　　依教修證
六  3:　　初於聞中入流亡所　　　　　　　　　　　　　　　　.
　    　　所入既寂動靜二相了然不生　　　　　　　　　　　　.
　    　　如是漸增聞所聞盡　　　　　　　　　　　　　　　　.
六  4:　　盡聞不住覺所覺空　　　　　　　　　　　　　　　　.
　    　　空覺極圓空所空滅　　　　　　　　　　　　　　　　.
　    　　生滅既滅寂滅現前　　　　　　　　　　　　　　　　.
六  5:　　忽然超越世出世間十方圓明　　　　　　　　　　　　.
　    　　獲二殊勝　　　　　　　　　　　　　　　　　　　　.
　    　　一者上合十方諸佛本妙覺心與佛如來同一慈力　　　　.
　    　　二者下合十方一切六道眾生與諸眾生同一悲仰　　　　.
六  6:　[HR] 　　由證起用
六  6:　　由我供養觀音如來蒙彼如來　　　　　　　　　　　　.
　    　　授我如幻聞熏聞修金剛三昧與佛如來同慈力故　　　　.
　    　　令我身成三十二應入諸國土　　　　　　　　　　　　.
六  7:　[HR] 　　　現四聖法界
六 11:　[HR] 　　　現六凡法界
六 39:　　是名妙淨三十二應入國土身　　　　　　　　　　　　.
　    　　皆以三昧聞熏聞修無作妙力自在成就　　　　　　　　.
六 40:　　我復以此聞熏聞修金剛三昧無作妙力　　　　　　　　.
　    　　與諸十方三世六道一切眾生同悲仰故　　　　　　　　.
　    　　令諸眾生於我身心獲十四種無畏功德　　　　　　　　.
六 41:　[HR] 　　　別施無畏相
六 55:　　由我所得圓通本根發妙耳門然後身心微妙含容　　　　.
　    　　周遍法界能令眾生持我名號與彼共持　　　　　　　　.
　    　　六十二恒河沙諸法王子二人福德正等無異　　　　　　.
　    　　我一名號與彼眾多名號無異由我修習得真圓通　　　　.
六 56:　　是名十四施無畏力福備眾生　　　　　　　　　　　　.
六 57:　　我又獲是圓通修證無上道故　　　　　　　　　　　　.
　    　　又能善獲四不思議無作妙德　　　　　　　　　　　　.
六 58:　[HR] 　　　明四不思議
六 64:　　佛問圓通我從耳門圓照三昧緣心自在因入流相　　　　.
　    　　得三摩地成就菩提斯為第一　　　　　　　　　　　　.
　    　　彼佛如來歎我善得圓通法門於大會中　　　　　　　　.
　    　　授記我為觀世音號　　　　　　　　　　　　　　　　.
　    　　由我觀聽十方圓明故觀音名遍十方界　　　　　　　　.
　    　[HR] 別顯修證/終

六 65:　　〇　爾時世尊於師子座從其五體同放寶光　　　　　　.
　    　　　　遠灌十方微塵如來及法王子諸菩薩頂　　　　　　.
　    　　　　彼諸如來亦於五體同放寶光從微塵方　　　　　　.
　    　　　　來灌佛頂並灌會中諸大菩薩及阿羅漢　　　　　　.
六 66:　　　　林木池沼皆演法音交光相羅如寶絲網　　　　　　.
　    　　　　是諸大眾得未曾有一切普獲金剛三昧　　　　　　.
六 67:　　　　即時天雨百寶蓮華青黃赤白間錯紛糅　　　　　　.
　    　　　　十方虛空成七寶色此娑婆界大地山河　　　　　　.
　    　　　　俱時不現唯見十方微塵國土合成一界　　　　　　.
　    　　　　梵唄詠歌自然敷奏　　　　　　　　　　　　　　.
六 68:　　〇　如來告文殊師利法王子　　　　　　　　　　　　.
　    　　　　汝今觀此廿五無學諸大菩薩及阿羅漢　　　　　　.
　    　　　　各說最初成道方便皆言修習真實圓通　　　　　　.
　    　　　　彼等修行實無優劣前後差別　　　　　　　　　　.
六 69:　　　　我今欲令阿難開悟二十五行誰當其根　　　　　　.
　    　　　　兼我滅後此界眾生入菩薩乘求無上道　　　　　　.
　    　　　　何方便門得易成就　　　　　　　　　　　　　　.
六 70:　　〇　文殊師利法王子奉佛慈旨即從座起頂禮佛足　　　.
　    　　　　承佛威神說偈對佛　　　　　　　　　　　　　　.
六 65:　[HR] 文殊受命簡擇
六 71:　[HR] 　頌隨染緣從源出流
六 71:　　覺海性澄圓　圓澄覺元妙　元明照生所　所立照性亡　.
　    　　迷妄有虛空　依空立世界　想澄成國土　知覺乃眾生　.
六 72:　[HR] 　總明滅妄歸真
六 72:　　空生大覺中　如海一漚發　有漏微塵國　皆依空所生　.
　    　　漚滅空本無　況復諸三有　　　　　　　　　　　　　.
六 73:　[HR] 　總示方便須擇
六 73:　　歸元性無二　方便有多門　聖性無不通　順逆皆方便　.
　    　　初心入三昧　遲速不同倫　　　　　　　　　　　　　.
六 74:　[HR] 　簡非
六 74:　　色想結成塵　精了不能徹　如何不明徹　於是獲圓通　.
六 75:　　音聲雜語言　但伊名句味　一非含一切　云何獲圓通　.
六 76:　　香以合中知　離則元無有　不恒其所覺　云何獲圓通　.
六 77:　　味性非本然　要以味時有　其覺不恒一　云何獲圓通　.
六 78:　　觸以所觸明　無所不明觸　合離性非定　云何獲圓通　.
六 79:　　法稱為內塵　憑塵必有所　能所非遍涉　云何獲圓通　.
六 80:　　見性雖洞然　明前不明後　四維虧一半　云何獲圓通　.
六 81:　　鼻息出入通　現前無交氣　支離匪涉入　云何獲圓通　.
六 82:　　舌非入無端　因味生覺了　味亡了無有　云何獲圓通　.
六 83:　　身與所觸同　各非圓覺觀　涯量不冥會　云何獲圓通　.
六 84:　　知根雜亂思　湛了終無見　想念不可脫　云何獲圓通　.
六 85:　　識見雜三和　詰本稱非相　自體先無定　云何獲圓通　.
六 86:　　心聞洞十方　生於大因力　初心不能入　云何獲圓通　.
六 87:　　鼻想本權機　祇令攝心住　住成心所住　云何獲圓通　.
六 88:　　說法弄音文　開悟先成者　名句非無漏　云何獲圓通　.
六 89:　　持犯但束身　非身無所束　元非遍一切　云何獲圓通　.
六 90:　　神通本宿因　何關法分別　念緣非離物　云何獲圓通　.
六 91:　　若以地性觀　堅礙非通達　有為非聖性　云何獲圓通　.
六 92:　　若以水性觀　想念非真實　如如非覺觀　云何獲圓通　.
六 93:　　若以火性觀　厭有非真離　非初心方便　云何獲圓通　.
六 94:　　若以風性觀　動寂非無對　對非無上覺　云何獲圓通　.
六 95:　　若以空性觀　昏鈍先非覺　無覺異菩提　云何獲圓通　.
六 96:　　若以識性觀　觀識非常住　存心乃虛妄　云何獲圓通　.
六 97:　　諸行是無常　念性元生滅　因果今殊感　云何獲圓通　.
　    　[HR] 　簡非/終
六 98:　[HR] 　正明觀音所修
六 98:　[HR] 　　泛明此土入道所宜
六 98:　　我今白世尊　佛出娑婆界　此方真教體　清淨在音聞　.
　    　　欲取三摩提　實以聞中入　　　　　　　　　　　　　.
六 99:　[HR] 　　正明離苦得樂人法
六 99:　　離苦得解脫　良哉觀世音　於恒沙劫中　入微塵佛國　.
　    　　得大自在力　無畏施眾生　妙音觀世音　梵音海潮音　.
　    　　救世悉安寧　出世獲常住　　　　　　　　　　　　　.
六100:　[HR] 　　正明觀音所修法門
六100:　　我今啟如來　如觀音所說　譬如人靜居　十方俱擊鼓　.
　    　　十處一時聞　此則圓真實　　　　　　　　　　　　　.
六101:　　目非觀障外　口鼻亦復然　身以合方知　心念紛無緒　.
　    　　隔垣聽音響　遐邇俱可聞　五根所不齊　是則通真實　.
六102:　　音聲性動靜　聞中為有無　無聲號無聞　非實聞無性　.
　    　　聲無既無滅　聲有亦非生　生滅二圓離　是則常真實　.
　    　　縱令在夢想　不為不思無　覺觀出思惟　身心不能及　.
　    　[HR] 　正明觀音所修/終
六103:　[HR] 　勸進讚美
六103:　[HR] 　　誨敕當機諦聽學行
六103:　　今此娑婆國　聲論得宣明　眾生迷本聞　循聲故流轉　.
　    　　阿難縱強記　不免落邪思　豈非隨所淪　旋流獲無妄　.
六104:　　阿難汝諦聽　我承佛威力　　　　　　　　　.
　    　　宣說金剛王　如幻不思議　佛母真三昧　　　.
六105:　　汝聞微塵佛　一切秘密門　欲漏不先除　蓄聞成過誤　.
　    　　將聞持佛佛　何不自聞聞　　　　　　　　　.
六106:　　聞非自然生　因聲有名字　旋聞與聲脫　能脫欲誰名　.
　    　　一根既返源　六根成解脫　見聞如幻翳　三界若空華　.
　    　　聞復翳根除　塵銷覺圓淨　淨極光通達　寂照含虛空　.
　    　　卻來觀世間　猶如夢中事　摩登伽在夢　誰能留汝形　.
六107:　　如世巧幻師　幻作諸男女　雖見諸根動　要以一機抽　.
　    　　息機歸寂然　諸幻成無性　　　　　　　　　　　　　.
六108:　　六根亦如是　元依一精明　分成六和合　一處成休復　.
　    　　六用皆不成　塵垢應念銷　成圓明淨妙　餘塵尚諸學　.
六109:　　大眾及阿難　旋汝倒聞機　　　　　　　　　　　　　.
　    　　反聞聞自性　性成無上道　圓通實如是
六110:　[HR] 　　嘆美法勝以寓勸修
六110:　　此是微塵佛　一路涅槃門　過去諸如來　斯門已成就　.
　    　　現在諸菩薩　今各入圓明　未來修學人　當依如是法　.
　    　　我亦從中證　非唯觀世音　　　　　　　　　　　　　.
六111:　[HR] 　　述成佛意結示簡選
六111:　　誠如佛世尊　詢我諸方便　以救諸末劫　求出世間人　.
　    　　成就涅槃心　觀世音為最　　　　　　　　　　　　　.
六112:　　自餘諸方便　皆是佛威神　　　　　　　　　　　　　.
　    　　即事捨塵勞　非是常修學　淺深同說法　　　　　　　.
六113:　[HR] 　　禮請加被以明真實
六113:　　頂禮如來藏　無漏不思議　願加被未來　於此門無惑　.
　    　　方便易成就　堪以教阿難　及末劫沈淪　但以此根修　.
　    　　圓通超餘者　真實心如是　　　　　　　　　　　　　.
　    　[HR] 　勸進讚美/終
　    　[HR] 文殊受命簡擇/終

六114:　　〇　於是阿難及諸大眾身心了然得大開示　　　　　　.
　    　　　　觀佛菩提及大涅槃猶如有人因事遠遊　　　　　　.
　    　　　　未得歸還明瞭其家所歸道路　　　　　　　　　　.
六115:　　　　普會大眾天龍八部有學二乘　　　　　　　　　　.
　    　　　　及諸一切新發心菩薩其數凡有十恒河沙　　　　　.
　    　　　　皆得本心遠塵離垢獲法眼淨　　　　　　　　　　.
六116:　　　　性比丘尼聞說偈已成阿羅漢　　　　　　　　　　.
六117:　　　　無量眾生皆發無等等阿耨多羅三藐三菩提心　　　.
六119:　　　　難：我今已悟成佛法門是中修行得無疑惑　　　　.
　    　　　　　　常聞如來說如是言　　　　　　　　　　　　.
　    　　　　　　自未得度先度人者菩薩發心　　　　　　　　.
　    　　　　　　自覺已圓能覺他者如來應世　　　　　　　　.
　    　　　　　　我雖未度願度末劫一切眾生　　　　　　　　.
六120:　　　　　：此諸眾生去佛漸遠　　　　　　　　　　　　.
　    　　　　　　邪師說法如恒河沙　　　　　　　　　　　　.
　    　　　　　　欲攝其心入三摩地　　　　　　　　　　　　.
　    　　　　　　云何令其安立道場遠諸魔事　　　　　　　　.
　    　　　　　　於菩提心得無退屈　　　　　　　　　　　　.
六121:　　　　佛：善哉善哉　　　　　　　　　　　　　　　　.
　    　　　　　　如汝所問安立道場救護眾生末劫沈溺　　　　.
　    　　　　　　汝今諦聽當為汝說　　　　　　　　　　　　.
六122:　　　　　：汝常聞我毗奈耶中　　　　　　　　　　　　.
　    　　　　　　宣說修行三決定義　　　　　　　　　　　　.
　    　　　　　　所謂攝心為戒因戒生定因定發慧　　　　　　.
　    　　　　　　是則名為三無漏學　　　　　　　　　　　　.

六123:　[HR] 四決定清淨明誨
六123:　[HR] 　第一：婬戒
六123:　　若諸世界六道眾生其心不婬則不隨其生死相續　　　　.
六124:　　汝修三昧本出塵勞婬心不除塵不可出　　　　　　　　.
　    　　縱有多智禪定現前如不斷婬必落魔道　　　　　　　　.
　    　　上品魔王中品魔民下品魔女彼等諸魔　　　　　　　　.
　    　　亦有徒眾各各自謂成無上道　　　　　　　　　　　　.
六125:　　我滅度後末法之中多此魔民熾盛世間　　　　　　　　.
　    　　廣行貪婬為善知識令諸眾生落愛見坑失菩提路　　　　.
六126:　　汝教世人修三摩地先斷心婬　　　　　　　　　　　　.
　    　　是名如來先佛世尊第一決定清淨明誨　　　　　　　　.
六129:　　如我此說名為佛說不如此說即波旬說　　　　　　　　.
六130:　[HR] 　第二：殺戒
六130:　　又諸世界六道眾生其心不殺則不隨其生死相續　　　　.
六131:　　汝修三昧本出塵勞殺心不除塵不可出　　　　　　　　.
　    　　縱有多智禪定現前如不斷殺必落神道　　　　　　　　.
　    　　上品之人為大力鬼中品則為飛行夜叉諸鬼帥等　　　　.
　    　　下品當為地行羅剎　　　　　　　　　　　　　　　　.
　    　　彼諸鬼神亦有徒眾各各自謂成無上道　　　　　　　　.
六132:　　我滅度後末法之中多此鬼神熾盛世間　　　　　　　　.
　    　　自言食肉得菩提路　　　　　　　　　　　　　　　　.
六133:　　我令比丘食五淨肉此肉皆我神力化生本無命根　　　　.
　    　　汝婆羅門地多蒸濕加以沙石草菜不生　　　　　　　　.
　    　　我以大悲神力所加　　　　　　　　　　　　　　　　.
六134:　　因大慈悲假名為肉汝得其味　　　　　　　　　　　　.
　    　　奈何如來滅度之後食眾生肉名為釋子　　　　　　　　.
　    　　汝等當知是食肉人縱得心開似三摩地　　　　　　　　.
　    　　皆大羅剎報終必沈生死苦海非佛弟子　　　　　　　　.
　    　　如是之人相殺相吞相食未已云何是人得出三界　　　　.
六135:　　汝教世人修三摩地次斷殺生　　　　　　　　　　　　.
　    　　是名如來先佛世尊第二決定清淨明誨　　　　　　　　.
六136:　　清淨比丘及諸菩薩於歧路行不蹋生草況以手拔　　　　.
　    　　云何大悲取諸眾生血肉充食　　　　　　　　　　　　.
六137:　　若諸比丘不服東方絲綿絹帛及是此土　　　　　　　　.
　    　　靴履裘毳乳酪醍醐如是比丘　　　　　　　　　　　　.
　    　　於世真脫酬還宿債不遊三界何以故　　　　　　　　　.
　    　　服其身分皆為彼緣如人食其地中百穀足不離地　　　　.
六138:　　必使身心於諸眾生若身身分身心二途不服不食　　　　.
　    　　我說是人真解脫者　　　　　　　　　　　　　　　　.
六139:　　如我此說名為佛說不如此說即波旬說　　　　　　　　.
六140:　[HR] 　第三：盜戒
六140:　　又復世界六道眾生其心不偷則不隨其生死相續　　　　.
六141:　　汝修三昧本出塵勞偷心不除塵不可出　　　　　　　　.
　    　　縱有多智禪定現前如不斷偷必落邪道　　　　　　　　.
　    　　上品精靈中品妖魅下品邪人諸魅所著　　　　　　　　.
　    　　彼等群邪亦有徒眾各各自謂成無上道　　　　　　　　.
六142:　　我滅度後末法之中多此妖邪熾盛世間　　　　　　　　.
　    　　潛匿奸欺稱善知識各自謂已　　　　　　　　　　　　.
　    　　得上人法誘惑無識恐令失心所過之處其家耗散　　　　.
六143:　　我教比丘循方乞食令其捨貪成菩提道　　　　　　　　.
六144:　　諸比丘等不自熟食寄於殘生　　　　　　　　　　　　.
　    　　旅泊三界示一往還去已無返　　　　　　　　　　　　.
　    　　云何賊人假我衣服裨販如來造種種業皆言佛法　　　　.
　    　　卻非出家具戒比丘為小乘道　　　　　　　　　　　　.
　    　　由是疑誤無量眾生墮無間獄　　　　　　　　　　　　.
六145:　　若我滅後其有比丘發心決定修三摩提　　　　　　　　.
　    　　能於如來形像之前　　　　　　　　　　　　　　　　.
　    　　身然一燈燒一指節及於身上爇一香炷　　　　　　　　.
　    　　我說是人無始宿債一時酬畢長揖世間永脫諸漏　　　　.
　    　　雖未即明無上覺路是人於法已決定心　　　　　　　　.
　    　　若不為此捨身微因縱成無為必還生人　　　　　　　　.
　    　　酬其宿債如我馬麥正等無異　　　　　　　　　　　　.
六146:　　汝教世人修三摩地後斷偷盜　　　　　　　　　　　　.
　    　　是名如來先佛世尊第三決定清淨明誨　　　　　　　　.
六148:　　若諸比丘衣缽之餘分寸不蓄乞食餘分施餓眾生　　　　.
　    　　於大集會合掌禮眾有人捶詈同於稱讚　　　　　　　　.
　    　　必使身心二俱捐捨身肉骨血與眾生共　　　　　　　　.
　    　　不將如來不了義說回為己解以誤初學　　　　　　　　.
　    　　佛印是人得真三昧　　　　　　　　　　　　　　　　.
六149:　　如我此說名為佛說不如此說即波旬說　　　　　　　　.
六150:　[HR] 　第四：大妄語戒
六150:　　如是世界六道眾生雖則身心無殺盜婬三行已圓　　　　.
　    　　若大妄語即三摩地不得清淨成愛見魔失如來種　　　　.
六151:　　所謂未得謂得未證言證　　　　　　　　　　　　　　.
　    　　或求世間尊勝第一謂前人言我今已得　　　　　　　　.
　    　　須陀洹果斯陀含果阿那含果阿羅漢道辟支佛乘　　　　.
　    　　十地地前諸位菩薩　　　　　　　　　　　　　　　　.
　    　　求彼禮懺貪其供養　　　　　　　　　　　　　　　　.
六152:　　是一顛迦銷滅佛種如人以刀斷多羅木　　　　　　　　.
　    　　佛記是人永殞善根無復知見沈三苦海不成三昧　　　　.
六153:　　我滅度後敕諸菩薩及阿羅漢應身生彼末法之中　　　　.
　    　　作種種形度諸輪轉　　　　　　　　　　　　　　　　.
　    　　　　或作沙門白衣居士人王宰官童男童女　　　　　　.
　    　　　　如是乃至婬女寡婦奸偷屠販　　　　　　　　　　.
　    　　與其同事稱讚佛乘令其身心入三摩地　　　　　　　　.
　    　　終不自言我真菩薩真阿羅漢泄佛密因輕言末學　　　　.
六154:　　唯除命終陰有遺付　　　　　　　　　　　　　　　　.
　    　　云何是人惑亂眾生成大妄語　　　　　　　　　　　　.
　    　　汝教世人修三摩地後復斷除諸大妄語　　　　　　　　.
　    　　是名如來先佛世尊第四決定清淨明誨　　　　　　　　.
六156:　　若諸比丘心如直弦一切真實入三摩地永無魔事　　　　.
　    　　我印是人成就菩薩無上知覺　　　　　　　　　　　　.
六157:　　如我此說名為佛說不如此說即波旬說　　　　　　　　.
　    　[HR] 四決定清淨明誨/終`);
