lines.push(
`七  3:　　　　佛：若有宿習不能滅除汝教是人一心誦我　　　　.
　    　　　　　　佛頂光明摩訶薩怛多般怛囉無上神咒　　　　.
七  4:　　　　　：斯是如來無見頂相無為心佛從頂發輝　　　　.
　    　　　　　　坐寶蓮華所說神咒　　　　　　　　　　　　.
七  6:　　　　　：若有末世欲坐道場　　　　　　　　　　　　.
　    　　　　　　先持比丘清淨禁戒　　　　　　　　　　　　.
　    　　　　　　要當選擇戒清淨者第一沙門以為其師　　　　.
　    　　　　　　若其不遇真清淨僧汝戒律儀必不成就　　　　.
七  7:　　　　　：戒成已後著新淨衣然香閒居　　　　　　　　.
　    　　　　　　誦此心佛所說神咒一百八遍　　　　　　　　.
　    　　　　　　然後結界建立道場　　　　　　　　　　　　.
七  8:　　　　　：求於十方現住國土無上如來　　　　　　　　.
　    　　　　　　放大悲光來灌其頂　　　　　　　　　　　　.
七  9:　　　　　：如是末世清淨比丘若比丘尼白衣檀越　　　　.
　    　　　　　　心滅貪婬持佛淨戒於道場中發菩薩願　　　　.
　    　　　　　　出入澡浴六時行道如是不寐經三七日　　　　.
　    　　　　　　我自現身至其人前摩頂安慰令其開悟　　　　.
七 10:　　　　難：我蒙如來無上悲誨心已開悟　　　　　　　　.
　    　　　　　　自知修證無學道成　　　　　　　　　　　　.
　    　　　　　　末法修行建立道場云何結界　　　　　　　　.
　    　　　　　　合佛世尊清淨軌則　　　　　　　　　　　　.
七 11:　[HR] 明檀法

七 21:　　　　難：自我出家恃佛憍愛求多聞故未證無為　　　　.
　    　　　　　　遭彼梵天邪術所禁心雖明瞭力不自由　　　　.
　    　　　　　　賴遇文殊令我解脫　　　　　　　　　　　　.
　    　　　　　　雖蒙如來佛頂神咒冥獲其力尚未親聞　　　　.
七 22:　　　　　　惟願大慈重為宣說悲救此會諸修行輩　　　　.
　    　　　　　　末及當來在輪迴者承佛密音身意解脫　　　　.
七 23:　　〇　爾時觀世音菩薩頂禮佛足而白佛言　　　　　　　.
七 24:　　〇　爾時世尊從肉髻中湧百寶光　　　　　　　　　　.
　    　　　　　　光中湧出千葉寶蓮有化如來坐寶華中　　　　.
　    　　　　　　頂放十道百寶光明一一光明皆遍示現　　　　.
　    　　　　　　十恒河沙金剛密跡擎山持杵遍虛空界　　　　.
　    　　　　　　大眾仰觀畏愛兼抱求佛哀佑　　　　　　　　.
　    　　　　　　一心聽佛無見頂相放光如來　　　　　　　　.
　    　　　　　　宣說神咒　　　　　　　　　　　　　　　　.

七 25:　[HR] 楞嚴咒

七 31:　[HR] 述楞嚴咒功德勸持
七 31:　　是佛頂光聚悉怛多般怛囉秘密伽陀微妙章句　　　　　.
　    　　出生十方一切諸佛　　　　　　　　　　　　　　　　.
　    　　十方如來因此咒心得成無上正遍知覺　　　　　　　　.
七 32:　　十方如來執此咒心降伏諸魔制諸外道　　　　　　　　.
　    　　十方如來乘此咒心坐寶蓮華應微塵國　　　　　　　　.
　    　　十方如來含此咒心於微塵國轉大法輪　　　　　　　　.
七 33:　　十方如來持此咒心能於十方摩頂授記　　　　　　　　.
　    　　　　自果未成亦於十方蒙佛授記　　　　　　　　　　.
七 34:　　十方如來依此咒心能於十方拔濟群苦　　　　　　　　.
　    　　　　所謂地獄餓鬼畜生盲聾瘖啞　　　　　　　　　　.
　    　　　　怨憎會苦愛別離苦求不得苦　　　　　　　　　　.
　    　　　　五陰熾盛大小諸橫同時解脫　　　　　　　　　　.
　    　　　　賊難兵難王難獄難風火水難饑渴貧窮　　　　　　.
　    　　　　應念銷散　　　　　　　　　　　　　　　　　　.
七 35:　　十方如來隨此咒心能於十方事善知識四威儀中　　　　.
　    　　　　供養如意恒沙如來會中推為大法王子　　　　　　.
七 36:　　十方如來行此咒心能於十方攝受親因令諸小乘　　　　.
　    　　　　聞秘密藏不生驚怖　　　　　　　　　　　　　　.
七 37:　　十方如來誦此咒心成無上覺坐菩提樹入大涅槃　　　　.
七 38:　　十方如來傳此咒心於滅度後付佛法事究竟住持　　　　.
　    　　　　嚴淨戒律悉得清淨　　　　　　　　　　　　　　.
七 39:　　若我說是佛頂光聚般怛囉咒　　　　　　　　　　　　.
　    　　　　從旦至暮音聲相聯字句中間亦不重疊　　　　　　.
　    　　　　經恒沙劫終不能盡　　　　　　　　　　　　　　.
七 40:　　亦說此咒名如來頂　　　　　　　　　　　　　　　　.
　    　　汝等有學未盡輪迴發心至誠取阿羅漢　　　　　　　　.
　    　　不持此咒而坐道場令其身心遠諸魔事無有是處　　　　.
七 41:　　若諸世界隨所國土所有眾生隨國所生　　　　　　　　.
　    　　樺皮貝葉紙素白氈書寫此咒貯於香囊　　　　　　　　.
　    　　是人心昏未能誦憶或帶身上或書宅中　　　　　　　　.
　    　　當知是人盡其生年一切諸毒所不能害　　　　　　　　.
七 42:　　我今為汝更說此咒救護世間得大無畏　　　　　　　　.
　    　　成就眾生出世間智　　　　　　　　　　　　　　　　.

七 43:　　若我滅後末世眾生有能自誦若教他誦　　　　　　　　.
　    　　當知如是誦持眾生火不能燒水不能溺　　　　　　　　.
　    　　大毒小毒所不能害　　　　　　　　　　　　　　　　.
　    　　如是乃至　　　　　　　　　　　　　　　　　　　　.
　    　　天龍鬼神精祇魔魅所有惡咒皆不能著心得正受　　　　.
　    　　一切咒詛厭蠱毒藥金毒銀毒草木蟲蛇　　　　　　　　.
　    　　萬物毒氣入此人口成甘露味　　　　　　　　　　　　.
　    　　一切惡星並諸鬼神磣心毒人於如是人不能起惡　　　　.
七 44:　　頻那夜迦諸惡鬼王並其眷屬皆領深恩常加守護　　　　.
七 45:　　是咒常有八萬四千那由他恒河沙俱胝　　　　　　　　.
　    　　金剛藏王菩薩種族一一皆有諸金剛眾而為眷屬　　　　.
　    　　晝夜隨侍　　　　　　　　　　　　　　　　　　　　.
七 46:　　設有眾生於散亂心非三摩地心憶口持　　　　　　　　.
　    　　是金剛王常隨從彼諸善男子何況決定菩提心者　　　　.
七 47:　　此諸金剛菩薩藏王精心陰速發彼神識　　　　　　　　.
　    　　是人應時心能記憶八萬四千恒河沙劫　　　　　　　　.
　    　　周遍了知得無疑惑　　　　　　　　　　　　　　　　.
七 48:　　從第一劫乃至後身生生不生藥叉羅剎　　　　　　　　.
　    　　及富單那迦吒富單那鳩槃茶毗舍遮等　　　　　　　　.
　    　　並諸餓鬼有形無形有想無想如是惡處　　　　　　　　.
七 49:　　是善男子若讀若誦若書若寫若帶若藏諸色供養　　　　.
　    　　劫劫不生貧窮下賤不可樂處　　　　　　　　　　　　.
　    　　此諸眾生縱其自身不作福業　　　　　　　　　　　　.
　    　　十方如來所有功德悉與此人　　　　　　　　　　　　.
　    　　由是得於恒河沙阿僧祇不可說不可說劫　　　　　　　.
　    　　常與諸佛同生一處　　　　　　　　　　　　　　　　.
　    　　無量功德如惡叉聚同處熏修永無分散　　　　　　　　.
七 50:　　是故能令破戒之人戒根清淨未得戒者令其得戒　　　　.
　    　　未精進者令得精進無智慧者令得智慧　　　　　　　　.
　    　　不清淨者速得清淨不持齋戒自成齋戒　　　　　　　　.
七 51:　　是善男子持此咒時設犯禁戒於未受時　　　　　　　　.
　    　　持咒之後眾破戒罪無問輕重一時銷滅　　　　　　　　.
七 52:　　縱經飲酒食噉五辛種種不淨　　　　　　　　　　　　.
　    　　一切諸佛菩薩金剛天仙鬼神不將為過　　　　　　　　.
　    　　設著不淨破弊衣服一行一住悉同清淨　　　　　　　　.
　    　　縱不作壇不入道場亦不行道誦持此咒　　　　　　　　.
　    　　還同入壇行道功德無有異也　　　　　　　　　　　　.
七 53:　　若造五逆無間重罪及諸比丘比丘尼　　　　　　　　　.
　    　　四棄八棄誦此咒已如是重業猶如猛風吹散沙聚　　　　.
　    　　悉皆滅除更無毫髮　　　　　　　　　　　　　　　　.
七 54:　　若有眾生從無量無數劫來所有一切輕重罪障　　　　　.
　    　　從前世來未及懺悔若能讀誦書寫此咒身上帶持　　　　.
　    　　若安住處莊宅園館如是積業猶湯銷雪　　　　　　　　.
　    　　不久皆得悟無生忍　　　　　　　　　　　　　　　　.
七 55:　　若有女人未生男女欲求孕者　　　　　　　　　　　　.
　    　　若能至心憶念斯咒或能身上帶此悉怛多般怛囉者　　　.
　    　　便生福德智慧男女　　　　　　　　　　　　　　　　.
　    　　求長命者即得長命　　　　　　　　　　　　　　　　.
　    　　欲求果報速圓滿者速得圓滿　　　　　　　　　　　　.
　    　　身命色力亦復如是　　　　　　　　　　　　　　　　.
　    　　命終之後隨願往生十方國土　　　　　　　　　　　　.
　    　　必定不生邊地下賤何況雜形　　　　　　　　　　　　.
七 56:　　若諸國土州縣聚落饑荒疫癘　　　　　　　　　　　　.
　    　　或復刀兵賊難鬥諍兼餘一切厄難之地　　　　　　　　.
　    　　寫此神咒安城四門並諸支提或脫闍上　　　　　　　　.
　    　　令其國土所有眾生奉迎斯咒禮拜恭敬　　　　　　　　.
　    　　一心供養令其人民各各身佩　　　　　　　　　　　　.
　    　　或各各安所居宅地一切災厄悉皆銷滅　　　　　　　　.
七 57:　　在在處處國土眾生隨有此咒　　　　　　　　　　　　.
　    　　天龍歡喜風雨順時五穀豐殷兆庶安樂　　　　　　　　.
　    　　亦復能鎮一切惡星隨方變怪　　　　　　　　　　　　.
　    　　災障不起人無橫夭杻械枷鎖不著其身　　　　　　　　.
　    　　晝夜安眠常無惡夢　　　　　　　　　　　　　　　　.
七 58:　　是娑婆界有八萬四千災變惡星　　　　　　　　　　　.
　    　　二十八大惡星而為上首　　　　　　　　　　　　　　.
　    　　復有八大惡星以為其主　　　　　　　　　　　　　　.
　    　　作種種形出現世時能生眾生種種災異　　　　　　　　.
　    　　有此咒地悉皆銷滅　　　　　　　　　　　　　　　　.
　    　　十二由旬成結界地諸惡災祥永不能入　　　　　　　　.
七 59:　　是故如來宣示此咒於未來世　　　　　　　　　　　　.
　    　　保護初學諸修行者入三摩提身心泰然得大安隱　　　　.
　    　　更無一切諸魔鬼神及無始來　　　　　　　　　　　　.
　    　　冤橫宿殃舊業陳債來相惱害　　　　　　　　　　　　.
七 60:　　汝及眾中諸有學人及未來世諸修行者　　　　　　　　.
　    　　依我壇場如法持戒所受戒主逢清淨僧　　　　　　　　.
　    　　持此咒心不生疑悔　　　　　　　　　　　　　　　　.
　    　　是善男子於此父母所生之身　　　　　　　　　　　　.
　    　　不得心通十方如來便為妄語　　　　　　　　　　　　.
　    　[HR] 述楞嚴咒功德勸持/終

七 61:　[HR] 述願護法
七 61:　　〇　說是語已會中無量百千金剛　　　　　　　　　　.
　    　　　　一時佛前合掌頂禮而白佛言　　　　　　　　　　.
　    　　　　如佛所說我當誠心保護如是修菩提者　　　　　　.
七 62:　　〇　爾時梵王並天帝釋四天大王　　　　　　　　　　.
　    　　　　亦於佛前同時頂禮而白佛言　　　　　　　　　　.
　    　　　　審有如是修學善人　　　　　　　　　　　　　　.
　    　　　　我當盡心至誠保護令其一生所作如願　　　　　　.
七 63:　　〇　復有無量藥叉大將諸羅剎王富單那王　　　　　　.
　    　　　　鳩槃茶王毗舍遮王頻那夜迦諸大鬼王　　　　　　.
　    　　　　及諸鬼帥亦於佛前合掌頂禮　　　　　　　　　　.
　    　　　　我亦誓願護持是人令菩提心速得圓滿　　　　　　.
七 64:　　〇　復有無量日月天子風師雨師雲師雷師　　　　　　.
　    　　　　並電伯等年歲巡官諸星眷屬　　　　　　　　　　.
　    　　　　亦於會中頂禮佛足而白佛言　　　　　　　　　　.
　    　　　　我亦保護是修行人安立道場得無所畏　　　　　　.
七 65:　　〇　復有無量山神海神一切土地水陸空行　　　　　　.
　    　　　　萬物精祇並風神王無色界天　　　　　　　　　　.
　    　　　　於如來前同時稽首而白佛言　　　　　　　　　　.
　    　　　　我亦保護是修行人得成菩提永無魔事　　　　　　.
七 66:　　〇　爾時八萬四千那由他恒河沙俱胝　　　　　　　　.
　    　　　　金剛藏王菩薩　　　　　　　　　　　　　　　　.
　    　　　　在大會中即從座起頂禮佛足而白佛言世尊　　　　.
　    　　　　如我等輩所修功業久成菩提不取涅槃　　　　　　.
　    　　　　常隨此咒救護末世修三摩地正修行者　　　　　　.
七 67:　　　　如是修心求正定人若在道場及餘經行　　　　　　.
　    　　　　乃至散心遊戲聚落我等徒眾　　　　　　　　　　.
　    　　　　常當隨從侍衛此人　　　　　　　　　　　　　　.
七 68:　　　　縱令魔王大自在天求其方便終不可得　　　　　　.
　    　　　　諸小鬼神去此善人十由旬外除彼發心樂修禪者　　.
　    　　　　世尊如是惡魔若魔眷屬　　　　　　　　　　　　.
　    　　　　欲來侵擾是善人者　　　　　　　　　　　　　　.
　    　　　　我以寶杵殞碎其首猶如微塵　　　　　　　　　　.
　    　　　　恒令此人所作如願　　　　　　　　　　　　　　.
　    　[HR] 述願護法/終

七 69:　[HR] 明正助合行所成伏斷圓三德位
七 69:　　〇　阿難即從座起頂禮佛足而白佛言　　　　　　　　.
　    　　　　難：我蒙如來無上悲誨心已開悟　　　　　　　　.
　    　　　　　　我輩愚鈍好為多聞於諸漏心未求出離　　　　.
　    　　　　　　蒙佛慈誨得正熏修身心快然獲大饒益　　　　.
七 70:　　　　　　如是修證佛三摩提未到涅槃　　　　　　　　.
　    　　　　　　云何名為乾慧之地　　　　　　　　　　　　.
　    　　　　　　四十四心至何漸次得修行目　　　　　　　　.
　    　　　　　　詣何方所名入地中　　　　　　　　　　　　.
　    　　　　　　云何名為等覺菩薩　　　　　　　　　　　　.
七 71:　　　　佛：善哉善哉　　　　　　　　　　　　　　　　.
　    　　　　　　汝等乃能普為大眾及諸末世一切眾生　　　　.
　    　　　　　　修三摩地求大乘者　　　　　　　　　　　　.
　    　　　　　　從於凡夫終大涅槃懸示無上正修行路　　　　.
　    　　　　　　汝今諦聽當為汝說　　　　　　　　　　　　.
七 72:　　妙性圓明離諸名相本來無有世界眾生　　　　　　　　.
　    　　因妄有生因生有滅生滅名妄　　　　　　　　　　　　.
　    　　滅妄名真是稱如來無上菩提及大涅槃二轉依號　　　　.
七 73:　　汝今欲修真三摩地直詣如來大涅槃者　　　　　　　　.
　    　　先當識此眾生世界二顛倒因　　　　　　　　　　　　.
　    　　顛倒不生斯則如來真三摩地　　　　　　　　　　　　.
七 74:　　云何名為眾生顛倒　　　　　　　　　　　　　　　　.
　    　　　　由性明心性明圓故　　　　　　　　　　　　　　.
　    　　　　因明發性性妄見生從畢竟無成究竟有　　　　　　.
　    　　　　此有所有非因所因住所住相了無根本　　　　　　.
　    　　　　本此無住建立世界及諸眾生　　　　　　　　　　.
七 75:　　　　迷本圓明是生虛妄妄性無體非有所依　　　　　　.
　    　　　　將欲復真欲真已非真真如性非真求復　　　　　　.
　    　　　　宛成非相　　　　　　　　　　　　　　　　　　.
七 76:　　　　非生非住非心非法展轉發生生力發明　　　　　　.
　    　　　　熏以成業同業相感因有感業相滅相生　　　　　　.
七 77:　　由是故有眾生顛倒　　　　　　　　　　　　　　　　.
七 78:　　云何名為世界顛倒　　　　　　　　　　　　　　　　.
　    　　　　是有所有分段妄生因此界立　　　　　　　　　　.
　    　　　　非因所因無住所住遷流不住因此世成　　　　　　.
七 79:　　　　三世四方和合相涉變化眾生成十二類　　　　　　.
七 80:　　　　是故世界因動有聲因聲有色因色有香　　　　　　.
　    　　　　　　　　因香有觸因觸有味因味知法　　　　　　.
　    　　　　六亂妄想成業性故十二區分由此輪轉　　　　　　.
七 81:　　　　是故世間聲香味觸窮十二變為一旋復　　　　　　.
　    　　　　乘此輪轉顛倒相故是有世界　　　　　　　　　　.
　    　　　　卵生胎生濕生化生有色無色有想無想　　　　　　.
　    　　　　若非有色若非無色若非有想若非無想　　　　　　.
　    　[HR] 明正助合行所成伏斷圓三德位/終

七 69:　[HR] 明迷真起妄成十二類生顛倒法
七 82:　　由因世界虛妄輪迴動顛倒故和合氣成　　　　　　　　.
　    　　　　八萬四千飛沈亂想　　　　　　　　　　　　　　.
　    　　如是故有卵羯邏藍流轉國土魚鳥龜蛇其類充塞　　　　.
七 83:　　由因世界雜染輪迴欲顛倒故和合滋成　　　　　　　　.
　    　　　　八萬四千橫豎亂想　　　　　　　　　　　　　　.
　    　　如是故有胎遏蒲曇流轉國土人畜龍仙其類充塞　　　　.
七 84:　　由因世界執著輪迴趣顛倒故和合暖成　　　　　　　　.
　    　　　　八萬四千翻覆亂想　　　　　　　　　　　　　　.
　    　　如是故有濕相蔽尸流轉國土含蠢蝡動其類充塞　　　　.
七 85:　　由因世界變易輪迴假顛倒故和合觸成　　　　　　　　.
　    　　　　八萬四千新故亂想　　　　　　　　　　　　　　.
　    　　如是故有化相羯南流轉國土轉蛻飛行其類充塞　　　　.
七 86:　　由因世界留礙輪迴障顛倒故和合著成　　　　　　　　.
　    　　　　八萬四千精耀亂想　　　　　　　　　　　　　　.
　    　　如是故有色相羯南流轉國土休咎精明其類充塞　　　　.
七 87:　　由因世界銷散輪迴惑顛倒故和合暗成　　　　　　　　.
　    　　　　八萬四千陰隱亂想　　　　　　　　　　　　　　.
　    　　如是故有無色羯南流轉國土空散銷沈其類充塞　　　　.
七 88:　　由因世界，罔象輪迴，影顛倒故，和合憶成　　　　　.
　    　　　　八萬四千潛結亂想　　　　　　　　　　　　　　.
　    　　如是故有想相羯南流轉國土神鬼精靈其類充塞　　　　.
七 89:　　由因世界愚鈍輪迴癡顛倒故和合頑成　　　　　　　　.
　    　　　　八萬四千枯槁亂想　　　　　　　　　　　　　　.
　    　　如是故有無想羯南流轉國土　　　　　　　　　　　　.
　    　　　　精神化為土木金石其類充塞　　　　　　　　　　.
七 90:　　由因世界相待輪迴偽顛倒故和合染成　　　　　　　　.
　    　　　　八萬四千因依亂想　　　　　　　　　　　　　　.
　    　　如是故有非有色相成色羯南流轉國土　　　　　　　　.
　    　　　　諸水母等以蝦為目其類充塞　　　　　　　　　　.
七 91:　　由因世界相引輪迴性顛倒故和合咒成　　　　　　　　.
　    　　　　八萬四千呼召亂想　　　　　　　　　　　　　　.
　    　　由是故有非無色相無色羯南流轉國土　　　　　　　　.
　    　　　　咒詛厭生其類充塞　　　　　　　　　　　　　　.
七 92:　　由因世界，合妄輪迴，罔顛倒故，和合異成　　　　　.
　    　　　　八萬四千回互亂想　　　　　　　　　　　　　　.
　    　　如是故有非有想相成想羯南流轉國土　　　　　　　　.
　    　　　　彼蒲盧等異質相成其類充塞　　　　　　　　　　.
七 93:　　由因世界怨害輪迴殺顛倒故和合怪成　　　　　　　　.
　    　　　　八萬四千食父母想　　　　　　　　　　　　　　.
　    　　如是故有非無想相無想羯南流轉國土　　　　　　　　.
　    　　　　如土梟等附塊為兒及破鏡鳥以毒樹果　　　　　　.
　    　　　　抱為其子子成父母皆遭其食其類充塞　　　　　　.
　    　[HR] 明迷真起妄成十二類生顛倒法/終`);
