lines.push(
`八  1:　[HR] 明滅妄名真立六十聖位轉依號
八  1:　　　　佛：如是眾生一一類中亦各各具十二顛倒　　　　.
　    　　　　　　猶如捏目亂華發生顛倒妙圓真淨明心　　　　.
　    　　　　　　具足如斯虛妄亂想　　　　　　　　　　　　.
八  2:　　　　　　汝今修證佛三摩提　　　　　　　　　　　　.
　    　　　　　：於是本因元所亂想立三漸次方得除滅　　　　.
八  3:　　　　　　一者修習除其助因　　　　　　　　　　　　.
　    　　　　　　二者真修刳其正性　　　　　　　　　　　　.
　    　　　　　　三者增進違其現業　　　　　　　　　　　　.
八  4:　[HR] 　第一增進修行漸次
八  4:　　云何助因　　　　　　　　　　　　　　　　　　　　.
　    　　　　是諸眾生求三摩提當斷世間五種辛菜　　　　　　.
八  5:　　　　是五種辛熟食發婬生噉增恚　　　　　　　　　　.
　    　　　　如是世界食辛之人縱能宣說十二部經　　　　　　.
　    　　　　十方天仙嫌其臭穢咸皆遠離　　　　　　　　　　.
　    　　　　諸餓鬼等因彼食次舐其唇吻　　　　　　　　　　.
　    　　　　常與鬼住福德日銷長無利益　　　　　　　　　　.
　    　　　　是食辛人修三摩地　　　　　　　　　　　　　　.
　    　　　　菩薩天仙十方善神不來守護　　　　　　　　　　.
　    　　　　大力魔王得其方便現作佛身來為說法　　　　　　.
　    　　　　非毀禁戒讚婬怒疑命終自為魔王眷屬　　　　　　.
　    　　　　受魔福盡墮無間獄　　　　　　　　　　　　　　.
八  6:　　　　修菩提者永斷五辛　　　　　　　　　　　　　　.
　    　　　　是則名為第一增進修行漸次　　　　　　　　　　.
八  7:　[HR] 　第二增進修行漸次
八  7:　　云何正性　　　　　　　　　　　　　　　　　　　　.
八  8:　　　　如是眾生入三摩地要先嚴持清淨戒律　　　　　　.
　    　　　　永斷婬心不餐酒肉以火淨食無噉生氣　　　　　　.
　    　　　　是修行人若不斷婬及與殺生出三界者無有是處　　.
八  9:　　　　當觀婬欲猶如毒蛇如見怨賊　　　　　　　　　　.
　    　　　　先持聲聞四棄八棄執身不動　　　　　　　　　　.
　    　　　　後行菩薩清淨律儀執心不起　　　　　　　　　　.
八 10:　　　　禁戒成就則於世間永無相生相殺之業　　　　　　.
　    　　　　偷劫不行無相負累亦於世間不還宿債　　　　　　.
　    　　　　是清淨人修三摩地父母肉身不須天眼　　　　　　.
　    　　　　自然觀見十方世界睹佛聞法親奉聖旨　　　　　　.
　    　　　　得大神通遊十方界宿命清淨得無艱險　　　　　　.
八 11:　　　　是則名為第二增進修行漸次　　　　　　　　　　.
八 12:　[HR] 　第三增進修行漸次
八 12:　　云何現業　　　　　　　　　　　　　　　　　　　　.
　    　　　　如是清淨持禁戒人心無貪婬　　　　　　　　　　.
　    　　　　於外六塵不多流逸　　　　　　　　　　　　　　.
　    　　　　因不流逸旋元自歸塵既不緣根無所偶　　　　　　.
　    　　　　反流全一六用不行　　　　　　　　　　　　　　.
八 13:　　　　十方國土皎然清淨譬如琉璃內懸明月　　　　　　.
　    　　　　身心快然妙圓平等獲大安隱　　　　　　　　　　.
　    　　　　一切如來密圓淨妙皆現其中　　　　　　　　　　.
　    　　　　是人即獲無生法忍　　　　　　　　　　　　　　.
八 14:　　　　從是漸修隨所發行安立聖位　　　　　　　　　　.
　    　　　　是則名為第三增進修行漸次　　　　　　　　　　.
八 14:　[HR] 　乾慧地
　    　　是善男子欲愛乾枯根境不偶　　　　　　　　　　　　.
　    　　　　現前殘質不復續生執心虛明純是智慧　　　　　　.
　    　　　　慧性明圓鎣十方界乾有其慧名乾慧地　　　　　　.
八 15:　[HR] 　十心
八 15:　　欲習初乾未與如來法流水接　　　　　　　　　　　　.
　    　　　　即以此心中中流入圓妙開敷　　　　　　　　　　.
八 16:　　從真妙圓重發真妙　　　　　　　　　　　　　　　　.
　    　　　　妙信常住一切妄想滅盡無餘中道純真　　　　　　.
　    　　　　名信心住　　　　　　　　　　　　　　　　　　.
八 17:　　真信明瞭一切圓通陰處界三不能為礙　　　　　　　　.
　    　　　　如是乃至過去未來無數劫中　　　　　　　　　　.
　    　　　　捨身受身一切習氣皆現在前　　　　　　　　　　.
　    　　　　是善男子皆能憶念得無遺忘　　　　　　　　　　.
　    　　　　名念心住　　　　　　　　　　　　　　　　　　.
八 18:　　妙圓純真真精發化無始習氣通一精明　　　　　　　　.
　    　　　　唯以精明進趣真淨名精進心　　　　　　　　　　.
八 19:　　心精現前純以智慧名慧心住　　　　　　　　　　　　.
八 20:　　執持智明周遍寂湛寂妙常凝名定心住　　　　　　　　.
八 21:　　定光發明明性深入唯進無退名不退心　　　　　　　　.
八 22:　　心進安然保持不失十方如來氣分交接名護法心　　　　.
八 23:　　覺明保持能以妙力回佛慈光向佛安住　　　　　　　　.
　    　　　　猶如雙鏡光明相對其中妙影重重相入　　　　　　.
　    　　　　名回向心　　　　　　　　　　　　　　　　　　.
八 24:　　心光密回獲佛常凝無上妙淨　　　　　　　　　　　　.
　    　　　　安住無為得無遺失名戒心住　　　　　　　　　　.
八 25:　　住戒自在能遊十方所去隨願名願心住　　　　　　　　.
八 26:　[HR] 　十住
八 26:　　是善男子以真方便發此十心　　　　　　　　　　　　.
　    　　　　心精發暉十用涉入圓成一心名發心住　　　　　　.
八 27:　　心中發明如淨琉璃內現精金　　　　　　　　　　　　.
　    　　　　以前妙心履以成地名治地住　　　　　　　　　　.
八 28:　　心地涉知俱得明了遊履十方得無留礙名修行住　　　　.
八 29:　　行與佛同受佛氣分如中陰身自求父母　　　　　　　　.
　    　　　　陰信冥通入如來種名生貴住　　　　　　　　　　.
八 30:　　既遊道胎親奉覺胤如胎已成人相不缺名方便具足住　　.
八 31:　　容貌如佛心相亦同名正心住　　　　　　　　　　　　.
八 32:　　身心合成日益增長名不退住　　　　　　　　　　　　.
八 33:　　十身靈相一時具足名童真住　　　　　　　　　　　　.
八 34:　　形成出胎親為佛子名法王子住　　　　　　　　　　　.
八 35:　　表以成人如國大王以諸國事分委太子　　　　　　　　.
　    　　　　彼剎利王世子長成陳列灌頂名灌頂住　　　　　　.
八 36:　[HR] 　十行
八 36:　　是善男子成佛子已具足無量如來妙德　　　　　　　　.
　    　　　　十方隨順名歡喜行　　　　　　　　　　　　　　.
八 37:　　善能利益一切眾生名饒益行　　　　　　　　　　　　.
八 38:　　自覺覺他得無違拒名無瞋恨行　　　　　　　　　　　.
八 39:　　種類出生窮未來際三世平等十方通達名無盡行　　　　.
八 40:　　一切合同種種法門得無差誤名離癡亂行　　　　　　　.
八 41:　　則於同中顯現群異一一異相各各見同名善現行　　　　.
八 42:　　如是乃至十方虛空滿足微塵一一塵中現十方界　　　　.
　    　　　　現塵現界不相留礙名無著行　　　　　　　　　　.
八 43:　　種種現前咸是第一波羅密多名尊重行　　　　　　　　.
八 44:　　如是圓融能成十方諸佛軌則名善法行　　　　　　　　.
八 45:　　一一皆是清淨無漏一真無為性本然故名真實行　　　　.
八 46:　[HR] 　十回向
八 46:　　是善男子滿足神通成佛事已純潔精真　　　　　　　　.
　    　　　　遠諸留患當度眾生滅除度相回無為心　　　　　　.
　    　　　　向涅槃路名救護一切眾生離眾生相回向　　　　　.
八 47:　　壞其可壞遠離諸離名不壞回向　　　　　　　　　　　.
八 48:　　本覺湛然覺齊佛覺名等一切佛回向　　　　　　　　　.
八 49:　　精真發明地如佛地名至一切處回向　　　　　　　　　.
八 50:　　世界如來互相涉入得無掛礙　　　　　　　　　　　　.
　    　　　　名無盡功德藏回向　　　　　　　　　　　　　　.
八 51:　　於同佛地地中各各生清淨因　　　　　　　　　　　　.
　    　　　　依因發揮取涅槃道名隨順平等善根回向　　　　　.
八 52:　　真根既成十方眾生皆我本性性圓成就不失眾生　　　　.
　    　　　　名隨順等觀一切眾生回向　　　　　　　　　　　.
八 53:　　即一切法離一切相唯即與離二無所著　　　　　　　　.
　    　　　　名真如相回向　　　　　　　　　　　　　　　　.
八 54:　　真得所如十方無礙名無縛解脫回向　　　　　　　　　.
八 55:　　性德圓成法界量滅名法界無量回向　　　　　　　　　.
八 56:　[HR] 　四加行
八 56:　　是善男子儘是清淨四十一心次成四種妙圓加行　　　　.
八 57:　　即以佛覺用為己心若出未出猶如鑽火欲然其木　　　　.
　    　　　　名為暖地　　　　　　　　　　　　　　　　　　.
八 58:　　又以己心成佛所履若依非依如登高山身入虛空　　　　.
　    　　　　下有微礙名為頂地　　　　　　　　　　　　　　.
八 59:　　心佛二同善得中道如忍事人非懷非出名為忍地　　　　.
八 60:　　數量銷滅迷覺中道二無所目名世第一地　　　　　　　.
八 61:　[HR] 　十地
八 61:　　是善男子　　　　　　　　　　　　　　　　　　　　.
　    　　於大菩提善得通達覺通如來盡佛境界名歡喜地　　　　.
八 62:　　異性入同同性亦滅名離垢地　　　　　　　　　　　　.
八 63:　　淨極明生名發光地　　　　　　　　　　　　　　　　.
八 64:　　明極覺滿名焰慧地　　　　　　　　　　　　　　　　.
八 65:　　一切同異所不能至名難勝地　　　　　　　　　　　　.
八 66:　　無為真如性淨明露名現前地　　　　　　　　　　　　.
八 67:　　盡真如際名遠行地　　　　　　　　　　　　　　　　.
八 68:　　一真如心名不動地　　　　　　　　　　　　　　　　.
八 69:　　　　發真如用名善慧地是諸菩薩從此已往　　　　　　.
八 70:　　　　修習畢功功德圓滿亦自此地名修習位　　　　　　.
八 71:　　慈陰妙雲覆涅槃海名法雲地　　　　　　　　　　　　.
八 72:　[HR] 　明等覺
八 72:　　如來逆流如是菩薩順行而至覺際入交名為等覺　　　　.
　    　[HR] 明滅妄名真立六十聖位轉依號/終

八 73:　[HR] 合結諸位次由三行而成
八 73:　　從乾慧心至等覺已是覺始獲金剛心中初乾慧地　　　　.
八 74:　　如是重重單復十二方盡妙覺成無上道　　　　　　　　.
八 75:　　是種種地皆以金剛觀察如幻十種深喻　　　　　　　　.
　    　　奢摩他中用諸如來毗婆舍那清淨修證漸次深入　　　　.
八 76:　　如是皆以三增進故善能成就五十五位真菩提路　　　　.
八 77:　　作是觀者名為正觀若他觀者名為邪觀　　　　　　　　.

八 78:　[HR] 結成經名以彰圓體圓宗圓用
八 78:　　〇　文殊師利法王子：　　　　　　　　　　　　　　.
　    　　　　當何名是經我及眾生云何奉持　　　　　　　　　.
八 79:　　　　佛：　　　　　　　　　　　　　　　　　　　　.
　    　　　　是經名大佛頂悉怛多般怛羅無上寶印　　　　　　.
　    　　　　　　　　十方如來清淨海眼　　　　　　　　　　.
八 80:　　　　亦名救護親因度脫阿難及此會中性比丘尼　　　　.
　    　　　　　　　　得菩提心入遍知海　　　　　　　　　　.
八 81:　　　　亦名如來密因修證了義　　　　　　　　　　　　.
八 82:　　　　亦名大方廣妙蓮華王十方佛母陀羅尼咒　　　　　.
八 83:　　　　亦名灌頂章句諸菩薩萬行首楞嚴　　　　　　　　.
八 85:　　〇　說是語已即時阿難及諸大眾得蒙如來開示　　　　.
　    　　　　密印般怛羅義兼聞此經了義名目　　　　　　　　.
　    　　　　頓悟禪那修進聖位增上妙理心慮虛凝　　　　　　.
　    　　　　斷除三界修心六品微細煩惱　　　　　　　　　　.

八 87:　[HR] 借破戒惡心為問端廣示七趣差別
八 87:　　　　難：若此妙明真淨妙心本來遍圓　　　　　　　　.
　    　　　　　　如是乃至大地草木蠕動含靈本元真如　　　　.
　    　　　　　　即是如來成佛真體佛體真實　　　　　　　　.
　    　　　　　　云何復有地獄餓鬼畜生修羅人天等道　　　　.
　    　　　　　　此道為復本來自有為是眾生妄習生起　　　　.
八 88:　　　　　：如寶蓮香比丘尼持菩薩戒私行婬欲　　　　　.
　    　　　　　　妄言行婬非殺非偷無有業報　　　　　　　　.
　    　　　　　　發是語已先於女根生大猛火後　　　　　　　.
　    　　　　　　於節節猛火燒然墮無間獄　　　　　　　　　.
　    　　　　　　琉璃大王善星比丘琉璃為誅瞿曇族姓　　　　.
　    　　　　　　善星妄說一切法空生身陷入阿鼻地獄　　　　.
八 89:　　　　　：此諸地獄為有定處為復自然　　　　　　　　.
　    　　　　　　彼彼發業各各私受　　　　　　　　　　　　.
八 90:　　　　佛：快哉此問　　　　　　　　　　　　　　　　.
　    　　　　　　令諸眾生不入邪見汝今諦聽當為汝說　　　　.
八 91:　　一切眾生實本真淨因彼妄見有妄習生　　　　　　　　.
　    　　因此分開內分外分　　　　　　　　　　　　　　　　.
八 92:　　內分即是眾生分內　　　　　　　　　　　　　　　　.
　    　　因諸愛染發起妄情情積不休能生愛水　　　　　　　　.
　    　　是故眾生心憶珍羞口中水出　　　　　　　　　　　　.
　    　　心憶前人或憐或恨目中淚盈　　　　　　　　　　　　.
　    　　貪求財寶心發愛涎舉體光潤　　　　　　　　　　　　.
　    　　心著行婬男女二根自然流液　　　　　　　　　　　　.
　    　　諸愛雖別流結是同潤濕不升自然從墜　　　　　　　　.
　    　　此名內分　　　　　　　　　　　　　　　　　　　　.
八 93:　　外分即是眾生分外　　　　　　　　　　　　　　　　.
　    　　因諸渴仰發明虛想想積不休能生勝氣　　　　　　　　.
　    　　是故眾生心持禁戒舉身輕清　　　　　　　　　　　　.
　    　　心持咒印顧盼雄毅心欲生天夢想飛舉　　　　　　　　.
　    　　心存佛國聖境冥現事善知識自輕身命　　　　　　　　.
　    　　諸想雖別輕舉是同飛動不沈自然超越　　　　　　　　.
　    　　此名外分　　　　　　　　　　　　　　　　　　　　.

八 94:　[HR] 　明純雜升沉
八 94:　　一切世間生死相續生從順習死從變流　　　　　　　　.
　    　　臨命終時未捨暖觸一生善惡俱時頓現　　　　　　　　.
　    　　死逆生順二習相交　　　　　　　　　　　　　　　　.
八 95:　　純想即飛必生天上　　　　　　　　　　　　　　　　.
　    　　　　若飛心中兼福兼慧及與淨願自然心開　　　　　　　　.
　    　　　　見十方佛一切淨土隨願往生　　　　　　　　　　　　.
八 96:　　情少想多輕舉非遠　　　　　　　　　　　　　　　　.
　    　　　　即為飛仙大力鬼王飛行夜叉地行羅剎遊於四天　　　　.
　    　　　　所去無礙　　　　　　　　　　　　　　　　　　　　.
　    　　　　其中若有善願善心護持我法或護禁戒隨持戒人　　　　.
　    　　　　或護神咒隨持咒者或護禪定保綏法忍　　　　　　　　.
　    　　　　是等親住如來座下　　　　　　　　　　　　　　　　.
八 97:　　情想均等不飛不墜生於人間想明斯聰情幽斯鈍　　　　.
八 98:　　情多想少流入橫生重為毛群輕為羽族　　　　　　　　.
八 99:　　七情三想沈下水輪生於火際受氣猛火　　　　　　　　.
　    　　　　身為餓鬼常被焚燒水能害己無食無飲經百千劫　　　　.
八100:　　九情一想下洞火輪身入風火二交過地　　　　　　　　.
　    　　　　輕生有間重生無間二種地獄　　　　　　　　　　　　.
八101:　　純情即沈入阿鼻獄　　　　　　　　　　　　　　　　.
　    　　　　若沈心中有謗大乘毀佛禁戒誑妄說法虛貪信施　　　　.
　    　　　　濫膺恭敬五逆十重更生十方阿鼻地獄　　　　　　　　.

八102:　[HR] 　示地獄趣
八102:　　循造惡業雖則自招眾同分中兼有元地　　　　　　　　.
八103:　　此等皆是彼諸眾生自業所感造十習因受六交報　　　　.
八104:　[HR] 　示地獄趣十因
八104:　　云何十因　　　　　　　　　　　　　　　　　　　　.
　    　　一者婬習交接發於相磨　　　　　　　　　　　　　　.
　    　　　　研磨不休如是故有大猛火光於中發動　　　　　　.
　    　　　　如人以手自相摩觸暖相現前　　　　　　　　　　.
　    　　　　二習相然故有鐵床銅柱諸事　　　　　　　　　　.
　    　　　　是故十方一切如來色目行婬同名欲火　　　　　　.
　    　　　　菩薩見欲如避火坑　　　　　　　　　　　　　　.
八105:　　二者貪習交計發於相吸　　　　　　　　　　　　　　.
　    　　　　吸攬不止如是故有積寒堅冰於中凍冽　　　　　　.
　    　　　　如人以口吸縮風氣有冷觸生　　　　　　　　　　.
　    　　　　二習相陵故有吒吒波波羅羅青赤白蓮寒冰等事　　.
　    　　　　是故十方一切如來色目多求同名貪水　　　　　　.
　    　　　　菩薩見貪如避瘴海　　　　　　　　　　　　　　.
八106:　　三者慢習交陵發於相恃　　　　　　　　　　　　　　.
　    　　　　馳流不息如是故有騰逸奔波積波為水　　　　　　.
　    　　　　如人口舌自相綿味因而水發　　　　　　　　　　.
　    　　　　二習相鼓故有血河灰河熱沙毒海融銅灌吞諸事　　.
　    　　　　是故十方一切如來色目我慢名飲癡水　　　　　　.
　    　　　　菩薩見慢如避巨溺　　　　　　　　　　　　　　.
八107:　　四者瞋習交沖發於相忤　　　　　　　　　　　　　　.
　    　　　　忤結不息心熱發火鑄氣為金　　　　　　　　　　.
　    　　　　如是故有刀山鐵捆劍樹劍輪斧鉞輪鋸　　　　　　.
　    　　　　　　如人銜冤殺氣飛動　　　　　　　　　　　　.
　    　　　　二習相擊故有宮割斬斫剌槌擊諸事　　　　　　　.
　    　　　　是故十方一切如來色目瞋恚名利刀劍　　　　　　.
　    　　　　菩薩見瞋如避誅戮　　　　　　　　　　　　　　.
八108:　　五者詐習交誘發於相調　　　　　　　　　　　　　　.
　    　　　　引起不住如是故有繩木絞校　　　　　　　　　　.
　    　　　　如水浸田草木生長　　　　　　　　　　　　　　.
　    　　　　二習相延故有杻械枷鎖鞭杖撾棒諸事　　　　　　.
　    　　　　是故十方一切如來色目奸偽同名讒賊　　　　　　.
　    　　　　菩薩見詐如畏豺狼　　　　　　　　　　　　　　.
八109:　　六者誑習交欺發於相罔　　　　　　　　　　　　　　.
　    　　　　誣罔不止飛心造奸　　　　　　　　　　　　　　.
　    　　　　如是故有塵土屎尿穢汙不淨　　　　　　　　　　.
　    　　　　　　如塵隨風各無所見　　　　　　　　　　　　.
　    　　　　二習相加故有沒溺騰擲飛墜漂淪諸事　　　　　　.
　    　　　　是故十方一切如來色目欺誑同名劫殺　　　　　　.
　    　　　　菩薩見誑如踐蛇虺　　　　　　　　　　　　　　.
八110:　　七者怨習交嫌發於銜恨　　　　　　　　　　　　　　.
　    　　　　如是故有飛石投瀝匣貯車檻甕盛囊撲　　　　　　.
　    　　　　　　如陰毒人懷抱畜惡　　　　　　　　　　　　.
　    　　　　二習相吞故有投擲擒捉擊射拋撮諸事　　　　　　.
　    　　　　是故十方一切如來色目怨家名違害鬼　　　　　　.
　    　　　　菩薩見怨如飲鴆酒　　　　　　　　　　　　　　.
八111:　　八者見習交明如薩迦耶　　　　　　　　　　　　　　.
　    　　　　　　見戒禁取邪悟諸業發於違拒出生相反　　　　.
　    　　　　如是故有王使主吏證執文籍如行路人來往相見　　.
　    　　　　二習相交故有勘問權詐考訊推鞫察訪披究照明　　.
　    　　　　　　善惡童子手執文簿辭辯諸事　　　　　　　　.
　    　　　　是故十方一切如來色目惡見同名見坑　　　　　　.
　    　　　　菩薩見諸虛妄遍執如臨毒壑　　　　　　　　　　.
八112:　　九者枉習交加發於誣謗　　　　　　　　　　　　　　.
　    　　　　如是故有合山合石碾碨耕磨如讒賊人逼枉良善　　.
　    　　　　二習相排故有押捺搥按蹙漉衡度諸事　　　　　　.
　    　　　　是故十方一切如來色目怨謗同名讒虎　　　　　　.
　    　　　　菩薩見枉如遭霹靂　　　　　　　　　　　　　　.
八113:　　十者訟習交喧發於藏覆　　　　　　　　　　　　　　.
　    　　　　如是故有鑒見照燭如於日中不能藏影　　　　　　.
　    　　　　二習相陳故有惡友業鏡火珠披露宿業對驗諸事　　.
　    　　　　是故十方一切如來色目覆藏同名陰賊　　　　　　.
　    　　　　菩薩觀覆如戴高山履於巨海　　　　　　　　　　.
八114:　[HR] 　示地獄趣六報
八114:　　云何六報　　　　　　　　　　　　　　　　　　　　.
　    　　一切眾生六識造業所招惡報從六根出　　　　　　　　.
八115:　　一者見報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此見業交則臨終時先見猛火滿十方界　　　　　　.
　    　　　　亡者神識飛墜乘煙入無間獄發明二相　　　　　　.
　    　　　　一者明見則能遍見種種惡物生無量畏　　　　　　.
　    　　　　二者暗見寂然不見生無量恐　　　　　　　　　　.
八116:　　　　如是見火　　　　　　　　　　　　　　　　　　.
　    　　　　燒聽能為鑊湯烊銅　　　　　　　　　　　　　　.
　    　　　　燒息能為黑煙紫焰　　　　　　　　　　　　　　.
　    　　　　燒味能為焦丸鐵糜　　　　　　　　　　　　　　.
　    　　　　燒觸能為熱灰爐炭　　　　　　　　　　　　　　.
　    　　　　燒心能生星火迸灑煽鼓空界　　　　　　　　　　.
八117:　　二者聞報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此聞業交則臨終時先見波濤沒溺天地　　　　　　.
　    　　　　亡者神識降注乘流入無間獄發明二相　　　　　　.
　    　　　　一者開聽聽種種鬧精神茅亂　　　　　　　　　　.
　    　　　　二者閉聽寂無所聞幽魄沈沒　　　　　　　　　　.
八118:　　　　如是聞波　　　　　　　　　　　　　　　　　　.
　    　　　　注聞則能為責為詰　　　　　　　　　　　　　　.
　    　　　　注見則能為雷為吼為惡毒氣　　　　　　　　　　.
　    　　　　注息則能為雨為霧灑諸毒蟲周滿身體　　　　　　.
　    　　　　注味則能為膿為血種種雜穢　　　　　　　　　　.
　    　　　　注觸則能為畜為鬼為糞為尿　　　　　　　　　　.
　    　　　　注意則能為電為雹摧碎心魄　　　　　　　　　　.
八119:　　三者嗅報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此嗅業交則臨終時先見毒氣充塞遠近　　　　　　.
　    　　　　亡者神識從地踴出入無間獄發明二相　　　　　　.
　    　　　　一者通聞被諸惡氣熏極心擾　　　　　　　　　　.
　    　　　　二者塞聞氣掩不通悶絕於地　　　　　　　　　　.
八120:　　　　如是嗅氣　　　　　　　　　　　　　　　　　　.
　    　　　　沖息則能為質為履沖見則能為火為炬　　　　　　.
　    　　　　沖聽則能為沒為溺為洋為沸　　　　　　　　　　.
　    　　　　沖味則能為餒為爽　　　　　　　　　　　　　　.
　    　　　　沖觸則能為綻為爛為大肉山有百千眼無量咂食　　.
　    　　　　沖思則能為灰為瘴為飛砂瀝擊碎身體　　　　　　.
八121:　　四者味報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此味業交則臨終時先見鐵網猛焰熾烈周覆世界　　.
　    　　　　亡者神識下透掛網倒懸其頭入無間獄發明二相　　.
　    　　　　一者吸氣結成寒冰凍裂身肉　　　　　　　　　　.
　    　　　　二者吐氣飛為猛火焦爛骨髓　　　　　　　　　　.
八122:　　　　如是嘗味　　　　　　　　　　　　　　　　　　.
　    　　　　歷嘗則能為承為忍　　　　　　　　　　　　　　.
　    　　　　歷見則能為然金石　　　　　　　　　　　　　　.
　    　　　　歷聽則能為利兵刃　　　　　　　　　　　　　　.
　    　　　　歷息則能為大鐵籠彌覆國土　　　　　　　　　　.
　    　　　　歷觸則能為弓為箭為弩為射　　　　　　　　　　.
　    　　　　歷思則能為飛熱鐵從空雨下　　　　　　　　　　.
八123:　　五者觸報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此觸業交則臨終時先見大山四面來合無復出路　　.
　    　　　　亡者神識見大鐵城火蛇火狗虎狼師子牛頭獄卒　　.
　    　　　　馬頭羅剎手執鎗茅驅入城門向無間獄發明二相　　.
　    　　　　一者合觸合山逼體骨肉血潰　　　　　　　　　　.
　    　　　　二者離觸刀劍觸身心肝屠裂　　　　　　　　　　.
八124:　　　　如是合觸　　　　　　　　　　　　　　　　　　.
　    　　　　歷觸則能為道為觀為廳為案　　　　　　　　　　.
　    　　　　歷見則能為燒為爇　　　　　　　　　　　　　　.
　    　　　　歷聽則能為撞為擊為剚為射　　　　　　　　　　.
　    　　　　歷息則能為括為袋為考為縛　　　　　　　　　　.
　    　　　　歷嘗則能為耕為鉗為斬為截　　　　　　　　　　.
　    　　　　歷思則能為墜為飛為煎為炙　　　　　　　　　　.
八125:　　六者思報招引惡果　　　　　　　　　　　　　　　　.
　    　　　　此思業交則臨終時先見惡風吹壞國土　　　　　　.
　    　　　　亡者神識被吹上空旋落乘風墮無間獄發明二相　　.
　    　　　　一者不覺迷極則荒奔走不息　　　　　　　　　　.
　    　　　　二者不迷覺知則苦無量煎燒痛深難忍　　　　　　.
八126:　　　　如是邪思　　　　　　　　　　　　　　　　　　.
　    　　　　結思則能為方為所　　　　　　　　　　　　　　.
　    　　　　結見則能為鑒為證　　　　　　　　　　　　　　.
　    　　　　結聽則能為大合石為冰為霜為土為霧　　　　　　.
　    　　　　結息則能為大火車火船火檻　　　　　　　　　　.
　    　　　　結嘗則能為大叫喚為悔為泣　　　　　　　　　　.
　    　　　　結觸則能為大為小為一日中萬生萬死為偃為仰　　.
八127:　　是名地獄十因六果皆是眾生迷妄所造　　　　　　　　.
八128:　[HR] 　別明因果輕重
八128:　　若諸眾生惡業同造入阿鼻獄受無量苦經無量劫　　　　.
八129:　　六根各造及彼所作兼境兼根是人則入八無間獄　　　　.
八130:　　身口意三作殺盜婬是人則入十八地獄　　　　　　　　.
八131:　　三業不兼中間或為一殺一盜是人則入三十六地獄　　　.
八132:　　見見一根單犯一業是人則入一百八地獄　　　　　　　.
八133:　　由是眾生別作別造於世界中　　　　　　　　　　　　.
　    　　入同分地妄想發生非本來有　　　　　　　　　　　　.

八134:　[HR] 　示鬼趣
八134:　　是諸眾生非破律儀犯菩薩戒毀佛涅槃　　　　　　　　.
　    　　諸餘雜業歷劫燒然後還罪畢受諸鬼形　　　　　　　　.
八135:　　若於本因　　　　　　　　　　　　　　　　　　　　.
　    　　貪物為罪是人罪畢遇物成形名為怪鬼　　　　　　　　.
八136:　　貪色為罪是人罪畢遇風成形名為魃鬼　　　　　　　　.
八137:　　貪惑為罪是人罪畢遇畜成形名為魅鬼　　　　　　　　.
八138:　　貪恨為罪是人罪畢遇蟲成形名蠱毒鬼　　　　　　　　.
八139:　　貪憶為罪是人罪畢遇衰成形名為癘鬼　　　　　　　　.
八140:　　貪傲為罪是人罪畢遇氣成形名為餓鬼　　　　　　　　.
八141:　　貪罔為罪是人罪畢遇幽為形名為魘鬼　　　　　　　　.
八142:　　貪明為罪是人罪畢遇精為形名魍魎鬼　　　　　　　　.
八143:　　貪成為罪是人罪畢遇明為形名役使鬼　　　　　　　　.
八144:　　貪黨為罪是人罪畢遇人為形名傳送鬼　　　　　　　　.

八145:　[HR] 　畜生趣
八145:　　是人皆以純情墜落業火燒乾上出為鬼　　　　　　　　.
　    　　此等皆是自妄想業之所招引　　　　　　　　　　　　.
　    　　若悟菩提則妙圓明本無所有　　　　　　　　　　　　.
八146:　　鬼業既盡則情與想二俱成空　　　　　　　　　　　　.
　    　　方於世間與元負人怨對相值身為畜生酬其宿債　　　　.
八147:　　物怪之鬼物銷報盡生於世間多為梟類　　　　　　　　.
八148:　　風魃之鬼風銷報盡生於世間多為咎徵　　　　　　　　.
八149:　　一切異類畜魅之鬼畜死報盡生於世間多為狐類　　　　.
八150:　　蟲蠱之鬼蠱滅報盡生於世間多為毒類　　　　　　　　.
八151:　　衰癘之鬼衰窮報盡生於世間多為蛔類　　　　　　　　.
八152:　　受氣之鬼氣銷報盡生於世間多為食類　　　　　　　　.
八153:　　綿幽之鬼幽銷報盡生於世間多為服類　　　　　　　　.
八154:　　和精之鬼和銷報盡生於世間多為應類　　　　　　　　.
八155:　　明靈之鬼明滅報盡生於世間多為休徵　　　　　　　　.
八156:　　一切諸類依人之鬼人亡報盡生於世間多為循類　　　　.
八157:　　是等皆以業火乾枯酬其宿債傍為畜生　　　　　　　　.
　    　　此等亦皆自虛妄業之所招引　　　　　　　　　　　　.
　    　　若悟菩提則此妄緣本無所有　　　　　　　　　　　　.
八158:　　如汝所言寶蓮香等及琉璃王善星比丘　　　　　　　　.
　    　　如是惡業本自發明非從天降　　　　　　　　　　　　.
　    　　亦非地出亦非人與自妄所招還自來受　　　　　　　　.
　    　　菩提心中皆為浮虛妄想凝結　　　　　　　　　　　　.

八145:　[HR] 　明人趣
八159:　　從是畜生酬償先債若彼酬者分越所酬　　　　　　　　.
　    　　此等眾生還復為人反徵其剩　　　　　　　　　　　　.
八160:　　如彼有力兼有福德則於人中不捨人身酬還彼力　　　　.
　    　　若無福者還為畜生償彼餘直　　　　　　　　　　　　.
八161:　　若用錢物或役其力償足自停　　　　　　　　　　　　.
　    　　如於中間殺彼身命或食其肉　　　　　　　　　　　　.
　    　　如是乃至經微塵劫相食相誅　　　　　　　　　　　　.
　    　　猶如轉輪互為高下無有休息　　　　　　　　　　　　.
　    　　除奢摩他及佛出世不可停寢　　　　　　　　　　　　.
八162:　　汝今應知彼梟倫者酬足復形生人道中參合頑類　　　　.
八163:　　彼咎徵者酬足復形生人道中參合異類　　　　　　　　.
八164:　　彼狐倫者酬足復形生人道中參於庸類　　　　　　　　.
八165:　　彼毒倫者酬足復形生人道中參合很類　　　　　　　　.
八166:　　彼蛔倫者酬足復形生人道中參合微類　　　　　　　　.
八167:　　彼食倫者酬足復形生人道中參合柔類　　　　　　　　.
八168:　　彼服倫者酬足復形生人道中參合勞類　　　　　　　　.
八169:　　彼應倫者酬足復形生人道中參於文類　　　　　　　　.
八170:　　彼休徵者酬足復形生人道中參合明類　　　　　　　　.
八171:　　彼諸循倫酬足復形生人道中參於達類　　　　　　　　.
八172:　　是等皆以宿債畢酬復形人道　　　　　　　　　　　　.
　    　　皆無始來業計顛倒相生相殺　　　　　　　　　　　　.
　    　　不遇如來不聞正法於塵勞中法爾輪轉　　　　　　　　.
　    　　此輩名為可憐愍者　　　　　　　　　　　　　　　　.

八173:　[HR] 　示仙趣
八173:　　復有從人不依正覺修三摩地　　　　　　　　　　　　.
　    　　別修妄念存想固形遊於山林人不及處有十種仙　　　　.
八174:　　彼諸眾生堅固服餌而不休息食道圓成名地行仙　　　　.
八175:　　堅固草木而不休息藥道圓成名飛行仙　　　　　　　　.
八176:　　堅固金石而不休息化道圓成名遊行仙　　　　　　　　.
八177:　　堅固動止而不休息氣精圓成名空行仙　　　　　　　　.
八178:　　堅固津液而不休息潤德圓成名天行仙　　　　　　　　.
八179:　　堅固精色而不休息吸粹圓成名通行仙　　　　　　　　.
八180:　　堅固咒禁而不休息術法圓成名道行仙　　　　　　　　.
八181:　　堅固思念而不休息思憶圓成名照行仙　　　　　　　　.
八182:　　堅固交遘而不休息感應圓成名精行仙　　　　　　　　.
八183:　　堅固變化而不休息覺悟圓成名絕行仙　　　　　　　　.
八184:　　是等皆於人中練心不修正覺別得生理壽千萬歲　　　　.
　    　　休止深山或大海島絕於人境　　　　　　　　　　　　.
　    　　斯亦輪迴妄想流轉不修三昧報盡還來散入諸趣　　　　.

八185:　[HR] 　示欲界天趣
八185:　　諸世間人不求常住未能捨諸妻妾恩愛　　　　　　　　.
　    　　於邪婬中心不流逸澄瑩生明　　　　　　　　　　　　.
　    　　命終之後鄰於日月如是一類，名四天王天　　　　　　.
八186:　　於己妻房婬愛微薄於淨居時不得全味　　　　　　　　.
　    　　命終之後超日月明居人間頂如是一類名忉利天　　　　.
八187:　　逢欲暫交去無思憶於人間世動少靜多　　　　　　　　.
　    　　命終之後於虛空中朗然安住日月光明上照不及　　　　.
　    　　是諸人等自有光明如是一類名須焰摩天　　　　　　　.
八188:　　一切時靜有應觸來未能違戾　　　　　　　　　　　　.
　    　　命終之後上升精微不接下界諸人天境　　　　　　　　.
　    　　乃至劫壞三災不及如是一類名兜率陀天　　　　　　　.
八189:　　我無欲心應汝行事於橫陳時味如嚼蠟　　　　　　　　.
　    　　命終之後生越化地如是一類名樂變化天　　　　　　　.
八190:　　無世間心同世行事於行事交了然超越　　　　　　　　.
　    　　命終之後遍能出超化無化境如是一類名他化自在天　　.
八191:　　如是六天形雖出動心跡尚交　　　　　　　　　　　　.
　    　　自此已還名為欲界　　　　　　　　　　　　　　.`);
