lines.push(
`九  1:　[HR] 　示色界天趣
九  1:　[HR] 　　初禪
九  1:　　世間一切所修心人不假禪那無有智慧　　　　　　　　.
　    　　但能執身不行婬欲若行若坐想念俱無　　　　　　　　.
　    　　愛染不生無留欲界是人應念身為梵侶　　　　　　　　.
　    　　如是一類名梵眾天　　　　　　　　　　　　　　　　.
九  2:　　欲習既除離欲心現於諸律儀愛樂隨順　　　　　　　　.
　    　　是人應時能行梵德如是一類名梵輔天　　　　　　　　.
九  3:　　身心妙圓威儀不缺清淨禁戒加以明悟　　　　　　　　.
　    　　是人應時能統梵眾為大梵王如是一類名大梵天　　　　.
九  4:　　此三勝流一切苦惱所不能逼雖非正修真三摩地　　　　.
　    　　清淨心中諸漏不動名為初禪　　　　　　　　　　　　.
九  5:　[HR] 　　二禪
九  5:　　其次梵天統攝梵人圓滿梵行澄心不動寂湛生光　　　　.
　    　　如是一類名少光天為　　　　　　　　　　　　　　　.
九  6:　　光光相然照耀無盡映十方界遍成琉璃　　　　　　　　.
　    　　如是一類名無量光天　　　　　　　　　　　　　　　.
九  7:　　吸持圓光成就教體發化清淨應用無盡　　　　　　　　.
　    　　如是一類名光音天　　　　　　　　　　　　　　　　.
九  8:　　此三勝流一切憂懸所不能逼雖非正修真三摩地　　　　.
　    　　清淨心中粗漏已伏名為二禪　　　　　　　　　　　　.
九  9:　[HR] 　　三禪
九  9:　　如是天人圓光成音披音露妙發成精行通寂滅樂　　　　.
　    　　如是一類名少淨天　　　　　　　　　　　　　　　　.
九 10:　　淨空現前引發無際身心輕安成寂滅樂　　　　　　　　.
　    　　如是一類名無量淨天　　　　　　　　　　　　　　　.
九 11:　　世界身心一切圓淨淨德成就勝托現前歸寂滅樂　　　　.
　    　　如是一類名遍淨天　　　　　　　　　　　　　　　　.
九 12:　　此三勝流具大隨順身心安隱得無量樂　　　　　　　　.
　    　　雖非正得真三摩地安隱心中歡喜畢具名為三禪　　　　.
九 13:　[HR] 　　四禪
九 13:　[HR] 　　　明凡夫四天
九 13:　　復次天人不逼身心苦因已盡樂非常住久必壞生　　　　.
　    　　苦樂二心俱時頓捨粗重相滅淨福性生　　　　　　　　.
　    　　如是一類名福生天　　　　　　　　　　　　　　　　.
九 14:　　捨心圓融勝解清淨福無遮中得妙隨順窮未來際　　　　.
　    　　如是一類名福愛天　　　　　　　　　　　　　　　　.
九 15:　　從是天中有二歧路　　　　　　　　　　　　　　　　.
　    　　若於先心無量淨光福德圓明修證而住　　　　　　　　.
　    　　如是一類名廣果天　　　　　　　　　　　　　　　　.
九 16:　　若於先心雙厭苦樂精研捨心相續不斷　　　　　　　　.
　    　　圓窮捨道身心俱滅心慮灰凝經五百劫　　　　　　　　.
　    　　是人既以生滅為因不能發明不生滅性　　　　　　　　.
　    　　　　初半劫滅後半劫生　　　　　　　　　　　　　　.
　    　　如是一類名無想天　　　　　　　　　　　　　　　　.
九 17:　　此四勝流一切世間諸苦樂境所不能動　　　　　　　　.
　    　　雖非無為真不動地有所得心功用純熟名為四禪　　　　.
九 18:　[HR] 　　　明不還五天
九 18:　　此中復有五不還天於下界中九品習氣俱時滅盡　　　　.
　    　　苦樂雙忘下無卜居故於捨心眾同分中安立居處　　　　.
九 19:　　苦樂兩滅鬥心不交如是一類名無煩天　　　　　　　　.
九 20:　　機括獨行研交無地如是一類，名無熱天　　　　　　　.
九 21:　　十方世界妙見圓澄更無塵象一切沈垢　　　　　　　　.
　    　　如是一類名善見天　　　　　　　　　　　　　　　　.
九 22:　　精見現前陶鑄無礙如是一類名善現天　　　　　　　　.
九 23:　　究竟群幾窮色性性入無邊際如是一類名色究竟天　　　.
九 24:　　此不還天彼諸四禪四位天王獨有欽聞不能知見　　　　.
　    　　如今世間曠野深山聖道場地皆阿羅漢所住持故　　　　.
　    　　世間粗人所不能見　　　　　　　　　　　　　　　　.
九 25:　　是十八天獨行無交未盡形累自此已還名為色界　　　　.

九 26:　[HR] 　示無色界趣
九 26:　　從是有頂色邊際中其間復有二種歧路　　　　　　　　.
　    　　若於捨心發明智慧慧光圓通便出塵界　　　　　　　　.
　    　　成阿羅漢入菩薩乘如是一類名為回心大阿羅漢　　　　.
九 27:　　若在捨心捨厭成就覺身為礙銷礙入空　　　　　　　　.
　    　　如是一類名為空處　　　　　　　　　　　　　　　　.
九 28:　　諸礙既銷無礙無滅其中唯留阿賴耶識　　　　　　　　.
　    　　全於末那半分微細如是一類名為識處　　　　　　　　.
九 29:　　空色既亡識心都滅十方寂然回無攸往　　　　　　　　.
　    　　如是一類名無所有處　　　　　　　　　　　　　　　.
九 30:　　識性不動以滅窮研於無盡中發宣盡性　　　　　　　　.
　    　　如存不存若盡非盡　　　　　　　　　　　　　　　　.
　    　　如是一類名為非想非非想處　　　　　　　　　　　　.
九 31:　　此等窮空不盡空理　　　　　　　　　　　　　　　　.
　    　　從不還天聖道窮者如是一類名不回心鈍阿羅漢　　　　.
　    　　若從無想諸外道天窮空不歸迷漏無聞便入輪轉　　　　.
九 32:　　是諸天上各各天人則是凡夫業果酬答答盡入輪　　　　.
　    　　彼之天王即是菩薩遊三摩提漸次增進　　　　　　　　.
　    　　回向聖倫所修行路　　　　　　　　　　　　　　　　.
九 33:　　是四空天身心滅盡定性現前無業果色　　　　　　　　.
　    　　從此逮終名無色界　　　　　　　　　　　　　　　　.
九 34:　　此皆不了妙覺明心積妄發生妄有三界　　　　　　　　.
　    　　中間妄隨七趣沈溺補特伽羅各從其類　　　　　　　　.

九 35:　[HR] 　示修羅趣
九 35:　　是三界中復有四種阿修羅類　　　　　　　　　　　　.
九 36:　　若於鬼道以護法力乘通入空　　　　　　　　　　　　.
　    　　此阿修羅從卵而生鬼趣所攝　　　　　　　　　　　　.
九 37:　　若於天中降德貶墜其所卜居鄰於日月　　　　　　　　.
　    　　此阿修羅從胎而出人趣所攝　　　　　　　　　　　　.
九 38:　　有修羅王執持世界力洞無畏　　　　　　　　　　　　.
　    　　能與梵王及天帝釋四天爭權　　　　　　　　　　　　.
　    　　此阿修羅因變化有天趣所攝　　　　　　　　　　　　.
九 39:　　別有一分下劣修羅生大海心沈水穴口　　　　　　　　.
　    　　旦遊虛空暮歸水宿　　　　　　　　　　　　　　　　.
　    　　此阿修羅因濕氣有畜生趣攝　　　　　　　　　　　　.

九 40:　[HR] 　結示勸修
九 40:　　如是地獄餓鬼畜生人及神仙天洎修羅　　　　　　　　.
　    　　精研七趣皆是昏沈諸有為相妄想受生妄想隨業　　　　.
　    　　於妙圓明無作本心皆如空華元無所著　　　　　　　　.
　    　　但一虛妄更無根緒　　　　　　　　　　　　　　　　.
九 41:　　此等眾生不識本心受此輪迴經無量劫不得真淨　　　　.
　    　　皆由隨順殺盜婬故　　　　　　　　　　　　　　　　.
　    　　反此三種又則出生無殺盜婬有名鬼倫無名天趣　　　　.
　    　　有無相傾起輪迴性　　　　　　　　　　　　　　　　.
　    　　若得妙發三摩提者則妙常寂有無二無無二亦滅　　　　.
　    　　尚無不殺不偷不婬云何更隨殺盜婬事　　　　　　　　.
　    　　不斷三業各各有私因各各私眾私同分非無定處　　　　.
九 42:　　自妄發生生妄無因無可尋究　　　　　　　　　　　　.
　    　　汝勖修行欲得菩提要除三惑　　　　　　　　　　　　.
　    　　不盡三惑縱得神通皆是世間有為功用　　　　　　　　.
　    　　習氣不滅落於魔道雖欲除妄倍加虛偽　　　　　　　　.
　    　　如來說為可哀憐者汝妄自造非菩提咎　　　　　　　　.
　    　　作是說者名為正說若他說者即魔王說　　　　　　　　.

　    　[HR] 借破戒惡心為問端廣示七趣差別/終

九 43:　[HR] 借無聞比丘為語端明五陰魔境

九 43:　　〇　即時如來將罷法座於師子床　　　　　　　　　　.
　    　　　　攬七寶几回紫金山再來仉倚普告大眾及阿難　　　.
九 44:　　　　佛：汝等有學緣覺聲聞　　　　　　　　　　　　.
　    　　　　　　今日回心趣大菩提無上妙覺　　　　　　　　.
　    　　　　　　吾今已說真修行法　　　　　　　　　　　　.
　    　　　　　　汝猶未識修奢摩他毗婆舍那微細魔事　　　　.
九 45:　　　　　：魔境現前汝不能識洗心非正落於邪見　　　　.
　    　　　　　　或汝陰魔或復天魔或著鬼神或遭魑魅　　　　.
　    　　　　　　心中不明認賊為子又復於中得少為足　　　　.
　    　　　　　　如第四禪無聞比丘妄言證聖　　　　　　　　.
　    　　　　　　天報已畢衰相現前謗阿羅漢　　　　　　　　.
　    　　　　　　身遭後有墮阿鼻獄　　　　　　　　　　　　.
九 46:　　　　　：汝應諦聽吾今為汝仔細分別　　　　　　　　.

九 48:　　有漏世界十二類生本覺妙明覺圓心體　　　　　　　　.
　    　　與十方佛無二無別　　　　　　　　　　　　　　　　.
　    　　由汝妄想迷理為咎癡愛發生　　　　　　　　　　　　.
　    　　生發遍迷故有空性化迷不息有世界生　　　　　　　　.
九 49:　　則此十方微塵國土非無漏者皆是迷頑妄想安立　　　　.
　    　　當知虛空生汝心內猶如片雲點太清裏　　　　　　　　.
　    　　況諸世界在虛空耶　　　　　　　　　　　　　　　　.
　    　　汝等一人發真歸元此十方空皆悉銷殞　　　　　　　　.
　    　　云何空中所有國土而不振裂　　　　　　　　　　　　.
九 50:　　汝輩修禪飾三摩地　　　　　　　　　　　　　　　　.
　    　　十方菩薩及諸無漏大阿羅漢心精通吻當處湛然　　　　.
九 51:　　一切魔王及與鬼神諸凡夫天見其宮殿無故崩裂　　　　.
　    　　大地振坼水陸飛騰無不驚懾凡夫昏暗不覺遷訛　　　　.
　    　　彼等咸得五種神通唯除漏盡戀此塵勞　　　　　　　　.
　    　　如何令汝摧裂其處　　　　　　　　　　　　　　　　.
　    　　是故鬼神及諸天魔魍魎妖精於三昧時僉來惱汝　　　　.
九 52:　　然彼諸魔雖有大怒彼塵勞內汝妙覺中　　　　　　　　.
　    　　如風吹光如刀斷水了不相觸　　　　　　　　　　　　.
　    　　汝如沸湯彼如堅冰暖氣漸鄰不日銷殞　　　　　　　　.
　    　　徒恃神力但為其客　　　　　　　　　　　　　　　　.
九 53:　　成就破亂由汝心中五陰主人主人若迷客得其便　　　　.
九 54:　　當處禪那覺悟無惑則彼魔事無奈汝何　　　　　　　　.
　    　　陰銷入明則彼群邪咸受幽氣　　　　　　　　　　　　.
　    　　明能破暗近自銷殞如何取留擾亂禪定　　　　　　　　.
九 55:　　若不明悟被陰所迷則汝阿難必為魔子成就魔人　　　　.
　    　　如摩登伽殊為眇劣彼唯咒汝破佛律儀　　　　　　　　.
　    　　八萬行中祗毀一戒心清淨故尚未淪溺　　　　　　　　.
　    　　此乃隳汝寶覺全身如宰臣家忽逢籍沒　　　　　　　　.
　    　　宛轉零落無可哀救　　　　　　　　　　　　　　　　.

九 56:　[HR] 　明色陰
九 56:　　汝坐道場銷落諸念其念若盡則諸離念一切精明　　　　.
　    　　動靜不移憶忘如一當住此處入三摩提如明目人　　　　.
　    　　處大幽暗精性妙淨心未發光此則名為色陰區宇　　　　.
九 57:　　若目明朗十方洞開無復幽黯名色陰盡　　　　　　　　.
　    　　是人則能超越劫濁　　　　　　　　　　　　　　　　.
　    　　觀其所由堅固妄想以為其本　　　　　　　　　　　　.

九 58:　　當在此中精研妙明四大不織少選之間身能出礙　　　　.
　    　　此名精明流溢前境斯但功用暫得如是非為聖證　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 59:　　復以此心精研妙明其身內徹　　　　　　　　　　　　.
　    　　是人忽然於其身內拾出蟯蛔身相宛然亦無傷毀　　　　.
　    　　此名精明流溢形體斯但精行暫得如是非為聖證　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 60:　　又以此心內外精研其時魂魄意志精神除執受身　　　　.
　    　　餘皆涉入互為賓主　　　　　　　　　　　　　　　　.
　    　　忽於空中聞說法聲或聞十方同敷密義　　　　　　　　.
　    　　此名精魄遞相離合成就善種暫得如是非為聖證　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 61:　　又以此心澄露皎徹內光發明十方遍作閻浮檀色　　　　.
　    　　一切種類化為如來於時忽見毗盧遮那踞天光台　　　　.
　    　　千佛圍繞百億國土及與蓮華俱時出現　　　　　　　　.
　    　　此名心魂靈悟所染心光研明照諸世界　　　　　　　　.
　    　　暫得如是非為聖證　　　　　　　　　　　　　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 62:　　又以此心精研妙明觀察不停抑按降伏制止超越　　　　.
　    　　於時忽然十方虛空成七寶色或百寶色　　　　　　　　.
　    　　同時遍滿不相留礙青黃赤白各各純現　　　　　　　　.
　    　　此名抑按功力逾分暫得如是非為聖證　　　　　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 63:　　又以此心研究澄徹精光不亂　　　　　　　　　　　　.
　    　　忽於夜半在暗室內見種種物不殊白晝　　　　　　　　.
　    　　而暗室物亦不除滅此名心細密澄其見所視洞幽　　　　.
　    　　暫得如是非為聖證　　　　　　　　　　　　　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 64:　　又以此心圓入虛融四體忽然同於草木　　　　　　　　.
　    　　火燒刀斫曾無所覺　　　　　　　　　　　　　　　　.
　    　　又則火光不能燒爇縱割其肉猶如削木　　　　　　　　.
　    　　此名塵並排四大性一向入純暫得如是非為聖證　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 65:　　又以此心成就清淨淨心功極　　　　　　　　　　　　.
　    　　忽見大地十方山河皆成佛國具足七寶光明遍滿　　　　.
　    　　又見恒沙諸佛如來遍滿空界樓殿華麗　　　　　　　　.
　    　　下見地獄上觀天宮得無障礙　　　　　　　　　　　　.
　    　　此名欣厭凝想日深想久化成非為聖證　　　　　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 66:　　又以此心研究深遠忽於中夜遙見遠方市井街巷　　　　.
　    　　親族眷屬或聞其語　　　　　　　　　　　　　　　　.
　    　　此名迫心逼極飛出故多隔見非為聖證　　　　　　　　.
　    　　不作聖心名善境界若作聖解即受群邪　　　　　　　　.

九 67:　　又以此心研究精極見善知識形體變移　　　　　　　　.
　    　　少選無端種種遷改此名邪心含受魑魅　　　　　　　　.
　    　　或遭天魔入其心腹無端說法通達妙義非為聖證　　　　.
　    　　不作聖心魔事銷歇若作聖解即受群邪　　　　　　　　.

九 68:　　如是十種禪那現境皆是色陰用心交互故現斯事　　　　.
　    　　眾生頑迷不自忖量逢此因緣迷不自識謂言登聖　　　　.
　    　　大妄語成墮無間獄　　　　　　　　　　　　　　　　.
　    　　汝等當依如來滅後於末法中宣示斯義　　　　　　　　.
　    　　無令天魔得其方便保持覆護成無上道　　　　　　　　.

九 69:　[HR] 　明受陰
九 69:　　彼善男子修三摩提奢摩他中色陰盡者　　　　　　　　.
　    　　見諸佛心如明鏡中顯現其像　　　　　　　　　　　　.
　    　　若有所得而未能用猶如魘人手足宛然見聞不惑　　　　.
　    　　心觸客邪而不能動。此則名為受陰區宇　　　　　　　.
九 70:　　若魘咎歇其心離身返觀其面去住自由無復留礙　　　　.
　    　　名受陰盡是人則能超越見濁　　　　　　　　　　　　.
　    　　觀其所由虛明妄想以為其本　　　　　　　　　　　　.

九 71:　　彼善男子當在此中得大光耀其心發明內抑過分　　　　.
　    　　忽於其處發無窮悲如是乃至觀見蚊蟲猶如赤子　　　　.
　    　　心生憐愍不覺流淚此名功用抑摧過越　　　　　　　　.
　    　　悟則無咎非為聖證覺了不迷久自銷歇　　　　　　　　.
九 72:　　若作聖解則有悲魔入其心腑見人則悲啼泣無限　　　　.
　    　　失於正受當從淪墜　　　　　　　　　　　　　　　　.

九 73:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　勝相現前感激過分　　　　　　　　　　　　　　　　.
　    　　忽於其中生無限勇其心猛利志齊諸佛　　　　　　　　.
　    　　謂三僧只一念能越此名功用陵率過越　　　　　　　　.
　    　　悟則無咎非為聖證覺了不迷久自銷歇　　　　　　　　.
九 74:　　若作聖解則有狂魔入其心腑見人則誇我慢無比　　　　.
　    　　其心乃至上不見佛下不見人失於正受當從淪墜　　　　.

九 75:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　前無新證歸失故居智力衰微入中隳地回無所見　　　　.
　    　　心中忽然生大枯渴於一切時沈憶不散　　　　　　　　.
　    　　將此以為勤精進相此名修心無慧自失　　　　　　　　.
　    　　悟則無咎非為聖證　　　　　　　　　　　　　　　　.
九 76:　　若作聖解則有憶魔入其心腑　　　　　　　　　　　　.
　    　　旦夕撮心懸在一處失於正受當從淪墜　　　　　　　　.

九 77:　　又彼定中諸善男子見色陰銷　　　　　　　　　　　　.
　    　　受陰明白慧力過定失於猛利　　　　　　　　　　　　.
　    　　以諸勝性懷於心中自心已疑是盧舍那得少為足　　　　.
　    　　此名用心亡失恒審溺於知見悟則無咎非為聖證　　　　.
九 78:　　若作聖解則有下劣易知足魔入其心腑　　　　　　　　.
　    　　見人自言我得無上第一義諦失於正受當從淪墜　　　　.

九 79:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　新證未獲故心已亡歷覽二際自生艱險　　　　　　　　.
　    　　於心忽然生無盡憂如坐鐵床如飲毒藥心不欲活　　　　.
　    　　常求於人令害其命早取解脫此名修行失於方便　　　　.
　    　　悟則無咎非為聖證　　　　　　　　　　　　　　　　.
九 80:　　若作聖解則有一分常憂愁魔入其心腑　　　　　　　　.
　    　　手執刀劍自割其肉欣其捨壽　　　　　　　　　　　　.
　    　　或常憂愁走入山林不耐見人失於正受當從淪墜　　　　.

九 81:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　處清淨中心安隱後　　　　　　　　　　　　　　　　.
　    　　忽然自有無限喜生心中歡悅不能自止　　　　　　　　.
　    　　此名輕安無慧自禁悟則無咎非為聖證　　　　　　　　.
九 82:　　若作聖解則有一分好喜樂魔入其心腑見人則笑　　　　.
　    　　於衢路傍自歌自舞自謂已得無礙解脫　　　　　　　　.
　    　　失於正受當從淪墜　　　　　　　　　　　　　　　　.

九 83:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　自謂已足忽有無端大我慢起如是乃至　　　　　　　　.
　    　　慢與過慢及慢過慢或增上慢或卑劣慢一時俱發　　　　.
　    　　心中尚輕十方如來何況下位聲聞緣覺　　　　　　　　.
　    　　此名見勝無慧自救悟則無咎非為聖證　　　　　　　　.
九 84:　　若作聖解則有一分大我慢魔入其心腑　　　　　　　　.
　    　　不禮塔廟摧毀經像　　　　　　　　　　　　　　　　.
　    　　謂檀越言此是金銅或是土木經是樹葉或是氈華　　　　.
　    　　肉身真常不自恭敬卻崇土木實為顛倒　　　　　　　　.
　    　　其深信者從其毀碎埋棄地中疑誤眾生入無間獄　　　　.
　    　　失於正受當從淪墜　　　　　　　　　　　　　　　　.

九 85:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　於精明中圓悟精理得大隨順　　　　　　　　　　　　.
　    　　其心忽生無量輕安已言成聖得大自在　　　　　　　　.
　    　　此名因慧獲諸輕清悟則無咎非為聖證　　　　　　　　.
九 86:　　若作聖解則有一分好輕清魔入其心腑　　　　　　　　.
　    　　自謂滿足更不求進此等多作無聞比丘　　　　　　　　.
　    　　疑誤眾生墮阿鼻獄失於正受當從淪墜　　　　　　　　.

九 87:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　於明悟中得虛明性　　　　　　　　　　　　　　　　.
　    　　其中忽然歸向永滅撥無因果一向入空　　　　　　　　.
　    　　空心現前乃至心生長斷滅解悟則無咎非為聖證　　　　.
九 88:　　若作聖解則有空魔入其心腑乃諦持戒名為小乘　　　　.
　    　　菩薩悟空有何持犯　　　　　　　　　　　　　　　　.
　    　　其人常於信心檀越飲酒噉肉廣行婬穢　　　　　　　　.
　    　　因魔力故攝其前人不生疑諦　　　　　　　　　　　　.
　    　　鬼心久入或食屎尿與酒肉等　　　　　　　　　　　　.
　    　　一種俱空破佛律儀誤人入罪失於正受當從淪墜　　　　.

九 89:　　又彼定中諸善男子見色陰銷受陰明白　　　　　　　　.
　    　　味其虛明深入心骨　　　　　　　　　　　　　　　　.
　    　　其心忽有無限愛生愛極發狂便為貪欲　　　　　　　　.
　    　　此名定境安順入心無慧自持誤入諸欲　　　　　　　　.
　    　　悟則無咎非為聖證　　　　　　　　　　　　　　　　.
九 90:　　若作聖解則有欲魔入其心腑一向說欲為菩提道　　　　.
　    　　化諸白衣平等行欲其行婬者名持法子　　　　　　　　.
　    　　神鬼力故於末世中攝其凡愚其數至百　　　　　　　　.
　    　　如是乃至一百二百或五六百多滿千萬　　　　　　　　.
　    　　魔心生厭離其身體威德既無陷於王難　　　　　　　　.
　    　　疑誤眾生入無間獄失於正受當從淪墜　　　　　　　　.

九 91:　　如是十種禪那現境皆是受陰用心交互故現斯事　　　　.
　    　　眾生頑迷不自忖量逢此因緣迷不自識謂言登聖　　　　.
　    　　大妄語成墮無間獄　　　　　　　　　　　　　　　　.
　    　　汝等亦當將如來語於我滅後傳示末法　　　　　　　　.
　    　　遍令眾生開悟斯義無令天魔得其方便　　　　　　　　.
　    　　保持覆護成無上道　　　　　　　　　　　　　　　　.

九 92:　[HR] 　明想陰
九 92:　　彼善男子修三摩提受陰盡者　　　　　　　　　　　　.
　    　　雖未漏盡心離其形如鳥出籠已能成就　　　　　　　　.
　    　　從是凡身上歷菩薩六十聖位得意生身隨往無礙　　　　.
　    　　譬如有人熟寐寱言是人雖則無別所知　　　　　　　　.
　    　　其言已成音韻倫次令不寐者咸悟其語　　　　　　　　.
　    　　此則名為想陰區宇　　　　　　　　　　　　　　　　.
九 93:　　若動念盡浮想銷除於覺明心如去塵垢　　　　　　　　.
　    　　一倫生死首尾圓照名想陰盡　　　　　　　　　　　　.
　    　　是人則能超煩惱濁觀其所由融通妄想以為其本　　　　.

九 94:　　彼善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛圓明銳其精思貪求善巧　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九 95:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人不覺是其魔著自言謂得無上涅槃　　　　　　　　.
　    　　來彼求巧善男子處敷座說法其形斯須　　　　　　　　.
　    　　或作比丘令彼人見或為帝釋或為婦女或比丘尼　　　　.
　    　　或寢暗室身有光明　　　　　　　　　　　　　　　　.
九 96:　　是人愚迷惑為菩薩信其教化搖蕩其心　　　　　　　　.
　    　　破佛律儀潛行貪欲口中好言災祥變異　　　　　　　　.
　    　　或言如來某處出世或言劫火或說刀兵恐怖於人　　　　.
　    　　令其家資無故耗散　　　　　　　　　　　　　　　　.
九 97:　　此名怪鬼年老成魔惱亂是人厭足心生　　　　　　　　.
　    　　去彼人體弟子與師俱陷王難　　　　　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九 98:　　又善男子受陰虛妙不遭邪慮圓定發明三摩地中　　　　.
　    　　心愛遊蕩飛其精思貪求經歷　　　　　　　　　　　　.
　    　　爾時天魔候得其便飛精附人口說經法　　　　　　　　.
九 99:　　其人亦不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求遊善男子處敷座說法自形無變　　　　　　　　.
　    　　其聽法者忽自見身坐寶蓮華全體化成紫金光聚　　　　.
　    　　一眾聽人各各如是得未曾有　　　　　　　　　　　　.
九100:　　是人愚迷惑為菩薩婬逸其心破佛律儀潛行貪欲　　　　.
　    　　口中好言諸佛應世某處某人當是某佛化身來此　　　　.
　    　　某人即是某菩薩等來化人間其人見故心生傾渴　　　　.
　    　　邪見密興種智銷滅　　　　　　　　　　　　　　　　.
九101:　　此名魃鬼年老成魔惱亂是人厭足心生　　　　　　　　.
　    　　去彼人體弟子與師俱陷王難　　　　　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九102:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛綿合澄其精思貪求契合　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九103:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人實不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求合善男子處敷座說法　　　　　　　　　　　　.
　    　　其形及彼聽法之人外無遷變　　　　　　　　　　　　.
　    　　令其聽者未聞法前心自開悟念念移易或得宿命　　　　.
　    　　或有他心或見地獄或知人間好惡諸事或口說偈　　　　.
　    　　或自誦經各各歡娛得未曾有　　　　　　　　　　　　.
九104:　　是人愚迷惑為菩薩綿愛其心破佛律儀潛行貪欲　　　　.
　    　　口中好言佛有大小某佛先佛某佛後佛　　　　　　　　.
　    　　其中亦有真佛假佛男佛女佛菩薩亦然　　　　　　　　.
　    　　其人見故洗滌本心易入邪悟　　　　　　　　　　　　.
九105:　　此名魅鬼年老成魔惱亂是人厭足心生　　　　　　　　.
　    　　去彼人體弟子與師俱陷王難　　　　　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九106:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛根本窮覽物化性之終始　　　　　　　　.
　    　　精爽其心貪求辨析　　　　　　　　　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九107:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人先不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求元善男子處敷座說法身有威神摧伏求者　　　　.
　    　　令其座下雖未聞法自然心伏　　　　　　　　　　　　.
　    　　是諸人等將佛涅槃菩提法身即是現前我肉身上　　　　.
　    　　父父子子遞代相生即是法身常住不絕　　　　　　　　.
　    　　都指現在即為佛國無別淨居及金色相　　　　　　　　.
　    　　其人信受亡失先心身命歸依得未曾有　　　　　　　　.
九108:　　是等愚迷惑為菩薩推究其心破佛律儀潛行貪欲　　　　.
　    　　口中好言眼耳鼻舌皆為淨土　　　　　　　　　　　　.
　    　　男女二根即是菩提涅槃真處　　　　　　　　　　　　.
　    　　彼無知者信是穢言　　　　　　　　　　　　　　　　.
九109:　　此名蠱毒魘勝惡鬼年老成魔惱亂是人厭足心生　　　　.
　    　　去彼人體弟子與師俱陷王難　　　　　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九110:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛懸應周流精研貪求冥感　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九111:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人元不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求應善男子處敷座說法　　　　　　　　　　　　.
　    　　能令聽眾暫見其身如百千歲心生愛染不能捨離　　　　.
　    　　身為奴僕四事供養不覺疲勞各各令其座下人心　　　　.
　    　　知是先師本善知識別生法愛黏如膠漆得未曾有　　　　.
九112:　　是人愚迷惑為菩薩親近其心破佛律儀潛行貪欲　　　　.
　    　　口中好言我於前世於某生中先度某人　　　　　　　　.
　    　　當時是我妻妾兄弟今來相度　　　　　　　　　　　　.
　    　　與汝相隨歸某世界供養某佛　　　　　　　　　　　　.
　    　　或言別有大光明天佛於中住一切如來所休居地　　　　.
　    　　彼無知者信是虛誑遺失本心　　　　　　　　　　　　.
九113:　　此名癘鬼年老成魔惱亂是人厭足心生　　　　　　　　.
　    　　去彼人體弟子與師俱陷王難　　　　　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九114:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛深入克己辛勤樂處陰寂貪求靜謐　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九115:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人本不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求陰善男子處敷座說法令其聽人各知本業　　　　.
　    　　或於其處語一人言汝今未死已作畜生　　　　　　　　.
　    　　敕使一人於後蹋尾頓令其人起不能得　　　　　　　　.
　    　　於是一眾傾心斂伏有人起心已知其肇　　　　　　　　.
　    　　佛律儀外重加精苦誹諦比丘罵詈徒眾　　　　　　　　.
　    　　訐露人事不避譏嫌口中好言未然禍福　　　　　　　　.
　    　　及至其時毫髮無失　　　　　　　　　　　　　　　　.
九116:　　此大力鬼年老成魔惱亂是人厭足心生去彼人體　　　　.
　    　　弟子與師俱陷王難汝當先覺不入輪迴　　　　　　　　.
　    　　迷惑不知墮無間獄　　　　　　　　　　　　　　　　.

九117:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛知見勤苦研尋貪求宿命　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九118:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人殊不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求知善男子處敷座說法　　　　　　　　　　　　.
　    　　是人無端於說法處得大寶珠　　　　　　　　　　　　.
　    　　其魔或時化為畜生口銜其珠　　　　　　　　　　　　.
　    　　及雜珍寶簡冊符牘諸奇異物先授彼人後著其體　　　　.
　    　　或誘聽人藏於地下有明月珠照耀其處　　　　　　　　.
　    　　是諸聽者得未曾有多食藥草不餐嘉饌　　　　　　　　.
　    　　或時日餐一麻一麥其形肥充魔力持故　　　　　　　　.
　    　　誹諦比丘罵詈徒眾不避譏嫌　　　　　　　　　　　　.
　    　　口中好言他方寶藏十方聖賢潛匿之處　　　　　　　　.
　    　　隨其後者往往見有奇異之人　　　　　　　　　　　　.
九119:　　此名山林土地城隍川嶽鬼神年老成魔　　　　　　　　.
　    　　或有宣婬破佛戒律與承事者潛行五欲　　　　　　　　.
　    　　或有精進純食草木無定行事惱亂是人　　　　　　　　.
　    　　厭足心生去彼人體弟子與師俱陷王難　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.

九120:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛神通種種變化研究化元貪取神力　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九121:　　飛精附人口說經法其人誠不覺知魔著　　　　　　　　.
　    　　亦言自得無上涅槃來彼求通善男子處敷座說法　　　　.
　    　　是人或復手執火光手撮其光分於所聽四眾頭上　　　　.
　    　　是諸聽人頂上火光皆長數尺亦無熱性曾不焚燒　　　　.
　    　　或水上行如履平地或於空中安坐不動或入瓶內　　　　.
　    　　或處囊中越牖透垣曾無障礙唯於刀兵不得自在　　　　.
　    　　自言是佛身著白衣受比丘禮誹諦禪律罵詈徒眾　　　　.
　    　　訐露人事不避譏嫌口中常說神通自在　　　　　　　　.
　    　　或復令人傍見佛土鬼力惑人非有真實　　　　　　　　.
　    　　讚歎行婬不毀粗行將諸猥媟以為傳法　　　　　　　　.
九122:　　此名天地大力山精海精風精河精土精　　　　　　　　.
　    　　一切草木積劫精魅或復龍魅或壽終仙再活為魅　　　　.
　    　　或仙期終計年應死其形不化他怪所附　　　　　　　　.
　    　　年老成魔惱亂是人厭足心生去彼人體　　　　　　　　.
　    　　弟子與師多陷王難汝當先覺不入輪迴　　　　　　　　.
　    　　迷惑不知墮無間獄　　　　　　　　　　　　　　　　.

九123:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛入滅研究化性貪求深空　　　　　　　　.
　    　　時天魔候得其便　　　　　　　　　　　　　　　　　.
九124:　　飛精附人口說經法　　　　　　　　.
　    　　其人終不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求空善男子處敷座說法　　　　　　　　　　　　.
　    　　於大眾內其形忽空眾無所見　　　　　　　　　　　　.
　    　　還從虛空突然而出存沒自在　　　　　　　　　　　　.
　    　　或現其身洞如琉璃或垂手足作栴檀氣　　　　　　　　.
　    　　或大小便如厚石蜜誹毀戒律輕賤出家　　　　　　　　.
　    　　口中常說無因無果一死永滅無復後身及諸凡聖　　　　.
　    　　雖得空寂潛行貪欲受其欲者亦得空心撥無因果　　　　.
九125:　　此名日月薄蝕精氣金玉芝草麟鳳龜鶴　　　　　　　　.
　    　　經千萬年不死為靈出生國土年老成魔惱亂是人　　　　.
　    　　厭足心生去彼人體弟子與師多陷王難　　　　　　　　.
　    　　汝當先覺不入輪迴迷惑不知墮無間獄　　　　　　　　.
九126:　　又善男子受陰虛妙不遭邪慮圓定發明　　　　　　　　.
　    　　三摩地中心愛長壽辛苦研幾貪求永歲棄分段生　　　　.
　    　　頓希變易細相常住　　　　　　　　　　　　　　　　.
　    　　爾時天魔候得其便　　　　　　　　　　　　　　　　.
九127:　　飛精附人口說經法　　　　　　　　　　　　　　　　.
　    　　其人竟不覺知魔著亦言自得無上涅槃　　　　　　　　.
　    　　來彼求生善男子處敷座說法　　　　　　　　　　　　.
　    　　好言他方往還無滯或經萬里瞬息再來　　　　　　　　.
　    　　皆於彼方取得其物或於一處在一宅中數步之間　　　　.
　    　　令其從東詣至西壁是人急行累年不到　　　　　　　　.
　    　　因此心信疑佛現前口中常說十方眾生皆是吾子　　　　.
　    　　我生諸佛我出世界我是元佛出世自然不因修得　　　　.
九128:　　此名住世自在天魔使其眷屬如遮文茶　　　　　　　　.
　    　　及四天王毗舍童子未發心者利其虛明食彼精氣　　　　.
　    　　或不因師其修行人親自觀見稱執金剛與汝長命　　　　.
　    　　現美女身盛行貪欲未逾年歲肝腦枯竭　　　　　　　　.
　    　　口兼獨言聽若妖魅前人未詳多陷王難　　　　　　　　.
　    　　未及遇刑先已乾死惱亂彼人以至殂殞　　　　　　　　.
　    　　汝當先覺入輪迴迷惑不知墮無間獄　　　　　　　　　.

九129:　　是十種魔於末世時在我法中出家修道　　　　　　　　.
　    　　或附人體或自現形皆言已成正遍知覺　　　　　　　　.
　    　　讚歎婬欲破佛律儀先惡魔師與魔弟子婬婬相傳　　　　.
　    　　如是邪精魅其心腑近則九生多逾百世　　　　　　　　.
　    　　令真修行總為魔眷命終之後必為魔民　　　　　　　　.
　    　　失正遍知墮無間獄　　　　　　　　　　　　　　　　.
九130:　　汝今未須先取寂滅縱得無學留願入彼末法之中　　　　.
　    　　起大慈悲救度正心深信眾生令不著魔得正知見　　　　.
　    　　我今度汝已出生死汝遵佛語名報佛恩　　　　　　　　.
九131:　　如是十種禪那現境皆是想陰用心交互故現斯事　　　　.
　    　　眾生頑迷不自忖量逢此因緣迷不自識謂言登聖　　　　.
　    　　大妄語成墮無間獄汝等必須將如來語於我滅後　　　　.
　    　　傳示末法遍令眾生開悟斯義無令天魔得其方便　　　　.
　    　　保持覆護成無上道　　　　　　　　　　　　　　.`);
