lines.push(
`十  1:　[HR] 　明行陰
十  1:　　彼善男子修三摩提想陰盡者　　　　　　　　　　　　.
　    　　是人平常夢想銷滅寤寐恒一覺明虛靜猶如晴空　　　　.
　    　　無復粗重前塵影事觀諸世間大地山河如鏡鑒明　　　　.
　    　　來無所黏過無蹤跡虛受照應了罔陳習唯一精真　　　　.
　    　　生滅根元從此披露見諸十方十二眾生畢殫其類　　　　.
　    　　雖未通其各命由緒見同生基猶如野馬熠熠清擾　　　　.
　    　　為浮根塵究竟樞穴此則名為行陰區宇　　　　　　　　.
十  2:　　若此清擾熠熠元性性入元澄一澄元習　　　　　　　　.
　    　　如波瀾滅化為澄水名行陰盡是人則能超眾生濁　　　　.
　    　　觀其所由幽隱妄想以為其本　　　　　　　　　　　　.

十  3:　　當知是得正知奢摩他中諸善男子凝明正心　　　　　　.
　    　　十類天魔不得其便方得精研窮生類本　　　　　　　　.
　    　　於本類中生元露者觀彼幽清圓擾動元　　　　　　　　.
　    　　於圓元中起計度者是人墜入二無因論　　　　　　　　.
十  4:　　一者是人見本無因何以故　　　　　　　　　　　　　.
　    　　是人既得生機全破乘於眼根八百功德見八萬劫　　　　.
　    　　所有眾生業流灣環死此生彼只見眾生輪迴其處　　　　.
　    　　八萬劫外冥無所觀便作是解此等世間十方眾生　　　　.
　    　　八萬劫來無因自有　　　　　　　　　　　　　　　　.
　    　　由此計度亡正遍知墮落外道惑菩提性　　　　　　　　.
十  5:　　二者是人見末無因何以故是人於生既見其根　　　　　.
　    　　知人生人悟鳥生鳥烏從來黑鵠從來白　　　　　　　　.
　    　　人天本豎畜生本橫白非洗成黑非染造　　　　　　　　.
　    　　從八萬劫無復改移今盡此形亦復如是　　　　　　　　.
　    　　而我本來不見菩提云何更有成菩提事　　　　　　　　.
　    　　當知今日一切物象皆本無因　　　　　　　　　　　　.
　    　　由此計度亡正遍知墮落外道惑菩提性　　　　　　　　.
十  6:　　是則名為第一外道立無因論　　　　　　　　　　　　.

十  7:　　是三摩中諸善男子凝明正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於圓常中起計度者是人墜入四遍常論　　　　　　　　.
十  8:　　一者是人窮心境性二處無因　　　　　　　　　　　　.
　    　　修習能知二萬劫中十方眾生　　　　　　　　　　　　.
　    　　所有生滅咸皆循環不曾散失計以為常　　　　　　　　.
十  9:　　二者是人窮四大元四性常住　　　　　　　　　　　　.
　    　　修習能知四萬劫中十方眾生所有生滅　　　　　　　　.
　    　　咸皆體恒不曾散失計以為常　　　　　　　　　　　　.
十 10:　　三者是人窮盡六根末那執受心意識中　　　　　　　　.
　    　　本元由處性常恒故　　　　　　　　　　　　　　　　.
　    　　修習能知八萬劫中一切眾生循環不失本來常住　　　　.
　    　　窮不失性計以為常　　　　　　　　　　　　　　　　.
十 11:　　四者是人既盡想元生理更無流止運轉　　　　　　　　.
　    　　生滅想心今已永滅　　　　　　　　　　　　　　　　.
　    　　理中自然成不生滅因心所度計以為常　　　　　　　　.
十 12:　　由此計常亡正遍知墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第二外道立圓常論　　　　　　　　　　　　.

十 13:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元於自他中起計度者　　　　　　　　.
　    　　是人墜入四顛倒見一分無常一分常論　　　　　　　　.
十 14:　　一者是人觀妙明心遍十方界湛然以為究竟神我　　　　.
　    　　從是則計我遍十方凝明不動　　　　　　　　　　　　.
　    　　一切眾生於我心中自生自死　　　　　　　　　　　　.
　    　　則我心性名之為常彼生滅者真無常性　　　　　　　　.
十 15:　　二者是人不觀其心遍觀十方恒沙國土　　　　　　　　.
　    　　見劫壞處名為究竟無常種性劫不壞處名究竟常　　　　.
十 16:　　三者是人別觀我心精細微密猶如微塵　　　　　　　　.
　    　　流轉十方性無移改能令此身即生即滅　　　　　　　　.
　    　　其不壞性名我性常一切死生從我流出名無常性　　　　.
十 17:　　四者是人知想陰盡見行陰流　　　　　　　　　　　　.
　    　　行陰常流計為常性色受想等今已滅盡名為無常　　　　.
十 18:　　由此計度一分無常一分常故墮落外道惑菩提性　　　　.
　    　　是則名為第三外道一分常論　　　　　　　　　　　　.

十 19:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於分位中生計度者是人墜入四有邊論　　　　　　　　.
十 20:　　一者是人心計生元流用不息　　　　　　　　　　　　.
　    　　計過未者名為有邊計相續心名為無邊　　　　　　　　.
十 21:　　二者是人觀八萬劫則見眾生　　　　　　　　　　　　.
　    　　八萬劫前寂無聞見無聞見處名為無邊　　　　　　　　.
　    　　有眾生處名為有邊　　　　　　　　　　　　　　　　.
十 22:　　三者是人計我遍知得無邊性　　　　　　　　　　　　.
　    　　彼一切人現我知中我曾不知彼之知性　　　　　　　　.
　    　　名彼不得無邊之心但有邊性　　　　　　　　　　　　.
十 23:　　四者是人窮行陰空　　　　　　　　　　　　　　　　.
　    　　以其所見心路籌度一切眾生一身之中　　　　　　　　.
　    　　計其咸皆半生半滅　　　　　　　　　　　　　　　　.
　    　　明其世界一切所有一半有邊一半無邊　　　　　　　　.
十 24:　　由此計度有邊無邊墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第四外道立有邊論　　　　　　　　　　　　.

十 25:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於知見中生計度者是人墜入四種顛倒　　　　　　　　.
　    　　不死矯亂遍計虛論　　　　　　　　　　　　　　　　.
十 26:　　一者是人觀變化元見遷流處名之為變　　　　　　　　.
　    　　見相續處名之為恒見所見處名之為生　　　　　　　　.
　    　　不見見處名之為滅相續之因性不斷處名之為增　　　　.
　    　　正相續中中所離處名之為減　　　　　　　　　　　　.
　    　　各各生處名之為有互互亡處名之為無　　　　　　　　.
　    　　以理都觀用心別見有求法人來問其義　　　　　　　　.
　    　　答言我今亦生亦滅亦有亦無亦增亦減　　　　　　　　.
　    　　於一切時皆亂其語令彼前人遺失章句　　　　　　　　.
十 27:　　二者是人諦觀其心互互無處因無得證　　　　　　　　.
　    　　有人來問唯答一字但言其無　　　　　　　　　　　　.
　    　　除無之餘無所言說　　　　　　　　　　　　　　　　.
十 28:　　三者是人諦觀其心各各有處因有得證　　　　　　　　.
　    　　有人來問唯答一字但言其是　　　　　　　　　　　　.
　    　　除是之餘無所言說　　　　　　　　　　　　　　　　.
十 29:　　四者是人有無俱見其境枝故其心亦亂　　　　　　　　.
　    　　有人來問答言亦有即是亦無亦無之中不是亦有　　　　.
　    　　一切矯亂無容窮詰　　　　　　　　　　　　　　　　.
十 30:　　由此計度矯亂虛無墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第五外道四顛倒性不死矯亂遍計虛論　　　　.

十 31:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於無盡流生計度者是人墜入死後有相發心顛倒　　　　.
十 32:　　或自固身云色是我或見我圓含遍國土云我有色　　　　.
　    　　或彼前緣隨我回復云色屬我　　　　　　　　　　　　.
　    　　或復我依行中相續云我在色　　　　　　　　　　　　.
　    　　皆計度言死後有相如是循環有十六相　　　　　　　　.
　    　　從此或計畢竟煩惱畢竟菩提兩性並驅各不相觸　　　　.
十 33:　　由此計度死後有故墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第六外道立五陰中死後有相心顛倒論　　　　.

十 34:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於先除滅色受想中生計度者　　　　　　　　　　　　.
　    　　是人墜入死後無相發心顛倒　　　　　　　　　　　　.
十 35:　　見其色滅形無所因觀其想滅心無所繫　　　　　　　　.
　    　　知其受滅無復連綴陰性銷散　　　　　　　　　　　　.
　    　　縱有生理而無受想與草木同　　　　　　　　　　　　.
　    　　此質現前猶不可得死後云何更有諸相　　　　　　　　.
　    　　因之勘校死後相無如是循環有八無相　　　　　　　　.
　    　　從此或計涅槃因果一切皆空徒有名字究竟斷滅　　　　.
十 36:　　由此計度死後無故墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第七外道立五陰中死後無相心顛倒論　　　　.

十 37:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於行存中兼受想滅雙計有無自體相破　　　　　　　　.
　    　　是人墜入死後俱非起顛倒論　　　　　　　　　　　　.
十 38:　　色受想中見有非有行遷流內觀無不無　　　　　　　　.
　    　　如是循環窮盡陰界八俱非相　　　　　　　　　　　　.
　    　　隨得一緣皆言死後有相無相又計諸行性遷訛故　　　　.
　    　　心發通悟　　　　　　　　　　　　　　　　　　　　.
　    　　有無俱非虛實失措　　　　　　　　　　　　　　　　.
十 39:　　由此計度死後俱非後際昏瞢無可道故墮落外道　　　　.
　    　　惑菩提性　　　　　　　　　　　　　　　　　　　　.
　    　　是則名為第八外道立五陰中死後俱非心顛倒論　　　　.

十 40:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於後後無生計度者是人墜入七斷滅論　　　　　　　　.
十 41:　　或計身滅或欲盡滅或苦盡滅或極樂滅或極捨滅　　　　.
　    　　如是循環窮盡七際現前銷滅滅已無復　　　　　　　　.
十 42:　　由此計度死後斷滅墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第九外道立五陰中死後斷滅心顛倒論　　　　.

十 43:　　又三摩中諸善男子堅凝正心魔不得便窮生類本　　　　.
　    　　觀彼幽清常擾動元　　　　　　　　　　　　　　　　.
　    　　於後後有生計度者是人墜入五涅槃論　　　　　　　　.
十 44:　　或以欲界為正轉依觀見圓明生愛慕故　　　　　　　　.
　    　　或以初禪性無憂故或以二禪心無苦故　　　　　　　　.
　    　　或以三禪極悅隨故或以四禪苦樂二亡　　　　　　　　.
　    　　不受輪迴生滅性故迷有漏天作無為解　　　　　　　　.
　    　　五處安隱為勝淨依如是循環五處究竟　　　　　　　　.
十 45:　　由此計度五現涅槃墮落外道惑菩提性　　　　　　　　.
　    　　是則名為第十外道立五陰中五現涅槃心顛倒論　　　　.

十 46:　　如是十種禪那狂解皆是行陰用心交互故現斯悟　　　　.
　    　　眾生頑迷不自忖量　　　　　　　　　　　　　　　　.
　    　　逢此現前以迷為解自言登聖　　　　　　　　　　　　.
　    　　大妄語成墮無間獄　　　　　　　　　　　　　　　　.
十 47:　　汝等必須將如來語於我滅後傳示末法　　　　　　　　.
　    　　遍令眾生覺了斯義　　　　　　　　　　　　　　　　.
　    　　無令心魔自起深孽保持覆護銷息邪見　　　　　　　　.
　    　　教其身心開覺真義於無上道不遭枝歧　　　　　　　　.
　    　　勿令心祈得少為足作大覺王清淨標指　　　　　　　　.

十 48:　[HR] 　明識陰
十 48:　　彼善男子修三摩提行陰盡者　　　　　　　　　　　　.
　    　　諸世間性幽清擾動同分生機倏然隳裂沈細綱紐　　　　.
　    　　補特伽羅酬業深脈感應懸絕於涅槃天將大明悟　　　　.
　    　　如雞後鳴瞻顧東方已有精色六根虛靜無復馳逸　　　　.
　    　　內外湛明入無所入深達十方十二種類受命元由　　　　.
　    　　觀由執元諸類不召於十方界已獲其同　　　　　　　　.
　    　　精色不沈發現幽秘此則名為識陰區宇　　　　　　　　.
十 49:　　若於群召已獲同中銷磨六門　　　　　　　　　　　　.
　    　　合開成就見聞通鄰互用清淨　　　　　　　　　　　　.
　    　　十方世界及與身心如吠琉璃內外明徹名識陰盡　　　　.
　    　　是人則能超越命濁　　　　　　　　　　　　　　　　.
　    　　觀其所由罔象虛無顛倒妄想以為其本　　　　　　　　.

十 50:　　當知是善男子窮諸行空於識還元已滅生滅　　　　　　.
　    　　而於寂滅精妙未圓　　　　　　　　　　　　　　　　.
　    　　能令己身根隔合開亦與十方諸類通覺　　　　　　　　.
　    　　覺知通曶能入圓元　　　　　　　　　　　　　　　　.
十 51:　　若於所歸立真常因生勝解者是人則墮因所因執　　　　.
　    　　娑毗迦羅所歸冥諦成其伴侶迷佛菩提亡失知見　　　　.
十 52:　　是名第一立所得心成所歸果違遠圓通　　　　　　　　.
　    　　背涅槃城生外道種　　　　　　　　　　　　　　　　.

十 53:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於所歸覽為自體盡虛空界十二類內所有眾生　　　　.
　    　　皆我身中一類流出生勝解者是人則墮能非能執　　　　.
　    　　摩醯首羅現無邊身成其伴侶迷佛菩提亡失知見　　　　.
十 54:　　是名第二立能為心成能事果　　　　　　　　　　　　.
　    　　違遠圓通背涅槃城生大慢天我遍圓種　　　　　　　　.

十 55:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於所歸有所歸依自疑身心從彼流出　　　　　　　　.
　    　　十方虛空咸其生起　　　　　　　　　　　　　　　　.
　    　　即於都起所宣流地作真常身無生滅解　　　　　　　　.
　    　　在生滅中早計常住既惑不生亦迷生滅　　　　　　　　.
　    　　安住沈迷生勝解者是人則墮常非常執　　　　　　　　.
　    　　計自在天成其伴侶迷佛菩提亡失知見　　　　　　　　.
十 56:　　是名第三立因依心成妄計果違遠圓通　　　　　　　　.
　    　　背涅槃城生倒圓種　　　　　　　　　　　　　　　　.

十 57:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於所知知遍圓故因知立解　　　　　　　　　　　　.
　    　　十方草木皆稱有情與人無異　　　　　　　　　　　　.
　    　　草木為人人死還成十方草樹　　　　　　　　　　　　.
　    　　無擇遍知生勝解者是人則墮知無知執　　　　　　　　.
　    　　婆吒霰尼執一切覺成其伴侶迷佛菩提亡失知見　　　　.
十 58:　　是名第四計圓知心成虛謬果　　　　　　　　　　　　.
　    　　違遠圓通背涅槃城生倒知種　　　　　　　　　　　　.

十 59:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於圓融根互用中已得隨順　　　　　　　　　　　　.
　    　　便於圓化一切發生求火光明樂水清淨愛風周流　　　　.
　    　　觀塵成就各各崇事　　　　　　　　　　　　　　　　.
　    　　以此群塵發作本因立常住解是人則墮生無生執　　　　.
　    　　諸迦葉波並婆羅門勤心役身事火崇水求出生死　　　　.
　    　　成其伴侶迷佛菩提亡失知見　　　　　　　　　　　　.
十 60:　　是名第五計著崇事迷心從物立妄求因求妄冀果　　　　.
　    　　違遠圓通背涅槃城生顛化種　　　　　　　　　　　　.

十 61:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於圓明計明中虛非滅群化以永滅依　　　　　　　　.
　    　　為所歸依生勝解者是人則墮歸無歸執　　　　　　　　.
　    　　無想天中諸舜若多成其伴侶迷佛菩提亡失知見　　　　.
十 62:　　是名第六圓虛無心成空亡果　　　　　　　　　　　　.
　    　　違遠圓通背涅槃城生斷滅種　　　　　　　　　　　　.

十 63:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於圓常固身常住同於精圓長不傾逝生勝解者　　　　.
　    　　是人則墮貪非貪執　　　　　　　　　　　　　　　　.
　    　　諸阿斯陀求長命者成其伴侶迷佛菩提亡失知見　　　　.
十 64:　　是名第七執著命元立固妄因趣長勞果　　　　　　　　.
　    　　違遠圓通背涅槃城生妄延種　　　　　　　　　　　　.

十 65:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　觀命互通卻留塵勞恐其銷盡　　　　　　　　　　　　.
　    　　便於此際坐蓮華宮廣化七珍多增寶媛　　　　　　　　.
　    　　恣縱其心生勝解者是人則墮真無真執　　　　　　　　.
　    　　吒枳迦羅成其伴侶迷佛菩提亡失知見　　　　　　　　.
十 66:　　是名第八發邪思因立熾塵果　　　　　　　　　　　　.
　    　　違遠圓通背涅槃城生天魔種　　　　　　　　　　　　.

十 67:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　於命明中分別精粗疏決真偽因果相酬唯求感應　　　　.
　    　　背清淨道　　　　　　　　　　　　　　　　　　　　.
　    　　所謂見苦斷集證滅修道居滅已休更不前進　　　　　　.
　    　　生勝解者是人則墮定性聲聞　　　　　　　　　　　　.
　    　　諸無聞僧增上慢者成其伴侶迷佛菩提亡失知見　　　　.
十 68:　　是名第九圓精應心成趣寂果違遠圓通　　　　　　　　.
　    　　背涅槃城生纏空種　　　　　　　　　　　　　　　　.

十 69:　　又善男子窮諸行空已滅生滅而於寂滅精妙未圓　　　　.
　    　　若於圓融清淨覺明發研深妙即立涅槃而不前進　　　　.
　    　　生勝解者是人則墮定性辟支　　　　　　　　　　　　.
　    　　諸緣獨倫不回心者成其伴侶迷佛菩提亡失知見　　　　.
十 70:　　是名第十圓覺曶心成湛明果　　　　　　　　　　　　.
　    　　違遠圓通背涅槃城生覺圓明不化圓種　　　　　　　　.

十 71:　　如是十種禪那中塗成狂因依迷惑　　　　　　　　　　.
　    　　於未足中生滿足證皆是識陰用心交互故生斯位　　　　.
　    　　眾生頑迷不自忖量　　　　　　　　　　　　　　　　.
　    　　逢此現前各以所愛先習迷心而自休息　　　　　　　　.
　    　　將為畢竟所歸寧地自言滿足無上菩提　　　　　　　　.
　    　　大妄語成外道邪魔所感業終墮無間獄　　　　　　　　.
　    　　聲聞緣覺不成增進　　　　　　　　　　　　　　　　.
十 72:　　汝等存心秉如來道將此法門於我滅後傳示末世　　　　.
　    　　普令眾生覺了斯義　　　　　　　　　　　　　　　　.
　    　　無令見魔自作沈孽保綏哀救銷息邪緣　　　　　　　　.
　    　　令其身心入佛知見從始成就不遭歧路　　　　　　　　.
十 73:　　如是法門先過去世恒沙劫中微塵如來　　　　　　　　.
　    　　乘此心開得無上道　　　　　　　　　　　　　　　　.
　    　　識陰若盡則汝現前諸根互用　　　　　　　　　　　　.
　    　　從互用中能入菩薩金剛乾慧　　　　　　　　　　　　.
　    　　圓明精心於中發化如淨琉璃內含寶月　　　　　　　　.
　    　　如是乃超十信十住十行十回向四加行心　　　　　　　.
　    　　菩薩所行金剛十地等覺圓明入於如來妙莊嚴海　　　　.
　    　　圓滿菩提歸無所得　　　　　　　　　　　　　　　　.
十 74:　　此是過去先佛世尊奢摩他中毗婆舍那　　　　　　　　.
　    　　覺明分析微細魔事　　　　　　　　　　　　　　　　.
　    　　魔境現前汝能諳識心垢洗除不落邪見　　　　　　　　.
　    　　陰魔銷滅天魔摧碎大力鬼神褫魄逃逝　　　　　　　　.
　    　　魑魅魍魎無復出生直至菩提無諸少乏　　　　　　　　.
　    　　下劣增進於大涅槃心不迷悶　　　　　　　　　　　　.
十 75:　　若諸末世愚鈍眾生未識禪那不知說法樂修三昧　　　　.
　    　　汝恐同邪一心勸令持我佛頂陀羅尼咒　　　　　　　　.
　    　　若未能誦寫於禪堂或帶身上一切諸魔所不能動　　　　.
十 76:　　汝當恭欽十方如來究竟修進最後垂範　　　　　　　　.

　    　[HR] 借無聞比丘為語端明五陰魔境/終

十 77:　　〇　阿難即從座起聞佛示誨頂禮欽奉憶持無失　　　　.
　    　　　　於大眾中重覆白佛　　　　　　　　　　　　　　.
　    　　　　　：如佛所言五陰相中五種虛妄為本想心　　　　.
　    　　　　　　我等平常未蒙如來微細開示　　　　　　　　.
　    　　　　　　又此五陰為並銷除為次第盡　　　　　　　　.
　    　　　　　　如是五重詣何為界　　　　　　　　　　　　.
　    　　　　　　惟願如來發宣大慈此大眾清淨心目　　　　　.
　    　　　　　　以為末世一切眾生將來眼　　　　　　　　　.

十 78:　[HR] 廣答陰本妄想

十 78:　　　　佛：精真妙明本覺圓淨非留死生及諸塵垢　　　　.
　    　　　　　　乃至虛空皆因妄想之所生起　　　　　　　　.
十 79:　　　　　　斯元本覺妙明真精妄以發生諸器世間　　　　.
　    　　　　　　如演若多迷頭認影　　　　　　　　　　　　.
　    　　　　　　妄元無因於妄想中立因緣性　　　　　　　　.
　    　　　　　　迷因緣者稱為自然彼虛空性猶實幻生　　　　.
　    　　　　　　因緣自然皆是眾生妄心計度　　　　　　　　.
十 80:　　　　　　知妄所起說妄因緣　　　　　　　　　　　　.
　    　　　　　　若妄元無說妄因緣元無所有　　　　　　　　.
　    　　　　　　何況不知推自然者　　　　　　　　　　　　.
　    　　　　　　是故如來與汝發明五陰本因同是妄想　　　　.

十 81:　　汝體先因父母想生汝心非想則不能來想中傳命　　　　.
　    　　如我先言心想醋味口中涎生　　　　　　　　　　　　.
　    　　心想登高足心酸起懸崖不有醋物未來　　　　　　　　.
　    　　汝體必非虛妄通倫口水如何因談醋出　　　　　　　　.
　    　　是故當知汝現色身名為堅固第一妄想　　　　　　　　.

十 82:　　即此所說臨高想心能令汝形真受酸澀　　　　　　　　.
　    　　由因受生能動色體　　　　　　　　　　　　　　　　.
　    　　汝今現前順益違損二現驅馳名為虛明第二妄想　　　　.

十 83:　　由汝念慮使汝色身身非念倫汝身何因隨念所使　　　　.
　    　　種種取像心生形取與念相應寤即想心寐為諸夢　　　　.
　    　　則汝想念搖動妄情名為融通第三妄想　　　　　　　　.

十 84:　　化理不住運運密移甲長髮生氣銷容皺　　　　　　　　.
　    　　日夜相代曾無覺悟此若非汝云何體遷　　　　　　　　.
　    　　如必是真汝何無覺則汝諸行念念不停　　　　　　　　.
　    　　名為幽隱第四妄想　　　　　　　　　　　　　　　　.

十 85:　　又汝精明湛不搖處名恒常者於身不出見聞覺知　　　　.
十 86:　　若實精真不容習妄何因汝等曾於昔年睹一奇物　　　　.
　    　　經歷年歲憶妄俱無於後忽然覆睹前異記憶宛然　　　　.
　    　　曾不遺失　　　　　　　　　　　　　　　　　　　　.
　    　　則此精了湛不搖中念念受熏有何籌算阿難當知　　　　.
　    　　此湛非真如急流水望如恬靜流急不見非是無流　　　　.
　    　　若非想元甯受妄習　　　　　　　　　　　　　　　　.
　    　　非汝六根互用開合此之妄想無時得滅　　　　　　　　.
十 87:　　故汝現在見聞覺知中串習幾則湛了內罔象虛無　　　　.
　    　　第五顛倒微細精想　　　　　　　　　　　　　　　　.

十 88:　　是五受陰五妄想成汝今欲知因界淺深　　　　　　　　.
　    　　唯色與空是色邊際唯觸及離是受邊際　　　　　　　　.
　    　　唯記與妄是想邊際唯滅與生是行邊際　　　　　　　　.
　    　　湛入合湛歸識邊際　　　　　　　　　　　　　　　　.
十 89:　　此五陰元重疊生起生因識有滅從色除　　　　　　　　.
　    　　理則頓悟乘悟並銷事非頓除因次第盡　　　　　　　　.
　    　　我已示汝劫波巾結何所不明再此詢問　　　　　　　　.
十 90:　　汝應將此妄想根元心得開通　　　　　　　　　　　　.
　    　　傳示將來末法之中諸修行者　　　　　　　　　　　　.
　    　　令識虛妄深厭自生知有涅槃不戀三界　　　　　　　　.

　    　[HR] 廣答陰本妄想/終

十 91:　[HR] 流通
十 91:　　　　　佛：供微塵諸佛以遍虛空七寶得福多不多　　　.
十 93:　　　　　佛：末劫時開示此法門於未學福超於前　　　　.
十 94:　　　　　佛：誦經持咒如教行道直成菩提無復魔業　　　.
十 94:　[HR] 流通/終

十 95:　　〇　楞嚴會圓滿　　　　　　　　　　　　　　　.`);
