QXL.volNum = 1;
QXL.text = `
《大乘起信論》諸位法師慈悲，諸位居士，阿彌陀佛！（阿彌陀佛！）大家請放掌。

這次由於和尚尼大悲願力的推動，所以我們今天有這個殊勝的因緣，共同學習《大乘起信論》。在講本論之前，先簡單的說明本論的重要性。本論是印度的大論師馬鳴菩薩所作；在南北朝時，由真諦法師翻成中文。可以說從南北朝到現在的中國佛教，將近二千年的時間，本論在中國佛教扮演一個非常重要的角色，特別是天台宗、華嚴宗，乃至於禪宗。這三個宗派在修止觀時，都是以本論來作為主要的根據，這當中的內涵我們作一個簡單的說明。

基本上，佛法修學的目的，主要是使令我們一切眾生離苦得樂，這當中的修學有兩個重點：第一個是業力的修學，第二個是心念的修學。

從它的次第來說，我們剛開始修學佛法，應該透過布施、持戒、忍辱這三個法門的身口斷惡、修善，來成就善業力。這善業力的資持，使令我們在生命中，能夠得到一種暫時的安樂，即所謂的人天果報。在這樣一個人天果報的基礎之上，我們應該更進一步的去修學所謂的正念力。這正念的修學，是透過禪定跟智慧止觀的修學，來消滅我們心中的顛倒。在《觀普賢菩薩行法經》上說：

/gatha/
一切業障海，皆由妄想生，
若欲懺悔者，端坐觀實相。
罪業如霜露，慧日能消除。
//

這個偈頌在天台宗是一個非常重要的偈頌，智者大師把這個偈頌的理論發揮出來，而安立了所謂的觀心法門。

觀心法門就是說：既然一切業障海，皆由妄想生，我們整個生死流轉的果報，是由內心的無明妄想所變現的，所以我們要消滅生死的相續，就必須先消滅無明妄想的相續，所以必須端坐觀實相。我們只是靠身口的斷惡修善，是不能消滅生死的相續。所以這個端坐觀實相，在觀照我們生命的真實相，它就能夠成就我們心中的正念。

這端坐觀實相的整個內涵，馬鳴菩薩揉合了整個大乘一百部的經論，而成就了《大乘起信論》，這當中對於整個生命的真實相，有非常詳細而且是有次第的說明。所以我們透過本論的修學，你能夠建立整個大乘的正見，由大乘的正見能夠生起大乘止觀的觀照，乃至成就大乘的功德。這就是今天我們願意撥出寶貴的時間，來修習本論的一個主要目的。

接下來我們看本文：

《大乘起信論》講表：

/KEPAN/將述此義，大科分四：壹、論主略史。貳、解釋標題。叁、隨文釋義。肆、結示勸修。今初。

我們分四科來解釋《大乘起信論》，第一大科我們先解釋論主略史，把本論的論主馬鳴菩薩簡略的歷史，作一個簡單的說明。第二個解釋標題，標題往往總持一部論的要義，所以解釋標題，能夠掌握本論的大綱。第三個隨文釋義，前面的兩科是前言，這一科可以說是正宗分，正式解釋本論的內容。第四科結示勸修，把本論學習以後，作一個總結。

/KEPAN/壹、論主略史

首先我們看第二頁，第一科論主略史。以下的論主略史，是學人根據《大正藏》，摘錄出有關馬鳴菩薩的歷史。這裡我們以三段的內容來解釋馬鳴菩薩的歷史：第一段說明馬鳴菩薩在家的因緣，在世俗的因緣；第二段解釋他出家的因緣，他是在什麼因緣情況之下出家；第三段說明他的修學因緣，馬鳴菩薩他出家以後如何來自利、利他。這就是我們介紹馬鳴菩薩的三個重點：在家因緣、出家因緣跟修學因緣。首先看第一段──他的在家因緣：

/SECTION/（一）在家因緣

馬鳴菩薩，生於佛滅後約六百年頃，中印度舍衛國之婆羅門世家。家學淵源，師承名門，加之聰穎多智，勤奮好學，八歲即便精通《吠陀》《奧義》等諸多典籍。十歲時隨師父那羅仙人，入淨修林，修學《羅摩衍那》，於詩歌及戲劇等文學，盡得師傳。

解釋在家因緣中，我們分成三小段。

/SECTION/第一段、出生背景

說明馬鳴菩薩的出生背景，他是生在佛滅度六百年左右，比龍樹菩薩早一百年。他出生的環境，是在中印度舍衛國的婆羅門世家。這一段我們簡單的作一個說明。

佛滅度以後，大概是一百年左右，阿育王建立了一個孔雀王朝，統一了整個印度；到了六百年左右時，阿育王的孔雀王朝慢慢的衰微了，所以印度又變成一個群雄割據的分裂局面。在這群雄割據中，比較強大勢力的王朝有三個代表：第一個就是南印度的揵陀羅王朝，是在印度南邊的安陀羅王朝；第二個中印度的摩羯陀國，就是馬鳴菩薩所出生的國家；第三個是北印度的貴霜王朝，就是迦膩色迦王所建立的貴霜王朝。在這三個強國中，最為強大的是北印度的貴霜王朝，其次是南印度的安陀羅王朝，最後才是中印度的摩羯陀國，而馬鳴菩薩出生的國家是一個比較小的國家。

在一個割據的局面，就像我們春秋戰國時代一樣，可以說是禮崩樂壞，人心不安；在這種情況下，人們對於宗教的修學，就會比較主動積極來追求生命的歸依。在當時的宗教，主要有兩大派系：第一個是佛教，屬於小乘的部派佛教；第二個是婆羅門教。當時馬鳴菩薩是出生在一個婆羅門世家，他的祖父、曾祖父，乃至於他的父親，都是信仰婆羅門教，是一個世代相傳的婆羅門世家。這裡是先說明他的出生背景。

/SECTION/第二段、家學淵源

/VERSE9/家學淵源，師承名門，加之聰穎多智，勤奮好學，八歲即便精通《吠陀》《奧義》等諸多典籍。

馬鳴菩薩的婆羅門世家，到了他父親時，可以說是到了顛峰時代，所以他父親在婆羅門裡面是擔任長老執事，統籌整個婆羅門的一些工作。他父親因為非常的忙碌在婆羅門宗務的推動，所以馬鳴菩薩的母親承擔起教育他的責任。由於馬鳴菩薩聰穎多智，勤奮好學，在母親的教育之下，八歲就精通了整個婆羅門最重要的兩部經典，一個是《吠陀》經典，第二個是《奧義》的經典。這兩部經典，我們作一個簡單的說明。

《吠陀》經典的思想是一個多神教的思想。身為一個宗教，就是要使令眾生離苦得樂，它是一個生命的修學，不是只是一個學問的研究。生命的修學，主要是離苦得樂，在《吠陀》經典的解釋中，認為宇宙間有多神，就是我們的生命是由眾多的神所決定，每一個神都決定了我們某一部分的生命。比如說：有的神決定我們身體的健康，有的神決定我們的財富，有的神決定我們外相莊嚴、美丑……等等。所以每一個眾生想要離苦得樂應該怎麼辦呢？就隨順你心中的需要，向他相應的神去祈禱，透過你對這個神的禮拜、讚歎、供養，這個神就會賜給你安樂，拔除你的痛苦，這就是《吠陀》經典的思想，所謂多神教的思想。

第二個是《奧義》的思想。《奧義》的思想在整個內涵中，比《吠陀》更加深入，更加高深，是一神教的思想。它認為宇宙間的確是快樂的，吉凶禍福是由神所主宰的。但這個神只有一個神，不是多神。這個神是誰呢？就是所謂的梵——大梵天。所以我們應該透過對大梵天的冥想去觀想歸依，我們跟大梵天相應，大梵天就能夠使令我們離苦得樂。所以這個《奧義》的思想是所謂梵我一如的一神教思想。　　從佛教的角度來觀察這兩部經典所描述的內涵，都是屬於心外求法，都沒有得到生命的真相。馬鳴菩薩在這樣的思想教育之下，先接受多神教跟一神教的思想。這是他小時候接受教育的情況。

/SECTION/第三段、專長興趣

/VERSE9/十歲時隨師父那羅仙人，入淨修林，修學《羅摩衍那》，於詩歌及戲劇等文學，盡得師傳。

馬鳴菩薩在八歲時就把他母親所學的《吠陀》跟《奧義》全部學光了，所以他母親在他十歲時，為他請了一個老師，就是那羅仙人。他十歲就離開了家庭到淨修林的地方，跟他的老師學習《羅摩衍那》。這個《羅摩衍那》是那羅仙人所專攻的一個法門，主要是用戲劇、故事的方式，把多神教（諸神的生起都有他的故事）這些神話故事表達出來。

所以馬鳴菩薩十歲以後，基本上修學的內涵，一個是戲劇，一個是詩歌。就是說《吠陀》《奧義》的經典甚深甚深，用故事、唱誦的方式來表達《吠陀》《奧義》的真理。這個戲劇跟詩歌表達的方式，對馬鳴菩薩後來弘揚大乘佛法的確有很大的幫助。這是簡單的把馬鳴菩薩在家因緣的過程作一個說明。

/SECTION/（二）出家因緣

我們接著看第二段，正式說明他的出家因緣。出家的因緣有三段：

第一段說明他對佛教的對抗，第二段說明他對佛教的歸依，第三個說明他對佛教的修學，有三個主題。我們先看：

/SECTION/第一段、對抗

/VERSE9/既出山林，生大我慢，以刀貫杖告曰：天下智士，能勝我者，截首以謝。初與佛為敵，履次挫敗佛教論師，一國之中，無能抗者。倡言：若諸比丘，能與我論，可打犍椎；如其不能，不得公鳴犍椎，受人供養。

馬鳴菩薩非常聰明好學，而且得到很多婆羅門的傳承，所以他非常的我慢。他怎麼做呢？他在刀下面貫了木杖，向天下有智慧的知識分子宣布說：如果有人能夠辯論超過我的，我就斬首謝罪。他所辯論的對像剛開始都是佛教的學者，而且屢次辯論都能夠挫敗佛教論師，乃至於整個中印度的摩羯陀國中，佛教論師都沒有一個能夠跟他對抗。

所謂一國之中，無能抗者這句話，我們作一個簡單的說明，馬鳴菩薩出生的環境是中印度非常落後的摩羯陀國，那為什麼佛教有這麼殊勝的義理，卻不能辯勝馬鳴菩薩這些邪見呢？在《大正藏》記載，有兩個主要的因素：

第一個因素：佛教的四聖諦，所謂的苦、集、滅、道，講到世間的因果、出世間的因果，這個義理甚深甚深，不是一般人容易理解；婆羅門的多神教思想，在一般人是心隨境轉的等流思考之下，是很容易理解，因為義理淺薄，所以很容易被一般人接受，這是第一點。

第二個因素：在表達方式上，馬鳴菩薩深知善巧；佛教的論師在表達佛法，往往都是比較單純的演說方式。馬鳴菩薩因為能夠善巧的把多神教思想，透過戲劇的故事化，乃至於用詩歌的方式唱誦出來，透過他肢體的表達、唱誦的音聲，讓大家生起非常廣大的歡喜。因為當時的文化很低落，一般人根本沒有接受教育的機會，所以這詩歌、戲劇的表達，在每一個地方很善巧的散播著多神教的思想，得到很多老百姓的共鳴。因為義理的淺薄、表達的善巧，所以馬鳴菩薩廣泛的把整個婆羅門教在中印度推廣開來。

這時，整個中印度的佛教也就慢慢的衰弱。他就說：比丘們，如果你能夠跟我辯論成功的，才有資格打犍椎；如果不能的話，在僧團中就不應該公開的打犍椎，受人供養。這個犍椎是我們僧團集合大眾的一個標幟，是一個僧團和合如法運作的綱紀；不能打犍椎，綱紀敗壞，僧團散漫，整個佛教就更加的衰微。這是講到馬鳴菩薩剛開始對佛教的態度是一種對抗的方式。再看

/SECTION/第二段、歸依

/VERSE9/時北印度有長老比丘脅尊者，知此事已，始從北天竺往詣中國，論辯馬鳴。長老入於三昧，觀其所應，乃立論曰：當令天下太平等，國王長壽，國土豐樂，無諸災患。馬鳴默然，無言以對，即墮負處，伏為弟子，剃除鬚髮，度為釋子。

這段正式說明馬鳴菩薩歸依佛教的因緣。

正中印度佛教慢慢衰微時，當時有部有一個勝天比丘（殊勝的勝，天上的天）跑到北印度的貴霜王朝，貴霜王朝當時的佛教非常興盛，在整個佛教的領域中，以北印度的貴霜王朝最為興盛，特別是一切有部的宗派特別興盛。勝天比丘找到有部的長老脅尊者，把中印度整個佛教衰微的因緣，如是如是的報告。於是脅尊者就帶了幾個大弟子，跑到中印度要跟馬鳴菩薩辯論。這時，他找一個比較接近馬鳴菩薩的道場住下來。

第二天早上，他就問一個沙彌說：你們為什麼都沒有擊犍椎？明知故問。沙彌說：長老啊，你不知道，我們現在中印度都不能夠擊犍椎，就如是如是的報告。這時脅尊者說：你現在可以擊犍椎，沒關係。沙彌聽了長老的教授以後就擊犍椎。馬鳴菩薩聽到擊犍椎以後，就帶了很多人來到這個道場，就約定了時間，準備跟脅尊者辯論。

脅尊者是一個大阿羅漢，具足三明、六通、八解脫，在辯論的前一天晚上，他在寮房入於禪定三昧中，觀察這個成敗的關鍵。他發覺在諸多的佛教論師跟馬鳴菩薩的辯論中，成敗的關鍵，主要是國王的因素。就是大部分比較重要的辯論，國王都會在場，而這個國王性情非常的暴惡，個性非常的固執。

比如說，佛教安立一個宗旨說：生命是無常的，整個生命的有為諸法是生滅變化的。我們昨天的相貌到了今天就有所變化；你今天很有錢，明天不一定有錢；你今天的壽命在，明天不一定壽命在。就是整個生命充滿了不安穩性，在這種變化中，無常所以是苦，因為你不能預測你明天會發生什麼事情。

當這個無常、苦的宗旨安立以後，馬鳴菩薩就善巧的說：你說生命是無常、是苦，難道國王、王后他們的生命也是無常、是苦嗎？他們是非常的快樂。這時，佛教的論師因為礙於國王個性的暴惡，在氣勢上有所衰竭，就輸掉了。

所以脅尊者就以其人之道反制其人，第二天就隨順國王的心情，安立了一個宗旨，他說：我今天安立一個宗旨，請你來破斥，我們的宗旨就是當令天下太平，國王長壽，國土豐樂，無諸災患，請你破斥。

在這種情況下，他希望國家太平，國王長壽，結果馬鳴菩薩無言以對，就失敗了。當然他的失敗，是馬鳴菩薩太過輕敵了。因此他就歸依了佛教，做佛門弟子。這一段是說明脅尊者馬鳴菩薩善巧方便，折伏憍慢的馬鳴菩薩，這是說明第二段的情況。第三段說明馬鳴菩薩正式皈依對佛法的修學：

/SECTION/第三段、修學

/VERSE9/一日馬鳴獨坐思惟：吾才識廣博，名震天下，如何一言便屈為弟子？師知其心，即命入房，為顯神變，並述法要，心乃悅服。

馬鳴菩薩在一次的辯論失敗以後，就來到佛教的僧團。有一天做完晚課，他就思惟：我通達《吠陀》跟《奧義》的經典，才識廣博，名震天下；脅尊者只是用善巧方便，才能辯勝過我，所以心中非常不服氣。

這時，脅尊者在禪定三昧中，知道馬鳴菩薩的心情，就請馬鳴菩薩到寮房，欲攝受馬鳴菩薩。就做了兩件事情：第一個為顯神變，第二個並述法要。馬鳴菩薩到了脅尊者的寮房以後，脅尊者以阿羅漢的神通力，跏趺坐現在虛空中放大光明。馬鳴菩薩一看：哎呀！這是一個聖人，不可以輕視。內心中對脅尊者由一種輕慢轉為恭敬，就生起了恭敬心。但不明白道理還是不行的，一個人不能只是停留在對三寶的信心，更重要是對三寶生起智慧。

所以脅尊者敘述了整個佛法的要義。脅尊者剛開始對馬鳴菩薩所敘述的要義，就是整個小乘的根本思想，所謂的三法印：諸行無常、諸法無我、涅槃寂靜。小乘的學者在觀察生命，是把生命分成兩個部分：一個是有為法的生命，一個是無為法的生命。

有為諸法的相貌有兩個：一個是諸行無常，一個是諸法無我。就是有為諸法，它根本的性質就是無常，饒汝千般快樂，無常終是到來。所以從無常中，我們知道生命是不安穩的。不安穩中，所以無常、所以是苦；從苦中，知道我們對生命沒有主宰性。假設我們能夠決定我們的生命，我們不可能讓自己墮落在痛苦中，所以生命是不能作主的，是無我沒有主宰性。這個是小乘學者對有為諸法生命的一個觀察，就是無常、無我。

生命的另外一個部分，所謂的涅槃，一個不生不滅、不垢不淨、不增不減的無為法的涅槃。這個涅槃的境界是什麼呢？是一個寂靜的安樂處。這就是整個小乘教法對生命的觀察。

馬鳴菩薩聽了以後，覺得這樣的教法，比他之前的多神教，乃至於一神教的思想更加高超，就心乃悅服，對佛教生起真實的歸依，心悅誠服了。這說明脅尊者剛開始用善巧方便的折伏，最後才用佛法來攝受。

這段是說明馬鳴菩薩的出家因緣。

/SECTION/（三）修學因緣

我們再看第三段，說明馬鳴菩薩出家以後修學的因緣。修學的因緣分成四段，先看：

/SECTION/第一段：遵從師教

/VERSE9/既入佛門，學法於脅尊者及富那奢尊者，盡得其學。尊者富那奢以法付囑，告曰：譬如暗室，燃大明炬，所有諸物，皆悉明瞭；法之明燈，亦復如是，流布世間，能滅癡暗。

馬鳴菩薩修學佛法，第一個是遵從師教。他在遵從師教的過程中有兩個師長：第一個是脅尊者；第二個是富那奢尊者，富那奢尊者是他的大師兄。脅尊者教育馬鳴菩薩，主要是教導義理的部分，就是整個《阿含經》四諦、十二因緣的內容。富那奢尊者本身比較重行門，所以他在整個小乘止觀，特別是小乘禪定有深厚的心得。富那奢尊者在小乘的禪定中，是成就了獅子奮迅三昧。就是這個禪定的過程有入、住、出。一般的外道修禪定是不得自在的，你有時候入了禪定要進去不得自在，或者進去以後想要安住也不得自在，安住以後你隨時想要出來也不得自在；因為外道的禪定，他的內心是向外攀緣的。

這時富那奢尊者告訴他：你修習禪定，要依止我空，向內安住，向空性安住，你就能夠解脫禪定的不自在。馬鳴菩薩以前在外道時雖然修過禪定，但是他沒有依止我空來修禪定，所以這時他就換一個方式、換一個心態，內心中觀察這個我不可得，以我空的心態來修習禪定，他也成就了獅子奮迅三昧。

所以馬鳴菩薩最初的師承有兩個：第一個是脅尊者，第二個是他的大師兄富那奢尊者。所以在《付法藏》的因緣中，脅尊者是第十祖，富那奢尊者是第十一祖，馬鳴菩薩是第十二祖。

富那奢尊者後來跟脅尊者由中印度回到北印度的家鄉，在回去之前就咐囑馬鳴菩薩一個偈頌，講出一個譬喻說：「譬如暗室，燃大明炬，所有諸物，皆悉照了。」眾生的內心都是顛倒愚癡的，心隨境轉；生命中，不知道什麼是功德相，也不知道什麼是過失相。那怎麼辦？只好跟著感覺走。一般人的心情，就是我內心跟境界接觸時，會產生一個受、一個感覺，我現在感覺要去做這件事情，就去做這件事情。

內心中沒有真理的照耀，心隨妄轉，所以是黑暗。這時怎麼辦？燃大明炬，我們應該在世間的黑暗中點起光明，讓大家知道什麼事情是功德，什麼是過失。這個光明就比喻佛法的智慧，能夠開啟眾生智慧的光明，滅除眾生的黑暗，使令眾生離苦得樂。

這段是說明馬鳴菩薩剛入佛門時接受佛法的教育，包括脅尊者四諦、十二因緣的教育，包括富那奢尊者禪定的教育。接下來第二段說明馬鳴菩薩的遊學參訪：

/SECTION/第二段、中印度弘法

/VERSE9/馬鳴敬受尊教，於是遊學參訪，增廣見聞；弘宣正法，摧伏外道。嘗於華氏城，依《賴吒和羅經》調和琴瑟，並自擊鐘鼓，令城中五百王子，厭惡五欲，出家學道。

馬鳴菩薩在脅尊者跟富那奢尊者離開中印度以後，就在中印度參學。在中印度的整個參學中，他參訪了有部的思想，也參訪了經部的論師。這當中值得一提的是：他參訪一個經部的論師勝受法師（殊勝的勝，感受的受），勝受法師有一個心得非常重要，他認為說：

這個生命有有為法，所謂雜染的生死法；也有無為法，所謂清淨的涅槃法：這兩個法都是由心所變現的——心為業主。

他提出這個觀念說：這個法本身不能決定染淨，你的心清淨，就變現了涅槃之法；你的心隨順煩惱染污，就變現生死法：所以染淨諸法是由心所變現的。這個思想在有部是不可能存在的，因為有部思想認為法是真實性，所以馬鳴菩薩得到很大的啟發。

不過在藏經裡面提到，馬鳴菩薩聽到心為業主時，提出了一個疑問：心有雜染的部分，有創造煩惱罪業的功能；也會出現善良的功能，而表現出戒定慧。我們這一念心有雜染的心、有清淨的心，這兩個心到底是同是異？這個雜染心跟清淨心的相互的關係是什麼？這時勝受法師沒有辦法回答，這是馬鳴菩薩心中的一個疑情。

/SECTION/第三段、北印度弘法

/VERSE9/嘗於華氏城，依《賴吒和羅》經調和琴瑟，並自擊鐘鼓，令城中五百王子，厭惡五欲，出家學道。

這說明馬鳴菩薩在中印度，除了參學以外，他對外弘法的一個因緣。

他當時根據《賴吒和羅經》，賴吒和羅是大富長者的兒子，很有善根，本來想要出家，因為父母的反對沒有辦法出家，賴吒和羅就絕食七天，後來父母親愛護兒子，所以就讓他出家了。他雖然出家，他父母親用種種的財富、種種的眷屬因緣來障礙他。但是賴吒和羅比丘善根非常深厚，他觀照世間的五欲是無常的，在解脫種種的障礙以後，終於證得阿羅漢果。

馬鳴菩薩就根據他這方面的才華，把賴吒和羅比丘整個出家的過程、修學所遇到的逆境、如何突破，編成一個故事，用戲劇、詩歌的方式唱誦出來。在整個城中，當時有五百多個王宮大臣的兒子去觀察，結果他們看完這齣戲以後，都厭惡五欲而出家學道，引起了整個中印度王宮大臣的反對，國王從今以後就禁止馬鳴菩薩在大眾場合表演戲劇。

這是說明馬鳴菩薩他在中印度的修學情形，乃至於弘法的情況。`;
