QXL.volNum = 6;
QXL.text = `
請大家打開《講義》第十一頁。

我們上一堂課程講到馬鳴菩薩造作本論的因緣，簡單的說明馬鳴菩薩之所以造作本論，是要成就大乘的信、解、行、證四種功德。這個信、解、行是大乘的因相，證是大乘的果相，所以說有如是等因緣，所以造論，主要是成就大乘的因相跟大乘的果相，所以造作本論，是這樣的一個宗旨而安立這個法門。

/KEPAN/戊二、釋疑明意
/KEPAN/己一、釋疑
/KEPAN/庚一、征問

這裡提出一個問答來說明因緣的內涵，這當中分兩科，先己一、釋疑，先提出疑問，疑問中先征問，再回答。

/VERSE/問曰：修多羅中，具有此法，何須重說？

有人問：成就大乘的信解行證四種功德，在佛陀的經典中有種種的宣說，如《華嚴經》《法華經》都是在發明信解行證的功德，為什麼馬鳴菩薩要重複的宣說呢？就是本論在發明信解行證，到底有什麼不共於其他經典的地方？有什麼樣的特色？提出這個問，才不會重複。

/KEPAN/庚二、答釋
/KEPAN/辛一、總釋

回答中先總答，再別答。

/VERSE/答曰：修多羅中，雖有此法，以眾生根行不等，受解緣別。

在佛陀的一代時教中，的確有很多的經典能夠成就大乘的信解行證，這個法本身沒有錯，但是能接受的眾生他的這念心有根行的不等。這根行不等，蕅益大師解釋比較詳細，他說：什麼叫根呢？種子叫做根。就是每一個眾生過去生所熏習的大乘佛法淺深有所不同，所以他大乘的善根有強弱的不同，就是過去所熏習的種子叫做根。

行就是現行，就是他內心的喜好，他表現出來的喜好有廣略的不同。有些人喜歡廣學，他廣學以後，他更能夠成就他的大乘善根，他讀得愈廣，他對大乘法愈生好樂；有些人喜歡簡略，他廣學則心思散亂，他必須吸收一些比較精華的心得部分：就是說每一個人在學習大乘佛法，的確有他喜好廣略的差別，這叫做行。

因為眾生的根行不等，所以接受這些經典的因緣就有所不同，所以每一部經、每一部論都扮演不同的角色。本論扮演的角色是什麼？我們看各別解釋，先看佛在世，再說佛滅度。

/KEPAN/辛二、別釋

/VERSE/所謂如來在世，眾生利根。能說之人，色心業勝。圓音一演，異類等解，則不須論。

有佛陀出世時，眾生的內因力強，你一個人能夠生在佛世，那一定是已曾供養無量諸佛、集眾德本，你大乘的善根力強，你的善業力也強，而且能夠遇到佛陀的說法。佛陀的說法有什麼特別呢？我們凡夫的說法跟佛陀的說法有什麼差別呢？佛陀色心業勝，圓音一演，異類等解，則不須論。佛陀的身口意三輪都特別殊勝。

先看佛陀的身業。佛陀所現的身相是三十二相、八十種好的莊嚴。龍樹菩薩在《智度論》上說：要成佛，要三祇修福慧，百劫修相好。你要花三大阿僧祇劫來成就六波羅蜜的福德、智慧兩種資糧，來成就你自受用的法身、報身；其次，你要花一百劫的時間來修相好的應化身，成就你這一期八相成道的莊嚴。

那百劫修相好產生什麼效果呢？龍樹菩薩說：佛法的真理是違背凡夫的思想，我們凡夫的思想你用佛法來看，百分之九十九都是錯誤的、顛倒的。佛陀演說這樣一個違背眾生思想的真理，他如果沒有現出相好，是沒有辦法攝受眾生的。佛陀的相好到什麼程度呢？你如果能夠親眼看到佛陀的三十二相、八十種好，你可以隨時為佛陀犧牲生命在所不惜，他的三十二相對你的攝受力達到這種程度。所以演說正法的佛陀，他身相的莊嚴對我們產生很大的信心，這是<c339>第一個殊勝──身相的莊嚴。</c339>

<c339>第二個，佛陀內心的殊勝。</c339>佛陀有種種的神通，當然主要的是他心通，佛陀能夠善巧觀察眾生的根機，施給我們適當的教法，就像好醫生要能夠正確的把出你的脈，才能夠開出適當的藥。所以佛在世時，我們面對的說法者是身相莊嚴、內心有智慧的觀照，所以非常殊勝。

<c339>第三個，佛陀的口業也不可思議。</c339>圓音一演，異類等解，則不須論。什麼叫圓音呢？這個音聲是沒有欠缺的。

在《維摩詰經》上說：佛以一音演說法，眾生隨類各得解，皆謂世尊同其語，斯則神力不共法。同樣一個觀念，有很多的表達方式，不同的表達方式，佛陀用一個音聲來說法。比如說佛陀是北印度人，佛陀講出北印度的話，佛以一音演說法，在座的眾生有人道、有天道、有中國人、美國人、各式各樣的人。眾生隨類各得解，每一個人都聽到他適當的表達方式。皆謂世尊同其語，每一個人都認為佛陀是專門為他說法的，這個法他聽起來剛好是恰到好處。這個是斯則神力不共法，是佛陀不共於一切二乘、菩薩的特殊功德，佛陀的口業殊勝。

也就是說如果我們今天生長在佛世，那馬鳴菩薩不須要造論了，第一個你善根也強，第二個有佛陀直接為你說法，本論就沒有多大的意義。因為你要成就大乘的信解行證在佛世有很多的方法，不需靠本論，這是講佛在世的因緣，再看佛滅度以後：

/VERSE/若如來滅後，或有眾生能以自力，廣聞而取解者。或有眾生，亦以自力，少聞而多解者。

這是講到像法時代。像法時代，如來滅後，或有眾生能以自力，廣聞而取解者，這個人他的悟性特別強、善根強，他不必靠別人演說，他直接看經典就不會錯認消息，而且廣泛的學習而得到大乘的信解。當然有大乘的信解，就能產生大乘的修行，成就大乘的功德。或者有些人他靠自己的力量，他能夠少聞、能夠專精的閱讀某一部經論，就能夠生起大乘信解行證的功德。

法藏大師說：自力的成就有廣聞跟少聞的差別：如果是廣聞而成就者，他能夠成就憶持而且成就聞持；如果是少聞而成就信解行證，只有憶持沒有聞持。

我們作一個說明，就講大乘的道理好了。大乘的法門要緊在達妄本空，知真本有，對我們這念心的妄想是破壞，對這念心的本性是加以肯定，有所肯定、有所否定。這個觀念，你看《華嚴經》或是天台宗的學者，他解釋大乘的不二法門，每一個觀念都用十門，講出十個角度，表示這些人都是廣聞，他不但義理上能夠通達，而且能夠安立很多很多的善巧名言，他有憶持跟聞持。

但是你看禪師在開示法語，他的話就講得很簡單，他心中的名相少，一個觀念可能只用一個名相來表達。你再問他，他把他的話再重複給你聽，你再聽不懂，他就走了。就是說他只能用一個角度來發明這個觀念，因為他少聞，但是義理是沒有差別的，而在表達義理的善巧就有廣略的不同。當然不管怎麼樣，這些人都能夠成就自力的功德。

/VERSE/或有眾生，無自心力，因於廣論而得解者。

這個也是不錯，這個人他自己沒有心力，善根薄弱，不能直接看經典，必須要靠菩薩造的論，菩薩造論他能夠廣泛的學習，這個人一般來說心比較寂靜，煩惱淡薄，所以他廣泛的學習，能夠得到理解。

<c339>第四個，就是本論所要加被的對像，</c339>馬鳴菩薩造論所要加被、所要攝受的對像。

/VERSE/自有眾生，復以廣論文多為煩，心樂總持少文，而攝多義，能取解者。

特別是末法眾生，他覺得廣泛學習很多的經論，實在是太耗神，太繁瑣，內心中好樂總持少文，文字愈簡單愈好，義理能夠愈豐富，而得到理解。

這個意思就是說，末法時代眾生的一個特性：畏繁樂簡。蕅益大師說：《大智度論》解釋《般若經》，當初在印度時，它是有一千卷，一千卷到了中國以後、到末法時代時，輾轉相傳只剩下一百卷，十倍略之，龍樹菩薩把它十倍略之。為什麼呢？因為眾生的心太粗重了，一千卷沒辦法憶持，只能夠背一百卷。

我過去看一篇文章，西方所發表的文章，一個天主教的神父發表文章說：在中古時代天主教的傳教，每一個人固定禮拜天要到教堂去聽神父開示。那個時代神父的開示，開演聖經的道理是講一個半小時，他聽得非常法喜。後來一個半小時大家沒辦法，頂多祗能開顯四十五分鐘，一半。天主教神父說：到了現在，美國各地教堂禮拜天的開示，神父頂多祗能開示十五分鐘，超過就沒辦法了、受不了了，就是心識粗重。

我個人的學習經驗也有這種感覺，就是說我讀佛學院時：第一年時我發覺我很認真在聽，但是老法師在講什麼我完全聽不懂。我真正聽懂法師在講什麼，是二年級時，突然間好像一個人眼睛打開了。唉呀！老法師是在講這件事情。我自己去回想觀察這個因緣，同樣的法師開演同樣的法，我第一年為什麼聽不懂？

我自己感覺到：一個人從世俗來到僧團，你只是一念的發心，你心中的相貌完全都沒有改變，妄想名言一大堆。就是說初學者來到僧團，內心中心隨妄轉，一天到晚都跟妄想打在一起，哪有時間聽佛法！偶爾把妄想撥開聽幾句如此而已，大部分的時間都被粗重的妄想所纏繞。慢慢地，在僧團中拜懺、持戒、修福，妄想慢慢輕薄了，就是你這念心跟法接觸時，中間的烏雲比較輕薄了，你突然間聽懂法師在講什麼道理。這裡就是說末法時代妄想粗重，妄想粗重你想廣學也沒辦法，沒有禪定的攝持力。

/KEPAN/己二、明意

/VERSE/如是，此論為欲總攝持如來廣大深法，無邊義故，應說此論。

在末法時代，眾生花很多時間打妄想，剩下的時間不多了，妄想的空隙不多了，剩下能夠專心用功的時間不多了。我們應該要趕快利用寶貴的人身，不打妄想的時間，要能夠攝持如來廣大甚深的法門，而且含攝無量的義理，而且文字不能太多，所以馬鳴菩薩造作此論。

簡單的說，本論的特點在於文簡意賅、辭約理富，在最短的時間建立你的大乘善根，這就是他為什麼融合一百部的大乘經典，而安立本論的主要目的。這就是本論不共於其他經論的地方，是文字簡要、義理豐富。到這裡是說明造論的因緣。

/KEPAN/丙二、立義分
/KEPAN/丁一、結前生起

這以下正式說明本論安立的宗旨，這當中分兩科，先看丁一、結前起後：

/VERSE/已說因緣分，次說立義分。

前面先說明造論因緣，這以下說明本論的宗旨。

/KEPAN/丁二、正立義宗
/KEPAN/戊一、總標

這當中分二科，先看總標：

/VERSE/摩訶衍者，總說有二種。云何為二？一者法，二者義。

開顯大乘的佛法有兩個主題：一個是法，一個是義。法藏大師解釋這個法說：法是能詮，是法的自體；義是所詮，是法的含義：一個是能詮，一個是所詮。這個解釋比較容易理解。說什麼是法？因緣所生就是法。因緣所生中有一個道理，它有一定的軌則，這個法為什麼會出現？為什麼會痛苦？為什麼會快樂？這當中有一個道理、有一個章法，章法就是它的道理。義，義理是在解釋這些因緣所生法的一些軌則。

/KEPAN/戊二、別說
/KEPAN/己一、出法體
/KEPAN/庚一、就體總立

把法跟義的內涵各別的說明。先講法，這當中分兩科：先就體總立，再開門別立。先作一個總說，再別說。

/VERSE/所言法者，謂眾生心。是心則攝一切世間、出世間法。依於此心，顯示摩訶衍義。

這個法當然就是因緣所生，因緣所生的法主要就是我們這一念心。因為因緣法的造作是靠業力，這個業力是由心所推動的，所以心是一切因緣的根源。說是心攝持一切世間的雜染法，也攝持出世間的功德法。

心為什麼攝這兩個法呢？

《大乘阿毗達磨經》上說：無始時來界，一切法等依，由此有諸趣，及涅槃證得。就說我們這念心的造作：有時候遇到三寶的境緣，它會造作布施、持戒、忍辱等等善業，這個業造了以後就變成一個功能保存下來；有時候遇到染污因緣的刺激，也會造殺盜淫妄的罪業，這個業也被心保存下來。所以說因為有這些種子，心的造業跟保存。

所以說因為有這些種子，心的造業跟保存，所以由此有諸趣，及涅槃證得。等到因緣成熟時，業力就表現出來，就有生死流轉的世間法；也有因為戒定慧因緣的累積，就有涅槃的出現。所以沒有心，這一切的雜染法、清淨法都不能建立。要有心去造作，也要有心來保存，才能夠有世間的雜染法跟諸佛菩薩的功德莊嚴出現。

因緣所生法簡單的說就是：心。

依於此心，顯示摩訶衍義，所以我們就依止心，來開顯大乘的不二法門。大乘的義理，是靠心安立的；小乘的義理是靠空性，它不依心性。所以小乘的學者不同意生命是無量的。他成就阿羅漢以後，在沒有入涅槃之前，你遇到他他會加持你、為你說法；入涅槃以後，他就在法界完全消失，他的生命消失了、他的智慧什麼都消失了，灰身泯智了。他沒有所謂的時空無盡，虛空有盡，我願無窮，沒有這回事。因為他依止的根源有問題，他沒有依心性而修，他依空而修。所以大乘佛法的依止點是心，有無量生命的觀念。這個是總說，再看別明：

/KEPAN/庚二、開門別立

/VERSE/何以故？是心真如相，即示摩訶衍體故。是心生滅因緣相，能示摩訶衍自體相用故。

我們這念心如何來攝持整個大乘法義呢？

大乘法義這麼廣大！簡單的說心有兩個相貌：一個真如相，一個生滅因緣相。

真如相：真就是真實不虛，它不是我們的名言虛妄捏造出來的；如，恆常不變，過去如此、現在如此、未來如此，它不隨時空而改變。這個真如的法是顯現大乘的體性，就是顯示心的體性。這念心它有隨順染淨的因緣，有所謂個體因緣的生滅，顯現大乘的相用，所謂的生滅門。

真如跟生滅，蕅益大師作一個譬喻，他說：譬如大海，大海是深廣無涯。我們怎麼了解這個大海呢？要從兩個角度了解：第一個，大海它的體性是不變，它的濕性是不變；但是大海的波浪是變化的，它有個體的生命因緣，就是大海遇到各式各樣的風的吹，有的變大波浪、有時候變成小波浪，有時候現出漂亮的波浪、有時候現出丑陋的波浪。就是說凡夫的心本來清淨，但是受業力的熏習，在流轉中，有時候現出轉輪聖王的尊貴果報、有時候現出螞蟻的卑賤果報，有各式各樣的因緣，就像波浪不斷的變化，但是它的濕性不會改變。這個濕性就是我們心性的自體，假名為真如；業力所熏習變現的五蘊身心果報，就是這個波浪，它不斷的變化；但是變化又相續，相續又變化，顯現心的作用。先說明法的自體、相用，再看它的意義，這個法有三大軌則。

/KEPAN/己二、彰名義
/KEPAN/庚一、明大義

/VERSE/所言義者，則有三種。云何為三？一者體大，謂一切法，真如平等，不增減故。二者相大，謂如來藏，具足無量性功德故。三者用大，能生一切世間出世間，善因果故。

這地方很重要──三大，這三大是我們凡夫已經忽略很久的一個觀念。我們要先了解三大，才能夠隨順，由隨順而成就，就是說你沒有成就三大，就沒有所謂的乘。從本論來說，我們要改造生命要先依止三大，否則改造生命變成不可能。什麼是三大呢？

/SECTION1/一、三大

/SECTION/（一）體大

/VERSE/一者體大，謂一切法，真如平等，不增減故。

這個體大就是真如平等，從真如法性來說，我們跟十方諸佛是平等的，沒有增減之相，在凡不減，在聖不增，所謂的自他不二。當然從業力來說會有增減：比如說你今天拜了一部《八十八佛》，從生滅門來說，你的生命增加了一個善業，就是你招感安樂果報的功能加強了；你起了惡念，你的生命也有變化，就是邪惡的功能增加，招感痛苦果的招感力加強。這個是變化的，但是你不管造善造惡，有一個東西是不變化的，就是你的本性真如，所謂的自他不二。

這個自他不二觀在修淨土宗，蕅益大師倒是滿強調的，他說：你念佛，這個真實信心的建立，在於自他不二觀念的建立。比如說我念佛，當然淨土法門是歸依，說我是苦惱的眾生，我是有自性的；佛陀是萬德莊嚴，佛陀也是有自性的。我是如此的卑賤，佛陀是如此的偉大，但沒關係，我歸依你。蕅益大師說：這樣的歸依是不決定，有很多的障礙。那要怎麼歸依呢？你要觀察你跟本尊是不二，就是我不可得。

什麼叫我？就是我一念的心性──所謂五蘊的果報，我的感覺；我的色，我的外表；受，我的感受；我的思想：把這些業力所熏習的東西撥開來，就是我們一念的心。佛陀的萬德莊嚴也是因緣所生法，是六波羅蜜的因緣所成就的萬德莊嚴，把它撥開來，佛陀也現出一個心。這時我們發覺心心相印，自他不二，能夠了解到自他不二的感覺來歸依，這時的歸依力量特別強大。所以這裡，首先了解到我們凡夫的心跟佛的心是平等無差別的，自他不二的觀念。

/SECTION/（二）相大

/VERSE/二者相大，謂如來藏，具足無量性功德故。

前面是體性，這個是相狀。就是說我們這念心在體性上，具足無量的功能德用，有這種可能性。這裡的性功德，到了中國佛教的末流，很多人錯認消息。有些人說：什麼叫無量性功德呢？就像把倉庫打開來，珍寶自然具足。所以很多人就產生懈怠，說是大乘佛法不要學習，掃地也可以開悟。開悟的智慧，每一個法的生起要有一定的因緣，你造作某一個法有某一個法的因緣。

什麼叫做具足呢？智者大師講性具，他很強調一個觀念：所謂的性具，是建立在諸法不自生，亦不從他生，不共不無因，是故知無生，依無生法而安立性具。也就是說所謂的性具，是安立在一切法自性空，因為空所以有無量的可能性，所以叫做性具。所以如來藏具足無量性功德，是說我們這念心有無量的可能性。

比如我們今天對生命的規劃，我希望來生做國王，可以，因為你的心有成就國王的可能性；但是要假藉因緣才能夠啟發，你就布施、持戒，你來生要莊嚴就持戒，我來生要各式各樣的功德都可以成就。就是說我們這念心有成就十法界的可能性，這叫做性具。這裡是講到我們的相狀有無量的可能性，當然這裡是偏重在善良的這部分，講性功德。

/SECTION/（三）用大

/VERSE/三者用大，能生一切世間出世間，善因果故。

前面的兩個是偏重在真如體性的觀照，它是平等不二，具足無量的功德；這裡是講生滅作用，就是能夠實踐的去做一些善法的因緣，就能夠開發出善的因果，能夠真實受用。前面的乘性功德是不能受用，只是具足；要假藉六波羅蜜的因緣，才能夠生起善因果。

這裡，蕅益大師提出一個觀念：我們一念心能夠生起善的因果──布施、持戒、忍辱、精進、禪定、智慧善的因果，那惡的因果是怎麼來的呢？現實環境，我們的確也造一些惡因去招感三惡道的苦果，我們這念心本來的設計是沒有惡的因果，為什麼會有惡的因果？

蕅益大師說：這惡的因果，是違背真理，顛倒所生，所以它虛妄不實。所以這個惡因果是情有理無，凡夫的妄想才有，就是你做夢才有，醒過來就沒有了，它是情有理無。所以在智慧觀照的中，是不承認它存在，它是一個虛妄相。

從心的體相用來說，我們的真實的相貌是具足體大、相大、用大，這個是講到大。接下來講乘：

/KEPAN/庚二、顯乘義

/VERSE/一切諸佛，本所乘故。一切菩薩，皆乘此法到如來地故。

這裡講得很肯定，就是說過去、現在、未來三世諸佛沒有一個例外，他能夠成佛一定要依止體相用三大而成就乘。就是一切諸佛為什麼能夠成就上求佛道，是依止體相用三大的修學而成就的；一切菩薩在因地時，也是依止體相用三大成就到如來地。這是講到一切諸佛菩薩的功德，都是假藉體相用三大而成就的，沒有一個例外。

這裡我們作一個說明。大乘當然是我們所依止的，依止大乘的義，使令我們的心能夠從雜染的心識轉成清淨的心識，所以大乘是所依止。本論中很強調根源，所謂依止處、觀照力，還有行動力，行動力是後面業力的修學。

就是說我們從因緣法來說，一定要先知道你的因種是什麼。說你今天拿沙去煮，不能煮成飯，你用很大的火去煮，你盡你最大的力量去加行，斷惡、修善，但是沙頂多變成熱沙，因為沙非飯本，它不是成就飯的因種。你沒有把飯的因種找到，你怎麼煮還是沙。你要煮成飯怎麼辦呢？你要先找到米，有米的加行加熱才煮成飯，是這個意思。說是你要成就大乘的功德，你要成就菩薩的功德，你要把你的因種找到。

我們凡夫內心是在虛妄的妄想中，以自我意識為因種；自我意識產生以後，對眾生產生對立；從對立中，產生我愛、我癡、我見、我慢，愛著自我的一個私慾，處處保護自己；以這種自我的私慾，修習一切的善法都是有漏。為什麼？因種不對。拿沙去修善業，變成熱沙。所以你在修善之前，要把你的因種找到，你要依止體相用三大為因種。

《六祖壇經》講到一個公案：有一個叫做南嶽懷讓禪師，他以前學過天台宗，讀過《法華經》《涅槃經》，他後來覺得修行不得力。古人是非常的面對現實，他不得力他一定要弄明白，他就去親近參訪六祖大師。向六祖大師禮拜以後，六祖大師就問他說：你從什麼地方來？古人講話一針見血，他不問你一天拜幾拜佛，這個只是加行是枝末的東西，就是說你到底找到你的家沒有？你從什麼地方來？

這時懷讓禪師沒辦法回答，他不知道他的因種在哪裡？所以沒辦法回答。古人他有慚愧心，依止善知識依止了三年，在六祖大師的座下學習三年。三年以後，他就跟六祖大師說：他明白這句話的意思了。六祖大師就問他說：你從什麼地方來？懷讓禪師說：說似一物即不中。說因種不能講，一講就落入對立，它是一個不二的現前一念心性。不能講，那怎麼知道你是對還是錯，有沒有錯認消息？

六祖大師就繼續追問：說似一物即不中，還有修證否？這個東西可以修證嗎？懷讓禪師說：修證即不無，污染即不得。這裡不錯。

就是說從修證的角度是不無，不無就是有，就是說這個因種你一修證，它會不斷的開顯，不斷的成就；從作用上來說，你不斷的修證，真如佛性會不斷的開顯，力量增長，所以不壞因果。體性上來說，污染即不得，它體性不能染污，簡單講就是即空、即假、即中。六祖大師很高興的說：即此污染不得，即三世諸佛之所護念，你是如，我也是如，諸佛也是如。這個是，三世諸佛的大乘清淨傳承你已經得到了，你已經得到正確而不顛倒的因種的傳承，你有資格修行了。

古人經常講說：你這個人修行上路了沒？什麼叫做上路呢？有些人他自己的因種沒有找到，每天只是積集善業。就像一個人還沒有找到高速公路，還在市區晃，你晃了三十年，你內心中還是這種相貌。差別在你學佛以後，在你的妄想心中多了一點善業，內心無量無邊的顛倒完全沒有改變，來生大富貴使令你迷惑，第三生墮落。不是佛法不能對你產生滅惡生善的功能，因為你沒有得到因種。所以你這個高速公路還沒找到，怎麼能夠到達台北？所以一個人能夠成就大乘的因種，就是你上了高速公路，這只是時間的問題而已。

《瑜伽師地論》講到菩薩的種性說：一個人能夠成就大乘種性，他能夠如實了知何期自性本自清淨；何期自性本自具足；何期自性能生善法。這個人有兩個相貌：

第一個，雖造惡業，速疾能悔。這個人偶爾也會起煩惱罪業，但是他知道內心是清淨，不依止自我意識，他的惡業不會太久，他一發動以後，他的佛性也會發動，會產生一種增上慚愧。你看有些人起恶心時很堅固，你怎麼勸他也沒辦法改變，這個人一定是依止自我意識修行，他認為煩惱是我的一部分、是我的本來面目，怎麼能改變它？頂多祗能夠調伏一點而已。一個人了解到何期自性本自清淨，你要消滅煩惱比較容易，雖造惡業，速疾能悔。

第二個，若墮惡趣，終不久留。即使你無量劫中有一些罪業到三惡道去，你不會久留的，你會很快彈出來，因為你的因種跟十方諸佛相同。套一句禪宗的話：你跟三世諸佛已經是同一鼻孔出氣。你今天是一個王子，你成佛只是時間的問題，懈怠一點就慢一點，精進的話就快一點。

這裡就是說，我們一定把這個乘，你要到彼岸你要把車乘找到，這個車乘就是體相用三大，就是我們的依止處。從今以後不要跟著自己的名言妄想走，隨順於體相用三大。這體相用三大，在後面的發揮是分兩部分：一個是觀照力，內心的觀照，是觀照體大、相大；第二個是行動力，實際的生起六波羅蜜的作用，產生善因果，這用大是屬於行動力：一個是觀照力，一個是行動力。這個體相用三大的修學，後面馬鳴菩薩會詳細的說明。

我們今天先講到這裡。

【學員提問】法師慈悲，本論的起信，有信根本、信佛、信法、信僧；跟小乘的四不壞信，信佛法僧戒不同，這是大小乘的不同，或是本論的特色？

【師父答疑】這四不壞信從經論上說是小乘初果的聖人，他對佛法僧戒產生堅定不移的信心。就是說他是一個初果的聖人，他遇到佛法僧，他會用他的生命來供養、歸依三寶，這是講他外緣；他的內心中，能夠任運防非止惡，對惡法能夠產生排斥、對治。但大乘佛法的信心，佛法僧是相同，但是他是依止真如，他能夠隨順體相用三大。這兩個是大小乘不同。

我們講修行有內因力、外緣力，外緣力佛法僧應該是沒有多大的差別。小乘的因種是戒；大乘的因種是根本，這根本就是真如。

小乘的戒它的內涵偏重在斷惡，就是我的生命中不要生起惡法；但是對於無量無邊的波羅蜜，對於生善、度眾生他不是很主動。但大乘真如它的體相用三大，體大是偏重在滅惡，相大是生善，用大是度眾生，可以簡單的這樣說。所以它整個稱性起修，是有所破壞、有所建設。所破壞的是惡；所建立的是自性具足的善根，把善根表現出來，而生起生善度眾生。所以這個根本它有生善、度眾生的地方是不共小乘。

在修學的過程中，斷惡這一部分是共聲聞學。斷惡這部分，包括斷除性戒、也包括斷除遮戒，令眾生生起信心。因為你有美好的威儀，令三寶久住，未生信心令生信心，已生信心令更增長。

所以我們可以這樣講：大乘佛法是根本教法，小乘佛法是大乘的一個旁支，是佛陀的為實施權；但是有些地方，大乘要共聲聞學，斷惡這部分要共聲聞學。`;
