QXL.volNum = 9;
QXL.text = `
請大家打開《講義》第十九頁，辛二、釋心生滅門

本論的宗旨，是要引導我們眾生能夠離一切苦，得究竟樂。怎麼樣才能夠成就究竟的離苦得樂？從本論的開導中，我們必須修學三個主要的法門：第一個是觀照力、第二個是誓願力、第三個是行動力。這三個法門的修學有一定的次第。也就是說，我們一定要先成就對生命的正確觀照，才能夠產生正確的希望，引導一個正確修學的行動。

所以在本論的解釋分中，剛開始就是引導我們能夠正確的觀察生命的真相。生命的真實相可以說是一個無止盡的水流，從過去流到現在，也會從現在流到未來，在這樣一個相續變化的水流中，我們應該如何來了解生命的真相？從馬鳴菩薩的開導，我們應該從兩個角度來觀察生命的真相。

/SECTION/一、從假入空

剛開始，我們應該是從假入空觀，就是依止我們現前這個身心世界的果報體，來觀察我們的身心世界，不管是外在的身相、或者是內心的思想，都是假藉種種業力的因緣變現出來的。所以我們說因緣所生法，我說即是空，透過緣起性空觀，把這些假藉因緣所生的身心世界撥開來；就觀照到我們內心深處的清淨本然，週遍法界的真如現前。在真如的理性中，是不生不滅、不垢不淨、不增不減的一種絕待平等的生命，我們稱為所謂的整體生命，或者叫真如門。也就是說我們在觀察這個水流時，我們先觀察在整個波浪的變化中，那個不生不滅、不增不減、不垢不淨的濕性，就看到整個生命總相的一個整體生命。

/SECTION/二、從空出假

第二個方法，我們可以從空出假觀，從絕待平等的生命中，再回到現實的個體生命。可以了解到：我們由於過去某一個時空所創的業力，這個業力就出現一個暫時流轉的個體生命。你現在的生命有一個外表的形狀，這個外表的形狀在內部有很多的受想行識──很多的感受、很多的思想、很多的了別作用，這個都是你在過去的某一個因緣中所創造的業力變現出來的。就是說你從一種平等的法界，又回歸到你個體生命的觀察。我們就是從個體生命的觀察又回到本體生命，從本體生命又回到個體生命；從真如而觀察生滅，從生滅而觀察真如。你能夠從真如跟生滅這二個角度來觀察生命，你就是正確而不顛倒的了解到生命真的實相，也就是你已經具足大乘的觀照力。

前面一科主要是針對於整個流轉生命中的真如門，一個平等的生命來說明；以下心生滅門就講到我們在流轉中，由於業力變現的個體生命。

/KEPAN/辛二、釋心生滅門
/KEPAN/壬一、正釋此心生滅因緣相

心生滅門分兩科，我們先看第一科。生滅門它是由業力所變現，我們在造業時是剎那剎那生滅的。譬如說你拜佛，每一拜佛是剎那剎那生滅，所以它得果報時，它的果報相也是剎那剎那生滅，所以叫做生滅因緣相。他這個個體生命的相貌：你昨天的身心世界跟今天不一樣，你今天的身心世界跟明天也不一樣。為什麼不一樣呢？因為我們因地造業的每一個剎那都是有變化的，所以會出現所謂的生滅因緣相。這一科就廣泛的說出，生滅因緣的差別相。這當中分兩科：

/KEPAN/癸一、明染淨生滅
/KEPAN/子一、正釋心生滅
/KEPAN/丑一、標名列義

生滅因緣相，具足來說其實就是兩種相貌：一個是雜染的相貌，一個是清淨的相貌；一個是隨順於六凡法界流轉門的雜染生滅，一個是隨順於四聖法界還滅門清淨的生滅相貌。這兩個相貌在本論中，會詳細說明它生起的因緣跟消失的因緣，所謂染淨的生滅。

這當中分成三小科，先看子一、正釋心生滅。既然講到生滅的因緣相，在大乘佛法生滅因緣相是一個果報相，所有的果報都不能夠離開心──它的一個原點。所以一定先了解心的染淨生滅，你才能夠知道果報的染淨生滅。所以我們剛開始先就著我們心的生滅相，來探討為什麼會有這些六凡法界的出現？為什麼會有四聖法界的出現？先從內心的世界去了解，所以先正釋心生滅。這當中分成三小科，先看第一小科，丑一、標名列義，先把生滅心的名稱跟它的內涵作一個總說。我們看論文：

/VERSE/心生滅者，依如來藏，故有生滅心。所謂不生不滅，與生滅和合，非一非異。名為阿賴耶識。此識有二種義，能攝一切法，生一切法。云何為二？一者覺義，二者不覺義。

這裡，法藏大師把它分成三科：

<c339>第一科是標題</c339>，說明生滅心所依止的體性。

心生滅者，我們平常個體生命的心是變化的，這些生滅心是怎麼來的？是依如來藏才有所謂的生滅心，這個如來藏簡單的說就是真如。真如有兩部分我們前面說過，真如有如實空義跟如實不空。在如實不空中，講到如來藏具足無漏性功德故，在真如裡面的如實不空這一部分就安立做如來藏，說它等於是真如的一部分，它是屬於不空這一部分。

什麼叫如來藏呢？如來藏字面的意思，就是如來的功德法是含藏在眾生的心中。就是眾生的心，有成就如來功德的可能性，如來藏具足無量性功德故，這叫如來藏，如來之法含藏在眾生的心中。這裡我們作一個解釋。譬如說有一個平靜的海水，這個平靜的海水由風所吹就變成了波浪。當然波浪會變化，前一剎那的波浪跟下一剎那的波浪，就產生很多個體的波浪出現。我們就問為什麼會有波浪呢？你說有風，當然風只是個助緣；究竟來說因為有水才有波浪，是風吹著水而變成波浪，所以它是依止這個水而有的。

這意思就是說：我們的生滅心是怎麼有呢？它剛開始是一念清淨的平等心性，為無明妄動的風所吹，所謂真如不守自性，不守自性就向外攀緣，一念的妄動，這時就變成所謂生滅心，就是依如來藏，故有生滅心。這句話，馬鳴菩薩要告訴我們一個觀念，就是生滅心不是我們的本來面目，它是後來才有的，我們後來一念的無明以後才有的，我們的本來面目是如來藏，這句話有這個深義。依如來藏，故有生滅心，就是我們在如來藏清淨的法界中，一時的顛倒，所以變成了生滅心。所以生滅心是因緣所生法，如來藏是眾生本具的，就有這一層意思。所以這一科是標題，先把生滅心它的一個根源全說出來。

<c339>第二科是辨相</c339>，辨別這個生滅心是什麼樣的相貌。什麼叫生滅心呢？

所謂不生不滅，與生滅合和，非一非異，名為阿賴耶識。這個生滅心簡單的講就是阿賴耶識，阿賴耶識翻成中文叫藏，它含藏一切諸法的種子，變現一切法的果報，這叫做藏。這個阿賴耶識，它是一個什麼相貌呢？本論說阿賴耶識是一個不生不滅的清淨本性，或者講真如，跟我們後來一念不覺以後那個妄動的生滅相，兩個合起來叫阿賴耶識。就是不生不滅的本性跟生滅的作用和合起來叫阿賴耶識。

這裡值得我們注意的是：什麼叫和合？一個是生滅，一個是不生滅，這兩個東西怎麼混在一起？這個和合不是二個個體混在一起，而是一個個體的一體二面。我們怎麼了解和合呢？馬鳴菩薩慈悲，怕我們誤會和合這二個字意思，就標出什麼叫和合呢？簡單的說就是非一非異。

這個非一非異，蕅益大師在註解上說：這四個字就是解釋和合這兩個字的意思。說非一，真如的不生滅跟這個生滅的作用，它們二個的作用是不同的，相用差別故，所以非一。為什麼講非異呢？因為同是一心故，它們是同一個心的體系，所以攝用歸體來說叫做非異。依體起用來觀察它們二個各有各的相貌：一個是寂靜的不生滅相，是無為法；一個是生滅變化，隨業力變化的有為諸法：所以是非一。我們為了解釋非一非異，簡單的說就是生滅跟不生滅的和合。

/SECTION1/唯識論的阿賴耶識定義之缺陷

這裡阿賴耶識的定義，跟《唯識三十頌》的定義有所不同，我們作一個說明。

我們過去研究唯識的經論，不管是《瑜伽師地論》，或者是《解深密經》，乃至於《成唯識論》講阿賴耶識，它是講生滅，沒有說生滅跟不生滅和合，唯識沒有這個觀念。唯識學是說每一個眾生流轉生命的根本處就是阿賴耶識。這個阿賴耶識它是剎那剎那生滅的，因為我們的起心動念，前七意識不斷的活動，它就熏習阿賴耶識。阿賴耶識不斷的去接受前七轉識造作的訊息，它就不斷的變化。在變化中，它沒說有一個不變化的本性，它沒有這樣講。

唯識的經論沒有這樣講，它開導出所謂五種種性，就是有些人是人天種性、有些人是聲聞種性、有些人是菩薩種性、有些人是一闡提種性，就沒有明顯說出每一個眾生都有成佛的可能性。因為它的不生滅本性，並沒有普遍到每一個阿賴耶，就是這個不生滅性只有少數幾個人有，有些人有成佛的可能性，有些人就沒有成佛的可能性。

所以唯識學這麼一個殊勝的教法之所以會判作權教，就是它這個生命根源點的阿賴耶識，它完全用生滅相解釋阿賴耶識，因為這一點所以被判作方便法門。

本論馬鳴菩薩主要根據《楞伽經》，當然《法華經》《涅槃經》都有這個思想。就是說阿賴耶識是我們雜染個體生命的依止處，但是阿賴耶識的本性是不生滅的。就是說我們看到很多的波浪，但是波浪的本性是濕性，這個濕性不會因為風的吹動而改變。所以不生滅的本性，所謂的真如，它就是普遍在每一個人，每一個都有阿賴耶識、都有真如。只要你願意努力，你就有可能恢復你的本性；不管你過去起多大的煩惱，不管你過去造多大的罪業，這些都是因緣所生法，它沒有真實染污到你的清淨本性。在大乘的經典中，包括《楞伽經》《法華經》《涅槃經》，佛陀都是非常肯定而明確的說出這個觀念。

所以在本論中，諸位要知道，阿賴耶識的定義跟《唯識論》《唯識三十頌》的定義有所不同。生滅與不生滅和合謂之阿賴耶。當然它所起的作用沒什麼差別，但是它的第一因，明確的說出──阿賴耶識之前是清淨的本性，所以阿賴耶識的本性也是清淨的，它的染污只是表相的染污而已，有這一層意思。所以我們這裡讀到阿賴耶識，要把過去唯識學的阿賴耶識稍為融通一下。

這一段是辨相，辨出這個生滅心的相貌，其實就是生滅跟不生滅和合的阿賴耶。

<c339>第三科是明用</c339>，說明生滅心它會生起什麼作用？

此識有二種義，能攝一切法，生一切法。云何為二？一者覺義，二者不覺義。阿賴耶識是整個生滅相貌的根源。這阿賴耶識有兩種的功能：第一個，它能夠攝一切法，這個攝簡單的講就是含攝，它能夠含攝一切染淨諸法的種子，這是第一個功能。第二個，它能夠引生一切法的現行，這個生就是引生它的現行。譬如我們講倉庫，倉庫本身不能創造物品，但是倉庫扮演兩個角色：第一個，它能夠把你的物品收藏起來，它能夠進貨；第二個，它能夠出貨，等到你有需要時，也能夠把這個倉庫裡面的東西搬出去：它有進有出。

阿賴耶識身為整個流轉個體的根源，它也是這樣，在無量劫中它不造業，它不造善也不造惡。那它在整個生滅因緣中，扮演什麼角色呢？它扮演攝跟生兩個功能。第一個，前七轉識所造的善惡業，它把它的功能保存下來。第二個，等到因緣成熟時，它把這一期業力再變現某一期的果報。如果是一個善業，它就把這個業力轉成安樂的果報；如果這是一個罪業，它就把這個罪業變現成一個痛苦卑賤的果報。所以阿賴耶識它含攝種子、變現果報，它就做這兩件事情。此識有二種義，能攝一切法，能生一切法。

這兩種義有兩種的差別相，云何為二？一者覺義，二者不覺義。身為阿賴耶識它能夠含攝、也能夠變現，這當中有兩個差別：第一個是覺悟的因緣，第二個是迷惑的因緣。

這一段蕅益大師的意思是說：假設我們是由覺悟的因緣所啟動，就是阿賴耶識中隨順於覺悟的因緣，它就能夠含攝一切無漏的種子，戒定慧相應的無漏種子，引生一切清淨的因果，所謂四聖法界的清淨因果。我們隨順於這個真理的觀照，這時阿賴耶識是攝無漏的種子，生起清淨的因果。如果我們的阿賴耶識是隨順於不覺，隨順我們這個感情，跟著感覺走，不隨順佛法的真理；這樣阿賴耶識是攝持一切有漏的種子、貪瞋癡的種子，引生一切雜染的因果。有這樣的差別。

這一段等於是把生滅心的體相用，先作一個大綱的說明。前面的心真如門，它非因緣所生法，是本來具足的東西，你不管造什麼業，對它絲毫沒有任何影響，它是一個無為法。但是今天講這個生滅心，它是因緣所生法，因緣法當然是隨業力而有變化。因緣所生法是整個佛法在解釋染淨緣起一個主要的觀念，一切法是因緣生，不是上帝創造的，也不是自然而有，是假藉因緣而顯現。

/SECTION1/因緣

因緣這兩個字，在小乘跟大小乘經論的解釋，的確有一些淺深的不同。我們看小乘的經論解釋因緣，說是因緣所生法，什麼叫因緣？就是業力。就是你今天造的是有漏的業力，你的生命就是苦集二道的流轉；你造的是隨順於戒定慧無漏的業力，你生命的活動範圍就是在滅道二諦裡面安住，它是萬般皆是業，半點不由人，由這個業力來主導我們整個個體生命的流轉，乃至於還滅的因緣。當然這樣講很容易理解。

但是以大乘的角度來看這個業感緣起，會覺得這樣講不清楚。大乘佛法說小乘是半字法門，這個字你怎麼寫一半！大乘佛法用這種清淨光明的智慧來觀照這個業，這什麼叫業？說業是推動整個生命染淨的一個因緣，那什麼是業呢？其實業就是一個造作，就是身口意的造作。究竟來說，身口是不能造作，它只是工具；其實是心的造作，你的心一動，就是一個業，所以業是由心所生的。

這個業，最後又跑哪裡去呢？說：我造了一個業，我剛剛拜了《八十八佛》，我很虔誠的南無普光佛，包括身業的禮拜、口業的讚歎、內心至誠的歸依，身口意這樣的造作，在每一個佛號的所緣境中，剎那剎那的造作。《八十八佛》每一佛這樣慢慢拜好了，這個業就造好了。造好了，現在這個業還沒得果報，這個業跑哪裡去呢？這個業我們造了以後，我的個體生命沒有多大的變化，如果說這個業消失了，那佛法就是斷滅見了，這個業它既然有招感果報的功能，就表示它存在。那存在哪裡呢？小乘的學者就不明白的說出有阿賴耶識這個觀念，在小乘部派有的觀念說：有一個得（得失的得）把這個業保存下來。這個得跟阿賴耶的觀念很接近，所以大乘佛法簡單的說就是阿賴耶識。就是你前六識在造業時，你的內心深處有一個不造業的心識在那個地方，寂靜的等待你造業。

那第八識幹什麼呢？它就把你造的每一個業所釋放的訊息全部的吸收起來；等到業成熟以後，再把它釋放出去。說阿賴耶識是無始時來界，一切法等依，由此有諸趣，及涅槃證得。我們過去研究《成唯識論》就有這個偈頌，就是從一個生滅門的個體生命，我們觀察過去的生命是無始時來界，我們曾經經歷過無量的生命，上至轉輪聖王，下至卑賤的螞蟻，我們都曾經扮演過這樣一個個體生命的角色。當然每一個個體生命都造了很多的業，有時候造了一些善業，有時候造了一些罪業。那這個業都跑哪裡去了呢？無始時來界，一切法等依，都被阿賴耶識這個廣大的藏識海全部吸收。那麼阿賴耶識不是只有吸收，它還會釋放。它怎麼釋放呢？由此有諸趣，及涅槃證得，等到它釋放出來的時後，有些人就變現六凡流轉的痛苦果報，有些人的阿賴耶識就變現一個及涅槃證得清淨安樂的涅槃功德。

所以我們今天研究生滅門，你應該要先知道整個生滅的根源，是因為有阿賴耶識的含攝一切法、引生一切法，所成就的生滅門。當然這當中有兩種因緣：第一個是由覺悟推動的阿賴耶識，假設由覺悟所引導的阿賴耶，這時是趨向於涅槃安樂的；假設是由不覺，是由情緒化的感覺所推動的阿賴耶，這個阿賴耶它生命的趨向，是往生死流轉的方向前進。說生命是一個無止盡的水流，它有兩種方向：一個是由覺悟引導往上的清淨水流，一個是由迷惑顛倒引導往下墜落的痛苦水流。這一段是先把生滅心的體相用作一個總說。

/KEPAN/丑二、依各釋
/KEPAN/寅一、釋覺義
/KEPAN/卯一、總立本始二覺

前面是一個總標，這以下把覺跟不覺這兩個內涵各別加以解釋，這當中分兩科，先看寅一、釋覺義，先解釋覺悟的功能及相貌。覺中分成三小科，先看卯一、總立本始二覺。這個覺有兩個：第一個是本覺，第二個是識始覺，先把這兩個差別的內涵說出來。我們先看第一段：

/VERSE/所言覺義者，謂心體離念。離念相者，等虛空界，無所不遍。法界一相，即是如來平等法身。依此法身，說名本覺。

/SECTION1/什麼叫做覺？

先解釋什麼叫做本覺。在講本覺之前，先解釋什麼叫做覺？我們平常說：你這個人是覺悟了。那什麼叫覺悟呢？它的定義，簡單的講就是心體離念。平常我們一般人的心就打很多的妄想，以自我意識為中心，變造很多善的妄想、或者邪惡的妄想。當我們內心中有一種功能生起，它能夠離念，這個離念簡單的說就是遠離一切的妄念，佛法的名詞叫做對治。就是說你內心中，或者修止、或者念佛、或者持咒、或者觀想修觀，總之你對你心中的妄想有對治的功能，當這個功能生起的時後，我們安立你內心已經安住在覺悟的內涵中。

外道也會做慈善事業，蓋個醫院、或者放生，但是這樣不能講覺；因為他只是在阿賴耶識中成就一個善業，但這個善業它不能夠離念的。雖然造了善業，但是你的妄想還是很粗重──弟子心不安，你那個不安穩性依舊存在，所以不能夠叫覺。也就是說，當你覺悟的功能生起時，對你的妄念有遠離、有對治的功能，佛法才定義做覺，覺是這個意思，這個跟積集善業是不同。解釋本覺之前，我們先解釋什麼叫覺？有一種能夠遠離妄念的功能，這叫做覺。知道這個覺以後，就可以解釋什麼叫本覺了。

離念相者，等虛空界，無所不遍。法界一相，即是如來平等法身。依此法身，說明本覺。什麼叫本覺呢？這裡先講一個譬喻：等虛空界，用虛空來形容本覺的相貌。這裡法藏大師解釋說：為什麼用虛空呢？因為虛空有兩層的意思：

第一個、週遍義

無所不遍。就是說不管你是好人、壞人，你都是活在虛空中，沒有一個人能夠遠離虛空而安住的；也就是說本覺它是週遍在整個十方一切凡聖的眾生中，皆平等具足，一切的凡聖都平等具足的，所以它有週遍義。

第二個、無差別義

虛空是法界一相沒有差別。我們之前講過什麼叫無差別呢？簡單的講有六層的無差別：不生、不滅、不垢、不淨、不增、不減，它遠離生滅的差別，遠離垢淨的差別，遠離增減的差別，它是無差別的。你造善業，本覺也是這樣；你造惡業，本覺也是這樣：它不會因為你造業而有所變化。簡單的說它是週遍義、是無差別義，它是如來清淨的平等法身，依止這個平等法身，我們安立一個名稱叫做本覺，本來具足的一個覺性。

就是說我們一般的個體生命，就是一個五蘊身心，你由過去在阿賴耶識中某一期的業力：假設有些人是善業強，他這一期的個體生命特別殊勝，外相特別的莊嚴健康；他的內心世界也特別強悍，有堪忍性，心力強，內心中快樂的時間也多。他不斷的造善業，他的五蘊身心就是特別的不斷的變化，來生會更好。假設有些人是罪業強，他所變現的五蘊身心，這個個體生命就比較差，外相看起來也比較丑陋；他的內心世界一天到晚經常感到昏昏沉沉的，要思惟東西、要打坐，這個心提不起功能，這個五蘊差。五蘊個體生命這個修行的工具，是過去罪業所招感的，就比較差。

所以業力是主導我們五蘊身心的變化。但是這裡本覺不是這個意思，它是不變化的，無所不遍，法界一相。到這裡，我們應該都有一些觀念，就是你看到一些不變化的東西一定是真如門，真如門有如實空跟如實不空：它如實空，離一切相，覺跟不覺都是離的，如實空是離一切的相；如實不空，就是如來藏具足無漏性功德得故，這個就是本覺，以本具的覺悟來總攝一切的無漏功德。

所以這裡是說明真如門不空這一部分叫本覺。

/VERSE/何以故？本覺義者，對始覺說。以始覺者，即同本覺。始覺義者，依本覺故，而有不覺。依不覺故，說有始覺。

前面是說明本覺的相貌，這以下說明這個始覺跟本覺的相互關係：

何以故？這裡是提出一個問：本覺是不生不滅，那跟始覺、本覺是什麼關係呢？他提出這個問。這以下有兩段回答，先看

第一段、「本覺義者，對始覺說。以始覺者，即同本覺。」

把本覺跟始覺的關係講出來，說本覺的安立是相對於始覺而安立的。這個我們解釋一下。這個本覺是眾生本具的，不必你去造作，它就法爾存在我們內心的深處，有一種覺悟的功能等待我們去啟發它，所以叫做本，這個本就是本來具。

這個始就是有個開始，就是本來沒有，始覺不是每個眾生都有的，這一定要有個開始，有個開始當然就是生滅相。就是說我們凡夫無量劫來是隨順於一念的無明，無明一動了以後，眾生就一念不覺開始向外攀緣。這個一念的妄動以後，糟糕了！停不下來，就一直動下去了。

當然我們在無量的生命中，大部分的時間都是跟著感覺走，我這一念心跟環境接觸時，產生一個感覺、一個心情。我現在的心情想做什麼事就去做了，我現在的心情想要做那件事情也就去做了，從來沒有用道德理性來約束自己的感情，就是跟著感覺走，這樣在個體生命中，就招感很多痛苦的果報。我們在痛苦中就產生一個慚愧心：可能跟三寶有一點結緣，個體生命中就生長在有三寶住世的地方；看到佛像的莊嚴，生歡喜心；參加法會，唱唱爐香讚，就刺激內心本覺的功能；這時發心修行、斷惡修善。

當我們開始發心修行、斷惡修善時，內心中那些妄念開始對治，我們開始用佛法的道理來檢查我們內心的活動──有些該做、有些不該做，開始對治，這時我們安立你始覺的智慧正式生起、正式啟動。

所以本覺義者是針對始覺而安立的，它們兩個是相對的，一個是本來具的，一個是你要發心才有的。下面這一段很重要，「以始覺者，即同本覺。」始覺跟本覺不同，但是它即同本覺，這個同就是隨順，它有開顯本覺的功能，就是說始覺是從本覺而引生的。就是我們的本覺遇到三寶因緣的刺激，從本覺裡面引生始覺，這個始覺當然慢慢擴大。始覺的擴大，也就不斷的開顯本覺的功能，所以講以始覺者，即隨順於本覺的體性，這是第一段的回答。

第二段，「始覺義者，依本覺故，而有不覺。」

為什麼會有始覺呢？就是你因為有本覺才有始覺。我們前面說過，你一定是先有平靜的水為無明的風所吹，所以才有所謂的生滅心。所以我們剛開始是清淨本然的本覺，所謂的如來藏具足無漏性功德故，這當中由無明的妄動以後，全體的本覺變成不覺，全水成波浪，我們在不覺的中不斷的活動、不斷的流轉才吃到苦頭，這時遇到三寶，開始歸依三寶，發心修行，才起動了始覺，開始對治我們的不覺，彼此相互的關係是這樣。`;
