QXL.volNum = 20;
QXL.text = `
請大家打開《講義》第三十九頁。我們這一科是講未二、更約因緣互相成辦。

這地方是說，既然我們內心的本覺是沒有差別的，本覺在內心中，白天、晚上不斷的熏習我們，但是為什麼每一個人的成佛之道，會有這麼多差別的因緣呢？這當中除了煩惱的遮障以外，我們對三寶的熏習這種善根的力量也是一個很重要的助緣。我們看第三段：

/VERSE/若因緣具足者，所謂自有熏習之力，又為諸佛菩薩等，慈悲願護故；能起厭苦之心，信有涅槃，修習善根。以修善根成熟故，則值諸佛菩薩，示教利喜，乃能進趣向涅槃道。

這地方作一個總結，說是成佛之道必需要因緣具足的。

一、內因力：什麼叫做內因力？就是自有熏習之力，就是所謂的本覺內熏。說雖然我們現在有無量的痛苦而完全沒有安樂，但是我們內心深處對於離開痛苦、追求安樂這樣的希望，我們從來沒有放棄過，我們想要改造生命的這種動力是從來沒有消失過。表示我們每一個眾生有無量的希望，因為我們每一個人都想離苦得樂，而這個是成佛之道的主要的動力了，就是所謂的內因力。

二、外緣力：諸佛菩薩等，慈悲願護故。我們必需要有諸佛菩薩清淨法語的開導，正確的了解到什麼是痛苦生起的因緣、什麼是安樂生起的因緣，能夠對生命善知抉擇。什麼樣的因緣會讓你痛苦？什麼樣的因緣讓你產生安樂？這都不是上帝的意思，這個生命其實是我們自己的抉擇。有了這樣的觀照力以後，就是這種外緣力。這時我們產生兩種的功德：

第一個、生起厭苦之心，信有涅槃，修習善根。這一段，法藏大師判作外凡的資糧位。外凡位他在修行，主要的是信有涅槃，修習善根，這當然是仰信涅槃。就是說原來我們不一定要完全認命的在三界流轉，我們有另外一種選擇，我們可以成就涅槃的。就是說只要肯努力，這個涅槃的功德不是天方夜譚，它是真實存在的。有了這樣的信心以後，我們開始勉強自己修習佛法戒定慧的善根，雖然這個過程有一些辛苦，但是我們對未來充滿了希望，這種剛開始是仰仗信心，我們叫做外凡資糧位。因為他對理性的觀照比較薄弱，所以叫外凡，心游理外。

我們在佛法中就會慢慢進步，到第二個階段內凡加行位。以修善根成熟故，則值諸佛菩薩，示教利喜，乃能進趣向涅槃道。我們慢慢的進步，從前面的信心到了善根成熟，佛法的善根主要就是內心的止觀，我們對於這個真理的觀照、對煩惱的調伏到達了一定的程度。這時我們遇到諸佛菩薩的示教，開導這種修行的法門，而成就種種的功德，引生內心的法喜，而慢慢慢慢的趣向涅槃，就從前面的信心而變成一種止觀，一種信力而引生一種法力。

這裡是說明體熏習。體熏習的意思我們作一個總結：這個體熏習有三個內涵值得我們注意：第一個是真如、第二個是無明、第三個是三寶。這裡真如就是本覺，我們內心中有一種離苦得樂的本性這叫真如，這種真如不管白天、晚上平等的在提醒我們──我們一定要離開痛苦、得到安樂，不管我們做得到做不到，一定要往這個方向走。這種善根在那個地方的熏習是任運的，所謂無作的任運生起。這個無明就是煩惱，你想離苦得樂，但是你起顛倒了，你把這個痛苦當做是安樂。我們總是覺得追求五欲是快樂，其實五欲不是快樂的境界。為什麼？這叫做無明，我們的煩惱顛倒遮障，第一個有遮障。其次，對三寶的學習、對佛法的學習不夠，智慧不足，這也是個問題。所以我們今天在真如熏習中的成佛之道有兩個因緣：

第一個、根利遮輕：有些人是根利遮輕，他除了有本覺內熏，他的善根強，遮障也輕薄。他把經典學習過以後，他很快的就從障礙裡面跳脫出來，因為他本身的煩惱就很淡薄，他不必做太多的加行，這種人入道如魚得水。

第二個、根利遮重：有些人修學佛法就是根利遮重，他在三寶中熏習的善根也強，但是無始劫來所熏習的煩惱罪業也特別的厚重，那就必需要有一些破障法門。我們這種所謂的末法時代，大部分都是根利遮重，就是有善根，但是可也是有煩惱跟罪業。所以密宗修習教法的止觀之前，一定要先修四加行。四加行：第一個是禮拜，你要拜十萬拜，你拜十萬拜中是求佛力加被，等於修歸依；第二個是持咒，持百字明咒破障；第三個是修供養，前面是滅惡，這裡生善，修種種的對諸佛菩薩的供養，或者是身業的供養、口業的讚歎、或者是財物的供養，各式各樣的供養；第四個才修上師相應法。這個禮拜、持咒、供養，其實就是在破除遮障。

我個人的修學經驗，我在1990年離開佛學院畢業以後，我有一年的時間進修。進修中，除了解門──把這三年佛學院的教理再重新的消化複習以外，我那個時候就是拜佛跟持往生咒，我一年中拜了差不多有二十萬。我自己感覺到那一年的修學，是我一生中可以說是最受用的，那種感覺就有一點像是茅塞頓開，就是我這個明瞭的心以前跟佛法接觸時，我自己覺得有點暗鈍，就是老法師講什麼不是很明白，那個明瞭性就是特別的遲鈍。但是你修懺、持咒以後，你那個明瞭性有明顯的變化，就是比較明利，就像是在一間被茅屋遮蓋的房間裡面，突然間露出了一點小小的光明的感覺。

我們說佛法是聞思修，你只要聽聞思惟就產生智慧。理論上沒有錯，但是你有遮障，你還得要修破障的加行，否則你就是沒辦法相應。這裡就是為什麼有些人他學佛會有障礙，因為你少修了破障法門。這裡是說明真如熏習的一個差別相，就是說真如是平等的，但是每一個人的遮障跟對佛法的學習不同，這裡就產生差別。

/KEPAN/辰二、釋用熏
/KEPAN/巳一、略標

用熏習分兩科，先看巳一的略標：

/VERSE/用熏習者，即是眾生外緣之力。如是外緣，有無量義，略說二種。

用熏習就是外在的一種資助力，外力。這個外力我們解釋一下：前面的自體熏習是一種自力，內心的本覺再加上佛的善根的熏習。外力是指他力，就是諸佛菩薩的加持力。這裡我們會提出疑惑說：那前面的外力也是三寶力，這裡的外力跟前面的外力有什麼差別？前面一科的體相熏習的外力，在三寶中主要是約法的熏習，是智慧這一部分，智慧的聞思所引生的觀照；這裡的外力是約人，約佛跟僧，是一個有明瞭性的人的攝受：用熏習是約著諸佛、菩薩一個有明瞭性眾生的攝受，前面的是約法，這裡有所不同，我們把它簡別出來。

/VERSE/云何為二？一者差別緣，二者平等緣。

諸佛菩薩對眾生的攝受有差別的因緣，也有平等的因緣，先作個總標：

/KEPAN/巳二、各釋
/KEPAN/午一、釋差別緣

各釋中分兩科，先看午一的釋差別因緣。

/VERSE/差別緣者，此人依於諸佛菩薩等。從初發意，始求道時，乃至得佛；於中若見若念。或為眷屬父母諸親，或為給使，或為知友，或為冤家，或起四攝。乃至一切所作無量行緣。以起大悲熏習之力，能令眾生增長善根。若見若聞得利益故。

我們先說明諸佛菩薩對眾生的差別因緣，這當中分成三段：第一段先說明感應之因。說這個修行人他的內心中，依於諸佛菩薩等，諸佛菩薩等是說他在因地時對於諸佛，或者菩薩（你對文殊菩薩、普賢菩薩，或者智者大師、蕅益大師、道宣律祖…），你能夠不斷地的去憶念他的功德，他有什麼特殊的戒定慧功德；或者你在你的佛堂中放一個他的身像，不斷地去觀想、禮拜；或者你乾脆只去憶念他的聖號，心念耳聽，你在諸佛菩薩這樣的名號、身像、功德中不斷地造作。做多久？從初發意，始求道時，乃至得佛，整個過程中，你遇到了遮障，你在佛前就祈求你的上師加被，修上師相應法，憶念上師的功德、憶念上師的身像、憶念上師的名號。

這當中有兩種的因緣：第一個若見若念。假設你福報大，你生長在正法時代、像法時代，你就能夠親自的眼見耳聞，你這個上師相應法，實際上你就是在諸佛菩薩旁邊，叫做見。或者我們現在等於是念，到末法時代這些佛菩薩都滅度了，但是沒關係，還有佛菩薩的相片存在，還有佛菩薩的名號存在，我們從經典上也知道每一個佛菩薩有不同的功德。我們怎麼辦？若念，我們就憶念，不斷地憶念諸佛菩薩的功德。這樣若見若念，就等於是一個感應的因緣，這以下是說明感應之果。

這樣有什麼好處？或為眷屬，父母諸親，或為給使，或為知友，或為冤家，或起四攝。我們不斷地去憶念諸佛菩薩以後，這個諸佛菩薩就有感應了，在我們的生命中做我們的眷屬。什麼叫眷屬？這以下有四種的因緣。第一個父母諸親，這裡法藏大師說：現慈愛以攝生。現出慈悲心，以現慈愛來攝受我們，做我們的父親、母親，或者是妻子等等。或為給使，這個給使是居卑以利物，他做我們奴婢、侍者，從這裡跟我們結緣，有因緣就方便開導我們。或為知友，這個知友是成同類以勸發，做我們的朋友、同參道友，大家在一起，他也示現有煩惱，你也有煩惱，大家一起修學做一種助伴，助伴中大家有問題就能夠互相的鼓勵勸勉。或為冤家，我們要做這種罪業時，佛菩薩現出恐怖來怖畏我們，對惡法生起害怕。總之就是生起四攝，這裡總結。或者是布施，先用財物布施令生起歡喜；愛語，用柔軟的言詞來鼓勵我們；同事，做我們修行的助伴，陪伴我們成長；利行，給我們種種的利益。

今天佛菩薩會對我們特別的攝受，就是我們因地對諸佛菩薩的若見若念。我們得到諸佛菩薩這樣的攝受有什麼好處？第三段就說明這種攝受的功德。乃至一切所作所為，種種的因緣，起大悲熏習之力，能令我們對大乘佛法的善根，信進念定慧的善根若見若聞，得利益故，我們得到各式各樣的利益。這裡是說明諸佛菩薩對眾生的差別因緣；那這以下說明這因緣的功德差別，把它開展出來。

/VERSE/此緣有二種：云何為二？一者近緣，速得度故。二者遠緣，久遠得度故。是近遠二緣，分別復有二種。云何為二？一者增長行緣，二者受道緣。

我們得到諸佛菩薩的攝受，成就的因緣主要有兩種：

第一個是近緣，就是說如果我們自己對大乘佛法的栽培善根成熟了，諸佛菩薩來攝受我們時，他就正直捨方便，但說無上道，直接講一佛乘的法門，使令我們能夠直接的返妄歸真，從妄想裡面跳脫出來，悟入真如，不必其他的枝枝葉葉，成就法身。

第二個是遠緣，就是說我們大乘佛法的善根還沒有成熟，我們一定要在過程中有一些方便，佛菩薩也會慈悲為實施權。你說你出離心不夠，先修人天法；你要修真空妙有的大乘法你沒有辦法承當，你就先修空觀：佛菩薩就先示現種種的方便，慢慢的攝受我們。

近遠二緣中又分兩種：一者增長行緣，二者受道緣。增長行緣是成就利他的功德。佛菩薩看到我們悲心不夠，開導成就大悲的方法；有些人悲心重，但是感情情執也太重，佛菩薩就講空性：說是二空自調，大悲利他。這個受道緣是成就自利的功德，開展出二空真如之理。這都是佛菩薩給我們的利益，或者是快速的成佛，或者是慢慢的成佛，這都是諸佛菩薩對我們的攝受。

這裡我們解釋一下。這裡就是我們講本尊相應法。從理論上來說，斷煩惱是我們內心自己的問題，但是我們的確不能忽略佛菩薩本尊對我們的攝受，這件事情不能忽略的。從《大勢至菩薩念佛圓通章》說：諸佛菩薩憫念眾生，如母憶子。諸佛菩薩看到我們眾生的心情，就像母親平等的憶念獨生子一樣，他是平等的。這裡說感應道交，為什麼他就運氣特別好，得到諸佛菩薩特別的加持，我就得不到佛菩薩特別的加持？經典上講出一個理由說：諸佛菩薩憶念我們，我們也要憶念佛菩薩，這樣才能夠感應道交。

就是說佛菩薩要加持我們不是單方面的，佛菩薩把手伸出來，我們也要把手伸出去。說我現在每天拜阿彌陀佛，當然阿彌陀佛我們拜不拜他，他的心情是平等的，他不會因為我們拜他而高興，但重點是我們在拜他時，就為自己創造一個佛菩薩要攝受我們的因緣，是這個意思。就是一切法因緣生，說是千江有水千江月，月亮很想照我們；但是你不把水準備好，月亮照不下來。每一個人所準備的水各式各樣，所以這個月亮照到水的影像也就各式各樣，就是所謂的差別緣。

在《法華經》有一品叫《妙莊嚴王本事品》。妙莊嚴王是一個轉輪聖王，那是一個七寶千子的大威德境界，這當中講到妙莊嚴王過去的因緣。說過去有四個比丘在山中的阿蘭若修行（當然修行得依止色身，這個色身它會飢餓的，所以經常要從山上走到山下去托缽，托缽完再從山下走到山上去。就是說不管願不願意，這件事不能避免，因為肚子會餓。），因為山上到山下的路非常的遙遠，所以他們為了把肚子填飽這件事，就從山上走到山下，從山下走到山上，整個精神體力都耗損掉了，回去修止觀時就打瞌睡了。

後來這四個人就想：這樣下去也不是個辦法，到時候我們四個人一生都空過了，就為了吃飯這件事情障道。這怎麼辦呢？就想出一個辦法：這四個人中有一個人要犧牲，就是你一個人去幫我們把四個人的飯都托好，我們三個人就專心用功。這當中有一個比丘就發心說：那這樣好了，你們三個人就專心的用功，從今以後你們就不要下山了，我下山去承辦你們吃飯的所有問題。這件事大家就這樣協調好了。這個比丘他就每天到了吃飯時間，他就從山上走到山下去托缽，從山下又回到山上去。其他的三個比丘因為能夠專心的辦道，果然三個人都成就聖道了。這個托缽的比丘（當然一切法因緣生，你很少在聖道的因緣造作，就荒廢了道業。）就荒廢了道業，但他也成就了福報力。

有一天他在托缽時，剛好看到國王出巡，國王有很多很多的眷屬、車乘、各式各樣的莊嚴，他生起了一念愛慕之心。我們凡夫沒什麼資糧力，生起愛慕心也就罷了；他這個有福報的人生起愛慕心，就有招感力，所以他生生世世就在人世間做國王，有時候做大國王，有時候做小國王。其他三個同參道友成就聖道以後，偶爾在涅槃的境界也會觀照一下：過去護持我們的這個比丘是幹什麼去了？哦！做一個國王，一時半刻還亂不了，就沒有採取行動。後來到了這一生妙莊嚴王時，就出了狀況，就是他後來信邪見外道，即將要依止邪見，造作種種的殺業，要墮落到三惡道了。

所以他以前所護持的三個比丘都是大乘的菩薩，就採取行動了，其中一個做他的夫人，另外兩個做他的兒子，一個是藥王菩薩，一個是藥上菩薩。外道的眾生就是喜歡神通，藥王、藥上菩薩就在他的父親的面前顯神通，現種種的神變。這時妙莊嚴王的夫人就在旁邊搭腔說：你看這兩個兒子真不可思議啊！這個神通比外道的神通還厲害。妙莊嚴王看：果然如此，兒子啊！我怎麼不知道你有神通，你的神通是誰教你的？他們說：我的老師是三界的導師佛陀。這時妙莊嚴王就對佛陀生起信心，這時藥王、藥上兩個兒子就帶著妙莊嚴王去禮拜佛陀。當然一個有善根的人也是不可思議，他見到佛陀就生起歡喜心，佛陀為他說法以後，他就放棄了王位出家了，後來在今生中也成就了聖道。

這個意思就是說，雖然諸佛菩薩憫念眾生內心是平等的，說十方諸佛憫念眾生，如母憶子，但是既然是感應道交，你對諸佛菩薩的憶念、造作、護持、禮拜、讚歎、供養的因緣不同，所以你得到諸佛菩薩的加持也有所不同。我們舉一個淺淺的道理，說同樣是一句佛號南無阿隬陀佛，這個比丘、比丘尼他心中把佛號一運轉時，這個佛號對他產生很大力量；但是有些人這個佛號在他心中運轉時力量薄弱。同樣是一句佛號！這就是因為他已經拜佛念佛很多，他這個佛號在心中已經是熏習非常非常久了；我們才剛學。所以這裡是說明，的確諸佛菩薩對每一個人的攝受有一些差別因緣，的確是這樣的。

/KEPAN/午二、釋平等緣

/VERSE/平等緣者，一切諸佛菩薩，皆願度脫一切眾生，自然熏習，恆常不捨，以同體智力故。隨應見聞，而現作業。所謂眾生依於三昧，乃得平等見諸佛故。

前面是講到諸佛菩薩對眾生差別的攝受，這裡是講平等的攝受。說諸佛菩薩的內心是平等的要度脫一切眾生，這種平等心是自然熏習，恆常不捨的，是任運的在他的大般涅槃中去加持一切有情。為什麼會這樣呢？因為以同體智利故，因為眾生跟諸佛是同一個，從真如的角度是心佛眾生三無差別，所以他能夠加持。隨應見聞，而現作業。隨眾生的見聞，他能夠顯現種種的妙用。

不過這裡的妙用要生起，標準比較高了。什麼因緣能夠生起諸佛菩薩對我們的攝受呢？所謂眾生依於三昧，乃得平等見諸佛故。這種平等緣你要能夠真實得到受益，你必須成就三昧，你不能在散亂心中，你必須在禪定的明瞭寂靜心中去見到十方諸佛，十方諸佛為我們或者是放光的照攝滅罪，或者為我們說法而成就解脫。

法藏大師說：前面的差別緣，是一種事相的因緣，你對佛菩薩或者是身業的禮拜、口業的讚歎、意業的歸依，種種的供養等等，跟諸佛菩薩結緣，諸佛菩薩在大般涅槃中特別的攝受你，這種是屬於外凡位的。這種攝受就是普門示現，有時候示現父母相、朋友相、冤家相，各式各樣的相貌，這種都是外凡十信位的菩薩能夠跟諸佛的感應。這個平等緣不是事相的因緣，是一種理性的因緣，它必需要內凡的三賢位，內凡一定是在三昧中才能夠得到平等的加持。這種平等的加持，佛菩薩出現一定是現佛身，沒有第二種情況。在禪定中見諸佛菩薩，一定是見諸佛的三十二相、八十種好的佛身，這個叫平等緣。

/KEPAN/卯三、結示

把體熏習跟用熏習作一個總結。

/VERSE/此體用熏習，分別復有二種。云何為二？一者、未相應。謂凡夫、二乘、初發意菩薩等，以意意識熏習，依信力故而能修行。未得無分別心，與體相應故。未得自在業修行，與用相應故。

我們講到淨法熏習，有所謂的真如熏習，有體熏習跟用熏習。這當中把體熏習跟用熏習作一個判教，講出它的淺深的次第，有未相應跟已相應的差別，就是跟真如有時相應，有時還沒有相應。

先看未相應：我們凡夫、二乘和初心的菩薩（這個初心的菩薩，包括外凡的十信位，也包括了內凡的三賢位，就是還沒有入法身之前的，都叫做初發心菩薩），是依止意意識，就是依止第六意識生滅心的觀照，當然這個觀照主要的還是靠信心。

我們剛開始就是仰信真如佛性，在凡不減，在聖不增，心佛眾生三無差別。我們剛開始在我們一天到晚打妄想的心中，我們相信打妄想心的本質，那種清淨本然具足無量功能德用的那個本質，跟諸佛是沒有差別的。這樣心中是依止有所得，信心當然是有所得，他有所對立，有所對立就有所得，這個有所得是不錯，我們是要放棄雜染，追求清淨，這個也是有所得。所以這時還沒有成就根本無分別智與真如體相應；也沒有成就後得智，未得自在業就是沒有成就後得智，與真如的妙用相應。

也就是說我們跟真如還有一段距離，但是我們相信：總有一天可以把這種真如的功德開展出來，依止這個信心，就支持我們在外凡十信跟內凡三賢位，渡過這麼漫長的一大阿僧祗劫，這個都叫做未相應。為什麼未相應？因為內心還有對立心，因為真如是不能有對立，當然剛開始你一定要對立。

/VERSE/二者、已相應。謂法身菩薩，得無分別心，與諸佛智用相應。唯依法力，自然修行，熏習真如，滅無明故。

總有一天我們跟真如相應以後，就是法身菩薩了，內心中已經有無分別智了，內心中能夠真實的修一切法，修一切的善而離一切相，雖念而無能念所念，這時得到無分別智與真如的體相應，也有這種大悲的妙用跟諸佛的智用相應。這時就依止法力，內心中有甚深的般若。這個甚深的般若就是正念真如，內心中以平等心來斷惡修善，不像我們前面是用對立的心。自然修行，熏習真如，滅無明故，是這樣的一個意思。

相應跟不相應是說，我們剛開始說是返妄歸真，就路還家，我們這一念心跟真如的確是有一段距離，真如當然是平等的。但是你一開始就平等，那你這樣怎麼斷惡修善呢？剛開始一定是有惡法可以斷，有善法可以修，依止清淨的戒定慧，來對治貪瞋癡的煩惱，剛開始都是從未相應開始的，先從這個對立。但是明白這個道理，我們慢慢慢慢地跟真如完全相應；雖然繼續的對治，但是沒有這種能所的對待。

在經典上說：法身菩薩修波羅蜜跟我們有所不同，他是任運的。就像是船要從這個岸到大海，剛開始時你要有動力，因為地心引力會把你拉回來，就是未相應時要有一點動力；但是到了大海以後，船就自然前進了，這以下是自然修行，熏習真如，滅無明故，他的內心中不管白天、晚上不斷地進步。

/KEPAN/子四、結判斷與不斷

前面是說明染法跟淨法的熏習，這裡是說明斷與不斷的差別。

/VERSE/復次，染法從無始已來，熏習不斷，乃至得佛，後則有斷。淨法熏習則無有斷，盡於未來。此義云何？以真如法常熏習故，妄心則滅，法身顯現，起用熏習，故無有斷。

染法它是從無始已來，熏習不斷，它是沒有開始的，到成佛時，它就會有斷，所以它是無始有終。這雜染法在我們心中，它沒有生起，它是無始，但是它有消滅的一天。淨法它的熏習是無有斷，盡於未來，它是無始也無終的。淨法主要的是依止真如，或者是本覺的熏習。

此義云何？以真如法常熏習故，妄心則滅。這裡就太重要了。我們在斷惡修善，你要永遠記住一個觀念，就是真如是能夠破壞妄心，而不是妄心能夠破除真如。就是說雖然有無量無邊的煩惱，但是煩惱是虛妄相，我們所依止的戒定慧是隨順於佛性，是真實的功德。所以說以真如法常熏習故，妄心則滅，妄心滅了以後，法身顯現，生起大悲的妙用，這樣是無有間斷的。

到這裡，把整個染淨的熏習全部解釋完了。

我們講淨法熏習，從本論的學習得到兩個心得，就是我們都希望增長清淨的法，這當中有兩種的修行方便：第一個是外熏習，外指的是佛法僧三寶，就是我們應該要對三寶作一些禮拜、讚歎、供養的一些造作，這個就是一種善業力。先從身口的造作，在三寶的身口造作來產生一種善的力量，這個是外力的熏習，祈求三寶的加被。第二個是內熏習，你要經過佛法的聽聞思惟，產生內在的觀照，來調伏自己的煩惱，趣向內心的真如。

不過從修學的次第上來說，我們看十大願王的安排布局，佛菩薩在修學的次第上，是告訴我們：剛開始先禮敬諸佛、稱讚如來、廣修供養、懺悔業障、隨喜功德，看這個意思我們剛開始先修外熏習，就是從三寶的所緣境中禮拜、讚歎、供養，從這裡懺悔業障，積集資糧，先修外熏習，先成就一種三寶的善業力。慢慢地再請佛住世、請轉法輪、常隨佛學，再恆順眾生、普皆迴向，再成就內心的止觀，成就內在的智慧跟大悲。請佛住世、請轉法輪跟常隨佛學是成就智慧，恆順眾生、普皆迴向是成就大悲。所以我們在整個成佛之道，是從外而內，先從外力的熏習，在三寶的所緣境總總的歸依，然後再生起內心的觀照，本論是這個意思。

到這裡，已經把<done>整個生滅門都講完了</done>，這個生滅門的第二科顯示大乘體相用，是把生滅門會歸到真如門。我們今天先講到這裡。

分辨三個問難。

這裡，再補充說明《大乘起信論》的真如緣起，特別是在唐朝有三種問難，我們必須要了解的。

一、真妄別體難：

就是有一些中觀的學者、小乘的學者，對真如緣起提出了真妄別體。我們先說出這個難的因緣，他說：本論安立了一心二門，真如門是平等的，生滅門是對立的，這樣把這個心分成二元論了，我們內心中有兩個自體，一個是真如，一個是生滅，這個是不合道理的。真如就不是生滅，生滅就不是真如。你如果說是平等就不是對立，你不是對立就是平等。為什麼一心能夠安立二門呢？這樣講是不是違背了真實相了？這是第一個對本論的第一個問難，真妄別體難。

答：我們看法藏大師怎麼回答，看第十六頁。法藏大師引用馬鳴菩薩的第十六頁來回答這個問題。這裡我們把它念一遍：

心真如者，即是一法界大總相法門體。所謂心性不生不滅。一切諸法，唯依妄念，而有差別。若離妄念，則無一切境界之相。是故一切法，從本已來，離言說相，離名字相，離心緣相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如。

就是說我們要清楚本論安立真如是怎麼安立。它說：什麼叫做真如呢？一法界大總相的法門體。真如是諸法的總相。就是說它安立二門，但不是安立二個自體，它們兩個是一個自體。你現在的心當然是生滅門，你有時候起善、有時候起惡，但是你不管起善、起惡，你內心中都有真如在那邊活動，它這裡一心二門是同一個自體的。

蕅益大師的解釋就更清楚了，蕅益大師直接告訴我們說：達妄本空，知真本有。其實生滅門根本就不存在的。這個妄想是不存在的，達妄本空，都是我們自己捏造出來的。沒有所謂的兩個自體的問難，因為你妄想本來就是虛妄的，虛妄你怎麼說有自體呢？這個真如是有自體，它的確是有這個妙用；這個生滅門是我們自己妄想捏造出來。所以說這真妄別體難是不能夠這樣問難，因為它這個真如跟妄想，這個妄想是虛妄的，所以安立一心二門，沒有一心有二個自體的問題。

二、真前妄後難：

真如緣起，說有真如，最後變成有無明，說是從真起妄。既然它本質是真如，它怎麼會生起妄呢？你是真如，從真如生起妄想，這二個自體不同，這裡有問題，真前妄後難。

答：這裡我們看法藏大師怎麼回答，第二十二頁講到我們眾生的覺跟不覺：

又心起者，無有初相可知。而言知初相者，即謂無念。是故一切眾生，不名為覺。以從本來，念念相續，未曾離念，故說無始無明。

這裡無明的定義是說：以從本來，念念相續，未曾離念，故說無始無明。就是說本論並沒有說是從真起妄，本論安立真如也安立無明，它說真如是無始，無明也是無始，本論從來沒有說：我們某年某月某日無明生起，它沒有明確說明有一個生起的點。所以我們應該說：迷真起妄，不能說從真起妄。就是妄為什麼有？就是因為迷。什麼時候迷？那這個我們就不能討論了。總之是迷真起妄，但是不能說從真起妄。從真起妄，它既是真，怎麼會起妄呢？這是矛盾的。所以真前妄後難，這個問題也不存在；因為本論是說真如是無始，無明也是無始，所以沒有所謂前後的問題。

三、悟後卻迷難：

說我們迷真起妄，總有一天把妄想消滅了，變成真如了；是不是悟後卻迷，哪一天又迷真起妄，又變成凡夫了呢？

答：這個問難，我們看第二十一頁，講到始覺智慧，我們就不詳細說明。總之，智慧，有凡夫業果的智慧，二乘空性的智慧，還有菩薩真空妙有的即空、即假、即中的智慧。

這個意思就是說，我們以前的真如，叫做在纏真如，這個真如被妄想所纏繞，所以這個真如在凡夫只有本覺而已，就是一種本覺內熏，一種想要離苦得樂的希望，但是這個希望被無量無邊的妄想顛倒所纏繞。就是說我們想離苦得樂，但是我們根本不知道什麼因緣是痛苦，什麼因緣是安樂，我們永遠不能滿足我們的希望，就是在纏真如。我們內心中想要離苦得樂的希望，被無量無邊的妄想所纏繞、所蒙蔽，這個叫做在纏真如。成佛以後的真如叫做出纏真如，這個真如它本覺以外，又多一個始覺智慧，有觀照力了。有觀照力，所以他不會再迷了，他有這個觀照力了。

本論的意思就是說，我們的一念心中，同時具足兩種功能：一種是覺，一種是迷。這個覺悟的功能起動時，會對治生滅門，趣向真如門。假設我們今天隨順迷惑，這個真如門的功能就消失了，生滅門的力量就增長。這兩個功能在內心中，互相的熏習。那我們怎麼辦呢？我們仰仗三寶的加持力、仰仗內心的觀照力，就把這個內心覺的功能不斷不斷地擴大，光明不斷地擴大，總有一天把這個不覺的虛妄相消滅掉，這時我們就從生滅門而完全趣向真如門，是這樣的意思。

這裡就是在真如緣起中的三大問難，我們可以從問難中，更加了解本論的宗旨。`;
