QXL.volNum = 22;
QXL.text = `
請大家打開《講義》第四十四頁：

/KEPAN/癸二、顯示用
/KEPAN/子一、正明用即真如

前面講到一心的體大跟相大，講到真如門；這以下講到用，這當中分三科，先看子一、正明用即真如。這個體大跟相大它是真如門，是一個非因緣所生法，它沒有對立的，眾生本具，諸佛所證，一種所謂法爾如是的情況；這個用大，它是因緣所生法，生滅門，因緣所生法就是所謂的修因證果。但這個修因證果，它必須要隨順於真如，用即真如，就是你要能夠隨順於真如，就能夠開顯體大、相大，所以講用即真如。這個即就是隨順，它本身不是真如，但是它有隨真如的功能。這個修因證果，我們先看第一個因地的修學，再講到果地的功德。先講因地修學：

/VERSE/復次，真如用者，所謂諸佛如來，本在因地，發大慈悲，修諸波羅蜜，攝化眾生，立大誓願，盡欲度脫等眾生界。亦不限劫數，盡於未來。以取一切眾生，如己身故，而亦不取眾生相。此以何義？謂如實知，一切眾生，及與己身，真如平等，無別異故。

什麼叫做隨順於真如的妙用呢？諸佛如來在因地時，他必須修學兩個重要的法門。當然諸佛如來從佛法的角度，他也是從我們凡夫這種障礙苦惱的心識開始修行的，這當中有兩個重點：第一個是大悲利他；第二個是三空自調，成就利他跟自利。

第一個重點、大悲利他

剛開始先講到大悲利他：我們就在凡夫的煩惱障、業障、報障心中發大慈悲，這個大慈悲心有兩個：一個是屬於行，一個是屬於願。這一個行，修諸波羅蜜，攝化眾生，這個是大慈悲的行，他的一個實際的行動；第二個願，立大誓願，盡欲度脫等眾生界，發願度盡一切眾生，不受時間、空間的限定。

我們先講這個願。你今天在一個苦惱的心中，你內心中生起一道的光明，你突然間想到佛道無上誓願成，你不想再做苦惱眾生了，你想要在生命中有所改造，你希望從人法界趨向於佛法界。你有這個希望以後，你就應該發願來受菩薩戒，這個發願你主要是要建立一個利他之心，要利益眾生之心。利益眾生心的生起，在宗喀巴大師的教法中有兩個重點：

第一個、七重因果：七重因果主要的就是知母，你要能夠如實了知一切眾生是我們過去的母親。這個意思就是說，你要生起利他的心，首先把你自己生命的個體，跟一切有情之間相互的關係找到。如果你一直覺得你跟眾生是完全沒有關係，你這個利他的心是空話；因為利他心的生起在於感同身受，對於眾生的苦你能夠感同身受，所以你真實的希望他離苦得樂。

你能夠感同身受，是建立在你跟他之間一種密不可分的關係；如果你這個關係沒有找到，那你不可能感同身受，也不可能生起利他的心，你頂多就是成就一個阿羅漢或者辟支佛。所以你一定要從無量的生死中，去觀察我們經歷過無量的生命，而每個生命一定要有一個母親，這個母親要生育我們、養育我們，給我們很多的恩惠，所以一切的有情都曾經做過我的母親。所以我們必須要跳脫現在這個時空的因緣，看到過去無量的生命中，每一個有情都是我的母親，建立一個密不可分的母子關係。既然一切有情都曾經是我的母親，我們就很容易對他生起感同身受的心情，我們就很希望他能夠跟我們一樣離苦得樂，這時你就容易生起利他之心。這是從事相、從因緣上的觀察，叫做七重因果。

第二個、自他交換：是屬於理上的觀察，所謂自他交換。自他交換這個自，就是愛護自己的心情，這個他就是愛護他人的心情。當然我們凡夫的心這個我愛執，愛著自己、保護自己的心很強。我們在我們的清淨平等心中，捏造一個自我以後，從今以後就保護自我、愛護自我。現在我們應該把這樣的思考，稍微調整一下，你應該觀察第一自他是平等，我們沒有比眾生更特別，我們這念心想要離苦得樂，眾生的心也想離苦得樂，這一點是沒有差別的。

從自他的平等中，再建立他是比較殊勝的，我是比較卑劣的。也就是說三世諸佛因為生起愛護眾生的心，所以他積集布施、持戒的善業，而成就萬德莊嚴。我們因為愛著自己的心，即使我們過去布施、持戒，因為我們思想卑劣，所以現在還在三界輪迴。換句話說，我們想要離苦得樂，重點還不是積集善業，更重要的應該改造我們卑劣的心態，就是把愛著自己的心，轉換成愛著眾生。

也就是說當我們修學佛法以後，會有一些功德，可能會有各式各樣持戒的功德、禪定的功德、智慧的功德，這功德我們有兩個選擇：第一把這個功德迴向給自己，完全自己受用；第二個我們選擇犧牲自己，把這功德迴向法界眾生離苦得樂。當你能夠選擇利他時，你的功德不但沒有失掉，反而更加的增長廣大，因為你的心剛好跟真如的平等相應，跟法界的功德相應。所以我們應該改造愛著自己卑劣的心，而生起一個利他的殊勝心，這叫自他交換，就把這個心態，透過我們不斷的去觀想——自他交換，去作一個修正。

就是說我們今天培養一個利他的心，當然我們不一定有行動，也就是說眾生不一定得到利益；但是我們自己本身念念跟真如想應，我們就開顯內心中的大智慧光明義故、遍照法界義故、常樂我淨義故，就是這樣的一個思考。所以我們剛開始時，當然如果你不想成佛，那就另當別論；但是你想成佛，你一定要有這樣的希望，希望有情離苦得樂，他的方法就是：自他交換跟七重因果。

有了希望以後，我們隨順因緣要產生一個行動，就是你度化眾生你要有方便力，不是說靠一股的衝勁就可以。什麼樣的方便呢？你必須修習六度、四攝，你應該要修習善法。修習布施、持戒、忍辱、精進、禪定、智慧六種波羅蜜，還要去成就四攝法，透過布施、愛語、利行、同事，這種四攝來攝化眾生，就是他有這個行動力，這都是我們在因地時就要去修學的大悲利他。

第二個重點、三空自調

「以取一切眾生，如己身故，而亦不取眾生相。此以何義？謂如實知，一切眾生，及與己身，真如平等，無別異故。」

我們今天說是利益眾生，我們也不可能完全在佛堂，這時候內心會跟各式各樣的眾生接觸──有時候是苦惱的眾生、有時候是大福報的善根。我們在度化眾生時，取一切眾生，如己身故，我們開始去愛護眾生，猶如愛護自己。但是這個中你要能夠不執著眾生的差別相，破除我們對眾生的一個執取。那如何破除呢？就是能夠如實知道一切眾生跟己身的真如平等，是沒有差別的。

我們剛開始度化眾生時，我們這念心都是從有相的境界來執著，看到他的外表、聽到他的聲音、他的顏色，色、聲、香、味、觸、法，但是我們應該要更深的觀察，把這些因緣所生法撥開，看到眾生真如心那個如，跟我們的如是沒有差別的。這時我們從我空、法空以後，再突破到空空，這空相也不可得，入平等法界，三空自調。

前面是利他；這裡是在利他時，你應該善知調伏我們內心對眾生的執取。這地方是說，我們今天這個用，這個在因地上的用要如何隨順真如？套一句《金剛經》的內涵說：應無所住，而生其心。當然你剛開始一定要生其心，你要有利他的心，你要沒有利他的心，你這個菩薩戒的戒體就建立不起來了，不管你的戒定慧有多麼的高深，跟成佛之道就不相應了，所以利他的心應該說是必要的條件，所以生其心是第一個重點。

但是這個應無所住是不容易的，所以我們剛開始一定要有次第，剛開始應該是有所住，住在這個善來對治惡。你可能剛出家時是非分明、擇善固執，慢慢慢慢我們就從有住的境界慢慢到無住，慢慢慢慢我們會知道擇善不一定要固執。就是能夠明辨是非以後，又能夠包容是非，做我們自己該做的事，盡心盡力就可以了。這裡就是說：你剛開始一定要生起利他的心，那慢慢慢慢再修無住法門，這樣的修學就是因地的悲智雙運。這樣有什麼好處呢？我們看它果地功德：

/VERSE/以有如是大方便智，除滅無明，見本法身。自然而有不思議業，種種之用。即與真如等，遍一切處。又亦無有用相可得。

我們前面的依止大悲利他、三空自調，雖然我們表面上在利益眾生，其實結果是自己得到最大的利益。我們內心在這樣的修學中，念念除滅我們心中的我愛執，慢慢地開顯我們內心的清淨法身。這樣的法身開顯以後，有什麼作用呢？自然而有不思議業，種種之用。這種見到法身的業用，前面說過我們內心在自利利他的過程中，不斷的開顯大智慧光明義故、遍照法界義故、常樂我淨義故，這種功德慢慢跟真如平等，而且遍一切的時空。但是在遍一切時空中，我們內心不會生起這樣的執著：哦！我開顯我的功德。你沒有起這樣的分別，無有用相可得，你還是一個平等的心。

/VERSE/何以故？謂諸佛如來，唯是法身智相之身，第一義諦，無有世諦境界，離於施作。

為什麼我們跟真如相應時沒有有所得的心呢？因為諸佛如來的身有兩個：一個是法身，一個是智身。這個法身是所受用的，這裡後面會說，它是一個色法，就是色聲香味觸法，我們能夠見聞覺知的法身叫做遍一切處。智身是一個心法，它是一個離相的、清淨明瞭的智慧心性。法身是色法，智相之身是一個心法，色心二法都是相應第一義諦，就是一個如如的境界；不像凡夫這種生滅門世俗諦，那是一種差別對立的，有種種的造作、有種種的有所得。這裡是講到我們如何從身口意的作用中隨順於真如。隨順真如有兩個：一個是慈悲，一個是般若。

在《瑜珈師地論》上說：其實我們在隨順真如時，剛開始的根機有所偏重，說是菩薩有兩種：一種悲增上，二者智增上。有一類的菩薩是比較偏重在大悲利他，他內心中雖然對眾生有所執取，但是他的利他的心很強。這種悲增上的菩薩，他會在三界中先成就福報力，然後再成就聖道。第二種是智增上的菩薩，他在修應無所住而生其心時，他會偏重在應無所住，他會把比較多的時間用在佛堂中打坐。當然他對眾生度化的希望不能放棄，因為你一放棄，菩薩戒體就失掉了。他是把度化眾生的行動，設計到先成就聖道，再採取行動，所以他會偏重到應無所住，這個人會先成就聖道，以後以聖道的力量再來積集福德資糧。這裡就有所差別，這個都是隨順真如的一個方法。

/KEPAN/子二、廣明隨機見別
/KEPAN/丑一、總明隨機

前面果地的功德講到法身、智身；這裡把佛的法身開展出來，隨順眾生的根機，而所見有所差別，這當中分兩科，先看丑一的總明隨機，先作一個總說：

/VERSE/但隨眾生，見聞得益，故說為用。

前面是講因地的隨順，這裡是講果地的妙用。當我們跟真如的體大、相大相應以後，所要成就的這種法身、智身的妙用，眾生在見聞時是有所差別的。比如印光大師在《文鈔》上說：我們念佛，是有一個能念的心，一個所念的佛號。我們這念心跟佛號接觸時，產生了三種力量：佛力不可思議、法力不可思議、心力不可思議。

印光大師把我們內心的功德分成兩類：念佛方能消宿業，竭誠自可轉凡心。

念佛方能消宿業：假設我們這念心在念佛時，只是依止一念的信心，你相信這個萬德洪名的功德不可思議，它有對你有滅惡生善的功能，只是一念的信心，這個佛號對你來說是念佛方能消宿業，這個佛號會對你產生滅除業障、增長福報。你會因為念佛的因緣，來生做轉輪聖王、或者大富長者。

竭誠自可轉凡心：如果你能夠進一步的竭誠自可轉凡心，你在念佛時有信心，又能夠產生智慧的觀照，觀察娑婆世界的苦、觀察極樂世界的樂，而厭離娑婆、欣求極樂，你在念佛時有一種光明的觀照，一句佛號信願具足，這個佛號就不是消業障而已，你能夠蒙這句佛號的接引，往生淨土、轉凡成聖。

所以諸佛菩薩的法身、智身，因為眾生根機不同，產生的用就有所差別，所以講但隨眾生的根機不同，所以見聞而得到各式各樣的利益，這都是諸佛菩薩法身、智身的妙用。先作一個總說。

/KEPAN/丑二、別示見別
/KEPAN/寅一、約所依識以判二身
/KEPAN/卯一、標征

把這些眾生所見的差別開展出來，這當中分兩科，寅一、約所依的心識來判定二身，這個二身就是應化身跟報身。先看標征：

/VERSE/此用有二種。云何為二？

先作一個標，這以下正式的說明：

/KEPAN/卯二、正明
/KEPAN/辰一、明應身

辰一是講到應化身，辰二是講報身。先看應化身：

/VERSE/一者、依分別事識。凡夫二乘心所見者，名為應身，以不知轉識現故，見從外來，取色分齊，不能盡知故。

我們見到諸佛菩薩真如的妙用，所謂的法身、智身，第一種人是依止分別事識，這個分別事識就是我們的第六意識，依止我們的名言妄想所產生遍計所執的一個心識，叫分別心識，有各式各樣的取著叫分別事識。分別事識包括誰呢？包括凡夫、包括二乘，凡夫是依止有相的取著，二乘依止無相的取著，見到的都是應化身。

就是我們是依止現在的內心狀態，假設我們生長在佛陀的世界，我們看到的佛陀就是三十二相、八十種好的丈六老比丘相，這叫應化身。我們因為不知道我們所見到佛的身相，是我們自己第六意識的取相分別，所以我們見從外來，取色分齊，我們看到佛是由心外而來的，所以產生一種取色分齊，有一種自他的分別，佛跟我是有差別的，我們就不能夠完全的盡知諸佛如來法身、智身的種種妙用。

這個意思就是說，同樣一個佛身，我們心中取著的心強，我們看到的佛陀會有衰老、會有病痛、會有死亡，其實這個是我們心中有所取著，所以我們看到佛陀會有老病死，這叫應化身。

/KEPAN/辰二、明報身

這個是無量功德莊嚴的報身。

/VERSE/二者、依於業識。謂諸菩薩，從初發意，乃至菩薩究竟地，心所見者，名為報身。

前面是依止分別事識，是凡夫跟二乘人有所得的心所建立的；這裡依止的是業識，業識是第八識，第八識當然是依他起性，沒有第六意識的遍計執。這個菩薩是初發意菩薩，這裡的初發意菩薩是初住，發心住以上的，包括三賢位，也包括十地，初發意是講發心住，乃至菩薩究竟地，所見者的是佛的功德報身。這一段是總標，第二段把報身的內涵說出來。

/VERSE/身有無量色，色有無量相，相有無量好。所住依果，亦有無量。種種莊嚴。隨所示現，即無有邊，不可窮盡，離分齊相。隨其所應，常能住持，不毀不失。

先說明報身正報的莊嚴。身有無量色，有各式各樣美妙的顏色；每一個顏色有無量的相，不只是我們前面說的三十二相，他有無量的相；每一個相有無量好，不是只有八十種好：這個不可思議的境界，這個正報莊嚴。他的依報，所住依果，亦有無量。種種莊嚴。他所住的國土，我們看到佛陀住的茅蓬也是由泥土所做；但初發意以上的菩薩，看到佛陀是住在實報莊嚴土，七寶莊嚴的實報莊嚴土，這是講到依正莊嚴。

以下講到這個莊嚴是沒有時間、空間的障礙。先講空間：隨所示現，即無有邊，不可窮盡，離分齊相。我們看到諸佛菩薩報身的依正莊嚴是沒有窮盡的，因為他沒有自他的分離。在時間上：隨其所應，常能住持，不毀不失，他沒有老病死的問題，他是無量壽。所以我們在拜佛時，我們說：南無本師釋迦牟尼佛，有時候我們是拜佛陀那一期的個體生命，佛陀的出生、出家、成道乃至於說法度眾生。當然應化身還是很重要，因為沒有應化身說法，我們就不能聽聞到佛法。但是有時候我們拜佛說南無常住十方三寶，就是沒有老病死的那個佛，這個是報身佛，因為他這種佛是常能住持，不毀不失。第三段作一個總結：

/VERSE/如是功德，皆因諸波羅蜜等無漏行熏，及不思議熏，之所成就。具足無量樂相，故說為報身。

這種功德報身，它的成就有兩種力量：第一種是外緣的力量，就是種種波羅蜜利他的因緣所成就的福德資糧；第二個是本覺內熏，我們依止我們內心的三空自調、正念真如、念念的隨順真如，一種本覺的內熏所成就的、悲智所成就的。這種報身有無量無邊的安樂解脫之相，故說為報身。

在《維摩詰經》上說：我們見到佛陀，如果你是見到應化身，你不一定會得到利益。你看外道他見到佛陀三十二相、八十種好，他有時候也當面的訶責佛陀，造了罪業，所以應化身是我們凡夫有所得的心顯現出來的。但是你要見到報身，你一定會得到利益，一定會滅惡生善，絕不空過。

在《淨土聖賢錄》上說：慧遠大師曾經念佛時見到佛的報身，那是遍虛空界，無量光明、無量相好。當然你能夠見報身，那絕對是會滅惡生善的。就是說佛陀的功德法身、智身就像鏡子一樣，你用什麼心態，你是一個各式各樣的相貌在鏡子上，你就見到自己的反射，見到自己相應的法身、智身，是這樣的。

/KEPAN/寅二、約機所見以判粗細

前面是講到二身，這裡是講到粗細，它不用二身來判斷，以粗跟細。這當中有四段，先看第一段：

/VERSE/又為凡夫所見者，是其粗色。隨於六道，各見不同。種種異類，非受樂相。故說為應身。

這個是最粗的，凡夫所見到的粗略的法身、智身，他是隨順於我們六道遍計執的心，各見不同。種種異類。就是說假設我們今天是一個三惡道的眾生，比如說你現在是一隻狗，或者是一條蛇，你看到的佛陀是一個黑象的腳，一個長長的黑色的柱子，沒有光明相、沒有莊嚴相。但你要是天人，你看到的佛身就像一個天神相，光明美妙。比如佛陀講《阿彌陀經》時，有諸天、有人、有餓鬼道、阿修羅，每一個人所見各式各樣不同，當然時間相也各式各樣不同。

總之，凡夫所見的這個粗色，簡單的說就是非受樂相，它不是一個清淨解脫之相，就是你看到了佛身，你看到的佛陀也生病了、也老了，他的色身也衰老了，身體出現了皺紋了，最後死掉了。這都是隨於六道，各見不同。種種異類，非受樂相，這是我們看到最粗略的顏色。再看第二個：

/VERSE/復次，初發意菩薩等所見者，以深信真如法故，少分而見。知彼色相莊嚴等事，無來無去，離於分齊。唯依心現，不離真如。然此菩薩，猶自分別，以未入法身位故。

這裡講到三賢位的菩薩，初發意菩薩──十住、十行、十迴向，這三種位次的菩薩，他有一種不可思議的功德──深信真如法故。就是說他內心在斷惡修善的過程中，他能夠生起觀照，說是念念照常理，心心息幻塵，遍觀諸法性，無假亦無真。他能夠離諸有相、無相的對待，能夠深信真如，這個信就是隨順忍可，他內心中雖然沒有真實的契入真如，但是他不斷的往這個方向去隨順去忍可，所以我們也可以說是少分而見，相似少分而見，所以他有真如的氣氛。他見到的佛身，是無來無去，離於分齊，他看到的這個佛身，沒有這個時間、空間的這種障礙，而且沒有自他的分齊，知道這是一心真如所顯現，而不離開真如。但是他的內心中，還有微細的自他分別，沒有完全契入法身的階位。他雖然隨順真如，但是他有所得的心還存在。他所見到的佛身，比前面凡夫所見的更加殊勝。看第三：

/VERSE/若得淨心，所見微妙，其用轉勝。乃至菩薩地盡，見之究竟。

這個講十地菩薩。十地菩薩從初心，初心就是歡喜地初地的菩薩，他見到佛的法身、智身是依正莊嚴、是不可思議的微妙。他的作用，佛陀對這個菩薩產生滅惡生善的功能，是地地轉勝，說是如來現起他受用，十地菩薩所被機，佛陀教化十地菩薩，是先從他受用的報身，這樣的報身對那個菩薩的加持就不可思議了，地地轉勝，這個是講到十地菩薩他在受用佛身時候的情況。我們最後會想：那佛跟佛接觸時，會是怎麼回事呢？看第四：

/VERSE/若離業識，則無見相。以諸佛法身，無有彼此色相迭相見故。

如果說一個人已經完全離開有所得的妄動業識，則無見相，因為諸佛如來法身，沒有彼此對立的相貌可得。這個則無見相的意思就是說，假設有一天釋迦牟尼佛跟阿彌陀佛見面，他們兩個是怎麼回事？

在《成唯識論》上說：佛跟佛之間的相見，他這一念心跟境界接觸時，只有見分沒有相分，因為這個相分是有差別的。我今天看到這個瓶子的相分，跟昨天看到的相分會有所差別。所以他這種是能見、所見唯是一心，沒有對立相，只有見分、沒有相分。當然這樣的意境也不可思議，就是有見分，但是沒有相分。這個是講到有四種的眾生：凡夫、三賢、十地跟佛，在受用法身、智身時一個粗細的差別。看最後一段：

/KEPAN/子三、結示真如妙用

這些種種的差別，其實都是諸佛如來從真如所顯現的妙用。

/VERSE/問曰：若諸佛法身，離於色相者，云何能現色相？

這個法身是離於色相，那為什麼能夠現色相呢？看回答：

/VERSE/答曰：即此法身是色體故，能現於色。所謂從本已來，色心不二。以色性即智故，色體無形，說名智身；以智性即色故，說名法身，遍一切處。所現之色，無有分齊。隨心能示十方世界無量菩薩，無量報身，無量莊嚴，各各差別，皆無分齊，而不相妨。此非心識分別能知，以真如自在用義故。

這裡把前面佛陀所現的應身報身、粗色細色，會歸到其實都沒有離開真如，我們看它的回答。這個法身是色體故，是色的依止處，所以能夠顯現色。其實從因緣所生法，色心是不能分開的。就說十法界的眾生一定有一個心，一個明瞭的心，這個心一定有個依止處，就是色法，這個物質的色法。當我們色性即智故，就是把色法會歸到一心時，說萬法唯是一心，把萬法的差別會歸到一心時，這個色體當然是不可得，所以這個智身是把色法會歸到心法時，我們稱為智身。當然這個智身是一個明瞭的心性，就無有少法可得；但是當我們智性即色故，當我們講一心萬法，把一心延伸萬法時，說名法身，遍一切處，以一切法為色，所以能隨緣顯現，看你是用什麼角度。

總之，這個色心是不分離的，只是在講時有所偏重。我們所見到諸佛的色是沒有差別分齊，隨眾生的心，顯現十法界菩薩各式各樣的報身莊嚴，但是他都沒有自他的分別，而不相妨礙，這不是我們凡夫的心所能了知的。而這些身相都是一心真如，從大智慧光明義故、遍照法界義故，乃至常樂我淨義故顯現的種種妙用，是這個意思。這裡等於是把佛身相的問題作一個解釋。

當然你要不修念佛法門，可能對佛身就沒有什麼樣的障礙，但是有些人對佛身有障礙。有些人說：我念阿彌陀佛，這個發音要怎麼樣才正確？美國人他念阿彌陀佛的發音跟我們台灣人的發音不一樣，哪一個人才是真正的阿彌陀佛？就是說既然淨土法門講到感應道交，感應道交是能念的心跟所念的佛要感應，我們一心歸命極樂世界阿彌陀佛，哪一個代表阿彌陀佛呢？這裡有些人會產生障礙，那麼這裡就給你答案了。其實是沒有障礙，障礙是我自己的分別。

敦珠仁波切說：你在修本尊相應時，你觀想本尊的相貌，你喜歡他是男相也好、女相也好；你說我希望我的本尊是一道光明也可以；你說我連相都不要，我就聽他的聲南無阿彌陀佛也可以。就是說諸佛如來是法界身，入眾生一切心想中，諸佛菩薩的真如妙用，他的大智慧光明義故、遍照法界義故、常樂我淨義故，他本身沒有時空障礙；但是你要深信你心中所現的影像，不管是一個聲音、是一道光明，是一個男眾、女眾，你要深信他就是總持本尊的功德，你要深信這件事情，你就能夠感應道交。你要是起一念疑惑，這樣本尊的功德就消失了，你就活在自己的妄想中，就這個意思。

就是說諸佛如來的真如妙用，他的大智慧光明義故能夠離一切時空的障礙，諸佛如來是法界身；但是你在憶念他時，你要相信深信諸佛皆充滿，你這樣就能夠得到諸佛如來的加持，不管你看到的是粗色、細色。其實這裡講無量莊嚴，各各差別，皆無分齊，而不相妨，都是成就諸佛的功德，重點是你要能夠深信。前面的用是講到修因，這裡是講到果地的功德。好，我們今天先講到這裡。`;
