QXL.volNum = 26;
QXL.text = `
請大家打開《講義》第五十五頁，癸二、釋發心。

在大乘的修學中，我們成就的第一個功德是信成就發心。信成就發心前面一科，先講到信心的成就，就是我們依止內外善根的熏習，成就所謂的菩薩種性，對於大乘菩薩的功德，對於一心具足體相用三大的功德，真實的信心而不退轉。這以下說：我們依止這樣的大乘種性發起菩提心，它的相貌是什麼？

/KEPAN/癸二、釋發心
/KEPAN/子一、釋所發之心
/KEPAN/丑一、正釋

這當中有三科，子一、釋所發之心，先說明菩提心的相貌是什麼，它果地的相貌；下一科再說明它因地修行的方法。先講果地的功德相，再說明因地的修學相。這當中有兩科：先正釋，再釋疑。先正式的說明：

/VERSE/復次，信成就發心者，發何等心？略說有三種。云何為三？一者直心，正念真如法故；二者深心，樂集一切諸善行故；三者大悲心，欲拔一切眾生苦故。

一個初住的菩薩，他已經依止了堅固的菩薩種性，一個有菩薩種性的人，他一定會發起菩提心，因為由信能夠引導我們的願力。一個有菩薩種性的人是什麼相貌呢？他的心跟凡夫心有什麼差別呢？這當中講出了三種差別：

一、菩提心的三種相貌

第一個、直心：這個直心就是正念真如法故。這個直心，在法藏大師的解釋中，是判作根本行，是整個菩薩道的根本。就是說你這個東西沒有根本，下面的修善、度眾生就變成有漏的業行。

一個初住菩薩的內心，他是正念真如法故。我們這一念的心性有兩個相貌，有真如跟無明兩種相貌，都是無始的在心中同時活動。無明主要的、最粗顯的相貌，就是自我意識。我們一般凡夫的心跟境界接觸時，都是心隨妄轉，跟著自己的感覺、跟著自己的習氣來活動，就是我完全靠直覺來活動，我現在想要做什麼就做什麼。

一個住位的菩薩，他的內心中，他的心能夠正念真如，這個念就是他有隨順真如的力量。他的心跟境界接觸時，當然也可能會起妄想，也可能不起妄想，但是他起妄想時，他有對治力，能夠把妄想的因緣撥開來，回歸到他內心的真如理體，一種清淨本然的理體，他能夠把心帶回家。所以這裡就是說他不再隨順妄想而活動，他念念之間，開始隨順真如法，以真如法來對治無始的妄想，這叫直心，這是整個發菩提心的根本。這裡是約著斷惡來說，他所修學的重點是修習內心的體大，就是真如平等無增減故。

第二個、深心：樂集一切諸善行故。前面的心，它的所觀境是約著惡法來加以對治；這裡的心，它所修的所觀境是善法。什麼叫善法？就是能夠生起此生、他生安樂果報的，都叫做善法。在佛法中的善法，有六波羅蜜──布施、忍持、戒辱，乃至於禪定、智慧。住位的菩薩他對於一切的善法好樂的修學，這個是成就了自利行，來成就內心的莊嚴，所謂的如是一心中，方便勤莊嚴，修習六度，以福德、智慧二種的資糧來莊嚴他的一心。前面是講直心，但直心只是斷惡，缺乏莊嚴；所以我們應該積極善法，以福德、智慧兩種的資糧來莊嚴我們的心。

第三個、大悲心：欲拔一切眾生苦故。我們不是只是求自己的受用跟莊嚴，我們還有一切如母的有情在三界中過著痛苦的生活，所以我們應該要以種種的善巧方便來度化眾生，這個是利他行，成就一心的用大。

所以真實信心成就的菩薩，他內心中是具足直心、深心跟大悲心，這樣我們就安立做發起的菩提心。他明瞭的心跟境界接觸時，具足直心、深心、大悲心，我們就安立說這個人的菩提心真實生起了。這是一個菩提心的三種相貌。

/KEPAN/丑二、釋疑

/VERSE/問曰：上說法界一相，佛體無二。何故不唯念真如，復假求學諸善之行？

我們前面在說理論時，講到真如門是法界一相，十法界從真如的體性是無差別的，所謂的心、佛、眾生三無差別。既然無差別，為什麼我們在修學菩提心時，我們不直接的唯念真如就好？我們可以經常在佛堂中，觀察摩訶般若波羅蜜，依止我空、法空的智慧，來消滅我們心中的妄想，安住在我們清淨平等的真如就好了，為什麼要去修善？為什麼要去度眾生呢？就是因為法界是一相，就提這個出問難，看回答。

/VERSE/答曰：譬如大摩尼寶，體性明淨，而有礦穢之垢。若人雖念寶性，不以方便種種磨治，終無得淨。

講一個譬喻：我們這個摩尼寶珠能夠所求如願，就表示我們的菩提心，雖然它的體性是光明清淨，但是它無始劫來有污垢。如果我們在一直憶念摩尼寶珠的體性是清淨的，但是我們沒有假藉種種抹布、清潔劑的方便來加以磨治，它還是不能恢復清淨的本性。也就是說這個菩提心的修學，應該是理事無礙。在理上，我們應該要能正念真如，生起觀照；但在事上，我們也應該要修善，乃至於度化眾生的行動：這樣才能夠達到目足雙運的理事無礙。這是譬喻，這以下合法。

/VERSE/如是，眾生真如之法，體性空淨，而有無量煩惱染垢。若人雖念真如，不以方便種種熏修，亦無得淨。

就是說眾生的真如之法，雖然本性是清淨，但是從作用上來說，我們在三界中，無量次的受生打滾，熏染了很多貪瞋癡煩惱的習氣，假設我們只是憶念真如，二空真如，而不假藉種種的六度方便加以熏修，我們是不能恢復它的清淨光明。為什麼？

/VERSE/以垢無量，遍一切法故；修一切善行，以為對治。若人修行一切善法，自然歸順真如法故。

因為我們眾生的煩惱污垢是無量，他煩惱污垢的生起因緣，是遍一切法故。我們要還滅一個東西，你要先找到他生起的因緣。我們的煩惱剛開始生起因緣，是普遍在一切的有情無情的境界中，去造惡而熏習的煩惱。所以我們從對治義的還滅角度來說，我們也必須在有情無情的境界中，去修一切善來加以對治。所以作一個總結：若人修習一切的善法，才能夠歸順於真如法故，不能夠執理廢事的。

這裡，我們可以回顧一下前面一心二門三大的理論：

我們前面講到現前一念心性時，講到我們內心中有真如跟無明。這當中真如是無始的，無明也是無始的，這表示我們內心的本性是真妄和合。所以你修行不能只是生善，不斷的生起你對真如的歸依就可以了，你還得破惡，生善跟破惡是缺一不可的。

你對真如的觀照很強，但是你無量無邊的煩惱習氣沒有對治，真如還是不能開顯。所以這裡就是說，我們內心中應該正念真如，對真如生起歸依的心；但是我們要假藉布施來對治慳貪、假藉持戒對治我們的罪業、假藉忍辱來對治我們的瞋恚，乃至於假藉禪定、智慧來對治惡法生起善法。就是事相的修學都是不能免的，這樣才能夠真實的歸依，歸依到一心真如的功德。這裡是說明我們在發心時，必須要發三種心的理由。因為你正念真如只是理觀，深心、大悲心的事修都不可以缺乏。

/KEPAN/子二、釋發心之行

前面是講到菩提心的相貌，這以下是說明成就菩提心的方便，它的方法是什麼？

/VERSE/略說方便有四種。云何為四？

我們成就菩提心的方便有四種，先看第一種。

/VERSE/一者行根本方便。謂觀一切法，自性無生，離於妄見，不住生死。觀一切法，因緣和合，業果不失。起於大悲，修諸福德，攝化眾生，不住涅槃。以隨順法性無住故。

這裡的根本，其實就是前面說的大乘信心，就是安住菩薩種性，它是根本，它等於是把信心再加以加強。當然信心主要是靠智慧的觀照引生，不能假藉外在的因緣，我們前面說過的。我們在成就菩提心時，第一個要加強我們的根本功德，所謂的安住菩薩種性，這當中有兩種的觀察：

一、觀察真如的如實空義：就是說我們經常觀察一切的有為法是自性無生，而離開凡夫的妄見，使令我們能夠不住生死，對治我們對生死果報的執取。

自性無生，就是我們觀察的重點，簡單的說就是自性空。大乘佛法修空觀，它的一個切入點，不是從無常，大乘佛法是觀因緣所生法，是從因緣上觀進去的。因緣所生法，在天台的止觀中，智者大師乃至於蕅益大師的觀法，就是從過去、現在、未來的觀察。怎麼樣觀察因緣所生法呢？比如說：我們觀察現在這個講堂，這個講堂是一個因緣所生法，它有過去、現在、未來。就是說這個講堂它過去是不存在的，因緣沒有成立時是不存在的；這時假藉因緣，它暫時剎那剎那現前；等到有一天因緣結束時，這個講堂又消失掉了。所以我們透過過去、現在、未來觀察，我們知道它是自性空。這是觀察依報的莊嚴。

我們也觀察我們的正報：你的生命有一個外在的色身，有一個內在明瞭分別的心識，有受、想、行、識，你有各式各樣的感受、各式各樣的想法等等。你這個身心世界怎麼去觀因緣所生法？就是未生無潛處，我們還沒有從父母親生出來之前，你這個身心世界是不存在的，它不是本來就存在。正生無住處，現在就算存在，也剎那剎那生滅，它也沒有一個安住的處所；等到我們死掉以後，我們來生又換一個色身、又換一個心識。你來生可能是一個男人的心識，或者一個天人的心識，那你那個心識跟現在這個心識，完全不一樣，你外表的色身也完全不一樣，所以生已無去處。你等到幾百年後，我們再觀察你這個身心世界，也覓之了不可得。

所以你從現在、過去、未來觀察因緣所生法，每一個法都可以了解到自性無生。這樣我們對於三界的生死果報，這種一時的得失，就會慢慢慢慢就會輕薄。就是這個生命它只是一個暫時的夢幻泡影，我們的重點在於過程，我們從這一期的生命中，如何的積功累德如此而已。我們從夢幻泡影中，假藉夢幻泡影的因緣，來滅惡生善，這是非常重要的菩薩空觀。你一定要修空觀，你的心才能夠從現前的因緣中，跳脫出來。這個是觀察它的如實空義，觀察我們真如的如實空義。

二、觀察真如的如實不空：我們不能老是在空義裡面安住，我們應該從空出假，觀一切法，只要是因緣的和合，這業果就會出現。你今天有五戒、十善的因緣，就出現人天的果報；你有四諦、十二因緣，出現二乘的偏空涅槃；你依止菩提心、六波羅蜜的因緣，成就菩薩的萬德莊嚴。你用假觀時，你就生起大悲心，把你這個成就聖道的心，普及在一切如母有情的眾生，為了有情的緣故，廣泛的修習福德種種的資糧，來攝受眾生而不住涅槃。前面是以空觀來成就心中的智慧，這裡是修假觀來成就我們的大悲，以悲智雙運的因緣，來隨順真如法性的平等，而使令我們無住。這裡的無住，包括了不住凡夫的生死，也包括了不住二乘的涅槃，而順入於中道的思想。

這裡的菩薩種性，我們說明一下：

菩薩種性的修學，是悲智雙運，上求下化，名菩提心。我們理觀時，應該要空有雙照，保持悲智的平等。事實上從一個實踐的角度，菩薩是有所差別的。有一類的菩薩是悲增上菩薩，他在觀照時會偏重在假觀，悲眾生苦，他會偏重修習福德資糧，先成就福德的莊嚴，再成就聖道的莊嚴。另外一種是智增上菩薩，他在修觀時，會偏重在觀察諸法的自性無生，對福德的修習，會比較不主動。他生命的因緣，會先成就聖道，然後再成就福報。所以菩薩在實踐上的確有所偏重，有悲增上、智增上的差別，有悲增上、智增上的差別，但是你不能夠完全缺乏一個。

就是說這兩個可能會有所偏重，但這兩個都應該有，這樣才能夠成就根本方便，所謂依止正念真如法故，來安住菩薩種性，這是我們的根本。就像你種蘋果，你一定用蘋果的種子、然後灌溉，你才能夠產生蘋果；你用葡萄的種子，一定長成葡萄。所以你要成就諸佛的功德莊嚴，你剛開始的種性，這個種性就是你的宗見，你對生命的知見是什麼，就影響到你的種性。你的種性有偏差，後面的行動力那這個方向就會偏差。所以剛開始先強調根本方便，先端正你的菩薩種性；二三四等於是依止這個種性再加以加行。

/VERSE/二者、能止方便。謂慚愧悔過，能止一切惡法，不令增長，以隨順法性離諸過故。

當我們對生命能夠空有雙照而順入中道以後，我們應該產生什麼行動呢？產生改過的行動。當然要改過，一定要有慚愧心，要增上慚愧。這個慚愧心的生起，就是你要能夠如實的了知惡法的過失，你要能夠怖畏當來的果報，就是你要持戒。你要把戒持得好，那這個戒法是由心來推動的，你對惡法的過失不生怖畏，那你持戒沒有什麼力量，因為這個戒法是由心來操作的。這個刀子它能夠把樹砍掉，但是你力量太少了，這棵樹就砍不斷。

所以我們在斷惡時，你一定要能夠對惡法生起怖畏心，這時以怖畏心來修習攝律儀戒，就能止住我們身口意的惡法，使令我們的惡法慢慢的減少不再增長，這樣是隨順真如法的離諸過故。

總之，我們在安住菩薩種性以後，第一個行動力，先求寡過，這個很重要。雖然菩薩的行動力有三聚淨戒，但是以斷惡作基礎。因為你這個過失不先調伏，你就直接去度化眾生，你所修度化眾生的善業都帶有雜染，所以剛開始先求寡過，這個就是我們第一個行動，修這個止，止惡的方便。

/VERSE/三者、發起善根增長方便。

前面在修習菩提心的第一個是止惡；這個是修善，修習種種的善根。

/VERSE/謂勤供養禮拜三寶，讚歎隨喜，勸請諸佛。以愛敬三寶，淳厚心故，信得增長，乃能志求無上之道。又因佛法僧力所護故，能消業障，善根不退。以隨順法性離癡障故。

我們在斷惡的基礎之下，應該要主動的修善，成就福德、智慧二種莊嚴。大乘佛法應該怎麼修善呢？這當中有兩個重點：

第一個是勤供養禮拜三寶，讚歎隨喜，這個是成就大乘的信心。

我們剛開始修善，它的所緣境是佛法僧三寶，這應該怎麼修？包括身業的禮拜、口業的稱名讚歎、內心的歸依隨喜，就是這樣修。以這個身口意的歸依，來修學我們大乘的善根。為什麼我們在修學歸依時，要面對三寶的境界呢？古德解釋說：三寶有二義：一者救護義。菩薩道不只是一生一世的修學，我們必須要生生世世能夠遇到大乘的三寶，我們能夠遇到三寶的因緣，就是我們必須要對三寶經常的憶念。《大勢至菩薩念佛圓通章》說：佛菩薩的心情，就像母親憶念兒子，他經常憶念我們，他經常對我們釋放他的善意。但是我們要能夠跟諸佛菩薩感應，這不是單方面的，我們自己也要釋放出對三寶的憶念。這樣雙方都有互相憶念，我們在生命中就能夠產生一種交集。這就是為什麼有些人容易生長在三寶的地方，有些人很難生長在有三寶的地方，就是你根本不修歸依。你不修歸依，你就算福報很大，你也沒辦法遇到三寶的住持。就是說三寶的心是平等的，就像月亮普照一切有情眾生，但是你要把水準備好，千江有水才能夠千江月。所以我們第一個修學善根，是對三寶的歸依，這是修信心。當然這是一個基礎，祈求三寶的救護。

第二個是三寶有破障力，依止對三寶的歸依，來破除我們的罪障；進一步勸請諸佛，我們應該請佛住世，請轉法輪。依止大乘佛法的聽聞跟思惟，把文字的佛法轉成我們內心的光明，你要有一種對生命的觀照力，你要能夠判定什麼因緣是過失相？什麼因緣是功德相？什麼因緣是隨順無上菩提？什麼因緣對無上菩提是障礙的？你要能夠善知抉擇。而這個抉擇力的生起，不是你一個人雙腿一盤一打坐就能夠生起，你只有一個方法，就是親近大乘的善知識，聽聞正法，如理思惟，才能夠生起。所以我們應該勸請諸佛住世，來轉法輪，成就智慧的善根。

依止對三寶的歸依，跟聽聞佛法的修學，這時以愛敬三寶，淳厚心故，信得增長，乃能志求無上菩提。這時我們對三寶真誠的歸依，增長對三寶的善根，能夠成就無上菩提。所以我們不斷的拜佛、念佛這件事情，是隨順無上菩提，因為三寶有救護義。

又因佛法僧力所護故，能消業障，善根不退。假藉三寶的攝受，這個中主要是佛法的熏習、內心的觀照，來破除我們內心的障礙，使令善根在成長的過程中，永遠不退轉。這樣而隨順真如法性的離癡障故。所以在修善中，有信心跟智慧二種的修學。

/VERSE/四者、大願平等方便。所謂發願盡於未來，化度一切眾生，使無有餘，皆令究竟無餘涅槃，以隨順法性無斷絕故，法性廣大，遍一切眾生，平等無二，不念彼此，究竟寂滅故。

前面是修善；這以下是度眾生，以大悲願力來平等救護眾生。我們應該發願，發什麼願？

在時間上是盡於未來。所以我們在受戒時，你要受聲聞戒，你的所觀境是要期誓願。你在受聲聞戒時，你不能說你生生世世要受持聲聞戒，因為聲聞戒是今生今世，你來生你不一定要出家的，你不一定能出家，所以聲聞戒它的要期是今生；但菩薩戒的所觀境是時空無盡的，你可以規劃到未來，就是說你不管來生是出家、在家，你還是要趣向無上菩提，所以你在發願時，是盡於未來。

在空間上是化度一切有情眾生，不能有所簡別。用什麼樣的功德來攝受眾生呢？使無有餘，皆令究竟無餘涅槃。使令眾生的三界果報，都能夠窮盡，而成就大乘的無餘涅槃。比如說離苦得樂，這個眾生他沒有飯你給他一碗飯吃，他沒有衣服穿你給他衣服穿，當然這都是一個暫時的離苦得樂。真實的離苦得樂，你應該要開顯佛法的道理給他了解，使令他生起光明的智慧，趣向無上菩提，這才是究竟。因為隨順法性無斷絕故，法性廣大，遍一切眾生，所以我們對眾生是平等不二，沒有自他的差別，成就究竟的寂滅。這裡是講度眾生，斷惡、修善、度眾生。

度眾生這句話說明一下：在宗大師修大悲心的開導中說到：我們在發願時要平等。比如說你得菩薩戒體，你面對的是十法界有情無情的眾生；你要是說針對某一個怨家，你不能夠對他斷惡、修善、度眾生，那你這個菩薩戒就不能夠成就，這個因種要圓滿。所以在理觀上，他是平等不二；但是在實踐上，有他的次第。他在次第上，一定先度化有緣的眾生，然後再對中庸的眾生，然後再對怨家的眾生，他是有次第的修。

佛在世時，外道就譏嫌佛陀說：佛陀啊！你的心是平等，但是你花很多時間為佛弟子說法，你花很少的時間為外道說法？這外道就譏嫌佛陀不平等。佛陀說：假設你有三畝田。一塊是最肥沃的田，你只要少分的耕種，就產生很多的水果；第二塊是中等的田；第三塊是貧瘠的田，你怎麼種就長不出水果。這樣的話，你應該要先耕種那一畝田？外道說：我這個精神體力有限，我應該先耕種肥沃的田。佛陀說：佛陀在度化眾生，亦復如是。當然是對於善根已經成熟的眾生，先加以攝受。所以佛陀花大部分時間對出家眾說法，花少部分的時間為居士說法，花極少數的時間為外道說法，那是因為眾生的善根不同而安立的。所以我們在發願時是不能有所簡別，但行動上有它的因緣差別，這個是在度眾生的方便。

這裡是講到修習菩提心的方便，在根本上安住菩薩種性，你要先把你的種性建立起來，依止這個種性修行三種的加行──斷惡、修善、度眾生的加行，使令我們從種性中，慢慢的開花結果，成就種種的功德莊嚴。這就是成就菩提心的四種方便，一個是根本法門，後面三種是枝末法門。我們今天就講到這裡。

我在回答一個問題，之前同學問一個問題，我沒有好好回答，我現在再重複回答一下。

【學員提問】法師慈悲！法師曾提到修行的次第，是從業力的修學而到心念的修學；也曾提到大小乘空觀的不同，小乘是把心性完全的否定而滅色取空，大乘有中道的智慧來保留心性本具的妙用。在實際的修行上，當我們在修習空觀時，是先修小乘的空觀，再修大乘的空觀？還是兩者同時的並行？

【師父答疑】我們修大乘佛法，可以從兩個角度來修學。第一個就是根本法門，就是安住菩薩種性，所謂的正念真如。就是你的宗見，你能夠觀察一切法自性無生而不住生死；也能夠觀察一切法因緣生不住涅槃，來積功累德，空有雙照，安住中道實相。當然這個是不能有差錯的。當你在建立菩薩種性時，還要有一些加行對治，就是斷惡、修善、度眾生。這裡的空觀，主要是約斷惡來說。

斷惡時，當然眾生惡法的熏習各式各樣。有些人根利遮輕，他大乘善根強，你跟他他講一心真如平等的法門，他就能夠接受；而且他煩惱輕薄，他的貪煩惱也輕薄、瞋煩惱也輕薄、高慢心也輕薄，所以他就不用太重的藥，他只要觀因緣所生法，我說即是空，就可以把他煩惱的相續活動給消滅掉。但是有些人根利遮重，他善根強，但是他煩惱也粗重，他面對煩惱時，觀因緣所生法，我說即是空，他這個藥就太輕了。所以聲聞法的好處，諸位讀聲聞法你會發覺：它的藥下得很重，它是對立法門。所以無常觀，有時候是治亂世用重典。

所以有時也一再強調修死亡，就是死亡也是無常觀，就是三界的果報。你說我們對三界果報的執取，觀自性無生，那也是可以；但是如果你觀察我們總有一天要死亡，死亡時萬般帶不去，只有業隨生，這個無常觀就有一點滅色取空。它這個滅色，這裡在觀時，就要注意：小乘的學者在觀察無常時，他是把整個三界的果報加以厭惡，所以一切有為法他一觀下去，一切有為法經過無常觀一抉擇下去，沒有一個東西有價值的。

所以你看《法華經》《維摩結經》聲聞弟子就很坦白跟佛陀說：我觀察這一切的法，不管是生死的法、不管是諸佛菩薩的功德莊嚴，都是不生不滅，無大無小，無常敗壞，不生好樂，他對有為法沒有感覺。菩薩在觀無常時，他主要是依止一心而修，他就是對治內心的障礙，這一點要注意，就是迴光返照。就是說我們也會用聲聞法的這個重藥來對治，但是他所對治的，是依止一心來對治心中的愛取，我們對三界的果報不會產生那麼怖畏，以後你往生淨土，要回入娑婆度有情，你就不會那麼困難。

所以我們諸位要知道一個原則，就是說成佛之道有很多事情要做，斷惡是第一件事，但是你在斷惡時，不要產生後遺症，不要為你以後的菩薩道做遮障。就是你在斷惡時，你不能錯損你的善根。我們今天觀無常觀，是對治內心的執取，對於三界的果報，你如果極度的厭惡，你以後要回入娑婆就有困難，你到時候還要再修一個法門來破除這個障礙。

就好像說我們學鋼琴，學鋼琴你一開始沒有跟一個好的老師學，你跟世間那些在路邊上彈鋼琴的人學，你一下子也會把鋼琴彈得很好，但是你手法不是完全正確，你要去彈正式國際的名曲就有困難。有困難時，你再請教善知識，善知識要花兩倍的時間教導你。就是你要是一張白紙，還好教導。就是你要花一半的時間，把你過去的習慣全部洗掉；然後再花一半的時間，重新學習正確的手法。

所以你剛開始就應該把正確的法門，這個正確的方法學對，不要為以後造成障礙，這個道理就在這裡。

就是說菩薩也用聲聞法，甚至於我們用人天法來對治，但是你的根本法門──正念真如，不能有差錯，這是菩薩道的重點，莫向外求。你所有的法門都是在作內心的對治，在對治內心的惡法，生起內心的善根、生起內心的大悲。這樣你能夠在三界中出入自在，你能夠在往生淨土、成就法身以後，要回入娑婆，就不會有困難。

就是說你今天在整個成佛之道的布局，你要有遠見。你採取激烈的手段，你以後一定會後悔，你還要花很多時間，尤其是那種法執、所知障是不染污無知，你會發覺為什麼以前同樣發心，大家一起修學聖道，人家成就初地了，我卻還在十信位、十住位，在那邊進不去？就是你過去斷惡時，激烈的手段產生的後遺症很難對治。因為我執是煩惱障，它粗重它很容易斷；法執是所知障，你弄錯以後，它非常微細，它是不染污無知，你很難斷，那種等流習氣，它會在你的菩薩道中，生生世世跟著你。

所以我們剛開始斷惡，要等同聲聞修學，但是你斷惡時，要注意你所斷的惡是內心的惡，不能把一切有為法斷掉，這裡要注意。所以到底應該是同時並行，還是專修小乘的空觀，或是大乘的空觀，這就要看個人煩惱的粗重性。但是它的重點就是莫向外求，依止一心為宗，來生起斷惡、修善、度眾生的加行，這樣就對了。`;
