QXL.volNum = 31;
QXL.text = `
請大家打開《講義》第六十九頁，寅三、揀成不成。

本論的修學宗旨，在前面的《序分》中說：為欲令眾生，除疑捨邪執，起大乘正信，佛種不斷故。也就是說本論的修學，主要的就是要成就我們大乘的因果。從果地來說，本論所強調的功德，就是菩提心。因為大乘佛法的種種自利利他的妙用，都是依止菩提心才能夠生起。所以我們整個追求的目標，就是把凡夫的心轉成一種清淨的菩提心。菩提心的修學次第有三個：信成就發心、解行發心、證發心，這是我們身為一個大乘的佛弟子所要追求的目標，這是大乘果地的功德。

這樣的菩提心應該怎麼生起呢？我們必須要積集大乘的因地。這個因地，基本上就是要成就大乘種性。大乘種性的修學，在前面的解釋分講到，主要就是內在的一種觀照力。這個觀照力，馬鳴菩薩提出了三種不同的觀照（產生三個不同的種性）：

一、善、惡業力的觀照：也就是說當我們這個明瞭的心，跟生命接觸時，我們看到的是一種業力：如果我們依止善業的造作，就招感了人天安樂的果報；假設我們依止的是罪業的造作，就招感刀山油鍋的三惡道痛苦果報。依止這個善惡業果的思想，我們就產生一種增上的慚愧心。這個增上慚愧生起時，我們就說你已經安住了人天的種性。也就是說我們今生的生命，將會趣向於人天，出現種種的財富、種種的眷屬、種種美好的名聲，種種安樂的果報，這就是由增上的慚愧心所引生的一種人天的果報，這樣叫做人天種性。

二、有為、無為的觀照：就是我們內心對生命接觸時，我們發覺這一切有為法都是無常敗壞、生滅變化的，所以這個無常本身，就是一種不安穩性，我們不知道明天會發生什麼事情。從這個無常流動中，就說明了整個有為諸法，包括三惡道的痛苦、也包括人天的暫時安樂，通通都是痛苦的。這樣人生的歸依處是什麼呢？就是一種無為的涅槃寂靜，所以整個無常觀所帶動的思考，就是所謂的諸行無常，是生滅法，生滅滅已，寂滅為樂。就會使令我們厭惡這種有為的無常敗壞之法，好樂這種不生不滅的涅槃寂靜。這樣的心生起，我們就說你已經成就了二乘的種性，發起了出離心。當然出離心的生起，就帶動我們生命會趣向於偏空的涅槃，這是第二層的觀照。

三、（第三層的觀照，是馬鳴菩薩所強調的。）前面的兩個觀照，包括業果的觀照，也包括有為、無為觀照，基本上都是心外求法，是向外的觀照；本論觀照所強調的是一種向內的觀照，就是我們觀察生命，你應該是莫向外求，你應該迴光返照我們現前一念的心性。我們一念的心性的活動有兩個選擇：第一個，我們隨順有所得的妄想，這樣就招感種種的痛苦果報。總相來說，痛苦就是無常敗壞的痛苦；從別相來說，就是刀山油鍋的三惡道的痛苦：這都是由一念的無明妄想所變現。第二個選擇，我們一念心的活動，可以隨順無所得的真如，這樣我們會產生種種的依報、正報的功德莊嚴，遠離種種的痛苦而得到究竟的安樂，所以說我們在觀察一心二門時，我們就知道無明的過失跟真如的功德。

接下來馬鳴菩薩引導我們應該觀察這三大的道理，所謂的體大、相大、用大。從這體、相、用三大的觀察，我們得知其實我們一念心雖然具足了無明妄想，也具足了真如本性，而重點是達妄本空，知真本有。就是妄想是一種虛妄的影像，真如才是我們的本來面目，所以從這樣的觀察，我們就開始棄生滅，守真常，遠離妄想、安住真如，這時就是成就了大乘種性，依止達妄本空，知真本有的理解，我們就能夠發起菩提心。這樣觀照所發的菩提心，馬鳴菩薩說這叫利根人根利遮輕，就是這個大乘善根特別強，無始的妄想也特別輕薄，他就能夠從一心、二門、三大的觀照，直接生起所謂信成就發心的大乘正定聚。

但是我們一般的末法眾生，我們雖然在觀照時，也相信真如的功德不可思議，也相信無明的種種過失，但是一時半刻要遠離無明妄想，有困難。就是我們的善根中，有很多很多的煩惱跟罪業的遮障，障礙我們趨向真如，所以我們在觀照之餘，要加強我們的行動力，就是所謂的修行信心分。要透過五門的修學，來加以破惡生善，幫助我們內在的觀照。

這五門中，前面的四門，就是布施、持戒、忍辱、精進，這四門主要是破障，破除我們內心的貪愛跟瞋恚的煩惱，安住在忍辱、精進的力量中。前面的破障是一個前方便，是道前基礎。其實在這五門中的正修，就是止觀。止觀門是真實能夠使令我們返妄歸真，止觀中，我們這一科講到的是修止。這個止，我們上堂課講過。這個大乘止觀的止，它的基本定義，什麼叫修止呢？就是止息一切的境界相，這叫做修止。這個止息一切境界相，在本論中提出了兩個方法：

一、止息外在的境界相：就是你修止時，要遠離氣息，遠離這種形色、遠離種種的地水火風、遠離見聞覺知，就是說外在的境界相，都必須要遠離。這個遠離的方法，法藏大師解釋說：就是觀察這些外在的境界都是唯心所現，是如夢如幻的。既然它是虛妄相，我們自然是應該遠離，所以它第一層的遠離，是遠離這種如夢如幻的外在境界。

其次，遠離我們內心的境界相，就是我在那個地方打坐，我也沒跟外在的境界接觸，但是我內心的名言妄想，它創造很多很多的境界，這樣也應該遠離。那怎麼遠離呢？本論說你應該觀察一切諸法，本來無想，念念不生、念念不滅。就是這一切法，它本身是沒有生滅的，所謂的生滅是一種因緣的生滅，從本性來觀察，它是念念不生、念念不滅，這樣我們就能夠遠離內在的妄想。

當我們能夠遠離外在的境界，又遠離內心的妄想，這時我們的內心就真實的把心帶回家，就從這種生滅有所得的妄想，安住在清淨光明的一心真如，這裡就叫修止。

這裡有些人就疑惑說：這樣大乘的止跟小乘的空觀有什麼差別？

小乘的學者當然也修空觀，不過小乘空性的安立，是一種滅色取空，他遠離一切的有為諸法，另外找一個空，所以他有為跟無為是對立的。這樣他這個空性的安立，基本上是一種心外求法，在遠離一念的心性之外安立一個空相，所以他這個空基本上不能生起種種的妙用，當然也不可能發菩提心。

大乘佛法的空性，他的安立在前面的論點上說：修習這真如三昧的一個根本思想，你應該觀察一切諸法，唯依妄念而有差別；若離妄念，則無一切境界之相。就是說這一切境界的差別是由妄念生起，怎麼遠離妄念呢？你應該觀察是故一切法，從本以來，離言說相、離文字相、離心言相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如。就是你應該遠離一切外在的境界，遠離內心的名言，然後唯是一心。

所以大乘的空觀，他內心中的現前一念明瞭心性，它是沒有消滅的，所以他隨時可以從空出假，廣度眾生。小乘的空性，他沒有依止一心，他是遠離這個身心世界，去找一個空相的真理，然後在那個地方安住，這整個生命的現象就全部消失掉；他沒有說是觀一切法空，然後安住一心，沒有這樣的思考，這個是我們感到遺憾的地方。所以這裡，我們應該把小乘的空觀跟大乘的真如三昧（真如三昧它的止息妄想，是隨時可以生起妙用的。）加以簡別。

/KEPAN/寅三、揀成不成

前面是講到我們修習大乘種性的一個方便，就是修習真如三昧；這裡就正式說明我們在修習真如三昧時，有的因緣可以，有的人可以成功，有些人不成功，這一個差別的因緣，我們作一個說明。這當中有兩段，先說明這個成功的因緣：

/VERSE/若從坐起，去來進止，有所施作。於一切時，常念方便，隨順觀察。久習淳熟，其心得住。以心住故，漸漸猛利，隨順得入真如三昧。深伏煩惱，信心增長，速成不退。

前面的修止，它的方便應該要住於靜處，端坐正意。就是我們剛開始修真如三昧時，你應該要在佛堂修，你應該觀察：一切的外境是如夢如幻，一切的妄想也是本自念念不生、本自念念不滅，這時遠離了外境，遠離了內心的妄想，安住在無住的真如。但是我們一個凡夫眾生，我們有很多很多的人事因緣必須要面對，我們也不可能一天到晚在佛堂中，所以若從坐起，從現實的生活，我們遲早會從佛堂出來。出來，就會跟這外在的境界接觸，也可能是順境、也可能是不如意的逆境。應該怎麼辦呢？這個在順逆境界的刺激之下，我們應該常念方便，隨順觀察。

就是說我們在歷緣對境時，跟靜中修有所不同。因為靜中修，你的心完全可以作主，它干擾的因緣少，所以你內心中，就直接扣著所謂的無住法門，你看到任何的境界、你想到的任何的事情，就以無住法門來破除。但是當你離開佛堂以後，這個人事的複雜度，那不是我們能想像的，所以我們有時後對於這個無住的真如法門，會忘失正念。但是忘失正念，因為你有順逆的刺激，你的心就會躁動，躁動時就會起動我們止的力量。這時我們應該怎麼辦呢？繼續的常念修習真如三昧方便，隨順這樣的一個方便去觀察，觀察這一切外在的順境、逆境，都是我們心中的業力所變現，一種如夢如幻的影像，它不真實，乃至於我們內心所帶動的妄想，也是念念不生、念念不滅，從本性的觀察，都是畢竟空的，這時候我們就能夠從這種妄想中跳脫出來。

久習淳熟，其心得住。我們一般人的心是安住在妄想，但是我們也說過妄想是一種虛妄相，當我們不斷這樣的如實觀照以後，這個妄想的力量就像烏雲一樣，這太陽一照，慢慢慢慢就消失掉了，這時我們真如的清淨本性現前，我們就從本性中真實的安住，慢慢安住了。

以心住故，漸漸猛利。一個人他在真如一安住以後，修行就跟以前不一樣了。我們以前在無明妄想中打轉，總是覺得修行不知道該怎麼辦。你能夠在真如中安住，乃至於少分的安住，你修行的那個真如力量就慢慢的猛利，慢慢就遠離無明妄想，開始隨順真如三昧。這樣有什麼功德呢？

深伏煩惱，信心增長，速成不退。我們經常修習真如三昧的人，從破惡的角度，他能夠深深的去消滅煩惱。這個煩惱，有貪慾、瞋恚、高慢心、嫉妒心等很多很多的煩惱。但是這個煩惱，它有一個共同的依止處，就是——妄想！真如三昧，就是直接從煩惱妄想的根本去破除，煩惱的根被你破壞了，煩惱就沒有辦法活動，就算有也是非常的輕薄，所以它能夠從內心的深處，把這個煩惱的根慢慢的斬斷。

從生善的角度，能夠引生我們大乘的信心。諸位很多人都受過菩薩戒，當然你也應該知道得菩薩戒戒體的因素，就是你要發菩提心。發菩提心的主要因素，就是成就大乘種性，也就是說你內心能夠從妄想中解脫出來，看到的所謂的何期自性本自清淨，你看到的這個本來面目以後，你再發這個菩提心，所謂眾生無邊誓願度、煩惱無盡誓願斷、法門無量誓願學、佛道無上誓願成，你才能夠發菩提心。

如果我們內心中，還是活在一種以自我意識、這種個人有所得的妄想中，你說斷煩惱、修法門、度眾生、成佛道，你會覺得這四件事跟你的距離非常遙遠，有很大段距離。但是如果你能夠把心帶回家，從這些如夢如幻的、有所得的妄想跳脫出來以後，你再去思惟這件事，斷如夢如幻的煩惱、修如夢如幻的法門、度化如夢如幻的眾生，這是因地，成就如夢如幻的萬德莊嚴，你會發覺這件事情，不是我們以前所想的那麼困難，就是你大乘的信心增長了。這樣你就能夠真實的從內心的深處發起你的菩提心，這就是你的信心增長，你對於成佛之道充滿了信心，你覺得每一個眾生總有一天可以成就萬德莊嚴的佛果，這件事情做得到，只要我們肯努力的話。這樣你就能夠在大乘的功德中，成就不退轉。

這個就是我們講真如三昧的因相跟果相的修學。當然這是一個非常幸運的眾生，他一修學時就非常的順利，這部車子就直接開到了寶所；但是有些人就沒那麼幸運，這當中有些障礙。我們看第二段，這個失敗的原因：

/VERSE/唯除疑惑、不信、誹謗、重罪業障、我慢、懈怠，如是等人，所不能入。

同樣的人，在接受所謂的真如三昧這樣的清淨教授以後，他如實的修學，他不能成功，這當中提出了六個因素產生障礙：

一、疑惑：真如三昧它觀修的重點是真如，而對真如理產生猶豫不決，這種人多數來說就是世智辯聰。就是說我們在觀修業果，或者觀修小乘的空性，基本上都是一個思議境，能夠用我們平常的名言、概念去推論；但是真如三昧這種意境，非空非有、即空即有的意境，不住有為、不住無為，以無住為住這樣的一個意境，是一種不思議境。不思議境你要用思想去推論，你就越離越遠，當然就產生疑惑了。所以這裡疑惑的因素就在這裡，就是你還是用你的老毛病，你依止妄想在活動，當然這樣就是心外求法，跟真如的距離就愈來愈遠。

二、不信：前面的疑惑，多少還是半信半疑。這個不信法藏大師說：這根本就是外道的闡提種性。就是他根本沒有大乘善根，你跟他講這件事情，跟沒有講是完全一樣的，完全不相信這個情況。

三、誹謗：誹謗比不信更嚴重，誹謗就是造罪業了，就是他個人已經有邪見。不信頂多是愚癡；而這個誹謗，他已經從自己的生命經驗中，創造一個生命的思考，這時他就誹謗真如三昧的功德，誹謗真如沒有真實的利益，不能帶領我們離苦得樂，這是誹謗大乘正法。

四、重罪業障：就是這個人，他以前（可能是今生，也可能是前生）曾經有這種五逆，乃至四重的這種重大罪業。一個有罪業的人，他內心就是躁動不安。不過這裡的罪業，特別指的是還沒有懺悔的罪業，就是你這個罪業，沒有真實的懺悔、沒有真實的斷相續心，所以罪業會繼續的活動，一直在干擾你。當你要把心帶回家時，它就障礙你。

五、我慢：就是高傲輕慢，對於師長、對於我們所教授的大乘正法產生高慢。一個人高慢心，我慢山高，法水不入，我們就很難得到一些佛法的教授。

六、懈怠：就是我們聽聞這個真如三昧的傳承以後，我們沒有經常數數的修學，我們內心中還是隨順妄想而轉。

真如三昧，是如是等人，所不能入。前面有六個因素，只要具足其中一個因素，就對真如三昧產生遮障。這六種的障礙，一般佛弟子最容易犯的大概是第一跟第六。因為這個二、三、四、五，我們不是很嚴重過失的人不容易犯。第一、第六我再說明一下：

疑惑的意思，就是說他不是完全不相信，他是猶豫不決、半信半疑。就是說因為我們生命無始劫來，有很多次很多次的生命，每一個生命我們的生活方式都是心隨妄轉，我們很習慣跟無明妄想在一起，我們很習慣去依止有所得的個人的慾望，去思考這一切的生命的現象。那你現在要我們遠離妄想這個非常熟悉的老朋友，的確是有困難。之所以有困難，這一個關鍵點就是──這個人他只有聞慧沒有思慧。就是你只有在課堂上時聽到真如三昧這個名相，但是你下去以後，你沒有根據這樣的一個法門去操作，你沒有真實的把心帶回家；所以要你遠離妄想，你就害怕。你說：我以前都是跟妄想在一起，你要我遠離妄想，那我怎麼辦呢？我云何應住、云何降伏其心？我都是跟妄想在一起，我的生命才能夠相續下去的；你從來就沒有跟真如相應過，你就不敢遠離妄想。

這個問題就是在這裡，就是你沒有真實的去操作真如三昧，你連一次都沒有，當然會對真如的功能產生疑惑。蕅益大師開示說：這個真如法門，跟一切法門有所不同。就是說你只要有一次的相應，這個信心生起，一信以後永不再疑惑，因為它是真實性，它是你的本來相貌，這跟其他法門不一樣。就是說你有五分鐘的相應以後，那你內心中對大乘真如的功德歸依，是其心安如海，不動如須彌，所有的這些障礙都不是障礙。那問題就是你完全沒有相應過，那你就有問題，疑惑就是你沒有思慧。

第二個懈怠：就是說我也相信真如是我生命的大安樂處，我也相信無明妄想是一個盜賊，帶給我痛苦，但是我就是懈怠。要我遠離妄想也是好、安住真如也是好，但是我就是沒有去做，一天過一天，悠悠泛泛。這個怎麼辦呢？

蕅益大師在《靈峰宗論》上說：對治懈怠的方法，你就是深觀這個生死輪迴的痛苦。觀察我們此生，生從何來，死將何去？

就是說我們過去無始劫來依止無明妄想，當然無明妄想它是一種有所得的慾望，有所得的慾望就很容易造罪業，非常容易。只要有境界稍微刺激你，你那個殺、盜、淫、妄的罪業就會出現了，這個罪業就帶你到刀山油鍋受痛苦的果報。當然一個有善根的人，有痛苦他就生慚愧心，從三惡道出來時就開始布施、持戒、忍辱，積集善業。這個善業，招感了這一期的安樂果報，做一個甜美的美夢。但是這一個人在安樂的環境，又容易產生放逸，安樂的環境最容易放逸。一放逸以後，這煩惱就開始活動，開始造業。造業以後，就到三惡道去了。就是我們過去無明妄想在活動時，就是到三惡道去、到人天道，到人天道、到三惡道去，這個歷史不斷不斷的重複。

簡單說：為什麼無法解脫呢？就是不曾離開過妄想！

不管你到三惡道去、不管你到人天果報，都是無明妄想。這個就是為什麼我們無始劫來到現在，還在這裡流轉的因素，就是我們沒有離開妄想，沒有真實的把心帶回家。

也就是說雖然我們今天遠離妄想、安住真如，這當中有很多的痛苦，我們剛開始也很不自在，但是我們應該思惟：我們過去的痛苦，在三惡道所受的痛苦，是現在修習真如三昧的百千萬倍。而過去的痛苦，受完以後完全沒有增上的力量，白白的受苦；而我們修真如三昧，雖然在過程中有一些痛苦，但是能夠究竟離苦，而究竟得到圓滿快樂的力量。這樣想，所以這件事情值得做，這樣思考就能夠破除懈怠。這個就是我們在修習真如三昧，必須要遠離的六種障礙。這裡是說明成功跟失敗的因素。

/KEPAN/丑二、明證相

前面是一個因地的修學；這裡是說明真如果地的相貌。就是說怎麼知道修這個真如三昧成功了呢？它的判定標準是什麼？

/VERSE/復次，依如是三昧故，則知法界一相。謂一切諸佛法身，與眾生身，平等無二，即名一行三昧。當知真如是三昧根本。若人修行，漸漸能生無量三昧。

如果我們今天能夠根據馬鳴菩薩真如三昧的修學，止息一切的虛妄相，把心帶回家，這樣你內心中會出現一個相貌，就是你能夠如實的了知法界一相，這是你修真如三昧的功能出現的判定標準。

什麼是法界一相呢？謂一切諸佛法身，與眾生身，平等不二，即名一行三昧。我們過去的思考是一種對立的思考──善惡的對立、空有的對立，當然這樣的思考從對治的角度也是有需要，但是這不是我們大乘的根本法門。大乘的根本是一個平等法門，就是說雖然諸佛的功德莊嚴是由種種的妙用，眾生有種種的惑業苦，但是這些都是因緣所生法，從他的本性觀察，這個眾生跟諸佛，他是平等不二的，這個就是平等的法門、不二法門，這個平等法門又叫做一行三昧。

蕅益大師註解說：這個法界一相，是約著他所證的功德來說；一行三昧是約著他能證的這個心識，他能證的心識就一行三昧，這一行就直接了當正直捨方便，但修無上道，直接的趣入真如，叫做一行三昧。一行三昧是因地的修學，法界一相是果地的功德。這樣的法界一相生起時，你就有能力發菩提心。

前面也說過，這個菩提心不是嘴巴講一講：眾生無邊誓願度、煩惱無盡誓願斷、法門無量誓願學、佛道無上誓願成；而是你能夠真實的體驗到諸佛法身，與眾生身，平等無二，產生一個堅定的信解力，而發起你要斷惡、修善、度眾生的意樂，這樣才講所謂的信成就發心，這就是我們修真如三昧的一個判定標準，你法界一相的功德是不是生起。

接著，讚歎真如三昧的一個力量。當知真如是三昧根本。若人修行，漸漸能生無量三昧。真如三昧的一個特點，它是一切的有為三昧的根本，一切有相三昧都是以真如三昧為根本。如果你能夠修持真如三昧，你要修習這些方便，你就很容易生起其他有為的三昧，包括念佛三昧、或者師子奮迅三昧，這些三昧都可以從平等不二的清淨心生起。

這裡我們解釋一下真如三昧：

蕅益大師說：它就是《楞嚴經》說的首楞嚴王三昧，也是《法華經》所說的一實相三昧。這個三昧的內涵，簡單的說就是修無住法門，不住於外在的境界，也不住於內心的妄想，以無住為住，內心中是一種空空蕩蕩了了分明、了了分明空空蕩蕩的一個無住的境界出現。這個境界是我們整個大乘佛法一切修行的出發點。

譬如禪宗有一個趙州禪師，說是「趙州八十猶行腳，只為心頭未悄然」。他內心真實跟虛妄的相貌如何抉擇，還不清楚，所以他只好繼續參訪善知識，他不敢閉關修行，他必須把根本找到。他八十幾歲的人跟年輕人在一起這樣參學，有一天參訪一個大善知識，這善知識就點他一句話說：你這個趙州禪師，老老大大，云何尚無住處？就是你年紀大了，跟這些年輕的比丘在那邊參學，你怎麼還沒有一個住處？當然這個住處不是說色身，色身要找一個住處很容易的，但是你的內心怎麼還沒有找到一個真實的歸依處呢？這時趙州禪師就起大慚愧心，開始迴光返照，後來就開悟了。開悟以後他說：「踏破鐵鞋無覓處，得來全不費功夫」。我走盡了大江南北，請善知識開示，原來所謂真實的歸依處，是在我一念心中，莫向外求，得來全不費功夫。

當你找到一個生命的歸依處，你就有資格可以修行，所有的斷惡、修善、度眾生都是你的方便。密宗也是這樣，密宗它的三密加持，身體的禮拜、或者是結手印，口業的持咒，意業的觀想本尊，這個三密的加持，基本上也是依止你的真如清淨心。密宗裡面警告：你在修三密加持時，你依止妄想，你這個因地是虛妄，你可能會出差錯，到最後你會心外求法，可能就會走火入魔，因為你根本的依止處是妄想。這個三密加持是一個很大的加持力，到最後卻加持在妄想上，那你就有問題了。

所以說我們修行一切法門都非常好，但是你必須把根本找到，說是當知真如是三昧根本，若人修行，漸漸能生無量三昧，就是這個意思。`;
