QXL.volNum = 32;
QXL.text = `
請大家打開《講義》第七十頁。

/KEPAN/丑三、辨魔事
/KEPAN/寅一、示魔事相
/KEPAN/卯一、明致魔之由

前面我們講到真如三昧因地的修學跟它果地的功德；這裡是說明我們在修真如三昧的過程，有可能會出現一些魔障的事由。也就是說我們剛開始的起跑點，我們依止的是一個無明妄想，現在我們要扭轉一個力量，就是把這個妄想的力量，轉成不生不滅的真如，在這樣真妄的交攻之下，有可能會產生魔障，我們應該如何來判斷它，乃至如何消滅它？這當中分成兩科：第一個先解釋魔障的相貌，第二段再解釋對治的方法。魔障的相貌中分成兩科：卯一先說明致魔之由，生起魔障的因緣。

/VERSE/或有眾生，無善根力，則諸魔外道鬼神之所惑亂。

這裡我們先解釋魔障的相貌。我們在修真如三昧時，魔障的因素主要有兩個：

一、是諸魔外道：這裡法藏大師說：這就是天魔，六欲天的天魔。天魔為什是外道呢？因為這個天魔擾亂人心，令入邪道，故名外道。就是說你在修真如三昧時，他干擾你，讓你生起邪見顛倒，誤入到外道種性。所以他有引導你從一個向內安住的因緣，轉成向外攀緣的因素，所以他是外道，因為他有引導你趨向外道的力量。

二、是我們一般說的鬼神，或者是山神、樹神等等的擾亂。我們一般修習真如三昧，如果你沒有到未到地定之前，天魔他是不會干擾你，所以我們一般的干擾都是鬼神。鬼神干擾你，主要有兩個因素：第一個就是我們說的冤親債主，你過去生跟他結下重大的惡緣，他剛好在鬼神道，這時他就來報復障礙你。第二個，他跟你也沒有惡緣，但是這個鬼神他有勝負心，他找你來挑戰，故意來誘惑你、干擾你，破壞你的正念，這是第二種因素。

總之，就是我們在修習真如三昧時，有可能會有鬼神或者天魔的擾亂。為什麼有這個擾亂呢？簡單的說就是我們沒有善根力。這裡就是說，有些人修真如三昧、或者念佛三昧，他沒有什麼障礙，有些人就有很多障礙，這跟一個人打妄想有關係。你一個人的種性，你這一念心跟境界接觸時，你很容易打很多很多的妄想，你這個人就容易被鬼神所干擾。怎麼說呢？這個鬼神要干擾你，他一定找一些比較容易下手的，就是說你這個人的隙縫太多，你這個空隙太多你這個妄想打得很重，他就容易下手幹擾你。

當然這個東西是感應道交，不是單方面的，他要干擾你，你得要接受，雙方面才會相應。有些人你找他也沒用，他根本就不甩你，這個鬼神就不會找你。所以我們今天會著魔，雙方都要負一半責任。對方干擾你，他錯一半；你隨順他的這個境界去攀緣，你也要負一半責任，就是你自己沒有善根力，簡單的說就是你自己沒有免疫功能。這裡我們說明主要致魔的因素，就是我們這種妄想太重，攀緣心太重。

/KEPAN/卯二、明魔事之相
/KEPAN/辰一、辨形聲

魔障的相貌，這當中有二科：先說明他的形聲，再說明他的過失。先說明他的出現是用什麼形狀跟音聲，這當中有二段：先講到他所現的是一種世俗相，再說明他所現是尊貴相。看世俗相：

/VERSE/若於坐中，現形恐怖，或現端正男女等相。當念唯心，境界則滅，終不為惱。

我們在靜坐修真如三昧時，本來是把心帶回家。在回家的過程中，突然間看到恐怖的相狀，就是說這個鬼神也好、天魔也好，他來干擾你，他不是以他的本來面目，他現出一些非常恐怖的相狀，這種人多數來說，古德的註解上說：這種人本身就是有恐怖的習氣，這個鬼神有神通，他知道你有恐怖的習氣，就用恐怖來恐怖你，這是第一個因素。

第二個，或現端正男女等相，有些人他本身貪愛的習氣特別重，這個鬼神、或者天魔，他就現出端正的男相女相來誘惑你。應該怎麼辦呢？當念唯心，境界則滅，終不為惱。就是說我們在修真如三昧時，慢慢的把心帶回家，這時你這個境界出現，你繼續起觀（觀照力），再從真如三昧出來、再起觀，觀照這一切的恐怖相、或者是可愛的相貌，其實都是唯心所現，都是如夢如幻，它沒有真實的體性，你內心中不隨妄轉。

前面也說過，別人要干擾你，這方面是要互相的感應，一個碗是敲不響的，所以你內心中不隨妄轉，這個境界就自動消失掉了。這裡在古德的註解上說：我們修習這個內在的觀照是根本法門，但是我們也可以修一些方便法門，就是歸依三寶、憶念三寶、念佛、持咒，祈求三寶的救護，這樣也可以過關。總之，你內心中，就是不能隨順妄想而轉，要把心收攝回來。再看第二段。前面是現出世俗的相貌，或者是恐怖相、或者是可愛相；這以下是現出尊貴的相貌。

/VERSE/或現天像、菩薩像、亦作如來像，相好具足；或說陀羅尼，或說布施、持戒、忍辱、精進、禪定、智慧；或說平等，空、無相、無願；無怨無親，無因無果，畢竟空寂，是真涅槃。

這裡的尊貴相，他是現出天人的相狀，特別高大莊嚴的天人，或者現出種種的菩薩像、或者現出佛陀像。總之，他的外表看起來都是相好具足，放大光明。他現這個尊貴相，基本上都會為你說法，或者說陀羅尼的總持法門，或者說布施、持戒等等的六度法門，或者說平等的法門。什麼叫平等法門呢？空、無相、無願，一切法、人、眾生中，沒有所謂怨家、親屬的差別，也沒有所謂的因果差別，一切法是畢竟空寂、畢竟平等，這叫真涅槃。

蕅益大師說：這個鬼神跟天魔的說法，基本上都是相似之法。表面上跟佛法很類似，但是事實上是完全不同。譬如這個平等法：佛法的平等是安住在真如本性，是立足點的平等，是本性上的平等；這裡的平等，是果報上的平等，那是一個齊頭性的平等，是怨親的平等、因果的平等。佛法的平等是從本性上安立，不從因緣上安立的。所以我們修慈悲觀，佛陀告訴我們慈悲觀的所緣境，先從親屬修起，然後中庸，再怨家。你怎麼能夠說怨家、親屬都平等、因果都平等、貪瞋癡跟戒定慧也平等！這樣這個平等法就是相似之法。不過有一個地方值得我們注意，就是說鬼神來干擾你，鬼神他也不是泛泛之輩，他敢來干擾你，他多少有一點資糧，特別是福德資糧，所以他跟你說法，有時候你也很難從他的法義上判斷真偽。

這裡，我們可以根據天台智者大師的兩個判斷方式：

不論是修真如三昧也好、修念佛三昧也好，如果看到諸佛菩薩現前，你先不要說，聽他講什麼法；你先觀察你這一念心是什麼相貌，就是你的心跟佛菩薩接觸時，你迴光返照你這個明瞭的心識。就是說你見到這個佛菩薩的相狀以後，你的心變成躁動不安，這裡肯定是鬼神的干擾；假設你內心跟這個佛菩薩的形像接觸時，內心是寂靜安樂的，隨順於寂靜的，這樣的一個相狀就是真實的功德。就是說鬼神他頂多能夠現出相似於佛菩薩的形狀，但是他不能改變他的本質，他的本質就是無明妄想，所以你跟他接觸時，他所釋放的訊息是躁動相，從這裡可以看得出來。因為你想想鬼神為什麼要現給你看？他就是要破壞你的正念，所以你跟他接觸時，對你的正念是破壞性的，那肯定有問題。所以這裡是很容易判斷，你從內心的躁動跟寂靜來判斷。

第二個，在這個千鈞一髮之際，你也不知道你是躁動不安、或者是寂靜安樂，你可以用念佛、持咒來鍛煉，這個方法不錯。就是你內心中跟佛菩薩形相接觸時，你就加強念佛、或者持咒，假設這個相狀是真實的佛菩薩，你用念佛、持咒的火來斷鍛煉他時，他真金不怕火煉，他不會消失掉。如果你念佛、持咒他消失掉，那這個是一個虛妄相。這個方法不錯，你就是歸依三寶，直接用三寶的力量，祈求三寶的救護，他如果是一個真實的功德，他就不怕你鍛煉；如果他是一個虛妄相，你這個三寶力量那麼強大，你一鍛煉他，他自然是消失掉了。這個都是一個判斷的方法。

/KEPAN/辰二、辨起過

在這樣一個鬼神的干擾下，會產生什麼過失？這個過失相有三段。第一段是成就所謂相似的五種神通：

/VERSE/或令人知宿命過去之事，亦知未來之事。得他心智，辯才無礙。能令眾生，貪著世間名利之事。

這是因為魔邪的加持力，突然間成就宿命通，過去發生很多很多事情，你突然間知道了；或者是預知未來之事，這叫天眼通，明天有什麼人要來看你，你事先就知道了，果然明天這個人來了；或者你有他心通，別人打什麼妄想你都知道；或者你成就了種種的辯才。這裡所謂的相似五通，我們很難判斷是邪是正，到底是善根發相，或者是魔障的干擾？這裡是說明它的重點。就是你成就五通以後，能令眾生，貪著世間名利之事。這個非常重要。

這邪正的判斷，就是當你成就五通以後，這五通的本質讓你反而對世間的名利更加的貪求。那表示什麼？世間的名利當然是向外攀緣，那是一種無明的力量，那你內心中本來修真如三昧，結果加強無明，那就不對了，你因果不相符。你因地時是追求真如，結果它果地是出現貪著世間名利，這一定是外力的干擾。所以你得到辯才、神通以後，你對世間的名利看得更重，那你就知道這一定是過失相。這一段是說明他成就一種相似的五通，第二段是說明他成就相似的福德，世間的福德：

/VERSE/又令使人，數瞋、數喜，性無常准。或多慈愛，多睡多病，其心懈怠。或卒起精進，後便休廢。生於不信，多疑多慮。或捨本勝行，更修雜業。若著世事，種種牽纏。

這裡有二段，先說明他相似的福德因緣，再說明他的過失相。相似的福德有六段：

數瞋、數喜，性無常准。這個人本來很正常，結果他去閉關以後，有時候發脾氣、有時候歡喜，這個性情變化很不定，這裡就有問題了，這不正常。

或多慈愛，修習真如三昧以後，本來內心中是把心帶回家，是一種平常心的境界，突然間你對眾生生起了一種特別的憐憫。

多睡、多病，其心懈怠。修習真如三昧以後，整天就是懶洋洋的，非常懶惰懈怠，提不起勁。

或卒起精進，後便休廢。突然間三天三夜沒有睡覺，然後連續睡三天覺；突然間精進，突然間休廢。

生於不信，多疑多慮。你修真如三昧以後，反而對大乘佛法產生不信，很多的疑惑、很多的憂慮。

或捨本勝行，更修雜業。你修真如三昧是一個成佛之道，成就萬德莊嚴的究竟離苦得樂，你這個人本來在佛堂打坐的好好，突然間跑去種菜了，更修雜業，修這世俗的雜業。

總之，前面的六段它引生過失：若著世事，種種牽纏。就是你本來應該是把心帶回家，結果你對世俗之事又產生更多的牽纏、更多的罣礙、更多的疑惑，那就是有障礙了。

蕅益大師說：有些人鬼神是他用神通來誘惑你；有些人他是用世間的福德來誘惑你，下一段是用禪定來誘惑你。就是說鬼神來障礙你，他基本上的原則就是順其習氣，令生愛著。就是你內心深處是愛著這個東西，而你沒有加以對治，這時鬼神就哦，你喜歡神通，他就給你神通；你喜歡世間的福報，他就給你相似的世間福報，讓你產生障礙，讓你的心回不了家。因為你本身有這樣的習性，他就順著這個習性來誘惑你。第三段是成就外道的邪定，一種相似的禪定：

/VERSE/亦能使人，得諸三昧，少分相似。皆是外道所得，非真三昧。或復令人，若一日、若二日、若三日乃至七日，住於定中。得自然香美飲食，身心適悅，不飢不渴，使人愛著。或令人食無分齊，乍多乍少，顏色變異。

這當中有三小段，先看第一段得諸三昧，這個三昧它只是少分相似。一般三昧的現前，基本上內心的相貌是明瞭寂靜的；如果你今天的禪定現前，是非常的昏昧、遲鈍，雖然寂靜但是不明瞭，這裡就是一種邪定。一般來說，閉關修行最怕的就是昏沉，還不怕你打妄想，因為你打妄想，你的明瞭性還在，你還能夠對治。就是說我們觀察一個修行人，不要讓他進入昏沉，因為你一昏沉以後，那是一個癡心所相應，很容易落入外道種性，很容易從昏昧中生起邪見，所以這個少分相似，就是昏昧遲鈍的相貌。

或復令人，若一日……至七日，住在定中，在定中你依稀彷彿能夠吃到這些自然香美飲食在定中你依稀彷彿能夠吃到這些自然香美飲食，內心中非常的歡喜，而且色身也不飢不渴，使令我們產生愛著，這裡也是一個問題。

或令人食無分齊，吃東西沒有限度，有時候多、有時候少，而且氣色特別的莊嚴美妙，這些都是一種相似禪定。

這裡我們說明一下：我們在修真如三昧時，鬼神之所以干擾你，基本上不管他給你什麼東西、給你什麼樣的相貌，他只有一個目標，就是破壞你的正念，要破壞你的正念，就一定要先誘惑你。所以古人說：上天要毀滅一個人，他必先以微福誘之，以微小的福報來誘惑你；當然上天是不會毀滅你。我們也可以說這個鬼神要破壞你，他一定是以一些微少的福報、相似的福報來誘惑你。你喜歡神通，他就讓你成就神通；你喜歡福德，他就給你福德；你喜歡禪定，他就給你相似禪定：他什麼都可以給你。但是，他要你一個東西，你要把你的正念給他，他要破壞你那個正念，真如三昧的那個正念，他就是要你離開那個正念三昧，簡單的講就是這個原則。

這裡就是說，在這個真如三昧的過程中，就是考驗我們一個人的因地發心。這個魔境的出現有兩個因素：

首先是：一時的忘失正念。我們突然間打妄想，那鬼神乘隙而入；這種一時的失念，我們只要在真如三昧中起觀，觀察它如夢如幻，或者我們修歸依，歸依三寶，他就破除了，這個問題不多。如果只是一時的失念，而招感鬼神的障礙，我們歸依三寶、或者提起正念都可以。

最怕的就是第二種，就是：你因地不真。你在真實用功之前，你根本不知道你用功的目標在哪裡，你為什麼要去作這個拜佛、持咒、修止觀的加行？你的目標在哪裡？你根本不知道。你不知道，你只是知道一種含糊籠統的離苦得樂。離苦得樂的內涵很多，神通也是離苦得樂、禪定也是離苦得樂、這種福德也是離苦得樂，你沒有真實一心一意的希求無上菩提，這時鬼神就用一些小小的糖果來誘惑你，使令你失去了廣大無上菩提的功德，這是你的因地不真。所以為什麼我們今天信成就以後要發菩提心？就是你有沒有依止你的菩提本願，來當作你修行的引導。

/KEPAN/寅二、示對治法
/KEPAN/卯一、治邪

前面是說明鬼神的相貌跟過失，這以下說明他的對治方法。先看治邪，再說明皈正。

/VERSE/以是義故，行者常應智慧觀察。勿令此心，墮於邪網。當勤正念，不取不著，則能遠離是諸業障。

這種鬼神障礙的因素，我們應該要經常智慧觀察。我們也說過，這個對治鬼神的方法，從內在的善根來說，我們生起觀照。怎麼觀照呢？勿令此心，墮於邪網。當勤正念，不取不著。就是你自己應該要避免──剛開始你看到境界，不要馬上就產生歡喜，不要墮入這種邪見之網；你應該起觀，觀察這一切的境界，不管是好的境界、不好的境界，都是唯心所現，如夢如幻。如果你覺得起觀有困難，你就直接歸依三寶、念佛、持咒，這樣就能夠遠離是諸業障。

為什麼起觀，或者歸依三寶就能夠遠離諸業障呢？我們修行時，一定要有一個基本觀念：邪不勝正。邪惡是黑暗，正是光明，光明能夠破除黑暗，不是黑暗能夠破除光明。那為什麼邪不勝正，還有些人會著魔呢？因為他內心沒有正氣，他沒有一直正念。就是說這個房間為什麼有黑暗呢？因為你根本沒有點起光明，所以只要你肯做一點點小小的努力，這個邪就消失掉，就怕你自己起顛倒，那就沒辦法了。所以說只要我們能夠當勤正念，不取不著，這些障礙根本就不是障礙，他自然能夠遠離，因為邪不勝正。以下就把這個外道的三昧作一個總結：

/VERSE/應知外道所有三昧，皆不離見愛我慢之心，貪著世間名利恭敬故。

這個天魔外道所產生的三昧、這種邪定，從內心的相貌來說，皆不離見愛我慢煩惱，就是愛見的煩惱，簡單的說就是一種有所得的攀緣心，所以這是一個非常重要的判定標準。就是說當你用功以後，你的我見愈高，對世俗的貪念愈深，那保證你這個方法是錯誤的，你已經沒有走在道上了。這是一個很容易判斷的標準。從外在的形狀來說，貪著世間名利恭敬，這裡也是一種向外攀緣的相貌。就是說，本來我們修真如三昧是深伏煩惱，增長大乘的信心；結果你卻增長我愛、我見，貪著世間名利，那你這個方向就錯誤了。這個錯誤也可能是我們自己的方法操作錯誤，也可能是有外力干擾，你自己要作一些調整與檢討。

/KEPAN/卯二、皈正

/VERSE/真如三昧者，不住見相，不住得相；乃至出定，亦無懈慢。所有煩惱漸漸微薄。

這裡是說，怎麼知道我們是正確的走在路上了呢？第一個不住見相，第二個不住得相。從一個修學次第，我們剛開始先不住得相，就是我們對於所緣的境界相，觀察它是唯心所現，如夢如幻，遠離外在的境界，這是不住得相。不住見相，就是我們能念的這一念心，內心的妄想也是念念不生、念念不滅，遠離外在的境界，遠離內心的妄想。

當你內心中感覺到你這一念心跟境界接觸時，慢慢能夠見相、離相，當然真如三昧不是說都沒有境界相，那你這個人就沒有明瞭性。就是說這個境界對你來說，它不能誘惑你、不能干擾你，乃至於你內心中的妄想對你的干擾也是慢慢淡薄，這就對了。在定中如是，乃至出定以後，你的內心中沒有懈怠、高慢之心，所有的煩惱就漸漸的輕薄了。

我們說過：你從三昧出來以後，你再來觀世間，正如《楞嚴經》所說：卻來觀世間，猶如夢中事。你內心中就是淡薄很多了，這裡是一個非常重要的判定標準。古德經常說：這個修行，這個人修行上路了，有些人修行還沒有上路。這是一個非常重要的關鍵。就是說你這個人從這裡要到台北去，怎麼開了半天還沒有上高速公路，還在這個市區打轉？那這就糟糕了。就是說你還搞不清楚這個修行的路頭，你不知道該怎麼辦，這樣的話就是一個非常麻煩的事情。就是說你這個人上路了，上了高速公路了，當然有時候你懈怠、有時候精進，但是你上路以後，你遲早要到台北的。這個真如三昧也是這樣的，從妄想要到真如三昧的過程很困難，但是你一上去以後，外在的境界不能干擾你，內心的妄想也不能干擾你，諸天魔鬼神都不能干擾你。

當無住法門生起時力量很大的！

金剛三昧，或者叫首楞嚴王三昧，這個首楞嚴王就是畢竟堅固，不可破壞。所以說，這個三昧剛開始修時，你要花很多時間去建立大乘的正見，依止正見去隨順觀察，這樣花很多的時間。但是你一上路以後，這個成佛之道是遲早的問題，你要精進就早一點，你要懈怠就要慢一點；但最怕就是你還沒有上路。那這裡就是你要趕快用功，趕快找到這個路上去。

這裡是說一個人修行路上的相貌，就是他的判斷相貌，他的內心世界不住見相，不住得相，內心應無所住。他出定以後，身心調柔而謙卑，所有的貪、瞋、癡煩惱都慢慢淡薄了，就是一個人修行上路了。

/KEPAN/丑四、勸修習
/KEPAN/寅一、正勸

這裡把真如三昧作一個總結，先看正勸：

/VERSE/若諸凡夫，不習此三昧法，得入如來種性，無有是處。以修世間諸禪三昧，多起味著，依於我見，係屬三界，與外道共。若離善知識所護，則起外道見故。

身為一個生死凡夫，假設我們不修習真如三昧之法，想要成就大乘的如來種性，這是無有是處的；這裡跟《楞嚴經》的說法是完全一樣的。《楞嚴經》說首楞嚴王三昧它的情況是：十方薄伽梵，一路涅槃門，十方諸佛都是依止首楞嚴王三昧而成就大般涅槃。就是說我們不能夠隨順真如三昧來遠離妄想而趨向真如，你要成就大乘種性、你要發菩提心成就大乘功德是沒有辦法的。因為你還沒有離開無明妄想，你的本質是無明妄想，你所修的資糧是依止妄想所生的資糧，那這裡當然就跟成佛不同。

以修世間諸禪三昧，多起味著，依於我見，係屬三界，與外道共。我們不修真如三昧，當然就是依止無明妄想，即使你在無明妄想中產生很多的禪定，產生很多很多的身心三昧樂；但是內心中有所得的心都還存在，所以這個高慢心就容易生起，所以他就沒辦法出離三界，跟外道是相共的。跟外道相共，假設遠離這種善知識的開導攝受，就很容易生起邪見顛倒。

臨濟宗有一個禪師叫做黃檗禪師，這個黃檗禪師他有一天在行腳時，遇到一個修苦行的比丘，這個修苦行的比丘，他希望能夠跟黃檗禪師一起去參學，黃檗禪師也同意。後來參學時要經過一個河，這個黃檗禪師就在這個河邊等這個船過去。等這個船過去，這個修苦行的比丘他等的時間很久，他就有點不耐煩，他就用神通就從水上走過去。

黃檗禪師他慢慢坐船過去以後，再告訴這個行腳的比丘說：饒你步步神通，佛法還是在老僧這一邊。說你這個東西不是佛法，是共外道法。當然我們也讚歎這種種的三昧神通的資糧力，但是這個根本是個問題，你根本是依止無明妄想，那跟依止真如那力量不同。講一句實際的話就是說：流轉的因緣是從十二因緣發動的，無明緣行，無明產生業力，由業產生果報，由這個果報產生流轉，產生老病死的痛苦。你這個步步神通，沒有破壞無明的力量，我今天不能從水上走過去，但是我內心中的真如三昧能夠破除無明，我總有一天也可以成就神通，總有一天！但得本，不愁末。

我以前看到一個修行人的日記上說：有一個喇嘛尊者他在山洞修行，他本來依止他師父修學，後來他跟另外一個修行法師修學。後來他師父說：你怎麼這幾天都沒來跟我請法修學？他說：我現在跟另外一個法師修學，修得不錯。他說：他怎麼不錯呢？他說：這個法師嘴巴能夠把這個火吐出來，嘴巴能夠吐火！他師父他說：那你要問問他：他這個吐火的力量，這種功德他修多久？他說：他修了十年，就可以把火吐出來。他師父說："我只要用一根火柴，就可以把火點出來；他要修十年，你修這個幹什麼呢？"

就是說我們在成就解脫時，我們一定要知道我們今天是幹什麼修學？就是解脫十二因緣。當然有些人從枝末上解脫，從愛取上的調伏，或者從業力的消滅，但是根本上就是無明，有所得的心。這裡就是說：我們一再強調：你今天的成佛之道，你在走之前，你要想想看，你到底要什麼？你追求的是什麼？這是你的目標，非常重要。

/KEPAN/寅二、明益

/VERSE/復次，精勤專心修學此三昧者，現世當得十種利益。云何為十？

這以下講出有十種的利益，讚歎真如三昧。當然真如三昧在未來的生命中是成佛的，但是你今生就有十種利益。

/VERSE/一者、常為十方諸佛、菩薩之所護念。

/VERSE/二者、不為諸魔惡鬼所能恐怖。

/VERSE/三者、不為九十五種外道鬼神之所惑亂。

/VERSE/四者、遠離誹謗甚深之法，重罪業障，漸漸微薄。

/VERSE/五者、滅一切疑，諸惡覺觀。

/VERSE/六者、於如來境界，信得增長。

/VERSE/七者、遠離憂悔，於生死中勇猛不怯。

/VERSE/八者、其心柔和，捨於憍慢，不為他人所惱。

/VERSE/九者、雖未得定，於一切時、一切境界處，則能減損煩惱，不樂世間。

/VERSE/十者、若得三昧，不為外緣一切音聲之所驚動。

這裡，法藏大師把他分成三段：

一、是善友的攝受：善友的攝受這是一個總相的功德。我們修真如三昧，得到十方諸佛菩薩之護念，一者十方佛愍念常守護，這個護念講一句白話就是加持。為什麼呢？蕅益大師解釋說：因為真如是諸佛菩薩的平等法身，你今天能夠依止平等法身，當然得到諸佛菩薩的加持。這個加持跟感應，我們說過一定要心心相應。十方諸佛依止真如，你依止妄想，他要加持你有困難。所以在淨土宗時，我們要知道淨土宗雖然強調他力的法門，所謂的佛力加被，但是他要求你臨終時，心不貪念、意不顛倒，正念分明，你內心中要安住在無所得的真如。你臨終時依止妄想到處攀緣，佛菩薩要感應有困難，不是他要不要，這是因緣不具足。所以這裡呢，十方諸佛要加持我們，我們必須要有這樣一個心心相應的隨順。第一個是善友的攝受。

二、三、四、五是離諸障礙：約著破惡來說。

二者、不為諸天惡鬼之所恐怖。蕅益大師說：你觀念念觀無生，來調伏貪愛，所以外魔所不能恐怖。一個人會有恐怖心，表示你心中有貪愛；如果你能夠以無住法門來調伏貪愛，你內心中就無所畏懼。

三者、不為九十五種外道鬼神之所惑亂。前面是貪愛，這是邪見。蕅益大師說：因為你觀察念念無生，調伏邪見，所以外道之法不能誘惑你。

四者、遠離誹謗甚深之法，重罪業障，漸漸輕薄。蕅祖說：因為你深觀法性本自空寂，所以業障之消如湯消冰。這個業障依止妄想而生，你這個妄想慢慢輕薄，業障也就輕薄。我們過去在消業障是依止慚愧心，斷相續心；但這裡的消業障是從根本，從根本的妄想無明下手。所以蕅益大師在《楞嚴經文句》上說：這個首楞嚴王三昧，或者真如三昧的消業障，是滅業障如翻大地，從根本上的破除業障。

五者、滅一切疑，諸惡覺觀。因修真如三昧，對於大乘一切功德的疑惑，自然就會慢慢的輕薄，破除疑惑。這個是能夠破除外道鬼神的干擾跟恐怖，也破除我們內在的煩惱跟罪業，這個是離諸障礙。

六、七、八、九、十是妙行堅固，生起善根善法：

六者、於諸如來境界，信得增長。修真如三昧，能了知如來功德不離一心故，信心增長，這大乘的功德，你相信這個功德是存在的，你也相信你可以成就。

七者、遠離憂悔，於生死中勇猛不怯。修真如三昧，能了知一切法，本自寂滅，所以不生憂悔，勇猛精進，不生怯弱。所以你修真如三昧，妄想淡薄，你對於這樣一個修行的勇猛心會生起。

八者、其心柔和，捨於憍慢，不為他人所惱。修真如三昧，別人就很難干擾你，因為你內心調柔，就不會因外境而痛苦。

九者、雖未得定，於一切時、一切境界，則能減損煩惱，不樂世間。這是與世間定不同的地方，煩惱輕薄、不樂世間。

十者、若得三昧，不為一切外緣一切音聲之所驚動。修行真如三昧，對你所有其他的功德，不管是布施、持戒、忍辱、所有的功德，你都能夠變得更為堅固，有真如三昧的加持更為堅固。

這裡我們說明一下：

這個真如三昧，它這裡的三昧是止，止一切的妄想，以無住為住。當然這個無住為住它是正修，下一科講到觀，就是我們在修止時，有時候要起觀，有時候起有相觀、起無相觀加以對治。但是這裡我們說明一下。前面的觀察一心、二門、三大，那是直接趣入真如，那是即空、即假、即中，那是非常圓頓的思考；那這裡的真如，這個修習止觀門，它是把這個止跟觀分開，先修無住，然後再修生心。生心就是起觀，下一科會說明。但是這個無住是一切的功德的根本，就是我們講的安住大乘種性，這是一個重點。

好，那我們今天講到這裡。這以下我們回答幾個問題

【學員提問】請問真如三昧的修法是否什麼都不要想，包括拜佛、止觀當下，這種修法往生以後，是否生到無想天去？

【師父答疑】這裡的真如三昧跟無想是不同的。

我們也說過：真如三昧是先觀後止，他是起觀，觀外境是唯心所現、如夢如幻，再觀內在的妄想是念念不生、念念不滅，它的本性是畢竟空寂，然後慢慢慢慢的向內慢慢慢慢的安住，他的心是向內。這個無想定它是向外，它的無想定是沒有觀，以無想為想，就是說他心是有所住，他是住在無想，他是以無想為住，這無想就是一種妄想，他還是有妄想，也就是說它對無明沒有對治力，無想定它是以無想為所緣境，這裡有所不同。

真如三昧的一個問題，我們也說過：這個真如三昧你完全無住，是嚴重的違背我們的人性，嚴重的違背！我們的心一定要動，所以後面馬鳴菩薩慈悲，我們在修真如三昧時，不妨兼修念佛三昧。就是說無住，那當然是最高境界，無相三昧的無住法門，就像禪宗說的相續也太難。你要一二秒鐘十秒鐘的相續不難，但是你要長時間的相續無相三昧很難；那找一個相狀讓你住，就修一相三昧，專修念佛也是不錯，先從一相三昧修起。

這裡我們可以這樣講：我們所修的功德，以前的功德都是一些小小的珍寶；真如三昧是魔尼寶珠，一切寶中之王，你乃至於只有幾秒鐘的相應，如果你能夠有這樣的相應，你再出來以後，你對整個生命的看法會完全不同，它的扭轉是從根本上的扭轉，它對你產生的滅惡生善的力量是不可思議，即使是少分的相應，所以這裡值得我們注意，因為它是根本功德。當然你要是不想成佛便罷，你要成佛，這條路你一定要走的。遠離無明妄想，以無住為住，這是下一個。

當然無住以後，後面講到修觀，要你生心，生起智慧的觀照，生起大悲心，那是後面的內涵。當然你連無住都沒有達到，後面的觀就沒有意義了。所謂沒有意義是說：從成佛之道來說，你就不相應。所以這裡跟無想是差太遠了。第一個，無想它沒有起觀；第二個無想是有所住，它是以無想為住，這裡不同。

【學員提問】儻欲入真如門，一定要修論中的止觀法，若具大乘正見，而修我空、法空觀，是否亦能至之，只是遲速不同？

【師父答疑】本論的無住法門，它遠離外境的執取，遠離內心的妄想，它這是一個方便。不管什麼法門都有無量方便，不是說一定要依止本論來修學。如果你有大乘正見，而修我空觀、法空觀，也能夠趣入真如。不過這裡，我們注意一下：我空觀、法空觀當然是大乘共法，但是智者大師的判教：這個我空觀、法空觀是通於大乘的三系，通、別、圓都是修我空觀、法空觀。

為什麼中觀的學者跟唯識的學者，他們沒有真實的契入真如三昧呢？就是說你這個我空觀、法空觀是向內、或者向外的差別。如果你是心外求法，離開了一念心性，另外有一個我空觀、法空觀，那這樣就落入別教、通教的思想。如果你這個我空觀、法空觀的修行，是慢慢慢慢趣向於一心三昧，你是向內的安住，所破的是內心的執取，向內的安住，這樣就對了。這裡，以向內跟向外的觀察來作一個判斷。

我們可以回憶一下：在前面觀察真如它說：是故一切諸法，從本以來，離言說相、離文字相、離心緣相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如。當然離言說相、離文字相、離心緣相，畢竟平等，無有變異，不可破壞，這個都是共通教、別教，但是不共的地方──唯是一心！

所以在《教觀綱宗》中有一個觀，就是你觀一切法空時，你那個空有沒有明瞭性，這是關鍵。如果你那個空是個理性，那這是別教；如果你那個空是安住在心性，唯是一心，那這個是圓教。

所以唯識學的真如是不受熏的。諸位知道，唯識的真如是一個法，它怎麼受熏呢？它是一個道理。圓教的真如是依止一心安立，它是一個明瞭的心性安立真如，它是向內的。所以唯識學他不同意每一個人都有真如，因為真如是心外的一個道理，你要去追求才有，所以它真如不能受熏。

大乘佛法是認為：真如它受熏，因為顛倒的因緣，它變成無明；因為覺悟的因緣，它產生萬德莊嚴。你剛剛也說的對，你要依止大乘正見，你依止一心來修習一切法門，你的出發點是依止現前一念心性，來觀察這些果報的差別，一念心性真如受熏。你用殺盜淫妄的業來熏真如，真如現出地獄刀山油鍋；你用五戒、十善的業來熏真如，真如就不思議心，不思議變現出人天果報。你用四諦、十二因緣熏真如，出現偏空涅槃；你用六波羅蜜，出現萬德莊嚴。你這樣的思考，然後用我空觀、法空觀來作一種調伏煩惱的方便，以無所得為方便，那這樣你的我空觀、法空觀肯定趣向真如。

就是你的根本思想是依止一念心性起修，那就對了──稱性起修。如果你真如的概念是離開一念心性，另外有一個真如，你必須去追求，向外追求，你最後的功德是一個權教的功德、別教的功德。我們不能夠從你所修的法門來判定你的種性，就是你對所有法門的依止點。所以《金剛經》說：一切賢聖，皆以無為法而有差別。就是你依止無為的那個真理，會影響到你未來的果證，這裡是個問題。

【學員提問】論中提起求生淨土，是為為求正信而怯弱的眾生所施設的勝異方便，這是後面會講到。為什麼法藏大師在論初的因緣分中，把修習止觀判作下品的中品；而把專念的念佛，判作下品的上品。就是念佛比止觀還高？

【師父答疑】這裡我們說明一下：這個念佛法門，套一句蕅益大師的話是：淺者見淺，深者見深，三根普被。念佛法門我們如果把它詳細的展開來，根據蕅益大師《大勢至菩薩念佛圓通章》的開示：念佛法門具足來說有三種差別：

第一個、專念他佛：這個人他不能明白萬法唯是一心的道理，他是心外求法，依止有所得的無明來修習念佛。當然有所得的念佛，他就會思考：我是業障凡夫，我是生命中一個有自性的個體；阿彌陀佛是萬德莊嚴，他也是一個個體。我們二個之間是完全沒有交集的，沒有交集但是沒關係，我是業障凡夫，我乞求彌陀的救護，這樣也非常好。但是這樣，當你在滅惡生善時，力量會比較薄弱；萬一有障緣出現時，你要滅除障礙會比較辛苦。入道多辛苦，這個叫做事持。但這樣依止信心，也可以往生，依止信願力往生，這個就是專念他佛，專念他佛以比較高的標準來看是心外求法。

第二個、專念自佛：就是我們說的真如三昧。阿彌陀佛就是我一念心性本具的，你就修真如無住法門，念念迴光返照，你跟阿彌陀佛就不二了。但是你也不念佛、也不求生淨土，蕅益大師說那這個就不是淨土法門，那是自力法門，專修專念自佛。

第三個、自他兼念：自他兼念就是說你在念佛之前，能夠很認真的學習所有的大乘經論，真實的明白：自知我是未成之佛，諸佛是已成之佛，其體無別。把阿彌陀佛的萬德莊嚴，這些如夢如幻的因緣所生法，把它無住，把它空掉，看到阿彌陀佛內心中現前一念心性；也把凡夫煩惱障、業障、報障這些無始劫以來，依止顛倒所熏習的這些煩惱罪業，這些如夢如幻的因緣所生法，也把它空掉，我們也出現了現前一念心性，結果我們發覺一如無二如。依止這個平等不二、自他不二的思考來念佛，所謂的托彼名號，顯我自性。這樣能念的心不可思議，所念的佛也不可思議，一念不可思議，百千萬句念念之間不可思議，滅惡生善，這樣叫做自他不二的念佛法門。

法藏大師他的判教，把這個專修念佛方便判作止觀之上，那他的念佛法門，應該就是自他不二。你不但修真如三昧，還有一個他力的救護。所以諸位如果知道的話，在密宗的最高的法門是本尊相應，當然它那個本尊相應不是我們說的我是業障凡夫，文殊菩薩是萬德莊嚴，以一種有所得的心去通身靠倒。密宗要求所有的修本尊相應、大圓滿、大手印的人，都要通達十年的顯教基礎，就是要讓你知道：你一念的心性跟十方諸佛是平等不二的。平等不二這是理觀，我們也不廢事修。假藉持大悲咒的因緣，開顯你自性本具的觀世音菩薩的功德。所以達賴喇嘛在作觀世音菩薩灌頂時，他作一個重要的開示：所謂的灌頂，就是讓你明白一個道理。你持大悲咒之前，你要相信你這念打妄想的心，跟觀世音菩薩的心是平等不二的。第二個你相信觀世音菩薩的功德，是你內心本具的。你只是假藉持大悲咒的因緣，來開顯你本性的功德，這樣你就成就了本尊灌頂，你有資格來修這個觀世音菩薩法門。如果你還是心外求法，就不能構成灌頂了。

所以法藏大師他把這個專修念佛判作是下品中的上品，修習止觀是下品中的中品，他這個念佛應該是依止自他不二的實相法門來念佛，就是自他不二這樣的一個平等思考來念佛。

這裡大家可以想一想，就是說這個成佛之道，有很多的差別果報。有些人會先到天上去享受人天的快樂，有些人會先到二乘的涅槃作短暫的休息，有些人會在菩薩的果位作很多很多的耽誤，有些人能夠從凡夫到成佛，他的差別就是跟你內心的正見有關係，你的種性有關係。就是說你是什麼種性，最後他就會先承受這個果報，然後再成就那個果報，再成就那個果報。所以本論它很強調生起大乘種性。這個當然要大家去想一想，這個成佛之道，你應該何去何從？你應該依止一個什麼樣的方便，對你最有利，你應該去想一想。`;
