QXL.volNum = 33;
QXL.text = `
請大家打開《講義》第七十四頁，子二、釋觀。

本論的特色，一言以蔽之就是文簡意賅、辭約理富，就是說馬鳴菩薩他是用簡短的文字，來總攝佛陀甚深廣大的大乘法義。因此本論在大乘佛法的一個地位，就正如《阿彌陀經》在淨土宗的地位一樣，就是文字簡要，義理豐富，都具足有總持的一個特色。身為總持大乘教義的本論呢，我們在學習的過程中，我們應該要掌握三個主要的重點。

一、應該先確認修學的目標。

本論在一開始時就說到：造作本論的因緣，為欲令眾生除疑捨邪執，起大乘正信，佛種不斷故。身為一個不定聚的初心菩薩，當然我們所追求的根本功德就是菩提心。在建立菩提心的過程中，我們首先要知道我們所破的是什麼，所建立的是什麼。在本論中講到在生起菩提心的一個過程中，首先要除疑捨邪執，就是我們應該要破除凡夫跟二乘的疑惑跟邪執，這二個都是會遮障我們菩提心的生起。所以剛開始應該是除疑捨邪執，這是我們所破的。所要建立的呢？是起大乘正信。就是我們應該要建立大乘佛法的正知見。這個就是在剛始一個不定種性的菩薩，我們在修學菩提心時，我們應該先知道，我們所破的跟所建立的一個修學的目標，這是我們在學習本論的第一個要掌握的重點。

二、要建立緣起的正見。

這一點就是我們應該要如實的去觀照生命的真相。觀照生命的真相，本論的主要特色，就是要我們莫向外求，就是這個觀照，你不是向外去觀照這些十法界的差別因果，而是要我們能夠去迴光返照我們的現前一念心性。在觀照的過程中，在利益分或者解釋分中就講到：我們在觀照時，可以從兩個角度來觀照：

首先就是依止這個生滅門，就是我們這一念心的差別作用來觀照，從作用上的觀照，就是我們在觀心時，第一個是看到我們這種生滅變化的心識。這樣的心識有兩個不同的緣起。第一個是以不覺為主導的，所謂的雜染的緣起，所謂的一念不覺生三細，境界為緣長六粗。就是我們隨順這種不覺，這種有所得向外攀緣的心識活動，產生的一個我相、人相的顛倒，這樣的一個無明活動，就正式起動了流轉的根源。在這流轉中，又因為種種境界的刺激，造成很多的煩惱跟業力，招感痛苦的果報。所以我們在流轉的因緣中，主要的是一個不覺的無明，以及我們在境界刺激所產生的煩惱跟罪業。這兩種力量的推動，使令我們在三界中，一次一次的去遭受生死的痛苦，這就是為什麼痛苦會出現的主要理由了。

從生滅門中，也有另外一個作用，就所謂的還滅門。還滅中，也是有兩種力量來主導的我們趣向安樂：第一個就是本覺為因，第二個是三寶為緣。就是我們開始修學佛法，是一種善業的修學。我們在修學善業的一個所緣境，就是佛、法、僧這種清淨廣大的所緣境。我們根據這個所緣境來禮拜、讚歎、歸依，積集種種的善業，使令我們產生安樂的果報。

進一步就是一種本覺的觀照。在解釋分中本覺的觀照，主要的就是我空、法空的觀照，來息滅我們有所得的心，這樣也就慢慢的息滅了整個輪迴的力量。所以我們在觀心時，剛開始所接觸的就是這種生滅心，一個是雜染的因果，一個是清淨的因果。

我們也可以再深入的去觀照我們這一念心的本性，就是把這些雜染的因果跟清淨的因果，這種如夢如幻的這些染淨的心識都把它撥開來，看到了這種不生不滅、不垢不淨，離諸對待的現前一念心性，這個就是本論所說的真如門。它的體性是以無住為自體，不住於外境的相貌，也不住於內心的妄想，以無住為本所謂的真如。

當我們能夠這樣觀照，就能夠得到一個緣起的結論，就是所謂的達妄本空，知真本有。我們知道妄想是虛妄的，真如本性是我們眾生本具的，只要我們肯努力，就是可以去開顯它的。依止達妄本空，知真本有大乘的平等不二法門，我們知道生滅心當下就是不生滅，能夠發起菩提心，這是利根人，就是從一種緣起的正見發起的堅固菩提心。所以我們在修學本論的第二個重點，應該要建立整個生命緣起的正見，產生一種正確的觀照力。

三、修學大乘五門。

身為一個末世眾生，我們只是根據這個觀照力，這當中是有點困難，因為我們無始劫有很多很多的遮障，這當然包括煩惱跟罪業的遮障；所以我們應該要透過這五門的修學，來破除遮障、增長善根。

在這個五門中，前面的四門就是布施、持戒、忍辱、精進，這前面的四門主要是破除遮障，建立善根的一個前方便，就是透過這四門，來消滅我們心中的煩惱跟罪業，建立我們忍辱跟精進的一個忍力跟行力，當作一種道前的基礎。在這五門中的正修，就是大乘止觀。前面也講到大乘的止，就是以無為的真如為所觀境，以無住的方便而從生滅心趨向於不生滅的真如。這裡，我們就正式從真如中起觀，這個觀中，我們分二科。先看丑一的明應修。

/KEPAN/子二、釋觀
/KEPAN/丑一、明應修

在說明這個明應修，先說明為什麼要修觀，再說明如何修觀？我們先說明明應修，先說明修觀的理由，我們看論文：

/VERSE/復次，若人唯修於止，則心沉沒。或起懈怠，不樂眾善，遠離大悲；是故修觀。

修觀的主要理由就是說：我們在修止，長時間的修止，會使令我們內心產生一種沉沒的相貌。我們講過大乘止觀的止，它的所緣境不是有為諸法。我們一般的止，比如說你是數息，以這個呼吸為所緣境；或者是持咒，以這個聲音為所緣境；或者念佛，也是以聲音為所緣境：這個都是一種色、香、味、觸法的有為諸法。前面大乘的止，它所安住的所緣境，是無為的真理，它是無住。當然這裡無住是所謂的：無住於外面的境界，觀察這個境界是唯心所現，如夢如幻；也觀察我們這一念心，是念念不生，念念不滅，也不住於內心的妄想。這時以這個無住的清淨心，當做我們修止的所緣境。

你在這清淨心無住的真理中，長時間安住，就產生一種很強大的寂靜力量，這當中有滅除煩惱跟罪障的力量。但是長時間這樣安住，就會有一些過失。什麼過失呢？或起懈怠，不樂眾善，遠離大悲。這樣一種清淨的本性，長時間的安住，就容易產生一種增上慢心，及寂靜安樂，我們就認為整個大乘的修學是大事已辦，對於十方諸佛所傳授種種波羅蜜的善法，以及我們去觀察無量有情眾生在三界中，承受的生死大苦，我們都沒有這種好樂追求跟度化的心情，就是不樂眾善，遠離大悲。對善法的修學、對眾生的度化，都不生好樂。換句話說，就會造成一種安住在少事、少業、少希望住的心情，這種情況就容易退大居小。基於這個理由，為了挽救只是修止的過失，所以我們必須要起觀。

這裡我們說明一下。小乘的空觀我們前面也一再強調，他是離開一念心性去向外追求一個空的相貌，在大乘佛法說是滅色取空。所以他這個空，是一個槁木死灰，所謂的死水不藏龍，他本身不能生起修善度眾生的妙用，他本身的空就沒有這種作用。但是這裡的真如三昧就是說：你在安真如三昧時，你一念心是空空蕩蕩、歷歷分明的，那個明瞭性是現前的，就是你有這個能力，但是你卻放棄了這個能力，是這個意思，就是等於是說得少為足。所以我們長時間安住在真如三昧的止，為了怕落入二乘種性，所謂的不樂眾善，遠離大悲，所以我們必須修觀來加以對治，這就是修觀的主要理由。

看丑二、明修相。應該怎麼去修觀呢？這當中有三科，先說明修觀的內容，再說明它的操作時間。先看它的修觀內容：

/KEPAN/丑二、明修相
/KEPAN/寅一、明觀相

/VERSE/修習觀者，當觀一切世間有為之法，無得久停，須臾變壞。一切心行，念念生滅，以是故苦。應觀過去所念諸法，恍惚如夢。應觀現在所念諸法，猶如電光。應觀未來所念諸法，猶如於雲，歘爾而起。應觀世間一切有身，悉皆不淨，種種穢污，無一可樂。

這裡我們先修正一個錯字，就是在七十四頁的最後一行第二個字，這個忽爾而起這個第一個忽字是多餘的，也就是從這個第二個三個火的歘開始，這個歘爾的意思就是迅速的意思，第一個忽是多餘。　　本論的觀它對因緣所生法的觀，主要是提出兩點：一個是不淨觀，來對治貪愛的煩惱；第二個是修無常觀、無我觀，來對治我見的顛倒。從一個對治的次第，我們應該先修不淨觀，從粗到細。我們先看這不淨觀的內容：

一、不淨觀

應觀世間一切有身，悉皆不淨，種種穢污，無一可樂：我們在進入這個真如三昧時，內心的相貌是一個無相三昧，沒有任何的相狀可得，那是一個所謂的清淨平等的法界。現在你要修觀，你必須要從這個法界裡面出來，或者我們可以說是從空出假，從一種我空、法空相應的清淨心，這時再生起一個念頭，在動一個有所得的念頭。動這個念頭以後，你就會從一個平等的法界，回到你現實的生命世界，就是你又看你過去的業力所招感的這個果報體，就是這一團肉。當然這一團肉，我們過去是非常的愛著，這時我們從一種清淨的本性，又回歸到我們這一期的因緣所生法，我們對於這一個色身，應該要以不淨來觀察，來對治我們的愛取煩惱。

我們凡夫愛取的所緣境非常的多，比如說對財富、對眷屬、對這種民生的愛取，但是在所有的所緣境中，以色身的愛取最為粗重。所以我們從對治煩惱的角度，重者先治，譬如擒賊必先擒王。這對色身的愛取，如果你是對自身的愛取就產生身見；對他身的愛取就產生淫慾心，所以這裡的過失是非常的重大。應該怎麼辦呢？在對治愛取，就是觀我們色身是不清淨的，也就是說我們過去的一個觀照力，只是看到色身的表層。就是這一層皮，被這一層美妙的皮所包裝，就產生了顛倒，所以我們應該把我們這一層皮跟肉剝開來，觀察到我們色身的內在相貌，所謂的種種不淨物，充滿於身內，常流出不止，如漏囊盛物。

所以我們修觀，在《智度論》裡面：它是先觀內相的不淨，把這個皮肉剝開，我們看到了色身中有種種的膿血屎尿，汗惡涕淚湯膏有三十六種不淨物。換句話說我們從色身的內部，我們看不到一個乾淨的東西，說是種種不淨物充滿於身內，這種不淨物，它也不完全只是待在裡面，它們經常利用身體的九孔，白天晚上流膿流血，流出種種的不淨物，就好像是一個皮革裡面裝著大小便溺，但是這個皮革破了解不動，經常流出不淨的一樣，這個就是外相不淨，透過這個不淨觀，就能夠息滅我們心中清淨的顛倒，消滅我們對色身的愛著。

佛法在教導我們弟子遠離貪愛，他的意思不是說叫你兩個眼睛閉起來，耳朵都關起來，六根都關起來，不去面對所緣境，不是這個意思。就是說你會貪愛，這當中是有它的因緣，這貪愛煩惱會生起有它的因緣，它的因緣就是顛倒，就是你對它產生一種錯誤的認知。所以呢你應該不是逃避，你應該面對它，就是說其實你所貪愛的，不是我們想像的是一個乾淨的東西。所以我們經過不淨觀的觀察，我們了解到過去的思想是錯誤的，我們一次一次的修正過去思想時，你的貪愛煩惱也就慢慢的輕薄。

這種貪愛的消滅，是從根本消滅，所以它不會去重新生起；不像一般的外道在調伏貪愛，是用壓抑的，這種都會反彈的。所以這裡就是說：我們從真如本性清淨的心一念不生，開始起念頭，回到現實的果報體：先觀察果報體是不清淨的，這樣產生對果報體的出離，有助於我們遠離業報身，追求清淨法身的一種力量。這是第一個不淨觀，當然這樣的修觀是比較粗糙的。

二、無常無我觀

其次，再觀察第二個無常、無我之智慧。

修習觀者，當觀一切世間有為之法，無得久停，須臾變壞。前面是對於這個身心世界的一種不淨觀察，這裡是觀察無常。這個無常簡單的說就是無得久停，須臾變壞。這個無常的觀察，我們在經論上主要有兩個：一個是粗分的無常，一個是細分的無常。

（一）粗分的無常：就是所謂的敗壞無常。我們可以取一期的生命來當做一個所觀境，比如說因緣所生法，簡單的說就是這個五蘊的果報體。這個果報體，比如說你今生是個女人，你有女人的外在身相，有女人內在的思想感受。這個果報體是怎麼回事呢？它是無常敗壞的。怎麼知道呢？就是你要死掉以後，你來生可能沒有到天上，也沒有到三惡道去，就變成一個男人。你來生的果報體，跟今生完全不一樣，是一個男人的色相，是一個男人的思想，男人的感受。當然你今生有持戒、布施，有善業，特別的富貴莊嚴；我們也可能會產生放逸，就把這個福報就花光了，在第三世就變成一隻螞蟻了。這個螞蟻又是一個螞蟻的身相，螞蟻卑賤的心思。所以在這個流轉中，我們發覺我們每一期的生命都是變化的，我們在每一期生命中，我們找不到一期生命跟一期生命中的交集點，這個就是無常。就是你來生的生命跟你今生的生命是一個完全不同的相貌，這個就是敗壞無常。

（二）當然前面的觀察是很粗糙的，也可以作細分的觀察：就是：剎那剎那的無常。比如說我現在的心情很快樂。當然你講這個快樂時，你所形容的那個身心世界，是前一剎那的身心世界；現在的身心世界又變化了。所以我們講過去、現在、未來，其實沒有過去，也沒有未來，每一期的生命都是現在、現在、現在，都是當下、當下、當下，它每一個都在流動。你講現在時，你所指的現在是前一剎那的現在。

所以我們剛開始對生命的觀察，第一個無常，從無常中我們在觀進去，一切心行，念念生命，以是故苦，所以無常就是苦。所以佛法苦的安立，是從無常安立的。因為無常就給我們一種不安全感、不安穩性。所有的快樂都要建立在安穩的體性，就是為什麼我們人、畜生一定要有房子住，就是尋求安穩。但是不幸的是在整個三界的果報體，它的本質就是不安穩，也就是說你沒辦法去預測你下一剎那會出現什麼事情，你沒辦法預測。也就是說我們今天住在一個房子，這個房子雖然暫時打扮的很漂亮，但是這個房子是在地震帶，你不知道什麼時候會發生大地震，這樣就是一種非常大的一個隱憂，這個就是苦、就是不安穩性，所以無常，所以知道這個三界的果報體就是苦。這裡的苦，包括三惡道，也包括人天的果報，都是苦，因為不安穩性。

但是從苦中，可以觀察無我：在修無我中，本論是分成過去、現在、未來的果報觀察。

應觀過去所念諸法，恍惚如夢。先看過去的果報，我們過去得了很多很多的果報，也做了很多的事情，但是現在迴光返照，好像是一場夢。這個夢，法藏大師解釋是無體難追，它沒有自體。你在做夢時，好像真的一樣有它的感受作用；但是你醒過來呢，覓之了不可得。這過去如夢，所以它沒有一個真實的自我。

應觀現在所念諸法，猶如電光。就是在黑暗中，晚上的黑暗有這種閃電。這個光，法藏大師解釋：剎那無住。剎那剎那生滅，它沒辦法停止。現在，是剎那無住；那未來的果報體呢？

應觀未來所念諸法，猶如於雲，歘（迅速）爾而起。就像這個浮雲，它只是暫時的積聚。這個雲，突然間變成一隻兔子，突然間變成一隻馬，它迅速的變化；我們對來生，根本沒辦法去預測它的一個相貌。

所以我們知道：我們的生命沒有一個主宰的我。就是說前面的真如三昧，它是對真如理的一種無分別住，這時我們從無分別中，生起一個善的分別，修不淨觀、修無常觀，這兩個觀基本上就是修出離心。前面等於是修空正見，這裡是從空出假來修出離心。再看下一段。

/KEPAN/寅二、示觀用
/KEPAN/卯一、起大悲心
/KEPAN/寅二、示觀用

這裡是修大悲心，從出離再生大悲。觀用中有三段，先看第一段起大悲心：

/VERSE/如是當念一切眾生，從無始時來，皆因無明所熏習故，令心生滅，已受一切身心大苦。現在即有無量逼迫。未來所苦，亦無分齊。難捨難離，而不覺知。眾生如是，甚為可愍。

前面在觀的一個所觀境，我們從一個真如的平等法界回到現實生活，我們所觀的算是自己的個體生命；現在呢，我們應該把自己的個體生命，把它遍及到一切眾生。就是一切眾生跟我們都是一樣，都是在承受這種個體生命的老、病、死的折磨。這種痛苦的折磨是怎麼來呢？一言以蔽之：皆因無明所熏習故，就是內心產生一種我見的顛倒，依止這個常一主宰的自我意識產生我相、人相的對立，就產生很多的業力，由這個對立心產生業力，由業力招感生死的果報。所以說從一個無明的熏習，過去已受一切身心大苦，我們已經經歷了很多刀山油鍋的痛苦；現在即有無量的逼迫，現在也是承受這一期生命老、病、死的折磨；我們對於未來的生命，我們也即將要面對很多很多的痛苦。就是每一期的受身，都積集了無量無邊的痛苦，這樣的眾生在面對未來生命的痛苦，他有一個非常嚴重的心態：難捨難離，而不覺知。這件事情是非常嚴重啦！一個人有痛苦，這件事情還不是很可怕；可怕的是，你面對痛苦的這樣一個情況，難捨難離而不覺知。

就是說身為一個佛弟子，當然我們現在還有一些有漏的業力跟無明要去對治，所以我們也痛苦，但是我們已經產生一種觀照力，所以痛苦對我們來說，只有不斷的減少，安樂不斷的增加，也就是說我們生命中，已經有一種光明的希望。眾生呢？他沒有接觸到大乘佛法的教義，他心中是一片的黑暗，他也搞不清楚東西南北，換句話說離苦得樂對他們來說是完全不可能。為什麼不可能呢？因為一切法因緣生，你根本沒有找到離苦得樂的因緣，你沒有創造離苦得樂的因緣，你怎麼會離苦得樂呢？所以這裡就是眾生最大的痛苦，就是愚癡，所以我們應該有一份去救拔他們的責任感，這個大悲心是這樣生起的。就是觀察眾生的痛苦，為什麼會有痛苦呢？是他的愚癡。所以我們有教育眾生的責任，這時生起大悲心。這裡我們說明一下。

前面我們修出離心時，所觀境是比較狹隘的一個自身生命；這裡的大悲心呢，就是說我們修大悲心，在阿底狹尊者的教授就是：你應該要跟眾生建立一個感同心受的情況。就是說為什麼你今天看到眾生的痛苦會產生大悲呢？就是你對他要有一個密切的關係，當然這個關係如果你今生只是看到今生的時空，你就很難跟眾生建立關係了，可能跟你有關係的人不多，所以你這個悲心就不大。

那怎麼辦呢？就是我們在觀察時，要從現前的時空跳出來，看到無始劫來我們有很多很多的生命，而每一個生命都有一個母親，每一個眾生包括天上的飛鳥、地上的螞蟻，都曾經做過我們的母親，所以我們跟眾生所建立的關係是一個密切的母子的關係。這樣母子關係這麼的親切，所以你看到他的痛苦、你看到他的愚癡，你就產生一種去救拔他的使命感，這就是大悲心生起時。前面是出離心而引生大悲心，這個大悲心呢，我們就可以發願了。我們看應該發什麼願？

/KEPAN/卯二、因悲立願

/VERSE/作此思惟，即應勇猛立大誓願。願令我心離分別故，遍於十方，修行一切諸善功德。盡其未來，以無量方便，救拔一切苦惱眾生，令得涅槃第一義樂。

當我們從自身的痛苦而遍及一切眾生的痛苦，這時我們應該利用這樣的心態，趕快的發起一個生命的誓願，這當中的誓願有兩個：一個是修善，一個是度眾生。

第一個：願令我心離分別故，遍於十方，修行一切諸善功德。

當我們安住在真如三昧時，產生破惡的力量，這時我們修觀，我們會發願：我的心離一切的虛妄分別，這個虛妄分別就是安住真如三昧。我們從一種個體的生滅，回歸到一個平等的生命，這樣我們就有力量普遍到十方的諸佛世界，修習種種的波羅蜜善法。因為你要度化眾生，你一定要有善的功德，才能度化眾生。依止這樣的善法，你對這個善法，你不是說自己受用；我們依止這樣的諸善功德，在盡未來際以無量的方便力，救拔一切苦惱眾生，使令他們得到究竟大般涅槃的安樂。這裡很明顯的意思就是：他的一個誓願力，是從觀照力生起的。就是眾生無邊誓願度這樣的願力是由觀，由這個觀照生起大悲心，才發願的。

不過這裡我們說明一下：藏傳佛教強調聖道三要──出離心、菩提心、空正見，就是說你一定要先觀察自身的苦，產生出離心；再觀察眾生的苦，生大悲心。這個次第不能錯謬，為什麼呢？假設我們不觀自身的苦，就直接觀眾生的苦生大悲，會有什麼過失呢？因為你沒有修自身的四念處，你就不能調伏你的愛見煩惱。就說你沒有創造一個消滅愛見煩惱的因緣，所以你的愛見煩惱就存在，你修大悲心時，你這個大悲心就夾雜著愛見的煩惱，叫做愛見大悲。愛見大悲在起動時，你會積集功德，你也會帶來一些過失，就是這個問題，你這個功德就不清淨！

所以這裡的次第，我們絕對不能夠錯謬。你一定是先觀自身的苦，內心中產生出離的想；然後再觀察一切眾生的苦，說你應該修習善法度化眾生。所以我們在修善度眾生時，大乘佛法很強調是以出世的精神，去做入世的工作。當然這個出世的精神的生起，就是觀四念處而產生出離。所以這裡在修觀時的次第是大家要注意的。

/KEPAN/卯三、依願起行

有這個願力就能夠引導我們的行動。

/VERSE/以起如是願故，於一切時、一切處，所有眾善，隨已堪能，不捨修學，心無懈怠。

一個修學有目標的人，跟沒有目標的人不同，在一切時、一切處，只要是五乘的善法，我們會隨順自己的力量，盡心盡力的修習，就勇猛精進，不生懈怠，不會得少為足。

一個人的修學，特別是大乘佛法的修學，往往會出現一些不可思議的事業出現，這主要是他有目標，就是有他的誓願力。就是大乘佛法他不是依止色身在修學，要是色身這老、病、死的色身，當然障礙重重；他心中有願力，有願力時，他很多障礙他就衝過去。一個人沒有願力的人，你就很容易被你這個五蘊的身心所困住了。你有一點障礙，你就沒有辦法修善，也沒辦法度眾生。所以這裡就說明這個目標的重要，就是大乘佛法的行動，是來自於他內心的願力，當然他這個願力是由觀照力來的，這個觀照力又依止真如三昧的無住做根本，所以他這個次第是一個扣一個。再看寅三修觀的時間：

/KEPAN/寅三、顯觀時

/VERSE/唯除坐時，專念於止。若餘一切，悉當觀察，應作不應作。

這裡是說我們在佛堂時，環境是比較單純，就偏重在真如三昧的止；但是從三昧出來時，就偏重在修出離心跟大悲心，這當中應該觀察一切的有為法──是應作、不應作，這裡法藏大師解釋說：跟我們的誓願──出離心、大悲心的誓願是相隨順的，我們就去做；跟我們這個誓願相違背的就不做。也就是說我們不起觀時，我們的心是跟著感覺走，也沒什麼目標去判斷這件事該做，這件事不該做；但是有目標時，我們就知道什麼是該做，什麼是不該做，生命的方向非常明確了！我們看下一段，子三、釋雙行，這裡是說明止觀必須雙運的情況。`;
