QXL.volNum = 34;
QXL.text = `
請大家打開《講義》七十六頁，

/KEPAN/子三、釋雙行

前面是把大乘的止跟大乘的觀，各別的說明，這個是針對初學的菩薩，應該是這樣修學的；這裡是告訴我們的目標，應該使令自己在操作上最好是能夠止觀雙運。

/VERSE/若行若住，若臥若起，皆應止觀俱行。

這裡是先說明我們止觀雙運的目標，就是你要能夠行、住、坐、臥，這一念心跟境界接觸時，都能夠具足止，也能夠具足觀，這是我們未來的目標。這樣應該怎麼做，才能夠達到這個目標呢？這以下講出止觀雙運的相貌：

/VERSE/所謂雖念諸法自性不生，而復即念因緣和合；善惡之業，苦樂等報，不失不壞。雖念因緣善惡業報，而亦即念性不可得。

如何能止觀雙運呢？當我們這一念心跟因緣所生法接觸時，我們可能會先修止，就觀察到諸法自性不生。這個自性不生的道理是怎麼觀察？我們剛開始觀察，是觀到這個生滅的相，這個人他這個因緣法是生起，或者消失了，或者是垢相、淨相、增相、減相，各式各樣的對立。但是我們要觀察：它是因緣的生滅，生是因緣的生，滅也是因緣的滅，從這個本性來觀察，它是離諸生滅的。你從這個不生不滅的本性，這個止就在這裡安住，就是於無住。你雖然能夠觀一切法是自性不生，在這裡安住，你也能夠了解到因緣合和，業果不失。或者我們跟心、境接觸時，我們先生起觀，我們觀察因緣果報，善惡的業報是絲毫不爽。但是我們也能夠觀察，其實善惡業報中，沒有一個真實的自我在主宰，一念心不得，它的本性是清淨本然。

就是說你這一念心具足了止跟觀兩種力量，這裡就是一種止跟觀的等流勢力。就是說我們修止時，比如說你今天修止修了一段時間，你雖然沒有修了，但是那個止的勢力還在，你修觀修了一段時間，雖然你沒有修了，但是那個觀的勢力也被保存下來。所以當你修止時，你之前修觀的那個等流勢力會存在；修觀時，止的等流勢力也會存在。所以慢慢慢慢的這二種力量，就會讓我們能夠止觀雙運，是這樣的一個情況。

/KEPAN/癸三、結益

這個止觀雙運所成就的功德利益。

/VERSE/若修止者，對治凡夫住著世間，能捨二乘怯弱之見。若修觀者，對治二乘不起大悲狹劣心過，遠離凡夫不修善根。以此義故，是止觀二門，共相助成，不相捨離。若止觀不具，則無能入菩提之道。

這裡我們先說明修止的功德。我們經常能夠把心帶回家，從這種有相的因緣所生法，就回歸到我們不生不滅的本性，這樣呢能夠對治凡夫對五蘊果報的愛著，也能夠棄捨二乘的怯弱，這個怯弱就是一種怖畏。世間這些有為諸法，凡夫跟二乘都是比較偏激的，凡夫是貪愛，二乘是害怕，所以二乘人在觀三界果報時，觀三界如牢獄，視生死如冤家，他非常害怕。所以二乘人他為什麼成就聖道，他還不敢回到因緣所生法度化眾生，我們不能夠說他沒有悲心，這樣講太武斷，因為四禪天的人都有修慈悲喜捨的慈悲，怎麼二乘人沒有慈悲呢！基本上他之所以不敢回來，是因為他害怕法執。

一個人會貪愛、會害怕，簡單的說就是產生一種自性執，就是法執，就是這件事情是真實的。這個真實，你就是兩個情況：你不是愛他，你就是恨，就這兩種。所以當我們能夠回歸到自性不生的念念不生、念念不滅的清淨本性，我們再出來看世間是如夢如幻，如夢如幻也沒有所謂的貪愛，也沒有什麼害怕，就是從因緣中，去做我們該做的斷惡、修善、度眾生這三件事，如此而已。所以你經常修真如三昧，就能夠遠離貪愛跟害怕的過失。

若修觀者，對治二乘不起大悲狹劣心過若修觀，因為你修觀能夠觀人我有情的苦，遠離凡夫不修善根的過失，所以作一個總結：以是義故，止觀二門應該要相輔相成，如果不能夠具足，就很難成就大乘種性，也就很難生起菩提心，也就很難生起大乘的功德。

所以這個大乘止觀，所謂的止觀門，以藏傳佛教的聖道三要來說，就是修出離心、菩提心、空正見。不過這裡，本論是先強調先修空正見。法王在開示聖道三要時，他也強調：最好利根的人先修空正見，再修出離心跟菩提心。為什麼呢？我們解釋一下：因為我們這一念明瞭的心性，從因緣所生法，我們在三界是流轉太久了，所以我們也熏習很多很多的煩惱，跟眾生結下很多很多的業力跟因緣。這樣的因緣已經是非常的錯綜複雜，已經是誰對誰錯釐不清楚了。所以你依止這樣一種錯綜複雜的心來修出離心、菩提心，你就會有困難，非常困難，很多的功德你就沒辦法生起。因為你這樣的一種錯綜複雜的心態去修出離心、大悲心，你根本修不下去了。那這怎麼辦呢？

就是把這個生命先歸零，就是你先不要是管這個因緣所生法是怎麼回事，剛開始就是把心帶回家。你先修無住，先從這個有為諸法的有相的因緣生滅門，就回歸到真如門，你在這個不生不滅、不垢不淨、不增不減的平等法界安住了以後，你再出來，你再來看人世間，那個感覺不一樣了。卻來觀世間，猶如夢中事。猶如夢中事，你要修出離心、大悲心就容易多了，這是一個新的開始。所以這裡，大家要注意它的一個道次第，先修無住，再修生心。以無住的真如三昧為本，再生出離心、大悲心，這大乘止觀的次第是這樣的。

/KEPAN/戊二、更示勝異方便
/KEPAN/己一、泛明念佛除障

前面所說的大乘止觀，是一個自利法門，我們所依止的是內在的觀照力跟誓願力；這裡的特別法門，是強調佛力加被，就是有諸佛的本願功德所攝受的所謂的佛力法門。那這當中，我們分兩科，先看己一的泛明念佛除障。

/VERSE/復次，眾生初學是法，欲求正信，其心怯弱。以住於此娑婆世界，自畏不能常值諸佛，親承供養。懼謂信心難可成就，意欲退者。當知如來有勝方便，攝護信心。謂以專意念佛因緣，隨願得生他方佛土，常見於佛，永離惡道。

這裡，我們根據這個古德的註解，分成兩段，先說明退轉的因緣：

一個初心的菩薩，修習大乘法門，依止這個一心、二門、三大的道理，來生起大乘止觀，來成就大乘的正信。但是這時有一個問題，就是在修學的過程中，產生怯弱。這裡怯弱，蕅益大師解釋：怯弱的理由有兩個：就是本身止觀的善根薄弱，這是無始劫來大乘止觀的熏習薄弱，當然這意思就是妄想粗重，本身的善根薄弱。第二個境緣粗惡，就是我們在這個流轉中，跟很多人結了很多的善緣，也跟很多人很多人結了惡緣。不管善緣、惡緣都是一種誘惑或者障礙，這個因緣刺激太大，境緣粗惡，所以說就產生怯弱，產生畏懼。這裡就把這個怯弱畏懼的心情，把它開展出來。

第一個講到善根薄弱：以住於此娑婆世界，自畏不能常值諸佛、親承供養。

今天你要成就大乘的正信，當然你要成就大乘止觀，大乘止觀，你一定要有大乘的善根，大乘善根的成就，這個善知識扮演著重要角色。因為善知識他有方便力，他能夠知道你內心中，那些遮障應該如何破除；你過去的善根，應該用什麼樣的方法來開導：他有這個方便力。就像《智度論》上說：這初心菩薩不能夠離開佛陀，就像小兒子不能離開母親。母親知道這個小孩子什麼時候要餵奶，什麼時候要睡覺，什麼時候做什麼事，也就把小孩子養得肥肥胖胖的，這母親他有這方便力；佛陀亦復如是，他有方便力，來開導你的善根，破除你內心的遮障。你在娑婆世界要遇到佛陀很難，你頂多遇到佛像，這是一個問題。

第二個、懼謂信心難可成就，意欲退者。這裡你沒有遇到佛陀已經是很嚴重的一個障礙，而且你遇到的環境都是違背，都是你要修大乘止觀的一個障緣。你日常生活所遇到的境界，幫助你修大乘止觀的非常的少，障礙大乘止觀的非常的多，這裡也是我們產生害怕的第二個原因。那這怎麼辦呢？這以下說明防止退轉的方法：

當知如來有殊勝的方便，來攝受這個大乘的信心，使令不退轉。應該怎麼辦呢？專憶念佛因緣，隨願得生他方佛土。這裡先講他的因地。因地就是憶念彌陀的功德，當然這個功德，或者是憶念他的相好，或者他的名號，以這樣的因地，發願求生到十方的佛土。為什麼要發願到佛土呢？這當中有兩個非常重要的理由：第一個常見於佛，第二個永離惡道。常見於佛我們也說過：見佛呢，我們得到佛陀的教化攝受，能夠破除遮障栽培善根。第二個是遠離惡道，我們生死凡夫在修大乘善根，跟初地菩薩修大乘善根最大的差別，就是這個報障，就這個分段生死的報障。

比如文昌帝君。文昌帝君受了十七世的士大夫，你看他十七世，那是一個久讀聖賢之書，久修聖賢之道，那是一個非常克己復禮的君子。但是他到十八世一時的惡業，變成一隻毒蛇，他的心情完全改變，那個瞋心非常重，看到人就要傷害，因為他變成毒蛇的果報。也就是說我們累積很多很多布施、持戒、忍辱、精進、禪定的善根，但是換到畜生道，你做一隻螞蟻、做一條蛇時，你的善根就產生遮障，這裡就是嚴重的問題。

因此，我們在修習大乘的善根有兩個選擇：第一個你選擇在穢土，當然這個是悲增上的菩薩；第二個你選擇在淨土，這是智增上菩薩。淨土法門它給你一個非要的保證：第一個，它保證你一定可以見到佛陀。當然你遇到佛陀，你一定是蒙佛陀的開導攝受，你善根的生起、遮障的破除，就比一般人得到很大的方便；第二個，你到了淨土，保證你不到三惡道去，你的修學不會因此而中斷。這兩大保證是這淨土的特色──常見於佛，永離惡道。這個是我們在穢土所沒有的一個殊勝的條件，再看：

/KEPAN/己二、的指求生極樂

/VERSE/如修多羅說，若人專念西方極樂世界阿彌陀佛，所修善根，迴向願求生彼世界，即得往生。常見佛故，終無有退。若觀彼佛真如法身，常勤修習，畢竟得生，住正定故。

前面是講十方的淨土；這以下馬鳴菩薩在十方淨土中，特別標出了西方淨土。說是正如在淨土三經上所說的，求生淨土要具足三種的功德：

一、專念西方極樂世界阿彌陀佛：或者憶念他的功德、憶念他的相好、憶念他的名號，這是第一個，專念彼佛。

二、修諸善根：以念佛為正行，兼修戒、定、慧來調伏煩惱。

三、至心迴向，願生彼國。

依止憶念佛陀、修諸善根、至心迴向這三種力量，就往生淨土，常得見佛，遠離惡道，終無退轉。這樣，法藏大師說是資糧位的淺位菩薩所修的有相行。

其次，是深位菩薩——加行位菩薩，求生淨土的修法：若觀彼佛真如法身，常勤修學，畢竟得生，住正定故。直接觀佛的法身，佛的法身，就是佛的真如三昧，從真如三昧中，再產生至心迴向，而往生成就正定聚。

這裡我們說明一下。這裡的念佛法門，它所取代的是前面的真如三昧。這個真如三昧，它是無相三昧。無相三昧，它是以無住為本，它有一個困難點，禪宗的祖師說：相續也太難。就是我們偶爾從有相的因緣，回到無相的真如，短時間的相續有可能，但是你要長時間的安住在真如三昧，有困難，就是無始劫所熏習這個等流的妄想太強烈。那怎麼辦呢？沒關係！這個無相三昧，當你修了一段時間，你可以修一相三昧。一個相，就是彌陀佛的相狀，他以一相三昧來取代真如三昧，但是其他的出離心、大悲心都不能少。

這裡我們也說明一下。前面是講到十方淨土，那這裡，馬鳴菩薩特別講到阿彌陀佛淨土，不但是馬鳴菩薩，我們看到歷代祖師都很強調阿彌陀佛淨土，它一個重要理由，我們說明一下，在《彌陀要解》也強調說：為什麼阿彌陀佛淨土在十方淨土中，是特別被讚歎的一個有特色的淨土？蕅益大師他提出兩個理由：

第一個是它依正莊嚴的殊勝，它所成就的依報莊嚴，它所提供你這個正報的壽命，所謂的無量光、無量壽，這件事情是超過十方淨土的第一個理由。當然這個理由還不是非常重要，這個是講果地的殊勝。

第二個它因地的殊勝，就是它的一個臨終接引的殊勝。蕅益大師說：在其他的淨土，比如說藥師佛的淨土也是很莊嚴，那其他的阿閦毗佛的淨土也是很莊嚴；但是你要去，你得個憑本事，你自己要超過三界的業力，簡單的說就是：深入正定、行重三昧，你自己要去。只有西方淨土，是人終時，阿彌陀佛與諸聖眾，現在其前。你念他的佛，他來到娑婆世界，開導安慰，使令你心不貪念、意不顛倒，把你帶到淨土去，這一點是西方淨土很特色的地方。

就是說你今天要去參訪一個長老，那你自己要去參訪他；這個長老，他來到你這裡帶你去，這臨終的接引這個願是非常重要的。針對我們臨終的一個錯綜複雜的凡夫，有彌陀的接引，會給我們很多的安定跟鼓勵的作用，這裡是西方淨土的特色。這裡是說，修真如三昧的一個怯弱，我們也可以兼修一相三昧。看丙五的勸修利益分，這當中分兩科。先看第一科的結前起後。

/KEPAN/丙五、勸修利益分
/KEPAN/丁一、結前起後

/VERSE/已說修行信心分，次說勸修利益分。如是摩訶衍諸佛秘藏，我已總說。

這個結前，就是前面的信心分已經說了，未來我們應該說明修習本論的功德利益。

如是摩訶衍諸佛秘藏，我已總說，這個摩衍諸佛秘藏，是一個大乘的不共法門，不共於二乘的法門。這個諸佛秘藏，蕅益大師說：諸佛不可思議的法門，一言以蔽之就是念佛法門。念佛法門有兩種：一個是念自性佛，向內安住的真如三昧；一個是念他方佛，是修一相三昧；當然你也可以修自他不二的法門。總之，諸佛秘藏那是密宗說的金剛乘，這是念佛法門，不管念自性佛、念他方佛，這都是大乘的不共法門。看丁二的正說勸修。這裡先作一個總勸，再作別勸。先看總勸：

/KEPAN/丁二、正說勸修
/KEPAN/戊一、總勸

/VERSE/若有眾生，欲於如來甚深境界，得生正信，遠離誹謗，入大乘道。當持此論，思量修習，究竟能至無上之道。

這裡是把大乘的因果作一個總結，從大乘的果報來說呢，我們一個初心菩薩對佛陀的甚深法界，要生起大乘的信心，遠離這樣的一種疑惑跟邪執，成就大乘的種性，這是大乘的功德。應該怎麼辦呢？當持此論，思量修習，究竟得至無上之道。就是本論的宗旨，它能夠使令我們對大乘的甚深功德，遠離邪執誹謗，成就大乘正信，而步入大乘的功德，這是一個總勸。

再看戊二的別勸，別勸中分二段：先說明修學的功德，再說明誹謗的過失。先看它的功德。

/KEPAN/戊二、別勸
/KEPAN/己一、修學功德

/VERSE/若人聞是法已，不生怯弱。當知此人，定紹佛種。必為諸佛之所授記。

/VERSE/假使有人，能化三千大千世界滿中眾生，令行十善。不如有人，於一食頃，正思此法。過前功德，不可為喻。復次，若人受持此論，觀察修行，若一日一夜，所有功德，無量無邊，不可得說。假令十方一切諸佛，各於無量無邊阿僧祇劫，嘆其功德，亦不能盡。何以故？謂法性功德，無有盡故。此人功德，亦復如是，無有邊際。

我們先分兩段，先作一個別釋，再作總結。別釋中，分成聞、思、修三種功德：

一、聞慧：我們聽聞大乘佛法這個一心、二門、三大的道理，而生起大乘止觀，假設對這樣的傳承，不生怯弱，你能夠信心具足，歡喜好樂，直下承當，這個人有什麼好處呢？定紹佛種，就是你這個大乘種性特別堅固，套一句印光大師的話：王子墜地，功超群臣。雖然你還有無量無邊的惡法要斷，你還有無量無邊的善法還沒有成立，但是你的種性已經是佛的種性了，這一點誰也不能否定，這是成就大乘種性，這是聞慧。

二、思慧：假使有人，能化三千大千世界滿中眾生，使令他們斷除惡法，修習十善，這功德很大。但是呢不如有人，於一食頃中，來思惟這個一心、二門、三大的道理，而生起大乘的止觀，這樣的功德，是不可為喻的！

這裡我們先說明一下：雖然十善法很多，你教導這麼多眾生修十善法，但是你比不上一食之頃來思惟這樣一個大乘的圓頓法門。就是說我們前面斷惡修善的法門，它本身沒有返妄歸真的力量，它只是在心中積集一些善業，如此而已。但是我們如實的觀照無住而生心，這樣大乘止觀，它有返妄歸真。就是說你這個生命的流轉，是從根本上的改變，這裡就有所不同，這個思慧，這個功德就更深刻了。

三、修慧：復次，若人受持此論，觀察修行，若一日一夜，所有功德，無量無邊，不可得說。假令十方一切諸佛，各於無量無邊阿僧祇劫，嘆其功德，亦不能盡。

這是成就修慧功德了。就是：你對大乘止觀，觀察修行到什麼境界呢？乃至於一日一夜，那這裡就成正定了，這種功德不要說是凡夫沒辦法宣說，十方諸佛都沒辦法宣說。為什麼呢？

何以故？謂法性功德，無有盡故。此人功德，亦復如是，無有邊際。因為你功德是隨順於清淨的真如法性，法性是時空無盡的，所以你這種功德也是時空無盡的。這裡是讚歎我們受持大乘止觀的一個殊勝利益，這以下說明誹謗的過失。

/KEPAN/己二、譭謗過失

/VERSE/其有眾生，於此論中，譭謗不信，所獲罪報，經無量劫，受大苦惱。是故眾生，但應仰信，不應誹謗，以深自害，亦害他人。斷絕一切三寶之種。以一切如來，皆依此法，得涅槃故。一切菩薩，因之修行，得入佛智故。

修行本論的功德，是這麼的廣大；對於本論的不思議境，我們不要誹謗不信。當然不相信是可以接受，但是不要出言誹謗，這樣的誹謗的過失，是經無量劫，這個時間很長，而且無量劫中受大苦惱，苦惱也特別大。所以我們對於這個不思議法門，剛開始仰信，仰信就是仰信真如佛性在凡不減，在聖不增。為什麼要仰信呢？因為我們誹謗，害了自己，也害了一切眾生，這當中的理由是斷絕一切三寶之種。

這裡蕅益大師的解釋我作一個說明，就是說眾生之所以能夠離苦得樂，是仰仗三寶的住世，眾生才有光明，而這個住持三寶的生起，必須有理體三寶。就是說三世諸佛因為證得真如三昧的理體三寶，才能夠從理體中生起應化身，來建立世間的住持三寶。你現在誹謗呢，是直接破壞三寶的根本、三寶的種。沒有理體三寶就沒有人能夠成佛；沒有人成佛，就沒有人來到世間來成就住持三寶，這種過失，蕅益大師說：比你造五逆十惡還重。因為你破壞世間住持三寶的根本，也就破壞世間的光明。

這以下再作一個總結：以一切如來，皆依此法，得涅槃故。一切菩薩，因之修行，得入佛智故。三世諸佛是依止這個法門而成就涅槃，一切的菩薩也慢慢的在這個法門中修學而趨向於佛智。這裡是勸我們應該要仰信，不要誹謗。戊三的總勸。

/KEPAN/戊三、結勸

/VERSE/當知過去菩薩，已依此法，得成淨信。現在菩薩，今依此法，得成淨信。未來菩薩，當依此法，得成淨信。是故眾生，應勤修學。

這裡是說明這個法門的傳承，是不隨時空而有所變化的，過去菩薩是這樣學，我們現在的菩薩也這樣學，經過無量劫的菩薩也根據這個這樣學，你別無選擇，這個傳承的法門是不會因為時空而有所改變的。看甲三的結施迴向。

/KEPAN/甲三、結施迴向

/gatha/
諸佛甚深廣大義  我今隨分總持說
回此功德如法性  普利一切眾生界
//

前面馬鳴菩薩把諸佛菩薩大乘止觀的甚深廣大義，已經是隨順眾生的根機，這個根機特別是針對末法眾生──煩惱粗重、善根淺薄，所以以這個扼要的總持來作一個簡說。回此功德如法性，普利一切眾生界。把這樣一個說法的功德迴向於無上菩提，迴向法界眾生，等於是迴向於菩提心。我們最後把它作一個結示勸修。

肆、結示勸修

我們修學本論，在實際的操作中，有所謂大乘的止跟觀，從止的角度簡單的說它是從假入空。就是我們剛開始從這個因緣所生的假名、假相、假用的這種有相的因緣，先回歸到這種真空的體性，它的意境，禪宗開悟的祖師說：

一、從假入空：

/gatha/
心空如太空  豁然無所住
一真法界中  寂照常安住
//

大乘佛法所空的，它不是空掉外面的所緣境，它是空掉內心的邪執，所以他講心空如太空，這個太空是一個譬喻。在這空性中，豁然無所觸，我不可得，法不可得，這是我們所必須要去遮遣的──我執、法執的這樣一個有所得的心。但是在這個空掉的心性中，它有它不空的功能──一真法界中，寂照常安住。

這個一真法界簡單的說：是一個絕待平等的法界。在這個絕待平等，沒有個體生命的平等生命中，寂照常安住。現前一念明瞭的心性，念念的現前，這等於是真如三昧。所以我們剛開始，先從一個有相的個體生命，回歸到一個無相的平等生命，所謂的一真法界中，寂照常安住，這等於是修無住。無住了一段時間，應該要生心，從空出假。應該怎麼生心呢？根據《華嚴經》上說：

二、從空出假：

/gatha/
於諸惑業及魔境  世間道中得解脫
猶如蓮花不著水  亦如日月不住空
//

當我們能夠從這個清淨心再出來時，當然那個歷練，歷事練心，就是在這個凡夫的煩惱障、業障，跟這些報障的因緣中，去成就我們大乘的解脫，所以大乘的解脫他不是離開了有相求解脫。就是蓮花它是長在污泥中，是在凡夫的煩惱障、業障、報障中，去成就解脫。成就解脫，怎麼解脫呢？這以下講出二個方法：猶如蓮花不著水。你應該先修出離心，這出離心就向蓮花學習，它在污泥中，它能夠出離，當然能夠出離就是有四念處的觀照。亦如日月不住空，這個大悲像日月一樣，普遍的去關懷這些如母有情，修大悲心。這個就是我們在本論中學習到我們修習止觀，由無住而生心，由生心而無住的一個修學宗旨。

我們身為一個佛弟子，基本上我們都相信諸法是從因緣所生的，當然這個因緣也是各式各樣。那如果我們有志於成就究竟圓滿的佛果這個因緣，本論就會告訴我們一個重要的消息，就是你要先成就無住，再生心，這個無住是最重要的。就是說如果你要求你所修的布施、持戒、忍辱種種的善法，要隨順於無上菩提、隨順於真如，你要先把你的家找到。簡單的說，你修行要上路，你要把你的根本找到，否則你修行就沒辦法上路了。本論中如果我們細細思惟，馬鳴菩薩他告訴我們一個回家的方法，就是你找到這個根本的無住法門──真如三昧，你修諸善法，都是趨向無上菩提。這一點是我們應該感激馬鳴菩薩的地方。

好，我們<done>這一堂課就跟大家學習到這裡，阿彌陀佛。</done>我簡單的回答一個問題：

【學員提問】法師慈悲，本論提到真如三昧是一切三昧的根本，而法師上課有提到若人具足大乘正見，以自他不二的方式念佛，則念念皆能與自性彌陀功德相應，其功德是不可思議的，那麼在實際的修行應用上呢，是否先修真如三昧的止，對自他平等了解以後，再專修淨土法門，求生西方，若有修習真如三昧很得力的人，令生相續，修真如三昧，但心中也已迴向淨土，如是此人也是屬於淨宗學者，請法師慈悲開示。

【師父答疑】大乘的法門有所謂的共於人天跟二乘的法門；也有不共的法門，所謂諸佛秘密藏。本論當然所強調是大乘不共法門，就是念佛法門。念佛法門有兩個：一個是修真如三昧，一個是修念佛三昧；一個是無相三昧，一個是一相三昧。這二個法門，我們也可以作一個簡別。我們先從果地上來說，再說它的因地。從果地上來說，如果你一路修真如三昧，會有什麼問題？當然我們今生修真如三昧應該沒什麼問題，因為這個真如三昧是誰也不能破壞的，它是金剛三昧，因為它是直接從有相到無相。所以鬼神也不能障礙你，煩惱也不能障礙你，罪業也不能障礙，你這是事實。因為從真如三昧來觀察，這些都不可得。所以你入了真如三昧以後，那這是一個非常安穩的處所。

但是這裡有一個問題，就是我們生死凡夫有這個死亡的問題。這是一個你要考慮的問題，就是說你經常修真如三昧，可能你就會忽略一些生命的現實面，就是你會忽略你還有死亡這件事情。當你死掉以後，我們內心中有這個業力，就去得果報了；得果報了以後呢，可能你對你的修行就會中斷，這是一個問題，就是你要面臨死亡。如果我們今天的壽命就像淨土無量無邊阿僧袛劫，那你修什麼都好，因為你成佛有三大阿僧袛劫，三大阿僧袛劫你再怎麼懈怠，你也不要用到無量無邊阿僧袛劫吧。但是問題是：我們的生命只有70歲80歲！這個分段生死，在我們凡位的菩薩修大乘善根，這件事情是個非常嚴重，我們要去面對的問題。

也就是說我們來生只有兩個選擇：我們不能到涅槃去，你要嘛在穢土繼續的流轉，你要嘛到淨土去，就是兩個選擇。就是我們相信有來生，來生你一定要作一個規劃，生命的規劃。然而你要是說在三界繼續流轉，那這件事情誰也不敢說，譬如空中的羽毛可上可下，你這個羽毛要飄到哪裡去，誰也說不準，我們只能夠說祝福你了。你要求生淨土，就是有這個好處，第一個保證你不到三惡道去，第二個你保證見到佛陀。你有任何疑惑，你有任何遮障，你的病再重，你看到好的醫生，就不怕，他有方便力。這件事情你要想一想。

當然你一天到晚修真如三昧，我經常在思惟，一個人經常修真如三昧，會忽略一些生命的現實。我相信很多人會有這種感覺：你在無相三昧待久了，你好像對這個生死的害怕輕薄，但是你對它害怕輕薄，它還是存在。所以我們有時候也要想一想這個生命的規劃，你來生應該怎麼辦？既然有來生，你就應該作出一個非常重要的抉擇，你應該在穢土繼續流轉，或者到淨土去比較好，這是你要面對的一個問題。

好，假設你決定求生淨土，你認為這件事情對你非常重要──為菩提道，求生淨土，我們從一個比較現實的角度，憶念彌陀的聖號是非常重要的。就是說一切法因緣生，你今天栽培什麼因緣，它就什麼果報。當然真如三昧是成就大乘善根，那是一個非常長遠的布局。但是就著來生求生淨土的角度，你憶念彌陀的聖號，臨終蒙佛的接引，這是一個所謂的你短期要達到的一個非常重要的目標。所以到底我們應該偏重真如三昧，或偏修念佛三昧？這就是你應該把你的目標訂出來，你才知道你的有限生命中，你要把比較多的精神體力放在哪裡，就是說你是由目標來引導你的修行。反正你今生能夠用的精神體力就這麼多，你扣掉吃飯、睡覺、雜務，你的時間就這麼多，你如何來規劃你這些時間，來規劃你長遠的菩提道，這就是你自己要去規劃的。

當然生命就是一個抉擇，你這樣抉擇，你就承擔你的抉擇，我們很難說誰好誰壞，但是要想清楚你該怎麼走，你再去做，這個是比較好的方法。如果說你今天我們害怕退轉，來生真的是充滿了不確定，我們應該先到淨土去，這時你也可以兼修真如三昧，但是你也要偏重念佛三昧，因為這個感應道交，你一定要憶念的聖號，才能夠從產生感應道交，這個不是單方面的。所以念佛三昧，從臨終的憶佛、念佛，要從平常的栽培，那這件事情你就不能忽略了。所以說你在規劃你今生的修學，你要先規劃到來生，就是你來生要到哪裡去，你就知道你今生應該要積集什麼樣的資糧，你這樣規劃會比較完整。你成佛之道應該怎麼做？你先規劃完你再去走，那就知道你應該如何做取捨了，你在這個有限的精神體力如何作取捨，這個問題諸位應該也就會知道你應該怎麼做。`;
