var imgMap = {};

function img(name, tip) {
  const SCALE_FACTOR = 0.8;
  var width = imgMap[name],
      ret = `<img src="9151/${name}.jpg" align="right"`;
  if (width) ret += ` width="${width * SCALE_FACTOR}"`;
  if (tip) ret += ` title="${tip}"`;
  return ret + '>';
}

(() => {
var lst =
`二門 667 293
如來藏 635 205
究竟覺 544 258
一心真如 636 281
不覺因緣 463 212
住相觀察 554 257
依言真如 667 297
信的安立 604 257
八個因緣 679 306
四種觀照 353 240
大乘體性 620 310
心與種姓 667 226
正說五分 666 285
歸敬三寶 603 274
滅相覺照 646 278
生相觀察 604 296
異相覺照 646 285
覺、本覺 466 256
覺悟因緣 516 246
解釋分三 667 281
述造論意 603 223
迷真起妄 672 275
阿賴耶識 671 280
隨順悟入 656 304
雜染根源 659 267
述造論意1 603 253
一切法無生 569 262
修學三法門 668 267
大小乘因種 553 275
生滅因緣相 588 300
難行道修法 578 239
一心二門三大 679 306
本覺不覺始覺 667 268
覓心了不可得 581 282
觀察無常無我 593 285
阿賴耶識二義 670 271
唯識學阿賴耶識 674 253
究竟覺非究竟覺 583 239`.split('\n');

for (var i in lst) {
  var a = lst[i].split(' ');
  imgMap[a[0]] = a[1]; // just width
}
})();
