http://www.baus-ebs.org/sutra/jan-read/002/09.htm

　　　　地藏菩薩本願經科註

　　古鹽匡庵　青蓮苾芻　靈乘父　輯

　　　　地藏菩薩本願經科註序

　　一月普現一切水，一切水月一月攝。此言聞者故多，而知者或寡。茍知之，則知地藏菩薩以一身現多身，而多身復一身，初無所作。又經歴無量無邊佛 剎微塵數劫，不間一剎那；於一剎那經歴無量無邊佛剎微塵數劫，曾無有異。如是則天堂地獄諸佛眾生苦樂逆順善惡好醜，如谷響鏡華，覓其形相，了不可得。故 曰，度盡眾生，實無度者。雖然，其奈六極之類，為無明罥所覆，未出三界，不免妄嬰諸苦。繇是菩薩乘夙願轂，以種種方便而救度之，使其離苦得樂，以至無上菩 提而後已。於戲！此菩薩大慈大悲大孝大願，大威神力，悉不思議。假使以虛空為口，雷霆為舌，盡塵沙劫，贊嘆其無量功德海中一滴之相，猶不能盡，況區區筆墨 乎！龍飛戊辰秋，崎陽大德真常公攜浙中運遐乘法師新編地藏經科註，將欲梓行，來謁予序。蓋以常公為法檀度，恆與四部眾演說是經，意有在也。予輒然沈啟讀， 嘆未曾有。乃知運法師孝德道力精進勇猛，越乎倫類。而且具般若智，獲無礙辯，得非當代教門之領袖，與資生利物，莫越於斯，鍥而傳諸不可後矣。

　　時

貞亨五季無射月朔日
　　　　支那嗣祖沙門高泉性潡敬題於佛國方丈

　　　　地藏菩薩本願經科註序

　　原夫百川具流至海而極，一乘圓果稱性而周。華藏十三重，處處現遮那之妙體；鐵圍百億土，塵塵顯地藏之願門。但以四弘廣被，萬行齊彰，統神變而 無窮，運悲心而叵竭。地藏本願經者，是唐於闐實叉所譯。故其言詞簡約，義趣幽深。緣起無生，宛合雜華之旨；體空成事，冥符起信之文。所以放光集會，嘆世主 之妙嚴；法界回施，較成佛之福利。為欲錶揚聖母之厚德，故此廣贊地藏之洪名。良由凈法身因性空而包納，種智果從心地以發生。然此因果圓融，主伴交徹，佛眼 難窺其奧，聖心莫測其微。故知心通則凈剎非遙，情隔則凡境是異。煩惱業緣，甚可怖畏，受報醜惡，何忍見聞。如因目中之赤眚，妄現燈上之毛輪；急須辦成佛之 資糧，悟惟心之自性。遂使迷途饑饉時忻逢王膳，火宅炎焰處頓獲清涼。至於聞名睹相罪滅河沙，禮念歸依福增劫石。良以一文之妙，攝義無遺；故一偈之功，能破 地獄。此經功德，真不可得而思議者也。吾浙古監匡庵運遐法師者，禪觀精修，顯密備究。嘗往天溪之門。年來杜跡註釋，部帙雖多，而此經科註，可謂獨步矣。長 崎德苑真常師信敬此經，素奉菩薩，見而悅之，意欲轉佈，甚合予願。顧惟大士威神不可思議，故得塵剎流通，寧止四海耶。今將授梓，屬予弁端。予嚮最敬此不思 議經王，遂合掌贊嘆。普願見聞隨喜者，悉得任運流入薩婆若海，以至圓滿無上佛果菩提而後已。是為序。

　　時

貞亨五年歲在著雍執徐清和浴佛日
　　　　　東明悅峰章熏盥敬題

　　　　地藏菩薩本願經科註序

　　地藏菩薩本願經者，頓脫生死之捷徑，速到涅槃之津梁，起死回生之良藥，閉惡興善之寶鑒也。乃至以信手拔疑根，用戒足登樂剎，慧目定心，無量功 德，靡不具足者，其唯此經歟。是故地藏菩薩實為群生所依福田之根本也。若能歸敬此菩薩者，則眾苦悉除，諸願滿足。現在能得安隱，將來必定解脫。若稱洪名， 或歴耳根，永滅重罪，終至寶果，是皆大士不可思議慈願力之所致。其慈山願海，實過於諸大菩薩者，日劫相倍矣。是以釋迦世尊將人天眾囑此大士，復贊之曰：一 彈指間歸依地藏菩薩，是諸眾生，即得解脫三惡道報也。原夫佛法寬廣，行門無量，所有諸善功德之中，而以發心起願為最要。緬惟菩薩往昔作長者子及光目女時， 而發心起願，齊修六度，圓證三身，恆沙功德，皆悉具足。故今播名十方，分身沙界，廣度眾生者，皆由發大心、起大願故。故知發心即諸願之根本，一切功德莫不 由是而生。然而本具大願從智體起，拔濟弘誓由悲用生。始從發心，終至成道，引行趣果，願為之本，是故成佛，莫先於願。所謂無願多退。如牛無禦，如畫無膠， 如壞未火，終不可用。故經雲：比丘不發誓者，終不成佛道。誓願之福不可稱計，得至甘露滅盡之處也。予嘗深玩是經，審以慈孝願行為宗要。何者？以光目女有大 慈湣心，為母發大願故。然則慈能生孝，因孝發願，由願興行，開則成孝願行，合則為慈願也。頃支那國有運遐法師，以自所編地藏菩薩本願經科註，寄送崎陽興福 悅峰師。師即運法師同省也。嘗聞運師於病中而註是經，凡成六卷，其功豈易言哉！此經自唐至今，仟有余載，甫有註釋之者。籲！亦可謂難矣。是誠菩薩護念法師 善願。病魔既退，勇猛莫超。佛言勇猛名地藏。然則運遐法師豈非能契佛意者歟。予欲請此註梓行於世。悅師諾然授之。予不勝喜，如獲異寶。今既付梓，普願見者 聞者知地藏菩薩本願功德利益之事，則植將來之智種。而且見果畏因，息惡勤善，遣妄歸真，仰信受持，如食金剛，決定不消，終得佛果。以此不思議尊經，實為群 生之慈澤，潤物無窮。逢是妙典，多劫慶幸，莫大於此。故不揣愚陋而為之序。

　　時

貞亨五年歲次戊辰季春上浣吉旦
　　　　　寶池釋真常稽首敬撰

　　　　地藏菩薩本願經科註

　　　　　古鹽匡庵　青蓮苾芻　靈乘父　輯

（編者按：《地藏菩薩本願經科註》錄自《續藏經》第三十五冊，原書中凡有△處，後面都有註者所作科分。因科分文繁，且對一般讀者沒有幫助，故這兒僅保留了△，錶示有被省略的科分。讀者若感興趣，可核對原書。）

　　委釋經題已如上說

△

【唐於闐國三藏沙門實叉難陀譯】

　　唐，代名。李氏，有天下之號。以其奮跡晉陽，為陶唐氏故都，故國號唐焉。（李淵之祖虎，佐西魏周閔帝，受西魏禪，追封唐國公。虎生昺，昺生 淵，皆襲封唐公，遂以立國。）於闐，正雲瞿薩怛那，唐言地乳。以王未有嗣，禱毗沙門像，額上剖出嬰兒，不飲人乳。神前之地忽然隆起，其狀如乳，神童飲吮， （徂兗切前上聲），遂至成立，故以名國。又雲渙那、於遁、豁且（子余切音疽）、屈丹，皆此國之異名也。大集月藏經，世尊付囑難勝天子仟眷屬，及散脂大夜叉 等毗沙門王，共護於闐國土。故多聖賢繼跡，乃譯師本生處也。三藏，梵名俱捨。此雲藏。如世庫藏以積錢財，法之三藏以蘊文義。三名各含一切文理，故名為藏。 阿含即定藏，毗尼即戒藏，阿毗曇即慧藏也。沙門正言室摩那拏，此言功勞，謂修道有功而多勞；又言息心。瑞應雲：息心達本源，故號為沙門。是也。然諸經譯 人，皆雲法師。今稱沙門者，譯主之謙德也。實叉難陀，唐翻學喜。時因天後明揚佛日，敬重大乘，以華嚴舊經處會未備，遠聞於闐有斯梵本，發使迎請實叉，與經 同來赴洛，重譯。

△

【忉利天宮神通品第一】

　　釋品如綸貫後仿此。

△

【如是】

　　大師深悟法華，闡明妙旨，以五重而解首題，以四釋而消文句。今經既同醍醐，釋文那容薄味。況諸經之首唱，乃法華之極談。南嶽三轉讀文，天臺一念觀具，理既一體，文合四番。第後代人情效簡，而末世根鈍憚煩。今故處中，或三二一。貴在得意，無煩筆墨。
　　如是者，信成就也。佛法大海，信為能入。心有凈信，能入法海。故不信者，言是事不如是。如牛皮未柔，不可屈摺。信者，言是事如是。如牛皮已 柔，隨用可作。信則所言之理順，順則師資之道成。故首標之。又如名不異，是曰無非。阿難傳佛所說圓經，譬之瀉水分瓶無異。文下之理，允當無非，則文如而理 是，故言如是。只此如是，莫不皆同，以不思議性識即諸法實相。體離四句，相絕百非，心佛眾生，三無差別。抑豈我佛跡中經初為然，即本經初，亦復如是。大論 雲：過去法如，即是未來、現在法如；現在法如，即是過去、未來法如；未來法如，即是過去、現在法如。所以者何？一如無異故。是則地藏菩薩元初發心以來，迨 今天宮受囑，皆以圓如是而自修，亦以圓如是而利它。種熟脫三，時時不廢。與我佛本跡之事，莫不皆如、皆是，方名今經開顯之如是也。行人能以此圓常正諦，觀 一念具心。即此具心所起修惡，即是性惡，名惡法界。無法不收，體是三德，復名三諦。稱諦而觀，照境不異，名如；境觀雙亡，永絕過非，曰是。如是信之，信成 就矣。

△

【我聞。】

　　我聞者，聞成就也。此海阿難自錶，親承有在，永異外道。我以主宰為義，十六見之首，五利使之元。故凡夫、小乘於人法中著我。而阿難為傳法菩 薩，於法華預授記之儔，傳此圓經，合順二空，何亦言我？須知凡夫人具足見、慢、名字三我。阿難已無見慢隨俗名字，以無我無聞，化道則絕。故雖知無我，為傳 化道，隨世假說。如以金錢易銅，買賣之法，人無笑者。

　　聞者，耳根不壞，聲在可聞處，作心諦聽，因緣和合，故能聞。應言耳聞，以我是聞主，聞是我用，主是假人，用是實法。若解主義，聞義自顯。但主 是總論緣起，聞乃別從說聽，不無少異。此是阿難直提法性，真我心聞，令人直下悟入耳。然真我無我無不我，心聞無聞無不聞，為傳化不絕，故雲我聞，聞則成就 已。

△

【一時，】

　　此應紀歲月。今雲一時者，蓋兩土正朔不同，說經前後有異，故以一時總攝耳。然一者，乃道之統，體天德之純，形氣之元，數之始，易之奇，生天生 地，萬物以茲，未有不始於一。故伏羲卦爻，倉頡文字，鹹起於一。一為字之大母，在上若天蓋形，在下若地載形，在中若人負荷形。時者，變易也。造化密移，人 疇覺之，其可見者莫如日。故取日之所之，乃是會意。以天體至大，運用之妙，存乎日也。佛世論時有二：一、迦羅，名短時、實時。示內弟子依時而食，護明相 等。二、三摩耶，名長時、假時。外道執時為實，故顯時是假。輔行雲：諸經既多，乃通言一時，則詼乎長短，攝彼精粗，是已。今言覺皇法運將竟，天宮嘉會之 時，聽者感佛為說，說者應機而談。說聽事訖，總名一時。大要令根熟，六道歸一心之時。大師雲：若前思後覺，斯二非一，思覺妄斷，豁悟之時。今亦然耳。

△

【佛在忉利天，】

　　天臺明六即佛。今約究竟即佛。有三：依一切智，有丈六佛；依道種智，有丈六尊特佛；依一切種智，有法身佛。三佛不得一異，非一異而一異。今既 開顯總秘密藏，同一圓佛，一異俱忘。暫時曰在，久停名住，一往語耳。今准大論，以住釋在。住者，四儀之一，佛為能住，忉利天為所住。以住處有二：一境界 處，遊歴之境，為化在俗之流。二、依止處，為統出家之眾。今指境界處也。然能住有四：謂天、梵、聖、佛。天住謂六欲，因即施戒善心。梵住從初禪至非想，因 即四無量心。聖住三乘人，因即三三昧。佛住首楞嚴百八三昧等，然必依諦而住。故丈六佛住真諦；合身佛住真中；法身佛住中道。是則吾人於一心中圓修三觀，念 念不休，時時住於三諦，即觀行住。故知能了神解心性，念念菩提果圓，介爾起意，大用現前，無待無依，非取非捨，從真起行，體用相收，以行契真，卷舒一際； 自然心心合道，念念冥真矣。忉利天見品題。

△

【為母說法。】

　　准觀佛三昧海經，是父王白佛：當往忉利天為母說法。佛言：當如輪王行法問訊檀越。按增一阿含經，乃帝釋所請，謂諸佛皆上生忉利為母說法，如來 亦應為聖母說法。於是如來與仟比丘，於安達羅國曲女城邊，升忉利天，為母說法，以報生身之恩。梵語摩訶摩耶，唐言大術，或雲大幻；長阿含名大化。妙玄雲： 摩耶是仟佛之母，是大權法身上地，豈有凡夫能懷那羅延菩薩耶！故晉譯華嚴，摩耶夫人答善財雲：我已成就大願智幻法門，得此法門，故為盧捨那如來母，於閻浮 提迦毗羅城凈梵王宮，從右脅生悉達太子，顯現不可思議自在神力。此約小乘明父母等。若約圓宗，都如幻現。如佛告月氏天子言：其菩薩者，不念於生，亦無所 起，用本願故，現有所生。天問：菩薩不念所生，亦不往生，雲何如來垂念所生之親，上忉利天，一時三月，如來不為從王後摩耶而由生乎？佛告天子：菩薩不從王 後摩耶所生，從智慧度無極生。所以者何？其三十二大人相、十力、四無所畏、十八不共、乃至虛空佛眼，神足善權，斯諸功德，悉為不從王後摩耶而生，則從智慧 度無極生。此即佛升忉利為聖後所說之法。經有三卷，皆稱本之談。

△

【爾時，十方無量世界，不可說不可說一切諸佛及大菩薩摩訶薩，皆來集會。】

　　爾時者，正如來為聖母說法時也。諸佛既多，難別剎土，故統雲十方無量世界。無量者，量不可得，有何等算。世為遷流，界為方位。東西南北上下為 界，過去未來現在為世。有二種：一、眾生世界，是正報。二、器世界，是依報。孔矣依正數夥不可說也。此是華嚴阿僧祇品百二十五數中之一。普及名一，盡際名 切，不一名諸，尊極名佛。各將一大菩薩為侍，故雲及。菩名道，薩名心，自行此道，復能化人，依勝位立勝行，乃圓教大人，故言大菩薩摩訶薩。主與伴俱，因隨 果集；主不異伴，伴不異主；即主即伴，非異非同；來則俱來，集則共集，故雲皆來集會。斯時如帝網珠光，重重無盡。行人一念，冥契其中，則始覺智與本覺智融 通一際，無明心與菩提心交互雙流。則無邊剎海，不隔毫端；十世古今，不離當念。心為總持之主，圓觀不可暫離。請各思之。

△

【贊嘆釋迦牟尼佛，能於五濁惡世，現不可思議大智慧神通之力，調伏剛強眾生，知苦樂法。】

　　釋迦，姓也。本起經翻能仁。准長阿含，昔甘蔗（姓也）王聽次妃譖，擯四太子至雪山北。自立城居，以德歸人，不數年間，為強國。父王遣使往召， 四子辭過不還。父王三嘆，我子釋迦，因此命氏。牟尼，字也。本行經翻寂默。以諸釋種憍慢多言，及見太子，悉皆默然。王雲宜字牟尼。姓從慈悲利物，故不住涅 槃。字取智慧冥理，故不住生死。首嘆能字，即此意也。

　　五濁惡世。譬如清水，投之塵土，容貌淚然，名之為濁。濁相有五：所謂劫濁，（劫濁無別體，約四濁立名。）見濁，（五利使為體）煩惱濁，（五鈍 使為體）眾生濁，（攬見慢果報立名），命濁，（連持色心為體）。而此五濁，煩惱、見為根本。從此二濁，成於眾生。從眾生有連持命。此四經時，謂為劫濁。劫 濁亂時，眾生垢重，慳貪妒忌，成就諸不善根，故名惡世。
　　悲華經寂意菩薩問：今我世尊，何因何緣，處斯不凈五濁惡世之中，成阿耨菩提，說三乘法？何緣不取清凈世界，遠離五濁惡世？佛告寂意菩薩：以本 願故，取凈妙國；亦本願故，取不凈土。菩薩成就大悲，取斯弊惡不凈土耳。是故我以本願，處此不凈穢惡世界，成阿耨菩提（雲雲）。大論雲：諸佛大悲，徹於骨 髓，不以世界好醜，隨應度者而教化之。如慈母愛子，子雖沒在廁混，勤求拯拔，不以為惡。故諸佛菩薩贊嘆能於五濁惡世，調伏剛強眾生。

　　現者，約化儀，本是瓔珞長者，現為弊垢之身，乃寢大而施小也。約佛意，本是圓佛，垂為三藏初成之相，乃隱實而施權也。大智慧神通，准大論，謂 能降伏外道大論議師及釋梵天王，故名大智慧。准賢愚經，降六師已，洴沙王白佛：六師群迷，不自度量，求於世尊，捔試神力。佛現神變，妙難思議。六師窮縮， 乃無一術，投水而死，徒類散解。故名大神通力者。佛身功德力，勝於十萬白香象寶，是為父母遺體力。若神通功德力，無量無限。如此大慧通力，三乘罔知，人天 莫測，名不可思議。以此慧通之力，調伏剛強眾生。維摩居士言：此土眾生，剛強難化。故佛為說剛強之語以調伏之。言是地獄，是畜生，是餓鬼，乃至是愚癡，是 愚癡報等。以難化之人，心如猿猴，又如象馬，[懺-仟+龍]悷（上音龍，下音例，[懺-仟+龍]悷，多惡也。）不調，如諸楚毒，乃至徹骨，然後調伏。如是 剛強難化眾生，故以一切苦切之言，乃可入律。故我佛稱調禦天人師。

　　苦樂即三藏生滅四諦，以迷真重故，從事受稱。然苦、集是一法，分因果成兩；道、滅亦然。以二是世間苦因果，二是出世樂因果，故但雲苦樂法者，軌持為義。以四諦法非佛、天人、沙門、婆羅門所作，唯是過去無明顛倒心中造作諸行法爾，能出今世六道苦果，天然好惡不同。

　　知者，即鹿苑三轉法輪時，示其相雲：此是苦，汝應知等。此是小始初成，先施方便，以調伏三乘根性：以四諦調伏聲聞，以因緣調伏緣覺，以六度調伏菩薩。諦緣弘誓，皆依四諦。故通言知苦樂法。此是釋迦能事，故果因交贊而共嘆也。

△

【各遣侍者，問訊世尊。】

　　侍者，親近從命承事之人。長阿含稱執事，即法華及諸僮仆也。疏雲：僮仆者，給侍使人，譬方便知見，皆已具足，和光六道，曲順萬機，即實智之僮仆。以實智主內，故為能遣；權智任外，故為所遣。

　　問訊者問起居，訊所事也。如分身諸佛，各遣侍者問訊曰：少病少惱，氣力安樂。及菩薩、聲聞眾，悉安隱不同。由應五濁惡世故，以病惱氣力為問，以佛示同人法也。

△

【是時如來含笑，放百仟萬億大光明雲。】

　　是時者，感應道交，發跡顯本。如來得付囑之機，大士承拔濟之命，今正是時。如優曇華，是時乃現。今既得時，故含笑放光。含，合也；合口停之 也。准大論，笑從口出，一切毛孔皆開，故名笑。由口笑，歡喜故，一切毛孔皆開。然佛佛皆有常光、放光之別。常光，佛身四邊各一丈光明。生便有此三十二相之 一，名丈光相。余界常光無量。釋迦佛因眾生薄福，不堪其明，故受一丈。今是放光，即錶應機設教，破惑除疑，從體起用也。然諸經放已必收，今不見收光之文 者，以放光照現在事，收光明將來事。今明地藏現事，故略收光之文。

　　光明玄雲：婆頗婆，翻光；郁多摩，翻明。雲者，山川之氣，天之章也。陰陽聚而為雲，逶迤上佈，自然成文。內經曰：地氣上為雲，天氣下為雨。故 從雨雲，象回轉變態之形，錶如來現身如雲，說法如雨。以雲出岫無心，散空絕跡，叆叇彌佈，甘雨滂沱，正顯如來無分別智，緣感則現身，機叩則說法，令眾生自 然菩提芽生。百仟萬億，言光雲數多。大論雲：身光是諸光之本，從本枝流，無量無數。譬如迦羅求羅蟲，其身微細，得風轉大。光明亦如是。得可度眾生，轉增無 限。故有百仟萬億。須知如來之光，本從智心流出，則吾人一念，本具三仟性相，百界仟如。如是互具百仟萬億之心光，與如來智光，無二無別。故得三乘鹹會，六 道齊開，同此一光，不可思議矣。

△

【所謂：大圓滿光明雲，大慈悲光明雲，大智慧光明雲，大般若光明雲，大三昧光明雲，大吉祥光明雲，大福德光明雲，大功德光明雲，大皈依光明雲，大贊嘆光明雲。】

　　所謂者，有指之辭。就文指十種光雲，約意指眾生性德。欲令睹形知意，目擊道存，全性起修，即因成果。方見毗盧遮那遍一切處，心佛眾生三無差 別。故約今家十乘觀法，對釋十種光雲，令修之得門，見不唐捐也。故四明雲：此之十法，雖是智者像代宣揚，若離此十，更無修法。今准其義，以釋此文，庶令十 法成乘，運歸寶所。

　　大圓滿光明雲為十光之首，流出九光，正對不思議境。居十乘之初，為九乘本。大圓滿即如來果德三身與眾生一念三仟，具足無減；即此之境，無法不備，故曰圓滿。法華大車，其在是歟！故以對之。

　　大慈悲光明雲，對第二真正發菩提心者。既觀妙境，何用發心。蓋此十法，雖俱圓常，圓人復有三根不等：上根唯一法，中根二或七，下根方具十。今 中下之根，觀境不悟，須加發心。故依妙境發無作四弘誓願，憫己傷他，上求下化，則如來慈悲，拔苦與樂，即吾人所發菩提之心。不合法華經文，恐太煩故，下併 略之。

　　大智慧光明雲，對第三善巧安心止觀者，因名止觀，果名定慧。即定之慧，名大智慧。大論雲：智慧普知，無法不盡。智大則光大，如函大蓋亦大。則知果上佛智無量。由因心巧安止觀，果因互顯，修證相成，故以對之。

　　大般若光明雲，對第四破法遍者。謂三觀一心，無惑不破，此正修之以般若。蓋眾教諸門，併以無生為首，遍破諸惑；復以無生度入諸門，縱橫俱破，令識體遍。識體遍是實相般若，入諸門是觀照般若，縱橫破是文字般若。故以對之。

　　大三昧光明雲，對第五識通塞者。此正以王三昧，照其四諦苦集、十二因緣、六蔽、塵沙、無明之塞，莫不皆成道滅。滅因緣智、六度、一心三觀之通。通者護之，塞者破之。無塞不通，名大三昧。三昧與慧冥契，何塞而不通。故以對之。

　　大吉祥光明雲，對第六道品調適者。大師雲：吉祥者，義利之詞。現益名義，當益名利。大悲空智經雲：吉祥者，謂不二智故。今無作道品，一一調停，隨宜而入。此以無漏般若，導諦緣度，一切萬行到薩婆若。般若導行，是不二智到薩婆若，得義利也。故以對之。

　　大福德光明雲，對第七對治助開者。福德即佈施等是助道，無漏般若是正道。正道多障，圓理不開，須修事福助開。涅槃雲：眾生煩惱非一種，佛說無量對治門。夫不信有對治之人，當知此人未曉正行。故以對之。

　　大功德光明雲，對第八知位次者。謂修行之人免增上慢。蓋此光雲，睹者皆有滅惡之功，生善之德，不無觀智淺深明昧之異。而上慢者，謂己均佛。實 未證得，自謂證得。非唯失位，卻墮泥犁。若知生佛體同而真，似因果前後不濫，則內勤三觀，外加五悔，免增上慢，成大功德。故以對之。

　　大皈依光明雲，對第九能安忍者。謂於逆順，安然不動，策進五品，而入六根。以圓觀行人，初入外凡。外招名利，內動宿障。因茲破敗，豈能進道。今見光雲示歸依之像，即返還自性，依憑三寶，一體光嚴，安住無生，任運而進，故以對之。

　　大贊嘆光明雲，對第十離順道法愛者。謂莫著十信相似之道，須入初住真實之理。以既修離愛，進入銅輪，（十住），百界分身，一多相即。自然任運流入薩婆若海，則三世如來，莫不贊嘆安慰，故以對之。

　　問：十種光雲，果覺神通之用；十乘觀法，圓初進修之門。以果對因，修證乖矣！答：夫論觀法，若其不用果覺為體，則非圓行；若其不以即覺之性為 所照境，則非妙境，非極理也。今不許初心與果覺同體，則如來光雲與眾生何涉，而天龍鬼神乘光普集耶？若知初後不二，方顯因果同塗。所謂眾生性德之佛，非自 非他，非因非果，即是圓常大覺之體。故知果佛圓明之體，是我凡夫本具性德。那言果佛光雲，非圓初心之妙用耶！

△

【放如是等不可說光明雲已，又出種種微妙之音。】

　　放等結前，又等起後。婆阇尼娑婆[口+林]，此雲聲音。准魔嬈亂經，梵名毗樓，翻聲音。後譯翻洪音。（拘樓秦佛弟子之名）白虎通曰：聲者，鳴 也；音者，飲也。剛柔清濁和而相飲。精蕰雲：音者，聲成文也。散而佈者，聲也，不如是則不能震動。函畜有余而不盡露者，音也，不如是則不能渾成。呼二字而 開發收閉備矣。今言詮理之聲謂之音。佛所出聲，言辭清雅，聞者無厭，聽之無足，能為一切作與樂拔苦因緣，莫若聞聲之益，即是以慈修口。故有八音：一、極好 音，二、柔軟音，三、和適音，四、尊慧音，五、不女音，六、不偽音，七、深遠音，八、不竭音。種種微妙者，佛先世種善音聲因緣故，咽喉中得微妙四大，能出 種種妙好遠近音聲，遍滿十方恆沙世界。今光雲出音，法爾宣流。絕緣慮心之情見，顯無分別之慧通。互相合響曰微，彼此不雜曰妙。此錶地藏隨類現身，應機說 法，境既不一，音亦眾多。華嚴雲：諸光明中出妙音，普遍十方一切國，演說佛子諸功德，能入菩提之妙道。正斯之謂也。

△

【所謂檀波羅蜜音，屍波羅蜜音，羼提波羅蜜音，毗離耶波羅蜜音，禪波羅蜜音，般若波羅蜜音，慈悲音，喜捨音，解脫音，無漏音，智慧音，大智慧音，師子吼音，大師子吼音，雲雷音，大雲雷音。】

　　宣說六度等有二意：一、錶佛菩薩身，即是法身，從諸法門功德生。二、錶佛菩薩說法，不出六度等法門，以大智慧作師子吼，興雲震雷潤物肅眾也。梵語檀那，秦言佈施。檀為寶藏，富貴安隱之福田；檀能破苦，得道涅槃之筏喻。利益殊多，故光雲首贊。

　　屍羅翻性善，又翻止得。謂止惡、得善也。若人求大善利，當堅持戒，如惜重寶，如護身命。譬如大地，一切萬物之所依住，戒為一切善法住處。故光雲宣流。

　　羼提雲忍辱，有生忍、法忍。菩薩行生忍，得無量福德；行法忍，得無量智慧。福德智慧具足，事事得如所願。以故光音宣流忍度。

　　毗梨耶雲精進。身精進，勤修善法；心精進，勤行善道。蓋欲成佛道，凡有二門：一者福德，即施戒忍；二者智慧，即實相般若。入福德門，除一切罪，所願皆得；入智慧門，不厭生死，不樂涅槃。欲入般若，要因禪定；欲修禪定，必須精進。是故光雲弘宣，起人精進度門。

　　禪那，雲思惟修。菩薩行禪時，五波羅蜜和合助成。一一禪中，行大慈悲，拔無量劫中罪，得諸法實相智，故為十方諸佛、大菩薩所念。以故光音宣演，起人禪定之門。

　　般若翻智慧。照了一切諸法，皆不可得，而能通達一切無礙，名為智慧。諸菩薩從初發心，求一切種智，當學一切法，得一切智慧。所以光音宣此，起眾生智慧之根。六度雖通四教，今是開前事理，總成純圓，理六度也。

　　慈悲音、喜捨音，此宣四無量心，四教菩薩俱修。能與它樂，名慈心；能拔他苦，名悲心；慶他得樂，名喜心；無憎無愛，名捨心。慈有三種：一、緣 眾生，觀一切眾生如父母親想。二、緣法，見一切法皆從緣生。三者、無緣，不住法相及眾生相。悲亦有三，名同於慈。今是如來四無量心故，一一名大。實能與前 人與樂拔苦，非假想也。今列二音者，慈悲是佛道根本；喜捨從慈悲上生，故分列之，以見慈悲為要耳。今光音宣說，正開前權小四心，皆成如來無緣實大四無量 心。

　　解脫音，梵名目帝羅，此雲解脫。凈名疏雲：一、真性，二、實慧，三、方便。經雲：諸佛菩薩有解脫，名不思議。若菩薩住此解脫者，能以須彌之高 廣，內芥子等，即是三種解脫不思議義。何者？菩薩解脫即是真性；菩薩住此，即是實慧；須彌內芥，即是方便。今光流妙音，正錶地藏不思議方便神通妙用。

　　無漏音，此中應說因緣四諦及三十七道品，今以無漏賅之。梵語烏波或薩遮，此翻有，有是何義？謂一切有漏法是。此不約小乘生滅四諦，以苦集為漏 因果；道滅為無漏因果。今是圓無漏；則七方便，皆名有漏。以六凡，漏落有邊；兩教二乘，漏落空邊；三教菩薩，漏落二邊。今光雲宣流真無漏音。會七方便，俱 住中道，永不漏落二邊也。

　　智慧音、大智慧音。智以窮微彰號，慧以決擇立名。列二音者，智慧音通七方便，如妙玄智妙中，所列二十種智是也。大智慧音是如來權實二智，即法華諸佛智慧甚深無量等。是也。
　　問：上雲梵語般若，華言智慧。今復列者，豈不重耶？
　　答：大品既雲，欲得道慧、道種慧、一切智、一切種智，當學般若波羅蜜。則般若能生智慧，故以此翻之。如母能生子，即以子名母之意。輔行雲：種 智般若，自具諸法，能泯諸相。則般若，自具實相等三名，而智慧不無因果、權實等二義，故不為重。今光音宣此，正開權小偏智，無非中道如實妙智。大論雲：三 世十方諸佛，身放大光明，遍照十方，破諸黑暗；心出智慧光明，破眾生無明闇冥，正是此意。

　　師子吼音、大師子吼音，梵語僧伽，翻小師子；梵名僧伽彼，翻師子，是大師子。大論雲：如師子王，清凈種中生，深山大谷中住（雲雲）。吼者，顰 申（一本作「咆哮」）也。以口扣地，現大威勢，錶師子王力。今謂師子音，為三乘說權小法；大師子吼，為別圓說大乘法。總錶無畏。新華嚴雲：譬如大師子吼， 小師子聞，悉皆勇健；一切禽獸，遠避竄伏。佛師子吼，諸菩薩等若聞，贊嘆菩提心聲，長養法身；妄見眾生，慚伏退散。大論雲：譬如師子，能令群獸懾伏。是 也。今光流衍者，謂欲宣六度等法，必具大智慧。智慧既足，作師子吼，眾生蒙潤，故以雲雷而終之。

　　雲雷音、大雲雷音。法華雲：譬如大雲，遍覆一切。慧雲含潤，電光晃曜，雷聲遠震，令眾悅豫；其雨普等，率土充洽。雲譬應身說十二部，故言慧 雲。身放大光，口震四辯，如電曜雷聲，宣註法雨，皆蒙利潤。受益差別，故雲雷不同。然皆一地所生，一雨所潤，差別即無差別，現相竟。

△

【出如是等不可說不可說音已，娑婆世界及他方國土，有無量億天龍鬼神，亦集到忉利天宮。】

　　西域記雲：索訶世界三仟大仟國土，為一佛所化攝也，舊曰娑婆。悲華雲：何名娑婆？是中眾生，忍受三毒及諸煩惱，能忍斯惡，故名忍土。又劫初， 梵王名忍，依王之名而名其土。故楞伽翻能忍。國土。梵名剎摩，正音掣多羅。此雲土田，萬境不同，亦名為剎，取莊嚴差別為名。國，域也。小曰邦，大曰國。古 之王者，建國居民，度天地之所合，定陰陽之所和，故言國土。然法身無像，豈假地以居；應物有形，故隨國而化。

　　大論明四種天：一、名天（今國王名天子，周稱天王。）二、生天（即二十八天是）。三、凈天（人中聖人）。四、凈生天（欲天諸聖人須陀洹，家家 斯陀含，色界中五種阿那含，無色一種阿那含是。）。梵名那伽，此雲龍。鱗蟲之長，能幽能明，能大能小，能長能短；春分而登天，秋分而入淵。有鱗曰蛟龍，有 翼曰應龍，有角曰虬龍，無角曰螭龍，未升天曰蟠龍。龍，天類也。故經論中天、龍併舉。五分律畜生除龍，能保綏國人，擁護正法故也。鬼神，鄭玄雲：聖人之精 氣為神，賢人之精氣曰鬼。此亦一往。故屍子雲：天神曰靈，地神曰祇，人神曰鬼。鬼者，歸也。古以死為歸。又畏也、威也。自則虛怯多畏，能令他畏其威。神 者，能也。力大者能移山填海，力小者能隱顯變化，皆鬼道攝。然他方國土，非我佛化境。何故天龍鬼神亦集？此有二意：一、由地藏分身化人，時時不廢此輩，宿 世根熟，法爾天性相關，故睹光聞音，同時來集。二、此輩得預法會，應准乘戒四句。天神同來，乘戒俱急之流；龍鬼亦集，乘急戒緩之類。併是輕報泥犁，焉得不 求度脫。其數莫窮，故雲有無量億。

△

【所謂四天王天、忉利天、須焰摩天、兜率陀天、化樂天、他化自在天。】

　　四天王天，上升（編者註：「升」疑是「界」）之元首，下界之初天。居須彌山腹，鄰於日月。帝釋外臣，即四鎮王也。釋名如後。長阿含雲，四天皆 有婚嫁，行欲同人，（根相到故）化生小兒在膝上，如五歲小兒。（忉利六歲，乃至他化如十歲。）未久，自然寶器感百味，食天甘露漿。食訖，便與諸天等量。其 六天身壽之量，應准俱捨頌：欲天俱盧捨，四分一一增，（四分之一即半裏，初天長半裏上五併半裏論增。）人間五十年，下天一晝夜，承斯壽五百，上五倍倍增。 （四天王壽五百。以人間五十年為一日。乃至他化十六仟歲，以人間仟六百年為一日。彼亦三十日為一月，十二月為一歲。）若佈施、持不殺戒、清凈小勝、厭患家 業、好樂聽法、供養善人，生四天王天。

　　忉利如前。大論雲：釋迦提婆因提，秦言能天主。人中佈施、加持、不盜戒、供養父母，及其所尊，心欲求勝，生三十三天，居須彌山頂。山頂四角有三十二天。已上二天單修上品十善，得生其中。

　　須焰摩天，大論雲：夜摩天王名，秦言妙善。以時時唱快樂，受五欲境，知時分故。此由佈施，加持，不淫戒，心意柔和，生夜摩天。復由於人間世，動少靜多，命終之後，於虛空中，朗後安住，日月光明上照不及。是諸人等，自有光明，此空居之首天也。

　　兜率陀天，新雲睹史多。大論雲：刪兜率陀，天王名，秦言妙足。於五欲知止足故。由昔佈施、加持、不四口過，好樂多聞，分別好醜，愛樂涅槃，心 著功德。命終之後，上升精微，不接下界諸人天境，乃至劫壞，三災不及。此天是補處菩薩所居。故佛地論名熹足，後身菩薩於中教化，多修熹足故。則三災不及， 約內院說。凡天外院，還受三災也。

　　化樂天，大論雲：須涅蜜陀，秦言化樂。自化五塵娛樂故。此由佈施、深心持戒、多聞、自力生活，生化樂天。

　　他化自在天，梵名婆捨跋提。以此天奪他所化而自娛樂故。由昔佈施時，清凈持戒轉深，好樂多聞，自貴情多，不能自苦，從他求樂。它所思惟，勤心 方便，化作五欲，奪而自在。故別行疏雲：是欲界頂天，假它化作，以成己樂，即魔王也。而垂裕記又雲：第六天上，別有魔羅所居天，他化天攝。經論所出不同。 已上四天空居。修十品十善，兼坐未到定，得生其中。感通傳雲：帝釋為地居天主，魔王為六欲天主。帝釋四王欲行佛法，魔不得制。
　　問：地居二天主住山頂，臣居山腹。空居四天，雲何安立？答：准大論：夜魔等諸天七寶地，在虛空中，有風持之令住。乃至凈居亦復如是。又業疏曰：第四禪上，雲居輕薄，如星散住。不同下天，如雲密合。則知下雖空居，必依雲假風，而得住持，福業所致耳。

△

【梵眾天、梵輔天、大梵天、少光天、無量光天、光音天、少凈天、無量凈天、遍凈天、福生天、福愛天、廣果天、無想天、無煩天、無熱天、善見天、善現天、色究竟天、摩醯首羅天。】

　　大論雲：欲界心散亂，行者依何地，何方便得。當依色界、無色界諸禪定，於四無量心、八背捨、八勝處、九次第地、十一切處試心，知得柔軟，自在如意不？譬如禦者試馬，曲摺隨意，然後入陣。故世出世間，以此禪為根本。

　　梵者，凈也，無欲染故。十八天皆凈無欲，此當其首，偏得梵名。梵眾是民，梵輔是臣。梵輔又名梵富樓，此雲前益天，在梵天前行，恆思梵天利益。 故大梵，即王也。故次第禪門雲：佛於仁王說十八梵，亦應有民主之異。准此，後亦例分民臣與王矣。然法苑論諸天貴賤，乃至色界之中，唯局初禪三天，有貴有 賤；大梵天是君（雲雲）。自此已上諸天，受報同等，更無貴賤。據此，則上之三光三凈，應是功行論優劣也。大論九雲：梵世天者，生處有三種：一、梵眾天，諸 小梵生處；二、梵輔天，貴梵生處；三、大梵天，中間禪生處。
　　問：離欲是同，何故貴賤異處？
　　答：初禪三種：修下禪，生梵眾；修中禪，生梵輔；修上禪，生大梵。慈行亦如是。以第一清凈心修上慈，即生大梵，主領大仟，而作世主。然通論有 萬億梵王，唯此是大仟之中，王名屍棄，秦言頂髻，得為大仟之主。（此約橫論）又初禪，內有覺觀，故外有語言，主領下地為便。若摩醯首羅，雖稱大靜王（灌頂 雲，字威靈帝。）居色界頂，報勝為主，無統王義。以上二禪，無語言法。是故諸禪，但以報勝為主，非統禦也。（此約豎論）若涅槃疏雲：娑婆世界主，正是首羅 梵王，只領小仟而已；乃古師之說，非今家正意。大論雲：有人佈施持戒，修佈施時，其心得樂，若施多，樂亦多。如是思惟，捨五欲，除五蓋，入初禪，乃至非有 想非無想天，亦如是。

　　二禪三天：少光，光明少故；無量光，光明轉增，無限量故；光音，（新雲極光）以光當語音故。大論三十三雲：如經說，心清凈優劣故，光有上中 下。諸天心清凈，佈施持戒，故身有光明。復有人於闇處燃燈，亦供養尊像塔寺，復常修慈心，遍念眾生；又修念佛三昧，念諸佛光明神德；復修火一切入；又以智 慧光明，教化愚闇邪見眾生，以是業因緣故，得心中智慧明，身亦有光。故阿毗曇論雲：諸天報身之相，皆無骨肉，亦無大小便利不凈，身放光明，無別晝夜，報得 五通，形無障礙，故知三天論光，義遍前後。三禪論凈，其義亦然。大要隨行高下，歴位淺深耳。

　　三禪三天：少凈，離喜受樂為凈，未及上位為少；無量凈，凈勝於前，不可量故；遍凈，樂受最勝，凈周普故。是三禪何故言凈？大論雲：緣凈故凈。 八色是凈法，未被練，不得凈。今三四禪法起，來觸此八色為作凈緣。三四禪等，此是色界極凈之色，用此為緣，觸八色更凈，故言緣凈故凈。是樂遍身受故，知是 三禪中凈。止觀雲：三禪樂如泉石水自中生。梵行之樂，亦復如是。二界中樂，不過三禪。夫求生天以樂為本，故以樂勝名天也。

　　四禪九天：三是凡夫住處，無想外道所居，五是三果居處。凡夫三天，經論出沒略異。如仁王雲：九梵：三凈，三光，三梵。五喜樂天，疏出無雲為 首，以沒福愛。今經與楞嚴，皆沒無雲，列福愛為第二。蓋譯師互有出沒耳。福生，以粗重相滅，凈福性生，從因彰名也。福愛，捨心圓融，勝解清凈。福無遮中， 得妙隨順。前天，以捨樂為福，今捨心轉勝，愛樂此福。與前福生淺深之別。廣果，凡夫之果，無勝過故。無想，一期中間，心想不行。故楞嚴雲：從是天中，有二 岐路。若於先心，無量凈光，福德圓明，修證而住，名廣果天；若於先心，雙厭苦樂，身心俱滅，經五百劫者，名無想天。此四勝流，一切世間諸苦樂境所不能動。 雖非無為真不動地，有所得心功用純熟，名為四禪。此中復有五不還天，於下界中，九品習氣，俱時滅盡，苦樂雙亡，下無蔔居，故於捨心眾同分中，安立居處，大 論名凈生天。色界有五種阿那含不還是間，即於彼得阿羅漢。

　　梵語首陀婆，秦言凈居天。何故名凈居天？以四禪有八種：五種是阿那含住處，是凈居；三種凡夫聖人共住。以凈居天常憐湣眾生，常勸請佛說法故。 無煩，無見思煩惱所雜，苦樂兩機，鬥心不交。故無熱，機括獨行，研交無地，違順具違，離熱惱故。無煩絕外境，無熱絕內心，淺深異耳。善見，十方世界妙見圓 澄，更無塵象，見極明徹故。善現，精見現前，陶鑄無礙，形色轉勝，善能變化故。色究竟，究竟群幾（編者註：「幾」疑是「機」），窮色性性，入無邊際，色法 最極故。

　　梵名阿迦尼咤，或名阿迦尼沙，此雲質礙。究竟，即此天也。摩醯首羅天，大論翻大自在。正雲摩訶莫醯伊濕伐羅，八臂三眼，騎白牛。然普門疏雲： 樓炭稱為阿迦尼咤，華嚴稱為色究竟天。是則摩醯首羅，即色究竟天。今別列者，如寶雨經雲：復有凈居天眾，摩醯首羅而為上首，今經別立，尊其主也。或有人以 為第六天，而諸經論，多稱大自在，是色界頂。釋論雲：過是八處，有十住菩薩住處，亦名凈居，號大自在天王，大仟界主。十住經雲：大自在天，光明勝一切眾生 故，世尊涅槃，獻供大自在天最勝。故知非第六天也。今謂他化自在，假他所作，為自受用，於境得大自在。摩醯首羅居色界頂，熏禪最勝，於定得大自在。一從勢 力，魔王自屬六天；一從禪定，尊極應居色頂。況波旬常求世尊入滅，而凈居每請如來轉輪，則自在之名固同，而自在之事永異。非第六天，斯言足徵也。婆沙雲： 凡生彼者，要是進嚮那含，身得四禪，發於無漏，起熏禪業；或起一品乃至九品，方乃得生。凡夫無此熏禪業，故不得生。楞嚴雲：此不還天，彼諸四禪四位天王獨 有欽聞，不能知見。如今世間曠野深山聖道場地，皆阿羅漢所住持。故世間粗人，所不能見也。

　　三無色天，深厭色籠，修四空定，生四空天，名無色界。以此四天只有四蘊，故得名也。輔行六上雲：從第四禪欲入空處，必作方便，滅三種色：一、 可見可對色，（色塵）二、不可見可對色，（五根四塵）三、不可見無對色，（法入少分，無錶色也），此之三色，併在色界，故滅此三。然但無粗色，非無細色。 故妙樂雲：無色雖無四大造色，定果所為，皆是墻壁，（法華經墻壁，大師喻意識）三界皆以意識維持。楞嚴雲：是四空天，身心滅盡，定性現前，無業果色，從此 逮終，名無色界。孤山釋雲：無業果色者，顯有定果色也。

△

【乃至非想非非想處天。】

　　乃至者，略辭也。此中應具列四天之名，以簡便故，故雲乃至。一、空處天，初離三種色，心緣虛空，既與無色相應，故名虛空定。二、識處天，捨空 緣識，以識為處，正從所緣處受名，故名識處。三、無所有處天，行者厭於識處無邊，於是捨之，入無所有處，亦名不用處。修此定時，不用一切內外境界，（外境 名空，內境名識。）捨此二境，故言不用處。四、非想非非想處天，此定不緣識處，故非想；不緣不用處，故非非想。此第四天，古多異解，今取止觀者，以見大師 雖未見楞嚴，凡所釋義，與經雅合。彼雲識性不動，以滅窮研，則是非想，豈非不緣識處乎？於無盡中，發宣盡性，則是非非想，豈非不緣不用處乎？又雲：如存不 存，即非想也；若盡不盡，即非非想也。故禪門雲：此定中，不見一切相貌，故言非想；若一嚮無想，如木石無異，雲何能知無想，故言非非想。如此釋義，天然吻 合，若非古佛再來，安能發此妙義。

　　近有以大師不見楞嚴，錯解法華六根，立言彈謗，寧不舌爛口中耶！輔行九上雲：若色無色二界相對，則色界名禪，無色界名定。若總以上界望於下 欲，則上二界俱名定，地下界為散。上來所釋，自四天王至非非想，雖定散有差，而生死無異，寧免三塗之輪轉，難逃七趣之升沈，雖用欣厭二門，快睹光雲諸瑞， 如鷹隼飛，同集天宮也。

△

【一切天眾、龍眾、鬼神等眾，悉來集會。】

　　此通指此界它方八部之眾結其來集也。梵雲娑婆，秦言一切。有二種：一名字一切，二實一切。今二種俱收。天龍鬼神假名也，名具五陰，實法也，眾 之為言多也。古人以公共取義眾字，故從[眾-四]目，言人所共視也。天之眾有五：一、上界天王摩醯首羅等；二、遊虛空諸天，日天子等；三、居虛空天，魔王 等；四、地居天，主藏天等；五、地下縛啰呬天等。各有無量天男天女諸眷屬也。

　　龍眾，別行疏雲：龍有四種：一、守天宮不落；二、興雲致雨益人；三、地龍決江開瀆；四、守轉輪王福藏。各有龍子孫諸眷屬也。

　　鬼神等眾，依正法念經，餓鬼大數有三十六種。准摩尼羅亶咒經，列鬼名九十三種。行因不等，受報各別。順正理明無財、少財、多財。各復有三類。 故摭華鈔名三品九類。瑜伽論謂內障、外障、無障。各有所統眷屬。今言八部者，部類不同，略言八種：一、天，二、龍，三、夜叉，四、乾闥婆，五、阿修羅（此 言無端正），六、迦樓羅，（此雲金翅）七、緊那羅，（此雲疑神，以頭有角，令人生疑。天帝絲竹之神。）八、摩睺羅伽，（此雲大腹行，地龍腹行也。）先舉 天、龍，以其位尊而力大。以鬼神賅後六部，見行劣而居卑。所以舉此者，我佛垂化，道濟百靈，說法利人，慈育萬品。出則釋天前引，入乃梵王後隨。左輔大將， 右弼金剛，三乘賢聖歸投，八部鬼神翊衛。他方者，見瑞雲而似鳥歸林；此土者，聞光音而如流赴壑。以今感而併來，由昔緣而普集也。

△

【復有他方國土及娑婆世界，海神、江神、河神、樹神、山神、地神、川澤神、苗稼神、晝神、夜神、空神、天神、飲食神、草木神，如是等神，皆來集會。】

　　此等諸神，各有攸司，或由業以實生，或因化而權示。海、江、河皆水神也。積陰之氣為水，上天為雨露，下地為江河。大論雲：一切物中，水為最 大。以大地上下四邊，無不有水。若護世天王，不節量天龍雨，又無消水珠者，則天地漂沒。又以水因緣故，世間眾生數，非眾生數，皆得生長，故水最大。然海為 百谷之王，故先舉海。海，晦也。主承穢濁，其水黑如晦也。故孫卿子雲：不積細流，無以成海。若唯據此四天下，梵名娑竭羅，此雲鹹海，四洲皆住其中。故博物 誌雲：天地四方，皆海水相通，地在其中，戎蠻夷狄，形類不同。總而言之，謂之四海。其神曰海若。山海經雲：朝陽之谷神曰天吳。是謂水伯。其為獸也，十八 尾、八首、人面、八足。莊子雲：波臣。大波之神曰陽候，濤之神曰靈胥。

　　江神，江公也。水流入中。公，共也。又訓貢所出珍物，可獻貢也。下皆據震旦言之。案水經及荊州記雲：江出岷山，其源若甕口可以濫觴。周官雲： 揚州，其川三江。漢書地理誌註雲：岷江為大江，九江為中江，徐陵為北江。蓋一源而三目，然其神，諸土難考。此方若屈原、錢镠、霍光等，江神之小者也。

　　河神，河下也，隨地下流而通也，乃水之伯，上應天漢，與江淮濟三水為四瀆。曰河宗者，四瀆之所宗也。案水經註：河源出昆侖之墟。准西域記雲： 贍部洲之中地者，阿那婆答多池（唐言無熱惱）。北面頗胝師子口，流出徙多河，繞池一匝，入東北海。或曰潛流地下，出積石山，即徙多河之流，為中國之河源。 統紀用此說。然禹貢廣覽雲：積石山非河源。記施功之處，故曰導河自積石，言自積石起也。又興起行經序雲：昆侖山者，閻浮利地之中心，阿耨大泉，外周圍山， 山內平地，泉處其中，象口所出者，則黃河是也。故廣覽雲：河出昆侖，黃河西南涵浸。（黃河多伏流。西南涵浸是其見處。）余是此說。以總圖傍註三字，曰黃河 源。以池南金象口流出信度河，入西南海，與西南涵浸合。故應指黃河為河源也。神名宓妃。（准長阿含，何緣有諸江河，因日月有熱，因熱有灸，因灸有汗，因汗 成江河。）

　　樹神，樹者，植木之總名。僧祇律：佛言：左右有樹木與人等者，便為塔廟，是故神祇樂來依止。四分律亦不許斫神樹。正法念雲：大樹夜叉羅剎之所 依止。依樹受樂，無樹則苦。若持戒人，勸不斫伐，命終生歡樂天，與天女歡樂。從天命終，若得人身，安隱巨富。其神也，應推閻浮提是南洲之樹王也。

　　山神，梵語勢羅，唐言山。逸雅訓產，說文訓宣，乃宣氣產生萬物也。然五嶽鎮地，支那之書固備七金環山；天竺之典能詳，其神隨山而名，耆阇崛山神名埤羅。

　　地神，地，底也。其體底下，載萬物也。又言諦者，五土所生，莫不信諦也。其神曰祗。（安也，大也。）亦名後土。主閻浮者，神名堅牢也。

　　川澤神，水之小者，川，穿也，穿地而流也。西徵記曰：故秦三川，即指河、洛、伊。水沃出為澤。兗州人曰掌：以水鐘聚如手掌也。又訓潤：潤萬物者，莫過乎水。其神各隨川澤立名。

　　苗稼神，說文雲：生草於田。蒼頡雲：禾之未秀，精蘊辯曰：禾始生也，從禾半出田上為意耳。舊從草，非。夫害嘉谷者，草也，去之惟恐不亟。從草立類，大害於義。又種曰稼，斂曰穡。舉一苗稼百谷通收，此土之神，應指後稷，教民稼穡之祖也。

　　晝神、夜神。晝者，正午也。聖人經天，以子午卯酉為定，聖人緯地，以東西南北為定。晝與夜相界，朝與暮相界。惟晝，大明中天，從口，指定上下 左右，而晝之界限自明，後世加聿，義反迂晦（其神如華嚴世主品）。[人/(火+月)]，明入地中，一日之終。目暗何見？賴火月之為功。從人，捨也；從火， 小明照室中也；從月，代明也。其光斜映戶內，此始夜時也。地以子夜為正，天玄正色，晝乃大亨，夜惟永貞，其天德之周流乎！其神，如善財參婆珊婆演底主夜神 等，共有九位。

　　空神，涅槃雲：物體質礙，空性虛通。小乘以明暗為體，大乘以空一顯色為體。其神，名舜若多。流（音兗）疏雲：未見誠釋，應是主空神，但無粗相之身，亦有微妙之色，故如來光中，映令暫現。

　　天神，天顯也，在上高顯也；又坦也，坦然高而遠也。五經通義雲：天神之大者曰昊天上帝，（即耀魄寶，亦曰天皇大帝，亦名太一。）其佐曰五帝。（東方青帝，威靈仰；南方赤帝，赤剽怒；西方白帝，白招拒；北方黑帝，[口+十]天紀；中央黃帝，含樞杻。）

　　飲食神，飲奄也，以口奄而引咽之也。食，殖也，所以自生殖也。故佛地論雲：任持名食，謂能任持色身，長養善法，身依食住，命托食存。其神乃竈君黃帝耳。

　　草木神，草，植物之弱者，易生而根不固，冬則盡死。故但象其莖葉叢生之形，而不著其根。木，生氣所發也，其德為仁。中直象幹，下象根氐深固， 上象旁枝分佈。凡草木茂大，必有鬼神倚附。然必尊雪山忍草、菩提樹神為宗主也。已上所列，皆舉總名，其間神數，擬若河沙。何況風火雷電，舟車房捨，衣服什 物，橋亭古廟，閭閻丘陵，故總雲如是等。莫不快睹光雲，欣聞法雨，皆來聚集天宮大會也。

△

【復有他方國土及娑婆世界，諸大鬼王，所謂：惡目鬼王、啖血鬼王、啖精氣鬼王、啖胎卵鬼王、行病鬼王、攝毒鬼王、慈心鬼王、福利鬼王、大愛敬鬼王，如是等鬼王，皆來集會。】

　　婆沙雲：有威德者名貴，無威德者名賤。又王者名貴，使者名賤。今言大鬼王，即有威德之貴者。富足充美，衣食自然，身服天衣，口餐天供，形常優縱，策乘輕馳，任情遊戲，共天何殊。此由前身大行檀故，得受威報；復由前身諂曲不實故，受鬼道也。

　　惡目鬼王，梵雲怛羅，此翻目童子也。心之神明，發見於目。竅開於肝，睛出於腎，育神於暗也。然目之美惡，由心之慈忍。此鬼心存剛愎（音辟），目放惡色。妙臂經雲：嗔目視之，乃至破壞身命。是也。

　　啖血鬼王，正法念名食血鬼。由殺生血食，不施妻子，受此鬼身。以血塗祭，方得食之。如訶利鬼母最小之子，名必利鹽迦羅夜叉，以其惡心，常食人血。十輪經雲：十三兆藥叉，怛啖諸血肉。是也。

　　啖精氣鬼王，梵名毗捨阇，此雲啖精氣。啖人及五谷之精氣，即顛鬼也。月藏經雲：地精氣，眾生精氣，正法勝味甘露精氣。是也。

　　啖胎卵鬼王。胎，始也。婦孕三月成胎，形猶未具。從月臺聲。爾時生氣未定，感於善則善，感於惡則惡；古有胎教，保之於混沌時也。卵即胞衣，如世雞卵，黃白未分，正同混沌之時。產生之候，即有無數惡鬼，啖食胎衣，如後。

　　行病鬼王，行瘟疫之使者，皆東嶽府所遣。如富單那主人間熱病是也。文殊寶藏陀羅尼經雲：於後佛法滅時，惡法增長，種種諸災流行於世；惡鬼下降，變為女身，與諸眾生，作種種諸雜等病。是也。

　　攝毒鬼王，如彌栗頭虔伽地，此雲善品。主於蠱毒，即蛇毒生。金銀毒等，皆能收攝。此即阿須倫王，諸龍毒氣，人從求願，令不幹人，故從德立名。

　　慈心鬼王。如阿羅難陀，梁言歡喜；蘇泥怛羅，此雲妙目。皆慈心鬼王之流，常以樂事施與，念念愛護眾生，故立此嘉稱。

　　福利鬼王。福與禍對，利與損對。此鬼每以利益之事與人，不降災禍損耗。鬼子母經雲：欲從鬼子母求願者，名浮陀摩尼缽。天上天下鬼，四海內車船，治生財產，皆屬其主。摩尼缽與佛，結要受戒，護人財物，故有福利之名。

　　大愛敬鬼王。愛即愛念，敬乃敬重。如妙臂經雲：若有行人修此法者，彼一切天藥叉、持明大仙乃至迦樓羅等，若有見者，恭敬禮拜，合掌作言：希有！希有！大慈悲者，湣念一切諸有情等。此善鬼王亦復如是，故有此名。

　　下總結來集如是等者，立名善惡不同，為行慈忍有異，然皆以鬼身而來聞法。止觀謂乘急戒緩者，以三塗身見佛聞經。如華嚴、涅槃，鬼神龍畜，皆預列眾。如是因果差降，升沈非一，雲何難言，理戒得道，何用事戒。幸於人天受道，何意苦入三塗。正此經列眾之指爾。

△

【爾時，釋迦牟尼佛告文殊師利法王子菩薩摩訶薩：汝觀是一切諸佛菩薩及天龍鬼神，此世界他世界，此國土他國土，如是今來集會到忉利天者，汝知數不？】

　　爾時者，正天龍鬼神畢至之時。既因果側塞，天宮及凡聖交參法會，時眾驚疑，誰能發問。故我覺皇悲心湣眾，慈眼觀機，縱目周覽，誰能酬酢。唯此文殊，久彰大智之名，堪對地藏沙劫威神之事，故特告之。

　　梵名文殊師利，此雲妙德。以了見三德法性，不縱不橫故，梵名鳩摩羅伽，此雲童真。內證真常而無取著，如世童子，心無染愛，即法王子之號也。大 論雲：文殊師利，十力、四無所畏等悉具。佛事故，住鳩摩羅伽地。什師雲：妙德以身遊方，莫知其所生；又來補佛處，故言法王子。荊溪問經稱：文殊為法王子， 其諸菩薩，何人不是法王之子？答有二義：一、於王子中，德推文殊；二、諸經中，文殊為菩薩眾首。故雲法王子。言汝觀者，非輕之也。蓋謂非汝文殊智眼，莫能 觀之。乃喜而親匿之稱。一切諸佛等，結上正報；此世界等，結上依報；如是等，結指眾數，問其能知不耶？

△

【文殊師利白佛言：世尊，若以我神力仟劫測度，不能得知。】

　　大論三十三雲：文殊菩薩等以二種神通力，果報神通，修得神通，住是中，以福德方便力，光明神足等種種因緣，開度眾生。今何雲：以我神力仟劫測度，不能得知耶？此以眾集難知，正顯地藏神力難思也。

　　問：天宮雖大，如何能容爾許之眾？答：佛與地藏有不思議神力，諸天福業自然之力。譬維摩之丈室，容獅座以何難？正法念經雲：譬如一室，然五百 燈，光明不相逼迫。諸天手中，置五百天，亦復如是，不窄不妨。又雲：彼夜摩天，或一百一仟共聚在一蓮華須同坐，不隘不窄。以善業故，自業力故。智論雲：第 三遍凈天，六十人坐一針頭而聽法，不相妨礙。諸天業力尚爾，何況如來不思議力，自應仰信也。

△

【佛告文殊師利：吾以佛眼觀故，猶不盡數。】

　　梵語多羅，梁言眼。瑜伽雲：屢觀眾色，觀而復捨，故名為眼，是照燭義。楞嚴雲：眼似蒲桃朵，或雲如秋泉池。有五種：肉、天、慧、法、佛。大論 雲：佛眼無事不知，無事不聞，無事不見；一切法中，佛眼常照。今言我以佛眼觀故，猶不盡數者。此正抑果揚因，遜己尊彼，彌顯地藏所化之眾，重重無盡也。佛 尚難知，況文殊乎！況余眾乎！

△

【此皆是地藏菩薩久遠劫來，已度、當度、未度，已成就、當成就、未成就。】

　　點出歴劫度人無量。度者，法也，亦度脫也。梵語悉地，此翻成就。逸雅雲：成，盛也。就，高也。從京從尤，尤高人所就之處。今准禮雲：天子孝曰 就，就之為言，成也。天子德被天下，澤及萬物，始終成就，則其親獲安。今地藏以出世孝道，令人人度生死河，成涅槃道，轉凡入聖，為高人登高處。故言成就， 已度，已成就，即十方世界不可說諸佛是。當度，當成就，即十方世界不可說諸菩薩是。未度，未成就，即娑婆世界十方國土無量億天龍鬼神是。所謂種熟脫三，時 時不廢；機有遲速，度有前後。大論雲：譬如搖樹取果，熟者前墮；若未熟者，更復後搖。又如捕魚，前網不盡，後網乃得也。

△

【文殊師利白佛言：世尊，我已過去久修善根，證無礙智，聞佛所言，即當信受。】

　　假文殊發問者，以諸小菩薩等，怖難未除，不能問佛。惟文殊權謀智鑒，知機知時，能激揚發動成辦利益，如大象擗樹，使象子得飽。故佛贊文殊雲： 汝今真是三世佛母，一切如來在修行地，皆曾引導初發信心，以是因緣，十方國土成正覺者，皆以文殊而為其母。然今汝身，以本願力現菩薩相，此久修善根之證 也。

　　無礙智，准佛性論，智有二種相：一者無著，見眾生界自性清凈，是如理智相。二者無礙，能通達觀無邊世界，是如量智相。今既觀雲集之眾，故用無 礙智。唐奘三藏雲：觀有不住有，觀空不住空，聞名不惑於名，見相不隨於相，心不能動，境不能隨，動隨不亂其真，可謂無礙智慧。蓋文殊原是古佛，今為輔揚法 化，權現童子之形；故於佛所說地藏度生之事，抑豈仰信諦受，自然通達無礙矣。

△

【小果聲聞、天龍八部及未來世諸眾生等，雖聞如來誠實之語，必懷疑惑，設使頂受，未免興謗。】

　　先舉疑謗之機，此顯興謗之意。良由小果惟聞諦緣，慧淺同於牛跡，根狹罔識滄溟。天龍八部，雜類下機，乘戒猶虧併運，大道安冀深知。未來眾生， 誌性不堅，業障糾纏難脫，威神測度奚知。故知參類之人，雖聞如來誠實之語，必懷狐疑惑亂，反道言雖如此，事豈誠然；外儀似頂戴受行，內心必橫生彈謗。疑謗 重愆，必墮阿毗。故須問明因地之由，闡發行願之事，方令三類之機，一心而受，則不墮闡提，永階佛道矣。

△

【唯願世尊，廣說地藏菩薩摩訶薩因地作何行，立何願，而能成就不思議事？】

　　因是種義，地錶自心。以本具三因，佛性之種，由了因未曾發心，緣因未曾加行，故性、緣、了同名正因，即理性三因也。今問此地藏菩薩創始於因地 發心，不審作何行門，立何願念，得能成就此不思議事？二何字是疑辭。良以四教菩薩，莫不修行發願，若前三教，偏權行願，俱屬生滅因緣。若以生滅心為本修 因，如何圓成果地不生滅性？故願廣說其因，令小果等信受，不興疑謗也。行、願如前必雙問者，以願是能引，行是起作。若有願無行，願則虛；若有行無願，行則 孤。由有願故行不孤；由有行故願不虛。願行相扶，證果彌速。所以雙問也。

△

【佛告文殊師利：譬如三仟大仟世界，所有草木叢林，稻麻竹葦，山石微塵，一物一數，作一恆河；一恆河沙，一沙一界；一界之內，一塵一劫；一劫之內，所積塵數，盡充為劫。】

　　大論問：雲何為三仟大仟世界？答：雜阿含中分別說。仟日仟月仟閻浮提乃至仟大梵天，是名小仟世界，名周利。（即小仟，梵名。）以周利仟世界為 一，一數至仟，名二仟中世界。以二仟中世界為一，一數至仟，名三仟大仟世界。初仟小，二仟中，第三名大仟。仟仟重數，故名大仟，二過復仟，故言三仟；合集 名百億日月，乃至百億大梵天，是名三仟大仟世界。此大仟世界在虛空中，風上水，水上地，地上人，其草木等在於地上。叢，聚也。叢木曰林。稻麻竹葦，喻有二 種：一者假以為喻，二者實事為喻。今為假喻，以此四物叢生綢致種類又多，又人常見，易於取信。山石微塵亦然，今於如是多多物中，隨拈一物中一數，作一恆 河；物既無量，河豈能窮。此約物以數河，河不可盡矣。又於一恆河沙，（有本雲一恆河滿沙）隨取一顆沙，即有一世界。沙既難窮，界豈能盡。此約一河沙以數 界，界不可盡矣。又於沙界之內，隨有一塵，即名一劫。塵既難知，劫豈可測。此約界塵數劫，劫不可盡矣。今又於一劫內所積塵數，盡將此塵併充為劫，歴時既 久，積塵自多，約如是多多劫塵以數劫，劫何能數，劫不可思議矣。如是重重喻顯，正見地藏大士自發僧那始心以來，若算師，若算師弟子，其數亦如上喻。同以靈 心巧手，擬欲算數，終莫能知之也。必舉恆河者，以沙多也。又佛生處遊行處，弟子眼見故。又四河中恆河最大，人皆以為福德吉河，入中洗者，罪垢悉除。以人敬 事此河，皆共識知。又諸河名字喜轉，恆河世世不轉，故以恆河為喻也。
　　問：恆河中沙，為有幾許？
　　答：一切算數所不能知，唯佛及法身菩薩能知。梵語劫波，秦言分別時節。有小劫、中劫、大劫不同。今約大劫言之。

△

【地藏菩薩證十地果位已來，仟倍多於上喻。何況地藏菩薩在聲聞、辟支佛地。】

　　此文先正喻大乘，二況出小果。但舉十地者，略其住、行、嚮之賢位，唯約聖證較之，此依別教論也。若約圓教，自初住以至等覺，共四十一位，皆真 因位。今且從別。一、歡喜地，從此用中道觀，破一分無明，顯一分三德。此是見道位，又無功用位，百界作佛，八相成道，利益眾生，行五百由旬，初入實相無障 礙土，初入寶所，故名歡喜。二、離垢，三、發光，四、焰慧，五、難勝，六、現前，七、遠行，八、不動，九、善慧，十、法雲。各斷一品無明，證一分中道（雲 雲）。而地藏菩薩證入如是若別若圓十地果位，迨至今日，其劫數長遠，較上界劫所積塵數之劫，又不翅仟倍矣，何況歴十住、十行、十回嚮之大乘，又何況在聲 聞、辟支佛地之小果耶。

　　聞苦集滅道四諦聲而證果者，曰聲聞。然有權實。實者，如常；權者，准十輪經，地藏菩薩與八十百仟那庾多頻跋羅菩薩，以神通力，現聲聞像，從南 方來，禮佛贊嘆。約今揆昔，寧不然乎。梵語辟支迦羅，此翻緣覺。觀緣悟道，故亦翻獨覺。出無佛世，故亦應論權實（雲雲）。此中不約大小較量，祗顯歴時長 遠，如此因地，誰能測度其久近哉。

△

【文殊師利，此菩薩威神誓願不可思議。】

　　此結降魔制外之威力神通，廣度群品之願心、弘誓，皆非小乘可測，下地能言。故十輪經：佛告好疑問菩薩雲：如是大士功德善根，一切世界天人大眾 皆不能測其量淺深。若如來廣說如是大士功德善根，一切世間天人大眾，皆生迷悶，或不信受。如是大士成就無量不可思議殊勝功德，善能悟入如來境界，於諸佛法 已得自在。為欲成熟一切有情，所在佛國，悉皆止住（雲雲）。不可思議，大論名不決定，以不能決定其化事，故名不可思議也。

△

【若未來世，有善男子、善女人，聞是菩薩名字，或贊嘆、或瞻禮、或稱名、或供養，乃至彩畫刻鏤塑漆形像，是人當得百返生於三十三天，永不墮惡道。】

　　若者，不定之辭。蓋行惡者多，行善者少，亦喜遇之言。謂倘若有修善男女，聞地藏菩薩名而修敬者，必當永得福堂矣。此不局在家二眾，如十輪稱地藏為善男子，則七眾三乘，皆可稱之。以諸惡莫作，眾善奉行，凡在佛法，孰不遵行。

　　聞菩薩名等，聞名成種，有感乃應。譬洪鐘在架，有扣則鳴。釋名如綸貫，字乳化也。男有室，女有家，而後生育，從[字-子]（音綿，似屋捨 也。）從子，會意也。今借為名字之字古者相語名之質也，周人尚之，以字文矣。然菩薩名字，雖從德立，亦假施設。大品雲：般若波羅蜜但有名字，菩薩亦但有名 字，是名字不在內外中間，和合故有，不生不滅，但以世間名字故說。故知此名字本來是空。既知空寂，則感應道交。故聞是菩薩名字，或以言詞而贊嘆，或瞻勝相 而禮拜，或專稱名字，或虔修供養，或精施五彩而繪畫，或巧斫諸木而雕鏤，或假凈土而範塑，或借膠漆而飾塗，成其形像而恭敬之。是人於當來世，必得百返生三 十三天，永不墮三惡道處。

　　三十三天有二說。准正法念經：忉利翻三十三，此是欲界中地居一天，若於此百返而生，則位卑處狹，奚能顯地藏不思議威神誓願。應准灌頂咒經所列 三十三天，始合經文。所謂近際、普觀、快見、無結愛、色究竟、凈光、普等、愛勝、福愛、極妙、廣妙、微妙、守妙、凈明、遍凈、約（凈，水應梵，水無量梵） 水微梵、水行梵、摩訶梵、梵輔祿、梵眾妙、化自在、化應聲、不憍樂、兜率、陀鹽摩羅、忉利、毗沙門、惟睒聞、毗樓勒、提頭賴叉，此就欲色二天，自四王而 上，至五凈居。復從五凈居而下，至四天王，中間次第歴生，各盡本天之壽。如是百返，極受天樂。修因少而受報多，歴時近而享福遠。方顯地藏神力不可思議。為 若此抑，豈生天受福，且能永離惡道。當知圓人如住胎王子，一聞名塑像，即生天離惡，所謂十善菩薩發大心，長別三界苦輪海。正今經之旨也。

△

【文殊師利，是地藏菩薩摩訶薩於過去久遠不可說不可說劫前，身為大長者子。時世有佛，號曰師子奮迅具足萬行如來。】

　　此敘最初發心之由。前字可作下句之首，不若為上句之末更妙。大長者，西土年耆德艾之通稱。如春秋末，吾邦有鄭長者。西國豪族，鹹稱長者。法華 文句具明十德。一姓貴，（皇帝之裔，貂插之家）；二位高，（輔弼丞相，鹽梅阿衡）；三大富，（銅陵金谷，豐饒侈靡）；四威猛，（嚴霜隆重，不肅而威）；五 智深，（胸如武庫，權奇超拔）；六年耆，（蒼蒼棱棱，物儀所伏）；七行凈，（白圭無玷，所行如言）；八禮備，（節度庠序，世所式瞻）；九上嘆，（一人所 敬）；十下歸，（四海所歸）。具斯十德，方稱長者。

　　子者，尊稱也。如此方孔老稱子等。非長者所生之子也。

　　師子奮迅，借喻佛名，非實師子。如師子，四足獸中獨步無畏，能伏一切。佛亦如是，於九十六種道中，一切降伏無畏，故名人師子。

　　奮，振也；迅，疾也。借譬顯法，如世師子。奮迅為二事，一為奮卻塵土，二能前走卻走捷疾，異於諸獸，此三昧亦爾。一則奮除障定微細無知之惑， 二能出入捷疾無間也。具足萬行者，大品雲：一心具萬行是也。一即一切，名具；一切即一，名足。既除障定之惑，出入三昧捷疾，則一中具無量，無量中具一。故 知師子奮迅三昧，得能具足萬行。若初心行人，攬果成因。如涅槃雲：金剛寶藏，具足無減，但有淺深明昧之殊。

△

【時長者子，見佛相好，仟福莊嚴。因問彼佛，作何行願，而得此相。】

　　見佛等者，乃邂垢途中，見應佛相好，與止觀觀佛相好發心同。所謂若見如來，父母生身，身相昺著，相好纏絡，上求下化，發菩提心是也。攬而可別名相，觀之可愛名好。相為大相海，好為小相海。相若無好，則不圓滿。好若無相，則不炳著。相、好互嚴，法身圓顯。

　　仟福者，以善有漏身口意業，修行六度，成百福德；用百福德，成一相，以為三十二相之業因。輔行雲：菩薩修十善，各有五心，謂下、中、上、上 上、上中上。初發五心，乃至具足五心。如是百心，名為百福。然福義多途，難可定判。有雲：大仟盲人治瘥為一福等。凡用三仟二百福，修成三十二大人相。故言 仟福莊嚴。大論雲：以三十二相、八十隨形好莊嚴，內有無量佛法功德，故視之無厭。見佛身者，忘世五欲，萬事不憶。若見佛身一處，愛樂無厭，不能移觀。佛身 功德如是。故長者見之，極生歡喜，渴仰情深，因問彼佛。夫此相好，乃佛身報果，果必由因，不審作何行願，能得此殊妙之相也。

△

【時師子奮迅具足萬行如來告長者子：欲證此身，當須久遠度脫一切受苦眾生。】

　　此示求相之法。此三十二相，即大悲之果報。故須度脫眾生，為相好本。此是諸大乘經廣明菩薩歴劫修行之相。既時長行遠，次第隔歴，即大乘別教修證之法。涅槃雲：四諦因緣，有無量相，非聲聞、緣覺所知。故雲久遠。
　　問：地藏發心既別，今何判教同圓？
　　答：發心本圓，借別為詮。維摩雲：雖知諸佛國及與眾生空，而常修凈土，教化於群生。諸有眾生類，形聲及威儀，無畏力菩薩，一時能盡現。等，行別心圓，明文在茲，然分圓即別融，別即圓義，非一[既/木]也。

△

【文殊師利，時長者子因發願言：我今盡未來際，不可計劫，為是罪苦六道眾生，廣設方便，盡令解脫，而我自身，方成佛道。】

　　此騰昔長者發願之辭。我今二句，標度生時。為是罪苦句，明所度機。廣設四句，示所發願。罪苦六道者，法華經雲：見六道眾生，貧窮無福慧人，入 生死險道，相續苦不斷。以雖分善惡，均不免生老病死之苦。廣設方便，出假要事。止觀雲：入假因緣，略言有五：一、慈悲心重，二、憶本誓願，三、智慧猛利， 四、善巧方便，五、大精進力。若對今文，一一具足，機既不一，法亦多門。故須廣設方便，令四門皆入。解脫言盡令者，如小般若雲：若胎卵濕化等，我皆令入無 余涅槃。是也。普曜曰：無五趣、五陰、六衰，則是泥洹，正今經之意。而我方成佛道者，楞嚴雲：自未得度，先度眾生者，菩薩發心也。止觀五，應略釋於此。若 如此要心，雖在生死煩惱，不能損我智慧，遮障留難，彌助化道矣。

△

【以是於彼佛前，立斯大願，於今百仟萬億那由他不可說劫，尚為菩薩。】

　　華嚴經賢首菩薩雲：若有菩薩初發心，誓求當證佛菩提，彼之功德無邊際，不可稱量無與等。何況無量無邊劫，具修地度諸功德，十力一切諸如來，悉 共稱揚不能盡。以此菩薩，聞圓法，起圓信，立圓行，住圓位，以圓功德而自莊嚴，以圓力用建立眾生。初心尚爾，況中後心。故四教義雲：所以一家講經說法，必 須委釋初心，若賢聖深位，但點章而已。學佛道者，不可不知也。

△

【又於過去不可思議阿僧祇劫，時世有佛，號曰覺華定自在王如來。彼佛壽命四百仟萬億阿僧祇劫。】

　　阿僧祇或阿僧企耶，此雲無央數。（央，盡也。）地持雲：一者，日月晝夜，歲數無量；二者，大劫無量，名阿僧祇。劫義如前。然如此不思議阿僧祇 劫，我佛觀之，猶如今日。宿命智力，叵思議矣。如昔分和檀王與佛捔智。佛告王曰：海水研墨，斫樹為筆，寫我所知為經。若海水幹盡，樹枝了索，吾經不盡。所 以爾者，佛有三達之智，來今往古，靡不通焉。是以過去塵點劫事，如觀手中庵摩勒果。

　　覺華定自在王，以定立名。維摩雲：覺意凈妙華。覺即本覺之性。肉團心形似蓮華，而有八葉，即錶八識心王，每葉各一如來。如來藏經雲：佛觀一切 煩惱心中，有如來結跏趺坐，儼然不動，德相具足。此乃天然性德，含生本具，迷之即凡，悟之即聖。彼佛因中，常於三昧觀此覺華。佛佛在定，覺性圓顯，心華頓 開。或於一根入正受，諸根起出說；或於諸根入正受，一根起出說；或一根雙出入，或不出入；或一根一塵即出入，即雙出入，即不出入。乃至余方亦復如是。若依 若正，得大自在，即三昧之王，故號覺華定自在王如來，即第一義諦名如，正覺名來，之報身佛也。

　　彼佛壽命等。凡佛必論三身，各詮量壽命。法身非壽非不壽，非量非不量。今既論劫數，則非法身矣。應身數數現生現滅，今既言四百萬億阿僧祇劫， 則非應身矣。此約報身。境智相應名壽，智慧為命，以如如智，契如如境，境發智為報，智冥境為受。境既無量無邊，常住不滅，智亦如是，函大蓋亦大。所雲：我 智力如是，久修業所得，慧光照無量，壽命無數劫。此是詮量報身智慧之命，故彼佛壽命如此久遠耳。

△

【像法之中，有一婆羅門女，宿福深厚，眾所欽敬，行住坐臥，諸天衛護。】

　　此騰彼佛滅後，像教堅固之時。像者，形像肖似也。韓子雲：象者，南方大獸，中國不識。但見圖寫者，故借義訓，為形似也。別作像非。然相沿既久，難可改張。

　　婆羅門，普門疏翻凈行。劫初種族山野自閑，故人以凈行稱之。女梵名摩那，此雲女，處子也。此句標類，下句嘆德。宿福深厚，明往因勝。大論雲： 果報名為福。略說三種：一、佈施福，與慳心相違故；二、持戒福，與惡業相違故；三、修定福，與欲界嗔亂相違故。此聖女宿修三福深厚故，致親戚宗黨家人鄰裏 鹹所欽服恭敬。法華雲：端正有相之女，宿植德本，眾人愛敬。是也。抑豈人所欽敬，凡於四威儀中，一切諸天神鬼，無不翊衛擁護。蓋福以悲敬為初。悲則哀苦趣 之艱辛，思拔濟而出離。敬則識佛法之難遇，弘信仰而澄神。是則雖處少年女品，已具大士願心，故感諸天衛護耳。

△

【其母信邪，常輕三寶。是時聖女，廣設方便，勸誘其母，令生正見。】

　　信者，心之實。五常百行，信則實有是理；不信亡之。彼既信邪，正信亡矣。邪者，邪見，心遊理外也。既內執邪見，故外輕三寶，成一闡提，造五無 間。純陀問佛：一闡提者，其義雲何？佛言：若有四眾，發粗惡言，誹謗正法，言無佛法眾，不信因果，不信業報，不親善友，不隨諸佛教誡，名一闡提。蓋一闡名 信，提名不具，信不具故，名一闡提。信既不具，自然常輕三寶，罪業深厚矣。聖女知母邪行，必沈苦海，於是繾綣左右，殷勤旦暮，廣說巧法，勸化誘掖，必令常 存正見，信重三寶，以免後苦。蓋正見，八正道之首也。

△

【而此女母，未全生信。不久命終。魂神墮在無間地獄。】

　　梵語阿摩，此雲女母。暫從勸誘而略信，仍蹈舊習而還邪，惡業既深，信心自闕。不久之間，大命終矣。夫為善生天，為惡入淵。惡業成熟，八識魂神，隨業而墮無間。佛說呵鵬阿含雲：白衣不信佛語者，便當墮泥犁中。泥犁終不呼人，人自循業發現耳。

△

【時婆羅門女，知母在世，不信因果，計當隨業，必生惡趣。遂賣家宅，廣求香華，及諸供具。於先佛塔寺，大興供養。】

　　知字乃救母根源。夫善惡相翻，罪福敵對，惡名俯墜，善謂清升，故罪惡之法，不可弗除；福善之功，無宜不造。弘善，示天堂之快樂；懲非，顯地獄 之辛酸，無奈邪見者，起斷滅之見，撥因果之談。此癡病為其原。以愚癡之人，不識因果，妄起邪見，破善惡法，名斷善根，決定當墮阿鼻地獄。今聖女知母在世之 時，癡病既重，常輕三寶，計其死後，必隨業而生惡趣矣。梵語阿波那伽低，此雲惡趣。此明罪母業重。下明救母之法。夫人之有家宅者，所以為安身也。今為救 母，何暇惜身，故變賣營資，廣求供物。香華申供之首事，錶誠之初門。香能辟穢，華具圓因。天人費氏雲：人中臭氣，上熏於空；諸天清凈，無不厭之。但以受佛 付囑，諸天不敢不來。故佛法中，香為佛使。香華既備，肴膳斯陳，懸幡蓋以飄揚，列珠瓔而[糸+宣]爛。於覺華定王先佛塔寺，興法界廣大供養。塔婆是梵名， 乃瘞佛骨之所。寺訓為嗣，治事者相嗣續於其內也。亦是攝十方一切眾僧，修道境界法耳。

△

【見覺華定自在王如來，其形像在一寺中，塑畫威容，端嚴畢備。時婆羅門女，瞻禮尊容，倍生敬仰。】

　　此言詣寺興供，舉頭見像，金容晃昱，嚴顯可觀，瞻禮之際，敬仰倍恆。須知瞻禮佛像，功德難思。如觀佛三昧經雲：過去有佛，號寶威德上王如來， 時有比丘，與九弟子，往詣佛塔，見一寶像，禮已贊嘆。後時命終，悉生東方寶威德上王佛國，大蓮華中忽然化生，凈修梵行，得念佛三昧海。佛為授記，各得成 佛。今東方善德佛是其師，九方無憂德佛等，是九弟子。

　　又空王如來涅槃後，有四比丘，同學佛法，煩惱覆心，不能堅持。多不善業，當墮惡道。空中有聲語比丘言：汝等今可入塔觀像，與佛在世，等無有 異。聞空聲已，入塔觀像，眉間毫相。即作念言：如來在世，光明色身，與此何異。佛大人相，願除我罪。由入塔觀像，毫相懺悔因緣，後八十億阿僧祇劫，不墮惡 道；常見諸佛，授記成佛。今東方阿閦、南方寶生、西方無量壽、北方微妙聲，即四比丘是。以是因緣，行者應當數數觀佛。故知聖女興供觀像，罪母生天無疑矣。

△

【私自念言：佛名大覺，具一切智。若在世時，我母死後，儻來問佛，必知處所。】

　　私者，內自懷念，人所不知也。心念佛者，如大夢覺。於一切法，知見無礙，為最第一，名一切智。假若佛猶住世，我母已死，儻來問母生處，升沈高下，男女尊卑，必蒙垂慈指示，有以慰我也。

△

【時婆羅門女，垂泣良久，瞻戀如來。忽聞空中聲曰：泣者聖女，勿至悲哀，我今示汝母之去處。】

　　初敘聖女苦心。無聲出涕曰泣，哭之細也。瞻，仰視也。戀，眷慕也。泣久瞻戀不去者，冀佛必示我母生處而度脫也。決定毗尼經，佛告捨利弗：若除如來智慧，更無余乘而得度脫，到於涅槃，能示眾生解脫之道，能令眾生遠離邪道，示現聖道，以是義故，故名如來。

　　今故瞻戀，冀以應我。次述空聲慰諭。恰當垂泣瞻戀之際，倏忽之間，空中有聲而慰之曰：聖女勿至悲泣而哀戀也。汝既行大孝，傾家興供，泣戀瞻依，冥冀感通，示母生處。我名大覺，具一切智者，當示爾母去處，何用悲哀不置乎。

△

【婆羅門女合掌嚮空，而白空曰：是何神德，寬我憂慮。我自失母已來，晝夜憶戀，無處可問，知母生界。】

　　合掌嚮空者，感之極，喜之至也。如失物者指之復得，失路者引之再歸耳。神，義如題。德者，固有之善，直心為德，性命本來之正，故順天而為神，皆聰明正直者。寬，廣也，舒也。昔由憶母生界，憂慮如物礙膺，今聞空聲示處，如物出胸，寬廣舒泰也。

△

【時空中有聲，再報女曰：我是汝所瞻禮者，過去覺華定自在王如來，見汝憶母倍於常情眾生之分，故來告示。】

　　有聲而不現相者，顯生而不生也；無相而有聲者，示滅而不滅也。憶母倍常，贊其至孝。故感佛告示。然母死而子憶，亦分所當然者。方子在胎，母有 十月懷耽之苦；及兒既生，母有三年乳哺之勞。毛詩曰：哀哀父母，生我劬勞，無父何怙，無母何恃，出則銜恤，入則靡至。父兮生我，母兮鞠我，拊我畜我，長我 育我，顧我復我，出入腹我。欲報之德，昊天罔極。故曾子曰：身也者，父母之遺體也。既與父母一體，母既死而不還，子寧不思母之憶我而返憶乎。但聖女之捐家 興供，禮佛求知，藉施福以薦親，仗佛慈而示處，固非常情所能企及。故佛現空聲而告其生界。嗚呼！純孝動天，致誠感佛！觀今聖女，其洵然矣！

△

【婆羅門女聞此聲已，舉身自撲，支節皆損，左右扶侍，良久方蘇。而白空曰：願佛慈湣，速說我母生界。我今身心，將死不久。】

　　情發於中，聲感於外，舉身撲拜，如太山崩，急欲知母生界，何暇顧惜形骸。遂致支體骨節悉損壞，而悶絕矣！左右扶侍。左者天道之所起，地道之所 止也。近取諸身，象輔手之形。左不得勢，因取僻遠之義；右手得勢而順，用力為多。復加以口，交相助益之意。蓋侍婢原不離左右者，故隨即扶起而侍奉也。蘇 者，死而更生也。黃庭經雲：臨絕呼之亦復蘇。俗作蘇，非。此經家敘事。下求說生界，然敦逼速說者，自知形殘心苦，將死不久也。

△

【時覺華定自在王如來告聖女曰：汝供養畢，但早返捨，端坐思惟吾之名號，即當知母所生去處。】

　　早返捨者。返，還也。約事，令其速還家捨；約法，捨錶五陰，令即還觀五陰，則心王智度之母，直下自現，故即雲端坐思惟。端坐者，即金剛正坐，或全跏或半跏也。禪那雲：思惟修，意令修念佛三昧。故坐思我名，即知母生處矣。

△

【時婆羅門女尋禮佛已，即歸其捨。以憶母故，端坐念覺華定自在王如來，經一日一夜。】

　　尋禮即歸，錶翻迷為悟之疾也。念是觀慧，覺華是心佛，所以觀此者，母即心母，佛即心佛。心也、母也、佛也，一而三，三而一者。孰為吾心，孰為 佛、母哉。普賢觀雲：若欲懺悔者，端坐念實相，眾罪如霜露，慧日能消除。故日錶聖女之悟，朗照如晝；夜錶罪母之迷，暝闇如夜。一總錶心迷悟之本。罪母信 邪，無明覆心，合塵背覺也；聖女興供，正智入心，合覺背塵也。心本是一，迷悟分岐也。

△

【忽見自身，到一海邊，其水湧沸，多諸惡獸，盡復鐵身，飛走海上，東西馳逐。見諸男子女人百仟萬數，出沒海中。被諸惡獸爭取食啖。】

　　此明定中見冥界之相。自到海邊，神從定出。海水湧沸，惡獸飛馳，皆識心似境，循業而發。此由眾生事識造罪，致斯苦報。楞伽雲：譬如巨海浪，斯 由猛風起，洪波鼓溟壑，無有斷絕時。得非藏海鼓風起浪，今感業海湧如沸湯。惡獸夜叉亦由業感，以生前縱貪嗔癡，具造殺盜淫妄，故至地獄，境界自現。若達境 心空，海亦自寂，心境俱寂，事無不照。猶如大海無風，森羅煥然明白。寶積經雲：一切法虛妄如夢，以唯念故。故知若達唯心，諸境如幻化矣。

△

【又見夜叉，其形各異，或多手多眼，多足多頭，口牙外出，利刃如劍。驅諸罪人，使近惡獸。復自搏攫，頭足相就，其形萬類，不敢久視。】

　　夜叉名疾捷，即地獄鬼。其頭如牛馬獅象虎豹豺狼，形形各異；或有二手，而至仟手者。或有一眼，而至仟眼者。頭足例之，口牙叉出嚮外，唇皮倒縮 露根，錯利如刃，鋒铓似劍。法苑雲：牛頭惡眼，獄卒兇牙是也。驅罪近獸，令其食啖也。搏，（伯各切，從甫。與從專不同。）手擊也；攫，（丘縛切，匡入聲。 又，厥縛切，義同。）爪持也，撲取也。莊子雲：左手攫之。此言夜叉等不惟驅罪人近惡獸令啖，復以手擊爪持，令罪人頭足相就，為團縮之形；然於罪人，戲弄其 身，或時令大，或時令小，或按蹙而短，或扯拽令長。擲拋豎倒，頃刻萬類，可久視乎！此乃從心變起，無有真實。如正法念經雲：閻羅罪人，非是眾生；罪人見 之，謂是眾生。手中執持焰然鐵鉗。彼地獄人，惡業既盡，不復見於閻羅獄卒；如油炷盡，則無有燈，業盡亦爾，不復見於閻羅獄卒。今眾生惡業未盡，自然無中妄 見也。

△

【時婆羅門女，以念佛力故，自然無懼。】

　　以，因也。因念佛之力，雖見眾形，自然無懼。蓋知諸境由心，心由境現；心既本空，境亦何有？心境既亡，懼自何生？心地觀佛告文殊雲：譬如叢林 蒙密茂盛，師子白象虎狼惡獸潛住其中，毒發害人，迥絕行跡。時有智者，以火燒林，諸大惡獸，無復遺余。心空見滅，亦復如是。又摩訶衍寶嚴經雲：譬如畫師， 作鬼神像，即自恐懼。如是迦葉，諸凡愚人，自造色聲香味細滑之法，輪轉生死，不知此法，亦復如是。今聖女了一切法從意生形，因心現相。知心如幻，無有定 儀，所見差殊，隨心生滅，既知如幻，亦奚畏懼乎。

△

【有一鬼王，名曰無毒，稽首來迎，白聖女曰：善哉菩薩！何緣來此？】

　　毒，害也。世有害人草，名荼莽。（冶葛之屬）法之害人者，名三毒。此鬼存心湣物，權現鬼身，心無毒害，彰此嘉名。然前有攝毒，後有惡毒，毒名 雖同，用意各別。原其利人，無有異也。禮雲：煦之嫗之，春夏所以生長也；霜之雪之，秋冬所以成熟也。莫非天之教也。稽首，以首至地，稽留少頃。鬼王拜迎 者，觀其形相非凡，威儀出類，諒非負罪而來，必是乘通而至。故言善哉！菩薩，何緣來此？梵名娑度，此翻善哉。乃歡喜王菩薩法門。若行人日日於佛前稱念仟 遍，得心清凈，得一切如來稱贊，所有諸法皆得成就。詳於施食詮次香乳記。

△

【時婆羅門女問鬼王曰：此是何處？無毒答曰：此是大鐵圍山西面第一重海。】

　　先，聖女問是何處者，驚疑之詞。以異乎平時之所見也。次，鬼王答。梵語柘迦羅，翻輪山。舊雲鐵圍，圍即輪義。准長阿含起世經等，四洲地心，即 是須彌山。山外別有八山，乃至其外鹹海，廣於無際。海外有山，即是大鐵圍山。依立世阿毗曇論雲：大鹹海外，有山名曰鐵圍，入水三百十二由旬，出水亦然，廣 亦如是。從閻浮提南際，取鐵圍山，三億六萬六百六十三由旬。從鐵圍山水際，極西。鐵圍山水際逕度十二億二仟八百二十五由旬，鐵圍山水際周回三十六億八仟四 百七十五由旬。第一重海，在其中也。

△

【聖女問曰：我聞鐵圍之內，地獄在中，是事實不？無毒答曰：實有地獄。】

　　初，聖女問：我聞經中說，鐵圍山內有地獄，實耶？不耶？次，鬼王答：此真實非虛。良由地獄本虛，人自實之耳。如鐵城泥犁經，佛誡諸沙門言：我 以天眼視天下人，生死好醜，得好道者，得惡道者。人於世間，身作惡，口言惡，心念惡。常好烹殺，祠祀鬼神者，身死當入泥犁中。豈非自實地獄乎。

△

【聖女問曰：我今雲何得到獄所？無毒答曰：若非威神，即須業力。非此二事，終不能到。】

　　初，聖女驚疑，自念地獄者，拘罪人之狴牢也。吾自揣於心，敬信三寶，一身無罪。何緣我今亦到此地獄處耶？次，鬼王答：凡到此者，有二種人：一有威德神通者，或為救度，或為遊觀。二或有惡業成熟，應受地獄，是故到此。除是兩端，終無有能到此者。

△

【聖女又問：此水何緣，而乃湧沸，多諸罪人及以惡獸？】

　　此述初到海邊，所見境界。海水是總問，何緣是疑詞。一、疑何緣此水湧沸。二、疑何緣水中多諸罪人。三、疑何緣海邊水內多諸惡獸。准首楞嚴，皆 是彼諸眾生自業所感，造十習因，受六交報。水之湧沸，由於慢習，發於相恃，馳流不息，故有騰逸奔波。積波為水，亦由誑習，交欺致有，沒溺騰擲，飛墜漂淪。 諸事惡獸，由觸報招引惡果，故致神識見大鐵城、火蛇、火狗、虎狼、師子等是也。

△

【無毒答曰：此是閻浮提造惡眾生新死之者，經四十九日後，無人繼嗣，為作功德，救拔苦難。生時又無善因。當據本業所感地獄，自然先渡此海。】

　　閻浮提者，長阿含經雲：須彌山南，有天下名閻浮提。其土南狹北廣，縱廣七仟由旬。有大樹王，名閻浮提，圍七由旬，高百由旬，枝葉四佈五十由旬。起世經小異。

　　造惡眾生，即具造十惡者。梵語鳩那羅，此雲惡人，亦不好人。能滅諸根名死，故涅槃雲：死者，捨所受身。有二種：一者，命盡死。有三：一、命盡 非是福盡，二、福盡非是命盡，三、福命俱盡。二者，外緣死。亦有三：一、非分自害死，二、橫為他死，三、俱死。復有三種死：一、放逸死，二、破戒死，三、 壞命根死。

　　四十九日等，准瑜伽論：人死中有身。（中有即中陰身，若極善者，即生凈土及與天上，極惡即入地獄，皆不經中陰。若善惡不定，即受中陰經冥司 也。）若未得生緣，極七日住，死而復生；如是展轉生死，至七七日，決定得生。若有生緣，即不定。釋氏要覽雲：今人亡，每七日必營齋追福，謂之齋七。令中有 種子不轉生惡趣也。今既經七七之後，畢竟無人繼續承嗣為作功德，令其滅惡生善，其誰救拔苦難？此言死者無人為追冥福，必致墮苦。次言死者生時自不修毫善， 必致墮苦。以致冥王考校善惡，據定本時所作之業，應墮地獄者，必至地獄矣。那先比丘所問經雲：人所作，善惡隨人，如形影隨身，人死但亡其身，不亡其行。譬 如然火夜書，火滅字存，火至復成。今世作行，後世成之。是也。自然者略，無假借勉強之意。閻王責罪人雲：罪自由汝，今當受之。正法念雲：汝邪見愚癡，癡罥 所縛人，今墮此地獄，在於大苦海。故曰自然先渡此海。

△

【海東十萬由旬，又有一海，其苦倍此。彼海之東，又有一海，其苦復倍。】

　　前言鐵圍西面第一重海，已含此二重也。其苦倍倍增者，泥犁經雲：堿水泥犁，縱橫數仟裏，水鹹如鹽熱沸踴躍。水中有鳥，喙如鐵生，啄人肌，咬人 骨，人不能忍是痛，便度水去。守泥犁鬼言：死惡人，汝何等求索？人言我苦饑渴。鬼即以鉤，鉤其上下龂，（音銀，齒根肉。）口皆挓開；復以消銅灌入口中，唇 舌咽腹皆燋盡，銅便下去。其人不能復忍，還入沸堿水中。其人平生於世間作惡甚故，求解不得解，隨波上下，回澓沈沒，其苦倍增，可勝言哉。

△

【三業惡因之所招感，共號業海，其處是也。】

　　三業惡因，即身口意三之十惡業也。由此因故招報獄海。然招者自招，感者自感。興起行經雲：先世自造此緣，要當受之，無可逃避處。此對亦非父 作，母作，王作，天作，亦非沙門婆羅門所作，本我自造，今自受之。故佛教眾生有二要：一者，作是得是；二者，不作是，不得是。三界五道，罪垢苦惱，不離於 作；一切無橫，所作罪福，如影隨形，如響應聲，不失如毛發者也。故此三處，皆號業海。聖女昔所耳聞，今身到其處也。

△

【聖女又問鬼王無毒曰：地獄何在？無毒答曰：三海之內，是大地獄，其數百仟，各各差別。所謂大者具有十八，次有五百，苦毒無量。次有仟百，亦無量苦。】

　　初，聖女問，既言鐵圍山內，實有地獄；今何唯見業海，不審地獄又在何處？次，鬼王答曰：三海之內，即是大地獄。豈捨此而別有耶！既由眾生從藏 海鼓風，起三毒波浪，故感地獄，即在三海之內。然考諸經論，地獄以三類攝盡。一熱、二寒、三邊。八熱獄在閻浮洲下，重纍而住，受熱苦惱；八寒獄在鐵圍山 底，仰嚮居止，受寒凍苦；邊獄有三：山間，水間，曠野。受別業報，此應寒熱雜受。

　　今既言大獄十八，又言五百仟百，何耶？蓋是約定處，如上所明。約不定處，不妨邊正同舉，寒熱雜受。不然，地獄正邊，何以別乎？三海等是總標， 八寒八熱各有十六遊增。略則各百三十六，廣則數有百仟。各各差別者，作業各有輕重。重者遍歴，中者不遍，下者復減。經劫亦有長短故也。所謂下，別釋。大者 十八，有二釋：一准問地獄經雲：十八王者，即主領十八地獄。是一迦延典泥犁，乃至十八觀身典洋銅，則獄名典主，局定十八之數。若觀佛三昧海經雲：阿鼻地 獄，有十八小地獄，小地獄中，各有十八寒冰地獄，黑暗、小熱乃至飲銅各有十八。如是阿鼻大地獄中，有此十八地獄。一一獄中，別有十八隔。（統紀是鬲，郎的 切，鼎屬）始從寒冰，乃至飲銅，總三百四十二隔地獄。今謂彼經以阿鼻為最大，故以各有十八為小。今雲大者具有十八，或不對阿毗，故各名大。例如世間諸王， 不對天子，各稱大王；若對至尊，則稱小王矣。經出不同，不須強釋。次有五百，亦是定數。而觀佛三昧經乃雲：五百億劍林地獄、刺林、銅柱、鐵機、鐵網，各五 百億。則兩經之數迥別，亦不須強會也。

　　苦毒無量者，准泥犁經，佛言：欲知勤苦最不可忍者，獨有泥犁。泥犁者，極苦不可具言。如世逆賊，為長吏所捕，將至王前，被三百矛，寧毒痛不？ 比丘答曰：人被一瘡，舉身皆痛；何況被三百瘡。佛言：泥犁中痛，與矛瘡痛，億億萬倍，尚不如泥犁痛。地獄之中，獄鬼加痛，毒無不至也。仟百獄亦無量苦者， 較五百獄，其苦稍減，比世間苦，萬分不及，苦有無量矣。通問地獄有無竟。

△

【聖女又問大鬼王曰：我母死來未久，不知魂神當至何趣？】

　　四分律雲：一切諸世界，無有不老死，眾生是常法，生生皆歸死。我母死雖未久，竟不知魂神今至何趣？祭義曰：氣也者，神之盛；魂也者，鬼之盛。 道經雲：魂者，氣之神；魄者，精之神。陽神日魂，陰神月魄。吾教指第八識。法句經雲：是身為死物，精神無形法，自作受苦樂，身死神不喪；識神造三界，善不 善三處，陰行而默至，所往如響應。故知必隨業而趣矣。

△

【鬼王問聖女曰：菩薩之母，在生習何行業？聖女答曰：我母邪見，譏毀三寶，設或暫信，旋又不敬。死雖日淺，未知生處。】

　　行名進趣，業謂造作。即三業構造善惡事也。法句雲：隨其所造業，罪福有果報，惡業墮地獄，善業生天上，高行生善道，得無漏涅槃。

　　不審菩薩之母，於此三業，作何業耶？聖女答言：我母著於邪見，譏毀三寶。成論雲：寧止不行，勿行邪道；身壞命終，墮於惡趣。且又存心不恆，立性無定，偶爾聽勸而暫信，忽焉循邪而譏毀。今死雖日淺，計必隨墮業苦。故吾急欲求知生處而未能也。

△

【無毒問曰：菩薩之母，姓氏何等？】

　　姓者，所以繫統百世，使不別也。氏者，所以別子孫之所由生也。印士族姓四流：一剎帝利，王種也；二婆羅門，凈行也；三吠奢，（舊雲毗捨）商賈也；四戌陀羅（舊雲首陀），眾人也。前二是貴，後二是賤。今不審菩薩之母何姓何氏？為賤為貴？姓氏明而稽查易，故必問乎姓氏也。

△

【聖女答曰：我父我母俱婆羅門種。父號屍羅善現，母號悅帝利。】

　　父甫也，始生己也；母，[曰/月]也，含生己也。既俱婆羅門種，自然執邪謗正。西天外道，專執婆羅門種第一最尊。如梵誌頞波羅延問種尊經雲： 本初起地上人時，皆是我曹婆羅門種。我曹種最尊，初從口中出，世人從下出。我種是第七梵天子孫。佛反言天下一種，持我曹種與剎利、田家、工師種等。我曹死 皆生梵天，佛反持我曹與凡人等。佛言：我經中以施行為本，施行善者，最為大種。其天下尊貴者，皆施行善得，不以種得也。

　　屍羅是梵語，翻性善。好行善道，不自放逸故。善現是華言，梵名須菩提。悅帝利未詳。其名號均好，存心各邪。智論雲：邪見罪重，故雖持戒，身口 業好，皆隨邪見。惡心如種，苦種皆作苦味。邪見之人，雖持戒精進，皆成惡法；不如不執而行慧施。何況內執邪見，外譏毀乎！然鬼王問母姓氏。聖女先舉父者， 以婦必隨夫彰名也。

△

【無毒合掌啟菩薩曰：願聖者卻返本處，無至憂憶悲戀。】

　　合掌乃慶慰之儀。返本處者，此非菩薩所應住也。始則為母而來，今既知之，應即退還本所住處，不須憂憶而悲戀也。

△

【悅帝利罪女生天以來，經今三日。雲承孝順之子，為母設供修福，佈施覺華定自在王如來塔寺。】

　　鬼王答曰：我初不知何人，若悅帝利罪女，已脫苦生天三日矣。下示生天之由。雲承孝順之子，為設供修福於如來塔寺之故也。善事父母曰孝，百行之 先，良心最真切者。吾身非從天降地生，故於親親，自不容已。祖師雲：父母非我親，誰是最親者？順者，不逆也。曾子雲：孝子之養親也，樂豫其心，不違其誌， 樂其耳目，安其寢食。故梵網雲：孝順，至道之法。孝經援神契曰：元氣混沌，孝在其中。故愛敬之情，藹然可匊。然皆訓乎男子，非教女子也。今聖女始勸母以正 信，中興供而感佛，終承福已生天，可謂能諭母於道，而救母於苦。世出世間事備一身。孝順之名，允乎遍法界而不磨，流沙劫而不泯也。

△

【非唯菩薩之母，得脫地獄，應是無間罪人，此日悉得受樂，俱同生訖。】

　　無間大獄，鐵城幽閉，窅窅冥冥，難期恩赦。今因施福，力資己母生天；此際善緣，澤及同人得樂。孝思至矣！福力廣矣！洵報母之標榜，誠資冥之樣子也。

△

【鬼王言畢，合掌而退。】

　　言畢合掌，敬慕之至。孝之感人深矣，行因事竟。

△

【婆羅門女尋如夢歸。悟此事已，便於覺華定自在王如來塔像之前，立弘誓願：願我盡未來劫，應有罪苦眾生廣設方便，使令解脫。】

　　尋，仍也、俄也，即史尋復其舊之尋。俄爾仍如夢歸也。夢是眠中現境，無明蓋也。然眠夢之塗，因心而動；動由內識，境由外熏。今因想母生界，故 致感佛現神。然既悟夢感，而道心頓發，故即從本尊像前，便立四弘誓願：從今日始，盡未來際，應有造罪受苦之人，無論怨親，廣設方便之法，盡令解脫沈淪。此 是最初之弘願，為下正宗之弄引。

△

【佛告文殊師利：時鬼王無毒者，當今財首菩薩是。婆羅門女者，即地藏菩薩是。】

　　財乃人所共寶，以無財則貧。古雲：甚矣！貧之為病也。但世寶凡俗所貴，招憂致患；唯有法寶，終始獲安。凈名雲：富有七財寶，教授以滋息。七財 者：一信、二戒、三多聞、四捨、五慧、（此五為寶）六慚、七愧（此二為守財人）。然此七財，以信為首。信故持戒，善由多聞，聞故能捨，捨則生慧。故信為財 首。

　　昔以無毒為名，固行十善之道；今彰財首之號，允登十信之階。若准瓔珞，六輪對位。鐵輪對十信，銅輪對十住，銀輪對十行，金輪對十嚮，琉璃輪對 十地，摩尼輪對等、妙。合尊摩尼為首。是則財首等覺之流歟！何以得知？准觀佛三昧經，昔過去有佛，號釋迦牟尼，滅度後，有王子名金幢。憍慢邪見，不信佛 法。有比丘名定自在。語王子言：世有佛像，極為可愛；可暫入塔，觀佛形像。王子即共入塔，見像相好。白言：佛像端嚴如此，況佛真身。比丘言：汝見像不禮， 當合掌稱南無佛。王子即合掌稱佛，還宮念像，後夜夢見，歡喜捨邪，歸依三寶。由入塔稱佛善根，命終值九百萬億那由它佛，得甚深念佛三昧，諸佛現前，為其授 記。是已來，經百萬阿僧祇劫，不墮惡道。乃至今日，獲得甚深首楞嚴定。昔王子者，今財首菩薩是。佛既言獲得甚深首楞嚴定，非等覺而何耶？

　　昔婆羅門女，由廣行孝道，成地藏之身。是故孝行置之而塞乎天地，敷之而橫於四海。施之後世，而無朝夕。放之東海而准，西南北方亦復如是。以故 上自帝王，下至民庶，貴賤雖殊，行孝一等。如地為萬物之所依止，如藏為萬人之所受用。故知地藏之名，全是孝順之目。此由文殊問地藏因地，略舉梗[既/ 木]。如此類例，胡能盡說也哉。

△

【分身集會品第二】

△

【爾時，百仟萬億不可思、不可議、不可量、不可說無量阿僧祇世界，所有地獄處分身地藏菩薩，俱來集在忉利天宮。】

　　爾時者，正如來含笑放光，光雲出音，天龍鬼神同集之時。蓋十方沙界分身地藏，既睹光聞音，即與眾偕來。但言不頓彰，故前後別說。非問答已竟方 來也。百仟萬億，數目也。震旦算經，始自黃帝。數法有十等：億、兆、京、秭、垓、壤、溝、澗、正、載。風俗通雲：仟生萬，萬生億，億生兆，兆生京，京生 秭，秭生垓，垓生壤，壤生溝，溝生澗，澗生正，正生載。載，地不能載也。今四數併明者，以億分四等：一、十萬為億，二、百萬為億，三、仟萬為億，四、萬萬 為億。今是第四億數，乃百仟萬之億。如是之數，尚難窮究，況又言百仟萬億不可思、議、量說之無量阿僧祇世界中，凡所有地獄之處，一獄一分身，皆來集會。猗 歟盛哉！此正顯世界難量，愈見地獄之夥。地獄既多，彌彰分身莫測，為下問答之張本。此是大菩薩不思議事，尚非聲聞、緣覺所知，況下地凡夫能測識者哉！若廣 輿所載：唐至德間，有新羅國僧，曰金地藏者，渡海而來。止於直隸池州府，青陽縣，九華山。嘗取巖間白土，雜飯食之，人以為異。年九十九，忽召徒眾告別，坐 化函中。後三載開視，顏色如生，畀之骨節俱動，亦分身之一也。俱集天宮者，如心地觀經雲：以身常處於地獄，非不親近大慈尊。以身常處於輪回，非不親聞微妙 法。以是因緣，諸佛子，繫心常念天人師。由是如胡麻來集，[土+則]塞忉利天宮，實為夐古未聞奇特事也。

△

【以如來神力故，各以方面，與諸得解脫從業道出者，亦各有仟萬億那由他數，共持香華來供養佛。】

　　上以，訓因；下以，訓與。因世尊雲音普遍神通之力，故各與四方地面所化之眾而來集也。解脫有小大之別，據下不退阿耨菩提，併是不思議大解脫 耳。持香華供養者，梵語健達。此雲香。准戒德香經，有根香、枝香、華香不同。梵語佈瑟波，此雲華。准大品經：有天華、生華、心華不同。今持供者，期具足菩 薩之道，願成就如來之香，清遠潛通，果因一契也。准十輪經：供養有三：一、利益，以四事等；二、敬心，將華錶情；三、修行，若有持說，即為供養。皆所以錶 誠敬也。

△

【彼諸同來等輩，皆因地藏菩薩教化，永不退轉於阿耨多羅三藐三菩提。】

　　此出供養意，所以持香華供養者，皆因地藏菩薩教化我等，永不退轉於阿耨菩提故也。不退轉，如後；阿耨等，阿，翻無；耨多羅，翻上；三藐，翻 正；三，遍也、等也；菩提，翻覺。孤山曰：極果超因雲無上，正則正觀中道，等則雙照二邊。蓋果上三智也。悲華經四雲：願我得首楞嚴三昧，以三昧力故，化作 地獄之身，入地獄中，與地獄眾生，說微妙法，勸令發菩提心。彼眾聞是法已，尋發菩提之心；即便命終，生於人中，隨所生處，常得值佛聽法，即得不退轉地。乾 闥婆乃至人非人等，天龍鬼神，乃至畜生餓鬼等眾，亦復如是，皆令發菩提心。正地藏所化業道之眾，不退轉菩提之流也。

△

【是諸眾等，久遠劫來流浪生死，六道受苦，暫無休息。以地藏菩薩廣大慈悲，深誓願故，各獲果證。既至忉利，心懷踴躍，瞻仰如來，目不暫捨。】

　　文分三節。初、明六道流轉，以背此覺心也。蓋此覺心，是諸佛所證妙道，是眾生所迷本源。則凡夫久遠劫來，流浪生死者，由不發此心也。其流有 四：一見流，（三界見）；二欲流，（欲界諸惑除見及癡）；三有流，（上二界，諸惑除見及癡）；四無明流，（三界癡）。梵語阇提阇，此雲生死。勝鬘雲：生 者，新諸根生；死者，故諸根滅。由此風浪，長淪生死。故涅槃雲：我昔與汝等，不見四真諦，是故久流轉生死大苦海。准大論：眾生有三苦：一身苦，老病死；二 心苦，貪嗔癡；三後苦，獄鬼畜。於是三種苦中，求暫休息，胡可得耶！

　　次、因地獄獲證。此言六道眾生，在昔則萬匯沈迷，居三道而流轉；在今，則十力超悟，證三身以圓通。是誰之功歟？此皆地藏無緣慈悲無作誓願之力耳。

　　三、出感佛恩深。既承如來神力，得隨地藏偕來，內心深懷踴躍，外儀瞻仰殷勤。瞻者，相好，微妙看視無厭；仰者，智慧深遠，景慕有期。大論雲：佛坐師子座，現最勝身，光明色像，威德巍巍。以此神力，感動眾生。其有信者，皆至阿耨菩提。是以瞻之仰之，不能暫捨也。

△

【爾時，世尊舒金色臂，摩百仟萬億不可思、不可議、不可量、不可說無量阿僧祇世界諸分身地藏菩薩摩訶薩頂。】

　　如來以一母陀羅臂，一兜羅綿手，遍摩所集無量阿僧祇分身地藏菩薩之頂。乃聖如意通中，轉變神力，故一臂能遍摩無量之頂，以慰勞安撫也。大論雲：手中德字縵網莊嚴，當以此手安慰眾生，令無所畏，是此謂也。

△

【而作是言：吾於五濁惡世，教化如是剛強眾生，令心調伏，捨邪歸正。十有一二，尚惡習在。】

　　此言佛調濁世眾機。如賢愚經，散阇調象師言：佛世尊者，二種性生。一者智慧，二者大悲。勤行六事，所謂六波羅蜜。功德智慧，悉具足已，號之為 佛。既自能調，亦調眾生。故雲：我是無上調禦師，轉正法輪，周世界化度無量諸眾生。當知由悟心地觀，故能調伏剛強眾生。即示以四諦，教以三學；以戒調伏其 身，以定慧調伏其心。既修三學，自斷二惑。輔行雲：昔無信鉤，致造重罪。如狂象無鉤，不可控制。今以慚愧鉤，鉤無慚心象。故雲令心調伏，捨邪歸正者。一切 法高王經雲：大比丘眾一仟二百五十人，其先悉是辮發梵誌。諸漏已盡，無復煩惱，一切心得自在，到第一彼岸（文）。皆捨邪歸正，已授記作佛。此明已調伏者十 中有七八矣。其有惡習深重，難於調伏者，十中猶有一二焉。如法華初開，五仟起去之流；及調達弟子、螺髻梵王等。習者，習氣。正使雖斷，余習尚在；身雖調 伏，心猶未調伏也。

△

【吾亦分身仟百億，廣設方便。或有利根，聞即信受。或有善果，勤勸成就。或有暗鈍，久化方歸。或有業重，不生敬仰。】

　　此與地藏分身方便度生形擊。故言吾亦等。梵動經雲：如來自知生死已盡。所以有身，為欲福度諸天人故。若其無身，則諸天世人無所恃怙。猶如多羅 樹，斷其頭者，則不復生。佛亦如是。已斷生死，永不復生（文）。今所以分身者，正顯如來從法垂應，被大小機，現勝劣身；從一派出，有無量身，攝用歸體，不 離一性。大論三十雲：若依禪定得四無量、背捨、勝處、神通、辯才等諸甚深功德，悉皆具得，隨意所為，無不能作。化為種種禽獸之身而不受其法，或時身滿虛 空，或時身若微塵，或輕如鴻毛，或重若泰山，如是等神通變化力，皆從禪得，此是身輪現通，廣設方便。即是意輪鑒機。施無謀巧用，觀十界性相。乃以口輪說種 種法，令熟者脫，未熟者熟，未種者種。故大論雲：釋迦牟尼佛，一世界中，常化作種種身，種種方便，以度眾生。此總示分身方便，下別明調機難易。根是根性， 屬於過去。今世根性利鈍，總由宿障重輕。若約四生論利鈍者，如處胎經，佛告喜見菩薩：如我今日在母胎中，與諸十方神通菩薩，說不退轉難有之法；亦以神通入 天四生，地獄四生，餓鬼四生，畜生四生。於四生中，胎化二生，盡漏得疾；濕卵二生，盡漏稍遲。化生胎生是利根人，濕生卵生是鈍根人。故大論雲：諸佛先觀 知：有人一切方便不可度，或有難度；或易化，或復有遲或有疾，或以光明或神足，種種因緣度眾生。是也。若約四洲論利鈍者，如天人費氏雲：北天一洲，少有佛 法；余三天下，佛法大弘。東西天下，少有黠慧，煩惱難化；南方一洲，雖多犯罪，化令從善，心易調伏。是也。准止觀：利根是法行機，鈍根是信行機。如聞一切 眾生，本有佛性，當下即信，信即思修，三慧頓成，是利根人。或聞善果，勤勸成就，則是仰信此理，思惟而修之，三慧漸進，是鈍根人。大論雲：若眾生欲作重 罪，善教不從，以苦言諫之，雖起嗔恚，後得安隱，此正教鈍根者。善果的指菩提心。如身子輩極鈍根者，具歴五時，頓發三因授記是也。暗鈍久化方歸，如莎伽陀 （此雲小路邊生）等，業重不敬仰者，如調達等。大論二十六雲：如死人種種莊嚴，轉轉爛壞，終不可令活。提婆達亦如是。佛日日種種教化，惡心轉劇，惡不善法 日日轉增，乃至作三逆罪。又雲：捨衛城中九億家。三億家眼見佛，三億家耳聞有佛，三億家不見不聞。佛在捨衛二十五年，而此眾生不聞不見，何況遠者。又如貧 老母，無度因緣，不得見佛。若得多信，利益無窮。我佛化門調機尚爾，則知地藏分身非易。故特以己形擊，彌顯其神力之難思也。

△

【如是等輩眾生，各各差別，分身度脫。】

　　分身度脫者，如處胎經，佛告智積菩薩：我宿命所行，戒德究具，得成佛身，變化自在，無所不入。亦入於金翅鳥，亦入於龍子，亦入於魚鱉黿鼉，所 化如是。故佛問彌勒：心有所念，幾念幾相識耶？彌勒言：舉手彈指之頃，三十二億百仟念，念念成形，形形皆有識，念極微細，不可執持。佛之威神，入彼微識， 皆令得度。此識教化，非無識也。故曰：導師出現世，非緣不降神，要度未度者，示現無為城。如來分身，可思議乎哉！

△

【或現男子身，或現女人身，或現天龍身，或現神鬼身，或現山林川原河池泉井，利及於人，悉皆度脫。或現天帝身，或現梵王身，或現轉輪王身，或現居 士身，或現國王身，或現宰輔身，或現官屬身，或現比丘、比丘尼、優婆塞、優婆夷身，乃至聲聞、羅漢、辟支佛、菩薩等身，而以化度。非但佛身獨現其前。】

　　此示眾機，關佛慈悲。以王三昧力，不動法性，而往應之。如處胎經，佛告諸來會者：吾從無數阿僧祇劫，能大能小，入細無礙。或在天勝，劫數教 化；或在人中，代彼受苦；或在畜生餓鬼地獄，教化無所不入。此正顯如來化身妙用也。初現男子身。男者，丈夫壯而有室也。人生不可無所事事，故取力田為男職 分所當為。子者，親之枝也。子有生義，天開於子，靜極而動也。次現天龍，悲華經雲：若有眾生事摩醯首羅天，我願化身如摩醯首羅；事八臂者，化為八臂天身； 事日月梵天，亦化為日月梵天，而教化之，令住善法。智論雲：如菩薩本身，曾為大力毒龍。又龍王名馬堅，是大菩薩，以本願故，生於龍中。次現神鬼身，如穢跡 大權神王、大力明王等。如現大鬼伏曠野鬼等。山林川原河池泉井，此現依報度人。如悲華經雲：佛因中為救閻浮提人民饑餓，思惟捨身體血肉。中路有山，名水愛 護，自投其身，即成肉山，高一由旬，乃至高仟由旬（雲雲）。天帝，如昔為帝釋，與羅呵阿修羅戰，以慈忍力勝之。昔為梵王，坐晝度樹下成道，梵名斫迦羅、伐 辣底、曷羅阇，此雲轉輪王。施設足說，金銀銅鐵輪，應別如其次，逆次能王領，一二三四洲。（准處胎經，無數阿僧祇劫，作大梵、帝釋、輪王，各三十六返，所 度眾生無墮二乘、惡趣。）迦羅越翻居士，愛談名言，清凈自居，凡多積財貨，居業豐盈，皆受此稱。國王，粟散王也。諸侯所封之地曰國，從口，而加或其中，以 明各有分地世守，毋相侵也。王者，三才之主，從│（音輥，一之轉也。），貫三，立天地人之道也。如大光明王捨頭，月光王捨眼，迦屍王破胸出心，堅意王捨手 等。宰，主也，烹也，調和膳羞之名。周禮冢宰，能調和眾官，故名宰。輔者，兩傍夾車木。朝堂有四輔官：左輔、右弼、前殿、後丞，所以主宰群辟，夾輔王化。 如周官太師、太傅、太保為三公。書雲：惟茲三公，論道經邦。佛曾作劬嬪大臣，分閻浮提為七分息諍。官者，宦也，公也。屬者，官僚部曲也。群辟之職，統於三 公。漢魏已來，三師皆開府置寮屬也。已上皆未受道者。此下皆受道之機：比丘，名乞士，清凈活命故。凈名疏翻除饉。出家戒行是良福田，能生物善，除因果之饉 乏也。尼者，女也。大論雲：尼得無量律儀，應次比丘。優婆塞、優婆夷，西域記雲：鄔波索迦，唐言近事男；鄔波斯迦，雲近事女。謂親近承事諸佛法故。

　　阿羅漢，翻殺賊、應供、不生。若阿[風+(拔-手)]（音跋）雲應真。瑞應雲，真人。盡以無生。釋羅漢也。聲聞等，如前。而以化度句貫上諸 文。非但佛身句，反顯不一，謂豈止佛身獨現眾機之前。隨其所感，普現色身。寶雨經雲：如來成就無量色身，若諸有情，應以如來色身而教化者，如來即能於一剎 那，（名極少時極少）或一臘縛，（即迦羅，一仟六百剎那名一迦羅），一牟呼栗多，（六十迦羅名莫呼律多。）各各於彼有情之所，示現如來色身之相。若應見種 種別類有情身相，如來即於一剎那，乃至示現種種別類有情色身之相。正今文之謂。皆是諸佛神智所感也。

△

【汝觀吾纍劫勤苦，度脫如是等難化剛強罪苦眾生，】

　　此佛自言於菩薩地，三大阿僧祇劫，勤苦無量。大經雲：我於往昔種種苦行，今得如是無上方便。為汝等故，無量劫中，捨身手足，頭目腦髓。疏雲： 夫身命者，誰所不重。吾輕生忽死，經無量劫，指山指地，骸骨倍多，指海指江，髓腦非喻。況復妻子國城，捐棄無量，如是恩德，但為汝等放逸無慚，繫在囹圄， （上音陵，領也。下音語，禦也。言領囚禁禦也。）不得解脫，豈非纍劫勤苦，端為度說如是等難化剛強罪苦眾生！如央掘魔羅，受邪師教，佛以神力化之，即捨出 家。梵王贊雲：奇哉！調禦天人師、如來，善調央掘魔。譬如毒蛇見咒師，吹氣放毒不怖畏。是也。罪苦，大論明二種：杖楚寒熱等名身苦，余殘名心苦。諸聖人以 智慧力，無憂愁嫉妒嗔恚等心苦，有老病饑渴寒熱等身苦。（捨利弗風熱苦，畢陵伽婆蹉眼痛苦，羅婆那跋提痔病苦。）於身苦中，亦復薄少。如人知負他債，償之 不以為苦；凡夫人不憶負債，故身心俱受現苦，後世復有三塗之苦。故雲罪苦眾生。

△

【其有未調伏者，隨業報應，若墮惡趣受大苦時，汝當憶念吾在忉利天宮殷勤付囑，令娑婆世界至彌勒出世已來眾生，悉使解脫，永離諸苦，遇佛授記！】

　　初四句指上業重之輩。隨業等，五母子經雲：世間人不知有後世生，但言死耳。作善自得福，作惡自得殃，入惡道中，悔無所及。魂神空去，隨其施 行，業報受苦，如影隨形。是也。汝當下，正申付囑。謂我滅後，此輩墮落受苦時，汝當思憶想念，吾疇昔在忉利天宮，親蒙世尊殷勤叮嚀，付囑於我，令娑婆世界 第十小劫彌勒出世成道已來，中間或曾受化，或未受化，悉使解脫惡道，永離三塗八難之苦。機緣成熟，遇佛授記。自應拳拳服膺，不致失墜也。

　　彌勒，西域記雲：梅哩麗耶，唐言慈氏。因過去為王，名曇摩流支，（此雲法希，亦曰法樂。）慈育國人，自爾至今，常名慈氏。彌勒下生經雲：彌勒 成道已，（准處處經雲：彌勒未下若當來下，余有五十億七仟六百萬歲。）無量仟萬億眾生，見世苦惱，皆於佛法中出家。彌勒見諸大眾，作是念言：是諸眾生，皆 於佛法中種諸善根。釋迦牟尼佛遣來付我，我今受之。善哉！釋迦牟尼佛能善教化如是等百仟萬億眾生，今至我所。如是三稱贊釋迦牟尼佛。然後為說四諦，聞者同 時得道。時華林園初會說法，九十六億人得阿羅漢。第二會說法，九十四億人得阿羅漢。第三會說法，九十二億人得阿羅漢。故處胎經，佛告彌勒雲：汝所三會人， 是吾先所化。九十六億人受吾五戒者，次是三歸人。九十二億者，一稱南無佛，皆得成佛道。是也。梵語和伽那，此雲授記。聖言說與名授，果與心期曰記，即初住 之應記也。此皆我佛於天宮付囑地藏，以待彌勒出世之人爾。

△

【爾時，諸世界分身地藏菩薩共復一形，涕淚哀戀，】

　　十論經雲：安忍不動，猶如大地。今地藏大士，發願於塵沙劫前，受囑於彌勒道後，忍斯濁穢，化度泥犁，其猶地乎。合分身為一形者，一為諸身之 本。故合末以宗本。此由地藏行般若時，修神通波羅蜜，受種種如意事。變一身為無數身，無數身還為一身。隱顯自在，然亦不著是如意神通，以自性空故，離故， 無生故，無有住處內外大小。以禪定力，疾遍諸身，還復亦速。長阿含十二，捨利弗雲：神足證者，隨三昧心，作無數神力，變一身為無數身，以無數身合為一身， 稱是神力者，卑陋下劣凡夫所行，非是賢聖之所修習。於諸世間，愛色不愛色，二俱捨已，修平等護，專念不忘，斯乃名曰賢聖神足（文）。小乘尚爾，況大菩薩 乎。一月影臨一切水，一切水月一月攝。正分身合身之旨。

　　涕淚哀戀有四意：一悲六道造業不悛，二悲眾生剛強難化，三悲如來慧日將沈，四悲天宮付囑事大。故知涕淚哀戀，誠有不得已也。

△

【白其佛言：我從久遠劫來，蒙佛接引，使獲不可思議神力，具大智慧。】

　　此地藏自陳所獲通慧，與佛通慧形擊。謂吾之通慧，乃久遠劫來，蒙佛接濟引掖，使我獲得，即佛之通慧也。今付末世眾生於我，自應如佛接引於我而接引之。令其亦獲此通慧，正我分內事，自應仰攀玄根，俯提弱喪者矣。

△

【我所分身，遍滿百仟萬億恆河沙世界。每一世界，化百仟萬億身。每一身，度百仟萬億人，令歸敬三寶，永離生死至涅槃樂。】

　　此中文含二意：分身沙界，明不思議神力；度人證果，明不思議智慧。神力、智慧，乃分身度人之本也。十輪經略雲：此善男子，成就不可思議諸功德 法，堅固誓願，勇猛精進，為欲成就諸有情故，於十方界，或時現作大梵王身，乃至或作地獄獄卒，諸有情身，現作是等無量無數異類之身，為諸有情如應說法，隨 其所應，安置三乘不退轉位（雲雲）。故大論雲：具足神通者，於十方恆沙世界中，一時能變化無量身，供養諸佛聽法，說法度眾生。是等除佛無能及者，是為末後 身菩薩，故能廣度多人，歸敬三寶。歸以返還為義，令其返邪歸正；敬以專誠為義，令其去妄歸真。三寶乃卻惡之前陣，入道之初章，越苦海之舟航，到涅槃之要 道，故須歸依。永離等，則二種生死俱斷，五住煩惱盡亡，三德秘藏同圓證矣。五母子經雲：拔其根株，便可得脫，如人不種，但當泥洹。泥洹，快樂是也。

△

【但於佛法中所為善事，一毛一渧，一沙一塵，或毫發許，我漸度脫，使獲大利。】

　　佛法中為善，有勝劣不同。今所為者，善之劣也。一毛甚輕，一渧極少，一沙甚微，一塵極小，毫發許善之更輶矣。然我亦令脫生死，獲大利也。賢愚 經，佛告阿難：若有眾生，於三寶福田中，種少少之善，得無極果。此正會人天之小善，歸廣大之一乘，即同法華遍開六道，低頭舉手，彈指散華，本是人天之福， 今開即是緣因佛種，使獲大利，復何疑哉。

△

【唯願世尊，不以後世惡業眾生為慮！如是三白佛言：唯願世尊，不以後世惡業眾生為慮！】

　　慰勿慮者，明己能任事也。蓋謂一切煩惱，六十二見等，皆是如來之種。即一闡提人，亦不斷性善。儻遇法緣，善根復發，一善若起，萬惡全消。譬星 火燒萬頃之薪，七毒喪多人之命。如十輪經雲：隨所住處，若諸有情，貪嗔癡等，皆猛利故，造作十惡業道。有能誌心稱名，念誦歸敬供養地藏菩薩者，一切煩惱， 悉皆消滅，遠離十惡，成就十善，於諸眾生，起慈悲心，及利益心。此善男子成就如是功德妙定威神之力，勇猛精進，於一食頃，能於無量無數佛土，一一土中，以 一食頃，皆能度脫無量無數殑伽沙等所化有情，令離眾苦，皆得安樂，隨其所應，安置生天涅槃之道。故不復以後世惡業眾生為憂慮也。

△

【爾時，佛贊地藏菩薩言：善哉！善哉！吾助汝喜，汝能成就久遠劫來發弘誓願，廣度將畢，即證菩提。】

　　地藏既領囑慰佛，如來即贊善助喜。雙贊善哉者，一以能禮佛心，敬承嚴命；二以分身利物，毫福不遺。所以喜之者，以遂我心，滿爾願也。廣度兩言，我佛縱許之辭，亦自知其時耳。若普曜經雲：不處生死，不住泥洹，便受菩提決（文）。是則地藏久矣證大菩提，何待廣度將畢耶。

△

【觀眾生業緣品第三】

△

【爾時，佛母摩耶夫人恭敬合掌問地藏菩薩言：聖者，閻浮眾生造業差別，所受報應，其事雲何？】

　　聖母因聞眾生各各差別，故如來分身度脫。復聞地藏雲不以後世惡業眾生為慮，故承機發問。然聖母首問者，以如來升天宮，端為聖母。況我佛之母， 是應居先也。梵語阿離野，此翻聖者。事無不通謂之聖。孔子對魯哀公雲：所謂聖人者，智通大道，應變不窮，測物之情性者也。今地藏以不思議方便，應變無方， 故稱聖者。

　　閻浮眾生下正申疑詞。一切眾生隨自業轉，有上中下差別不同。佔察經地藏菩薩雲：所觀三世果報善惡之相，有一百八十九種。須者自檢。

△

【地藏答言：仟萬世界乃及國土，或有地獄，或無地獄。或有女人，或無女人。或有佛法，或無佛法。乃至聲聞、辟支佛亦復如是。非但地獄罪報一等。】

　　夫主賓酬唱，如砧誤相扣。今之答問不合何也？此因聖母問詞，意不相到。蓋世界無邊，國土無量，眾生無盡，業果無涯。今秖問閻浮眾生業報差別， 無乃太局乎。首答仟萬世界，意可知矣。有地獄如娑婆等，無地獄如極樂等。阿閦佛國雖有女人，無邪欲想。極樂國土及八陽神咒經、八吉祥經、八佛名號經，各各 東方八佛，皆無女人。國中無女人，最為清凈。智論雲：菩薩觀欲種種不凈，於諸衰中，女衰最重。火刀雷電霹靂怨家毒蛇之屬，猶可暫近；女人慳妒嗔諂妖穢鬥諍 貪嫉不可親近故也。有佛法、無佛法者，大論，問：何以貴有佛世界，賤無佛國土？答：佛是莊嚴世界主。若諸佛不出世，則無三乘涅槃之道；若世有佛，眾生得出 三界牢獄，眾生知有罪福，受三歸、五戒、八齋，及出家五眾等種種善法。若無佛之國，乃至天人不能修善故也。乃至聲聞等超略之詞。准悲華經，或有世界，純諸 菩薩，無聲聞、緣覺之名；或有聲聞、辟支佛乘；或有無佛、菩薩、聲聞、緣覺；或五濁弊惡，或清凈微妙；或卑陋不凈，或嚴凈妙好；或壽命無量，或壽命短促， 種種不同。故言乃至等。故知聖母之問，大有不盡者也。

△

【摩耶夫人重白菩薩：且願聞於閻浮罪報所感惡趣。】

　　且者，粗略不竟之詞。謂我非不欲聞諸國土事。我今既聞閻浮眾生罪報，且問南洲所感惡趣為何如耳。

△

【地藏答言：聖母！唯願聽受，我粗說之。佛母白言：願聖者說。】

　　願聽受者，寄聖母以厲眾生也。粗說有二：一者，獄名叢雜，苦事絲棼，若欲廣明，一劫不盡。二者，說空無相等名柔軟語，說地獄等名粗語。願說者，謂我正願說此等事，奚俟固謙為也。

△

【爾時地藏菩薩白聖母言：南閻浮提罪報名號如是。】

　　如文

△

【若有眾生，不孝父母，或至殺害，當墮無間地獄，仟萬億劫，求出無期。】

　　初舉所作罪當墮，下示所感報。後仿此。首舉不孝父母，見罪之極大極重。蓋以父母，猶天地也。恩重經雲：人生在世，父母為親。非父不生，非母不 育，故難報。經雲：左肩持父，右肩持母，經歴仟年，便利背上，猶不能報父母之恩。且為子盡孝，天理之常，人倫之本。使子而不孝，則父母不復望於子，夷狄禽 獸之不若，安可言人乎！故正法念經雲：有四種恩甚為難報：一母、二父、三如來、四說法師。若有供養此四種人，得無量福，現在為人贊嘆，未來能得菩提。今既 不能供養報恩，已失子職，況敢行大逆，以至殺害乎！噫嘻！父母何人也。殺害何名也。夫殺者誅也，有罪而戮死，法所在也。害者傷也，有怨而必報，情不堪也。 今父母何罪、何怨，而至殺害乎？未生怨經：阿阇世王將欲害父。王曰：汝每有疾，吾為焦心，欲以身命，救危代汝。親之仁恩，唯天為上，汝懷何心，忍為逆惡。 夫殺親者，死入泰山。故經雲：不孝之罪，眾罪之上，自應墮無間地獄中，受苦仟萬億劫，求出無期也。

△

【若有眾生，出佛身血，毀謗三寶，不敬尊經，亦當墮於無間地獄，仟萬億劫，求出無期。】

　　出佛身血。如提婆達多推山壓佛。金剛力士（即耆阇山神名埤羅）以金剛杵而遙擲之，碎石迸來傷佛足指。火車來迎，生入地獄。

　　若世人焚燒經像，擬同此罪。毀謗三寶，由無信故。十輪經四雲：有剎帝利、旃荼羅王、宰官、居士、長者、沙門、婆羅門等，隨惡友行，善根微少， 諂曲愚癡，懷聰明慢。於三寶所無淳凈心。不見不畏後世惡果。自謂聰敏，於我所說聲聞、緣覺及大乘法毀咨誹謗，不聽眾生受持讀誦，下至一頌。如是等人，名為 毀謗佛正法者，挑壞無量眾生法眼，是人不久便當肢體廢缺，結舌不言，受諸苦毒，痛切難忍，命終定生無間大獄。

　　不敬尊經者，如事佛吉兇經雲：有人事佛，不敬佛經，持著弊篋衣服不凈之中，或著妻子床上不凈之處，或持掛壁上，無有座席恭敬之心，與世間凡書 無異。阿難請戒律論雲：僧尼白衣等讀經律論行語，手執翻卷者，依忉利天歲數，犯重突吉羅。傍報二億歲墮獐鹿中，恆被摺脊，苦痛難忍。無記戲言捉經律論，亦 招前報。或安經像房堂檐前者，依忉利天歲數，八百歲犯重突吉羅。傍報二億歲，墮豬狗中。若得人身，一億歲作客棲（註：或作「棲」）屑，不得自在。故雲亦當 墮於無間地獄等。

△

【若有眾生，侵損常住，點（一本作「玷」）汙僧尼。或伽藍內恣行淫欲，或殺或害，如是等輩，當墮無間地獄，仟萬億劫，求出無期。】

　　常住者，梵語僧祇。此雲四方僧物。律鈔明四種常住：一、常住常住（謂眾僧寺捨樹木田園仆畜等，體局當處，不通余界，但得受用，不通分賣，故重 言常住。）二、十方常住（僧家供僧常食，體通十方，唯局本處。）此二名僧祇物。三、現前現前（得施之物，唯施此處現前僧。）四、十方現前（亡五眾物，未羯 磨。從十方僧得罪，已羯磨，望現前僧得罪。）此二名現前僧物。十輪經雲：若有四方僧物，資生雜物等，持戒破戒，如是人等，悉不與之。命終已後，皆墮阿鼻地 獄。

　　點汙僧尼，點與玷同，小黑也。比丘尼、式叉摩那、沙彌尼，乃佛姨母之裔。貪欲之人，不知罪福，強行點汙，仟佛出世，不通懺悔。

　　梵名僧伽藍，譯為眾園。僧史略雲：為眾人園圃，生植之所。佛弟子則生植道芽聖果也。四分雲：雲何於清凈法中，行不凈耶？身壞命終，墮三惡道。 餓鬼報應經：一鬼問目連言：我常男根瘡爛，何罪所致？答言：汝為人時，於塔廟處行淫。今受華報，果在地獄。觀此，惡可縱恣乎！或殺害者，或因淫欲致殺身害 命，或貪淫欲，殺害生靈。如唐洛州景德寺比丘尼任五娘，死後，其妹每聽靈座有呻吟聲，因問之。靈曰：我在世，在房非為，好食肉，殺害眾生。又將活魚作鲙。 被殺眾生索命，受刀劍地獄。身上有摺刀七枚，痛入骨髓。望妹將我生前戶資變賣，求凈土寺寶獻大師寫金剛經七卷，對佛懺悔。妹依囑賣物寫經，一卷抽去一刀， 經圓抽盡，生靈各出善道，五娘亦離地獄。觀此可因淫欲而殺害乎！下示報（雲雲）。

△

【若有眾生，偽作沙門，心非沙門，破用常住，欺誑白衣，違背戒律，種種造惡，如是等輩，當墮無間地獄，仟萬億劫，求出無期。】

　　沙門，准瑜伽論有四：一、勝道沙門，即佛等。二、說道沙門，謂說正法者。三、活道沙門，謂修諸善品者。四、汙道沙門，謂諸邪行者。偽者，詭詐 也。外現修行之狀，內藏瑕穢之情，即汙道也。下四句釋何以謂偽，以破用常住物等故也。此是律儀戒。大論雲：是律儀戒，能令諸惡不得自在，以戒禁約之。毗 尼，翻律，律、法也。斷割重輕，開遮持犯，非法不定。一切出家人之所依仗，到涅槃之初因緣。故佛告僧護比丘雲：持戒最為樂，身不受諸惱，睡眠得安隱，寤則 心歡喜。今既違背，則人天路絕，地獄門開，故雲當入無間等。然天人費氏雲：南方一洲，雖多犯罪，從善易調。佛臨涅槃，親受付囑，併令守護，不使魔撓。若不 守護如是破戒，誰有行我之法教者，雖見毀禁，湣而護之。見有一善，萬過不咎，事等忘瑕，不存往失。韋將軍，三十二將之中，最多弘護。多有魔子魔女，輕弄比 丘。道力微者，併為惑亂。將軍淒惶奔赴，應機剪除，以修童真行，護正法故。

【若有眾生，偷竊常住財物谷米飲食衣服，乃至一物不與取者，當墮無間地獄，仟萬億劫，求出無期。】

　　偷、竊，皆盜也（從[池-也+欠]古涎字，從皿取鼠垂[池-也+欠]皿上之意），謂不與取。灼然不與取名劫，潛盜不與取名盜。物者資生之什 物。凡生天地間，有貌象聲色者，皆物也。今夫財物，僧之使用者；谷米飲食，僧之活命者；衣服，僧之遮體者。或灼然劫取，或潛行盜取，其罪重矣。觀佛三昧經 雲：盜僧鬘物者，過殺八萬四仟父母。華聚菩薩雲：五逆四重，我亦能救；盜僧物者，我不能救。蓋以隨盜一物，即望十方凡聖；隨境無邊，還結無邊等罪。微細尚 可知數，此罪不可測量，故偏重也。

　　下示報。如濟龍品。諸龍自念過業，於佛法中，或為俗人，或復聽法來往因緣。所有信心施捨種種華果飲食，共諸比丘依次而食，及啖四方眾僧華果飲 食等。彼業因緣，於地獄中，經無量劫，猛火燒煮，飲洋銅，吞鐵丸。從地獄出，墮畜生惡鬼。惡業未盡，生此龍中，常受苦惱。佛告諸龍，此之惡業，與盜佛物， 等無差別。嗚呼！今之狂瀾，滔滔尤甚，其誰能砥柱乎！

△

【地藏白言：聖母！若有眾生作如是罪，當墮五無間地獄，求暫停苦，一念不得。】

　　上來五種業，總是十惡上品。故地持經廣明十惡之業，必墮地獄、餓鬼、畜生。得生人中，各有二種余業之報，一一惡，各明五報（雲雲）。故地藏菩 薩答聖母言：若閻浮提眾生，作上來如是等罪者，皆當墮無間獄，仟萬劫中，求暫停酸楚之苦，即一念極促之時，胡可得乎！大論引佛言：我世世曾作小蟲惡人，漸 漸集諸善本，得大智慧。今自致作佛，神力無量，最上最大。一切眾生，亦可得爾，雲何空受勤苦，而墮小處；自應努力勤修，各求出離也。

△

【摩耶夫人重白地藏菩薩言：雲何名為無間地獄？】

　　由上文多番說當墮無間地獄，不審無間之名取何義而立耶？

△

【地藏白言：聖母！諸有地獄，在大鐵圍山之內。其大地獄，有一十八所，次有五百，名號各別；次有仟百，名號亦別。】

　　諸有，通謂凡諸所有。然的指二十五有，因果不忘也。法句經雲：所作善惡，皆有因果，經久不忘。二十五有頌：四洲四惡趣，六欲併梵天，四禪四空處，無想五那含。故下雲：不問男子女人，乃至罪行，業感悉同受之。故二十五有，凡所造罪，即有地獄，皆在鐵圍山內。余如前。

△

【無間獄者，其獄地（一本作「城」）周匝八萬余裏，其城純鐵，高一萬裏。城上火聚，小有空缺。其獄城中諸獄相連，名號各別，獨有一獄，名曰無間。】

　　准問地獄經。閻羅王城之四面，列諸地獄。人命終時，已捨死陰，未及生陰，乘中陰身，入泥犁城。（梁音寄條城，又言閉城）。言未受罪之間，共聚 是處。巧風所吹，隨業輕重受大小身。臭風所吹，成就罪人粗醜之形；香風所吹，成就福人微細之體。准此，在城受苦者，皆粗醜之形；生人天者，併微細之體。

　　諸獄相連，即等活等七大獄，及第八無間，名八熱地獄。各有眷屬等獄，互相連貫也。獨有一獄，正示無間。故俱捨論雲：以於其中受苦無間。非如余七大捺落迦，受苦非恆。故名無間，故以獨有一獄點示之。

△

【其獄周匝萬八仟裏，獄墻高一仟裏，悉是鐵為。上火徹下，下火徹上。鐵蛇鐵狗，吐火馳逐，獄墻之上，東西而走。】

　　鐵名黑金，性剛而冷，錶惡人殘忍，性剛而心冷。故感報處，悉以鐵為。火上下者，起世經雲：以不善報故，東方有大火聚出生。南西北方四維上下各 各如是。從東壁出大火焰，直射西壁，到已而住。西壁出火，射北壁。北壁出火，射南壁。從下於上，自上於下，縱橫相接，上下交射，故徹下徹上也。鐵蛇、鐵 狗，觀佛三昧海雲：鐵城二隔間，有八萬四仟鐵蟒大蛇，吐毒火中，身滿城內。其蛇哮吼，如天震雷，雨大鐵丸。四角有四大銅狗，廣長四十由旬，眼如掣電，牙如 劍樹，齒如刀山，舌如鐵刺，一切身毛皆然猛火，其煙臭惡。既吐毒火，復爭馳相逐於獄墻之上，東西急走，使諸罪人畏避無所。

△

【獄中有床，遍滿萬裏。一人受罪，自見其身遍臥滿床；仟萬人受罪，亦各自見身滿床上。眾業所感，獲報如是。】

　　十輪經雲：有五逆罪，為最極惡。故心殺父、母、殺阿羅漢、破壞聲聞和合僧事、乃至惡心出佛身血，是名五逆。復有四種大罪，同於四逆，犯根本 罪：殺辟支佛，是名殺生犯根本罪；淫阿羅漢比丘尼，是名邪淫犯根本罪；若人捨財與佛法僧，主掌此物而輒用之，是名盜犯根本罪；若人倒見，破壞比丘僧，是名 破僧犯根本罪。其人既犯逆罪，又犯根本罪，譬如鐵丸，雖擲空中，終不暫住，速疾投地。如是五逆，犯四重禁，及二種眾生，毀壞正法，誹謗賢聖。如是等十一種 人，犯一一罪者，身壞命終，皆墮無間獄中。豈非眾業所感，而獲報如是耶！

△

【又諸罪人，備受眾苦。】

　　長阿含雲：其中罪人，舉目所見，但見惡色；耳聞惡聲，鼻聞臭氣；舌嘗惡味；身觸苦痛；意念惡法。彈指之頃，無不苦時，名無間地獄。故罪人到彼，無不備嬰眾苦也。

【仟百夜叉，及以惡鬼，口牙如劍，眼如電光，手復銅爪，拖拽罪人；復有夜叉，執大鐵戟，中罪人身，或中口鼻，或中腹背，拋空翻接，或置床上。】

　　夜叉即鬼。復言惡鬼者，蓋比夜叉，惡尤甚焉。泥犁經名獸鬼，五苦章句名阿旁，牛頭人手，兩腳牛蹄，力壯排山，持鋼鐵叉。觀佛三昧經雲：獄卒八 頭六十四角，角頭火然，化成刀輪，在火焰間，滿阿鼻城。口牙等明相狀之惡，銅爪等明身力之猛。然由業力生此。法善現大德雲：心常懷忿毒，好集諸惡業，見他 苦生悅，死作琰魔卒。

　　新婆沙問：諸地獄卒，為是有情數，為是非情數耶？答：若以鐵鎖繫縛初生地獄，往琰魔所者，是有情數。若以種種苦具，於地獄中害有情者，非有情 數。妙樂雲：有情非情，併是共業所感，而為心變。此正楞嚴所謂觸報招引惡果，神識自見牛頭獄卒，馬頭羅剎，手執槍矛+肖，驅入無間也。銅爪拖拽，不足以苦 罪人。復以鐵戟刺身，使受極痛之苦。戟，兵器也。單枝為戈，雙枝為戟。戟，格也，旁有枝格也。（兩邊橫刃長六寸，中刃長七寸半，橫刃接柄處長四寸半。併廣 寸半。）今言大鐵戟，則長大燒赤，非世戟可比。其所中處，痛毒難忍。又將罪人拋擲空中，翻手接之，置於鐵床之上。准楞嚴，由於怨習交嫌發於銜恨，二習相 吞，故有投擲擒捉、擊射拋撮諸事，循業發現也。

△

【復有鐵鷹，啖罪人目。復有鐵蛇，繳罪人頸。百肢節內，悉下長釘。拔舌耕犁，抽腸剉斬，洋銅灌口，熱鐵纏身。】

　　鷹，鷙鳥也，一名鷞鳩，泥犁經雲：泥犁有鳥，嘴如鐵生，啄人頭，啖人腦，毒痛不可忍。鐵蛇如前。觀佛三昧雲：此由愚癡眾生，毀辱佈施，言施無 報，勸人藏積。嚮國王大臣，一切眾生，說施無因，亦無果報，故感生此獄。如冥報記，唐曹州城武人方山開。少好遊獵，所殺無數。貞觀十一年，死經一宿，穌 雲：初死之時，二人引上一山，登梯至頂。忽有一大白鷹，鐵為觜爪，飛來，攫左頰而去。又一黑鷹，攫右肩而去。二人即引南行，至一城，非常險峻。二人扣城， 北門即開。城中總是猛火。門側有數個毒蛇，皆長十余丈，頭大如五鬥塊，口中吐火射人。山開恐懼，唯叩頭念佛，門即自閉。乃見官人欲遣受罪。侍者諫曰：未合 即死。但恐一入此城，不可得出。未若且放，令修功德。官人放之。須臾即穌。爪跡極深，終身不滅。後捨妻子出家，以宅為佛院，恆以讀誦為業。然鷹蛇啖繳，嬰 苦劇矣。下更眾苦競集，逼切奚堪，肢節悉下長釘者。長阿含雲：鐵釘地獄，獄卒撲之，偃熱鐵上，舒卷其身，以釘釘手足，周遍身體，盡五百釘。苦毒號吟，猶不 復死。拔舌耕犁，如後。抽腸挫斬，此是抽腸拔肺地獄。所謂長叉柱肋，肝心碓搗，裂膽抽腸，屠身膾肉，挫之斬之，形如齏粉，此皆妄語所致，及余惡業所感。洋 銅灌口，如下。熱鐵纏身，即鐵鎞地獄。燒熱鐵鎞，錶裏洞徹，纏裹其身，內灌洋銅，外裹熱鐵，余業未盡，猶不死耳。

△

【萬死仟生，業感如是。】

　　罪人在地獄中，或被惡鬼燒煮斬斫而死，或罪人手生鐵爪相摑肉墮而死；或獄卒唱生，或冷風吹活，如是生死仟萬靡窮。故起世經雲：若人身口意造 業，作已入於惡道中，經歴無數仟億歲，死已須臾還復活。怨仇各各相報對，由此眾生更相殺。然其中受苦者，隨其作業，各有輕重，經劫數等。其最重處，一日一 夜，八萬四仟生死，經劫無量。作上品五逆十惡者，感此道身。

△

【動經億劫，求出無期。此界壞時，寄生他界；他界次壞，轉寄他方；他方壞時，展轉相寄；此界成後，還復而來。】

　　動與靜對。心體本靜，人自動之。起信雲：不知真如法一故動，動則有苦，果不離因故。此業相初動，漸至起惑，造業受報。字書雲：力重為動。凡夫 業力甚深，故動成地獄億劫之壽。起世經雲：佛言，如憍薩羅國斛量胡[廿/麻]，滿二十斛，高盛不[既/木]。有一丈夫，滿百年已，取一胡[廿/麻]。如是 次第滿百年已，復取一粒，擲著余處。擲滿二十斛[廿/麻]盡已，我說其壽猶未畢盡。如是二十額浮陀壽，為一泥羅浮陀壽；乃至二十波頭摩壽，為一中劫。此界 下，釋疑。謂地獄既在閻浮洲下，劫火壞初禪時，地獄先壞，罪人又藏何處？釋曰：火災起時，罪業未滿者，寄他界受之。又疑，它界亦有火起，不審又置何處？又 釋：儻它界以次而壞，又轉寄它方不壞獄中。又所寄處火災又起，更何所寄？復釋，儻它方火災亦起，仍前展轉寄不壞處。復覆難雲：若此方世界復成，所寄罪人還 來此間不耶？更釋：此界既成，自然還來大獄受苦。此據罪未畢者說。若長阿含雲：火災起時，從地獄死，皆生人中，修第二禪。從人中死，皆生光音天。水風二災 亦然。此據罪已畢者說。故大品雲：是人毀咨三世諸佛一切智，起破法業因緣故，集無量百仟萬億歲，墮大地獄中。從一大地獄至一大地獄。若火劫起時，至他方大 地獄中。如是遍十方獄，乃至還來是間大地獄中，從一大地獄至一大地獄。故言動經億劫，即欲求出，恐恩赦之無期也。

△

【無間罪報，其事如是。】

　　如是二字，情詞慘淡。所以結指者，冀人及早畏而修善也。

△

【又五事業感，故稱無間。】

　　五無間罪，如前。無間八熱獄之最下者。依薩婆多部，有八大地獄：一等活，二黑繩，三眾合，四叫喚，五大叫喚，六熱，七眾熱，八名無擇，亦名無 間。一投苦火，永無樂間。既苦無間，何所可擇。此八地獄，在閻浮洲下，重纍而住。依三法度論，前二有主治，次三少主治，後三無主治。新婆沙問：何故最下大 者名無間耶？答：彼處恆受苦受，無喜樂間，故名無間。問：余地獄中豈有歌舞飲食受喜樂異熟間耶？答：余地獄中，雖無異氣喜樂，而有等流喜樂。如等活地獄 中，有時涼風所吹，血肉還生；有時唱言等活，欻然還活。如是血肉生時，即還活時，暫喜樂間苦受，故不名無間也。

△

【何等為五？】

△

【一者，日夜受罪，以至劫數，無時間絕，故稱無間。】

　　受苦皆遍，間無暫樂，動轉不得，纏縛甚嚴，東西交過，上下通徹，如是經無量劫，名時無間也。

△

【二者，一人亦滿，多人亦滿，故稱無間。】

　　觀佛三昧經雲：復有眾生，犯四重禁，虛食信施，誹謗、邪見，不識因果，斷學般若，毀十方佛，偷僧祇物，淫泆無道，逼掠凈戒尼，姊妹親戚，造眾 惡事。此人罪報，經八萬四仟大劫，復入東方十八隔中，如前受苦。南西北方，亦復如是。身滿阿鼻獄，四肢復滿十八隔中。地獄不大，此身不小。准正法念：其身 長大五百由旬，造四逆人四百由旬，乃至造一逆人一百由旬。一人既爾，多人亦然，各見身形，無間斷處，名形無間也。

△

【三者，罪器叉棒，鷹蛇狼犬，碓磨鋸鑿，剉斫鑊湯，鐵網鐵繩，鐵驢鐵馬，生革絡首，熱鐵澆身，饑吞鐵丸，渴飲鐵汁，從年竟劫，數那由它，苦楚相連，更無間斷，故稱無間。】

　　此言苦具無物不備，故泥犁翻苦具。楞嚴雲：詐習交誘，發於相調，引起不住，故有杻械枷鎖鞭杖檛棒諸事。鷹蛇狼犬，鐵驢鐵馬，此由觸報招引，如 前如後。碓磨鋸鑿，此由枉習嗔習所感。碓，即搗碓地獄。立世阿毗曇雲：是時獄卒謂其伴言：我今共汝，一彈指頃，舂搗罪人。即捉諸罪人，納熱鐵艚中，以熱鐵 杵搗碎其身。一彈指頃，當人中五百年壽，磨鋸剉斫，俱如後。罪業報應經信相菩薩白佛言：今有受罪眾生，為諸獄卒剉斫斬身，從頭至足，乃至其頂。斬之已訖， 巧風吹活，而復斬之。何罪所致？佛言：以前世時，坐不信三尊，不孝父母，屠兒魁膾，斬截眾生，故獲斯罪。

　　鑊湯，如後。鐵網，獄中有七重鐵網，羅覆其上。獄卒取熱鐵網纏絡其身，燒熱焦爛鐵繩。長阿含雲：獄卒捉彼罪人，撲熱鐵上，以熱鐵繩拼之使直， 以熱鐵斧，逐繩道斫罪人作百仟段，復以鐵繩，拼鋸鋸之。復縣熱鐵繩，交橫無數，驅迫罪人，使行繩間，惡風暴起，吹諸鐵繩，歴絡其身，燒皮徹肉，焦骨沸髓。

　　生革絡首，長阿含雲：獄卒捉罪人，剝取其皮，纏罪人身，著火車上，輪碾熱地，周回往反，身體碎爛，皮肉墮落。既以生革絡首，復以鐵汁澆身，使令疾馳。

　　饑吞鐵丸等者，准起世經雲：從五叉小地獄出，詣嚮饑餓地獄中。守獄者即問：汝等何欲？答言：我等饑餓。守獄者即便取地獄眾生，撲著熾然熱鐵地上，令其仰臥，便以鐵鉗開張其口，用熱鐵丸，擲著口中。唇口應時燒然，次第燒舌燒腭，乃至經過小腸，嚮下而出，其丸尚赤。

　　從饑餓地獄出，詣嚮焦渴地獄中，守獄者問言：汝等今何所須？答言：我今甚渴。即取撲著熱鐵地上，在猛焰中，仰而臥之，便取鐵鉗，開張其口，融 赤銅汁，灌其口中。唇口即便焦爛，乃至燒腸燒胃，直破小腸，嚮下而出。由往昔所造若人非人身中一切惡業，於獄中次第而受，毒痛不可忍。泥犁中如是勤苦，經 那由他劫，略無絲毫樂間，名苦無間也。

△

【四者，不問男子女人、羌胡夷狄、老幼貴賤、或龍或神、或天或鬼，罪行業感，悉同受之，故稱無間。】

　　老者，年高而衰也。七十曰老。制字根於愛親，故從孝，轉註以匕（古化字）既憂其衰，又憂其且死，愛日之誠，能自已乎。幼，少而又少也。血氣未 充，故從力[糸-小]（於堯切，小也，從兩△△。小而又小）為意。人生十年曰幼。正父母愛憐時也。貴，尊而位高也；賤，貴之反也。俱從貝者，人所共寶也。 貴從中，又從一，在中間，如人負荷形，持中而負貝，人所共尊，故貴而高也。若持戈爭貝，人所共憎，故賤而下矣。

　　龍鬼神本屬四趣，墮獄無怪，天亦墮者何？大論雲：非有想非無想天中，死墮阿鼻地獄中。正法念經雲：帝釋復觀業果於殿中。叫喚大地獄，十八隔 處，殺生、偷盜、邪淫、妄語業，墮此地獄，具受眾苦。故不間乎天也。成論問：生天者，離惡積善，何故報盡，即入三塗？答：凡夫無始已來，惡業無窮，一日貪 嗔，尚受仟形，況惡既多，暫伏結生，報福既盡，昔業時熟，還墮三塗，何所致惑。涅槃雲：雖復得梵天之身，乃至非想非非想天，命終之後，還墮三惡道中。既果 報不間，名果無間也。

△

【五者，若墮此獄，從初入時，至百仟劫，一日一夜，萬死萬生，求一念間暫住不得，除非業盡，方得受生，以此連綿，故稱無間。】

　　觀佛三昧經雲：地獄一日一夜受罪，如閻浮提六十小劫，如是一大劫，此等罪人經八萬四仟大劫。長阿含經雲：久受苦已，從無間出，乃至寒冰地獄， 爾乃命終，為重罪行，生惡趣業。故墮無間地獄受苦，不可稱計。准楞嚴，由思報招引惡果結觸，則為一日中萬死萬生，於一切時，無有須臾暫受安樂如彈指頃。故 雲一念暫住不得。業盡受生者，乃遠約之辭。准鐵城泥犁經，從一泥犁出，乃至展轉入第八泥犁。復從第八反入第七，乃至第一阿鼻摩泥犁來，遙見鐵城，皆歡喜大 呼萬歲。閻羅即呼罪人，前若非怨，今汝去，當復為人，作子當孝順，當事長年，當畏帝王禁戒，當承事沙門道人，端心端口端身，得阿羅漢者，諸泥犁道，皆為閉 塞。於是從泥犁出，皆生善道。故言業盡受生。既從初以至業盡，生死連綿，故名命無間也。

△

【地藏菩薩白聖母言：無間地獄粗說如是，若廣說地獄罪器等名及諸苦事，一劫之中，求說不盡。】

　　何故罪器等事一劫說之不盡？由諸罪人在生惡心遍佈，晝夜相續，致墮地獄，循業發現，自然罪器苦事多廣難盡也。嗚呼！人更泥犁，醜毒萬端，各自思惟，亦可為善矣。

△

【摩耶夫人聞已，愁憂合掌，頂禮而退。】

　　此經家敘聖母聞退，愁罪人受苦靡窮，憂己力救援未逮。合掌錶自心不散，頂禮謝地藏能宣。且退本座以潛思，猶冀後緣之載演。

△

【閻浮眾生業感品第四】

　　品題見綸貫第。閻浮樹乃南洲樹王，故載考之，以備觀覺。長阿含雲：所以名閻浮者，下有金山，高三十由旬。由閻浮樹故，名為閻浮金樹。有五大柧 （音姑，木四方為棱，八棱三棱為柧。）四面四柧，上有一柧。果大如摩伽陀國一斛之甕。摘其果時，汁隨流出，色白如乳，味甘如蜜。其東柧果，乾闥婆所食；其 南柧者，七國人所食。一、拘樓（此雲不正叫），二、拘羅婆（雲叫喚），三、毗提（雲不正體），四、善毗提（雲賢），五、漫陀（雲善賢），六、婆羅（雲 牢），七、婆梨（雲勝）。西柧果，海蟲所食。北柧果，禽獸所食。上柧果，星宿天所食。觀佛三昧雲：閻浮提果，無以為譬。其形團圓，滿半由旬。婆羅門食，即 得仙道，五通具足，壽命一劫。凡夫食之，得四沙門果，三明六通，無不悉備。立世阿毗曇雲：此樹生在閻浮提地北邊，在泥民陀羅河南岸。是樹株本正洲中央，從 樹株中央取東西角併一仟由旬，生長具足，形容可愛，枝葉相覆，久住不雕，次第相覆，高百由旬。下本洪直，都無瘤節。五十由旬，方有枝條。樹身徑刺廣五由 旬，圍十五由旬，枝橫出五十由旬，中間亙度一百由旬，周圍三百由旬。其果甘美無比，其核如世間閻浮子大，上有鳥獸之形。根悉金沙所覆，春雨不漏，夏則不 熱，冬無風寒。乾闥婆及藥叉神依樹而住。然穢樹之名，前已略釋，今更解之。立世雲：一人乘通欲行至閻浮提樹，辭佛北行，經過七山，至第七金邊山，登山頂， 嚮北聳身遠望，惟見黑暗，怖畏而返。佛言：此黑暗色，即閻浮樹。（此取黑暗為穢）。又其果香氣，能染人心發顛狂。（此取染汙為穢）。長阿含雲：何緣月有黑 影，以閻浮樹影在於月中，故月有影。豈非月宮本自光明，因樹故，現黑影。穢樹之名，得非取此義乎？准今兩處所釋，則庶乎其不差矣。故載詳出，請證諸賢。

△

【爾時，地藏菩薩摩訶薩白佛言：世尊！我承佛如來威神力故，遍百仟萬億世界，分是身形，救拔一切業報眾生。若非如來大慈力故，即不能作如是變化。】

　　聖母才問無間獄竟之時，而地藏復重述者，蓋前付囑事猶未盡，而聖母即問獄報，正針線貫攝。今更復述，俾義理錯綜。世尊復示性識無定，以致五道輪轉，尤見前文業感無間，義意連屬。由此二品，鉤鎖如環，不可杜斷。故於業緣之後，業感之前，重述以起下文也。

　　先正述佛力分身，威即四無畏，神即六神通，力即十力。佛十力之智內充，故對外緣無恐，廣起神通，化度眾生，此是諸佛法，菩薩未得，今亦能分身 沙界，皆如來慈力所興，非己之能，故曰我承等。然分身救拔眾生，是四攝中同事攝，由菩薩法眼，明見眾生根緣，隨有同欣之者，即分形散影，普和其光，同彼事 業，各使沾益。因是生親愛心，故能救拔業報。下反顯己力難化。如大論雲：諸菩薩修苦行事，難辦難成故，欲懈怠。佛安慰言：無得疲厭，當勤精進，行是十力， 當得無量果報。故言若非如來大慈之力，即不能作如是變化。更移互換曰變，無而欻有名化。此是一切行禪中，無記化化禪，能現八種變化：一、能作小，二、能作 大，三、能作輕，四、能作自在，五、能有主，六、能遠到，七、能動地，八、隨意所作。亦名八自在我。此由菩薩善住和敬之法，與一切猶如水乳，欲生物希有之 心，故現大神通力。如化人所作化事，本無有實。故大品雲：一切法皆是化。於是法中，有聲聞、辟支、菩薩、諸佛法變化，有煩惱法變化，有業因緣法變化。若不 生不滅無誑相涅槃，是法非變化，以一切平等故。今言作變化者，依生滅隨情說耳。

△

【我今又蒙佛付囑，至阿逸多成佛已來六道眾生，遣令度脫。】

　　今字，與無央數劫叫應。阿逸多，此雲無能勝，彌勒之姓。凈名疏雲：有言阿逸多是名，既不親見正文，未可定執。准下生經雲：時修梵摩，即與子立字，名曰彌勒，則阿逸多是姓，審矣。

△

【唯然，世尊！願不有慮。】

　　唯應速之辭。今佛不喚，何須速應，乃西域口辭也。

△

【爾時，佛告地藏菩薩：一切眾生未解脫者，性識無定。惡習結業，善習結果。為善為惡，逐境而生。輪轉五道，暫無休息。動經塵劫，迷惑障難。】

　　初句是付囑本。解脫有二：若雲得阿羅漢者，諸泥犁道皆為閉塞，小乘解脫也；若雲我皆令入無余涅槃而滅度之，大乘解脫也。性識下，釋未脫之由， 以性識無定故。無定者，無堅住之定性。四自侵經雲：學者猶豫，心不專恆，或進或退，故使迷惑，往來不絕，是也。惡習下，釋所以。習者，熏習。佔察雲：眾生 以無明癡闇熏習因緣，現妄境界（文）。由惡習熏則造殺盜等惡業，則結三途惡果。善習熏，造施戒等善業，則結人天善果。惡因略果，善果略因。長阿含雲：彼天 眼凈，見諸眾生，死此生彼，從彼生此，形色好醜，善惡諸果，尊卑貴賤，隨所造業。報應因緣，皆悉知之。此人身行惡、口言惡、意念惡，誹謗賢聖，信邪倒見， 身敗命終，墮三惡道。此人身行善、口言善、意念善，不謗賢聖，見正信行，身壞命終，生天人中。以天眼凈見諸眾生隨所業緣，往來五道。此示由惑造業。業是心 思，身口以心為主。故經雲：諸法心為本，諸法心為勝，離心無諸法，唯心身口名。以依心故，善惡業成。

　　結者，惑業相資，如巾挽結。若欲解之，必抽中心。故忠國師雲：迷時結性成心，悟時釋心成性，得本之言也。為善二句，正明無定。以善惡業皆逐境 生。善心生，則種種善法生；惡心生，則種種惡法生。故密嚴經雲：阿賴耶識從無始世來，為戲論熏習，諸業所繫，輪回不已；如海因風，起諸識浪，恆生恆滅，不 斷不常。而諸眾生，不自覺知，隨於自識，現眾境界。蓋由真如不守自性，隨染凈緣，不合而合，故輪轉五道也。大論問：經說有五道，雲何言六道？答：佛去久 遠，經法流傳五百年後，部別不同，或言五道，於佛經回文說五。或言六道，於佛經回文說六。今言五者，如佛說五苦章句經雲：三界五道，生死不絕，凡有五苦： 一曰諸天苦，二曰人道苦，三曰畜生苦，四曰餓鬼苦，五曰地獄苦是也。如是五道，如汲井輪轆轤上下，故言輪轉。蓋善惡業相，無能轉者，於億仟萬世，隨逐不 捨，如債主隨人。得因緣具足，便與果報。另五道中受生，駛疾於箭，故言暫無休息，動經塵劫。

　　迷惑障難者，迷惑指十使，以十使中，五利使屬見；五鈍使屬思。因此十使，令人起見起思，昏迷惑亂也。障，即三障。難，即八難。由無始時來，流 轉生死，不能斷漏，得出世果，致令十使煩惱，能障四真諦理。復造業障，障出世法。業成招苦，報生八難，經塵劫而難出矣。故正法念雲：三界如輪轉，業繫輪不 斷，是故捨愛欲，離欲得涅槃。各宜聞此而思修之矣。

△

【如魚遊網，將是長流，脫入（一本作「或」）暫出，又復遭網。】

　　魚譬五道，網譬三界，長流譬業果，脫入等譬生死輪轉。魚乃水族之動物，正喻眾生性識無定。群魚貪食，而遭密網。眾生因愛，而入魔網。日明菩薩 經雲：又如密網，眾魚投之，刳腸俎幾。四自侵經雲：身若畫瓶，內滿不凈。不知內外身當歸盡。常以彩色脂粉莊嚴，自謂端正，顏貌無雙。斯等之人，羅網所纏， 莫能觀身。故大論雲：淫羅彌網，人皆投身。此由業感果，以對苦諦。

　　將是長流，將，隨也；是字，指阿賴耶識。以此識中，善惡種子，熏其現行，令造善惡業果，連綿不斷。亦如魚隨長流，去而不返。故唯識雲：如瀑流 水，上下魚草等物，隨流不捨。此識亦爾，與內習氣、外觸等法，恆相續轉。（阿賴耶識，無始時來，與作意、觸、受、想、思五心所，恆常相應。）此由惑造業， 以對集諦。光明文句，亦以水對集。以水體潤生，如集能資苦。長流者，一業若成，罪無邊際，百仟萬生，受報不盡也。脫入暫出，從三塗而升出人天；又復遭網， 從人天而復墮三塗。故五苦章句雲：三惡道者，是為一切眾生之家，暫得為天，暫得為人，譬如作客。作客日少，歸家日多。學者思之，勉力精進，可得脫苦，正斯 謂也。

△

【以是等輩，吾當憂念。】

　　佛言：人身難得，六情難具，口辯難中，才聰難致，壽命難獲，明人難遭，直信難有，大心難發，經法難聞，如來難值。世間有樹，名優曇缽，但有 實，無有華。如來出世，乃有華耳。已得人身，六情完具，口辯才聰，壽命延長，遭值明人，發菩薩心，直信不還，具聞法經，遇如來世，此皆宿行履福德人，從明 入明，尋如來跡，纍行不止，會於道場，無毀其根，亡失前功，一失道意，動有劫數。故如來憂之念之。蓋佛觀大地眾生，猶同一子，憂其性識無定，重結善惡業 果，念其暫出人天，復遭三塗密網，故我殷勤付囑救護解脫也。

△

【汝既畢是往願，纍劫重誓，廣度罪輩，吾復何慮。】

　　罪輩，准上文，通指五道。吾所憂念者，端為是輩。汝既畢願度之，吾復何憂何慮焉。問：諸天清升，精修禪定；七眾端肅，恭秉律儀，何亦名罪輩 耶？答：天上亦有諸苦，同是輕報泥犁。又人中不學解者，恆迷道法，雖修諸善，不除邪報。故俱捨論雲：在家由取五塵，故起鬥爭；出家由取諸見，故起鬥爭。成 論雲：若人持戒，取為清凈，名戒取結。即謂所取以為真實，余皆妄語，名見取結。此二是出家人鬥爭根本。又戒取是出家人縛；諸欲是在家人縛。是則戒取等，唯 是世善，招生死果，故名隨苦，非真道法。愚人多迷，妄執生罪。准此，罪輩奚辭。故知內教七眾，有執俱非；外道六師，無著皆正。若了諸法原（「原」一本作 「人」）空，一真本寂，入平等門，遊無為捨，一切無礙人，一道出生死，則罪輩之名，何有於我哉。

△

【說是語時，會中有一菩薩摩訶薩，名定自在王，白佛言：世尊！地藏菩薩纍劫已來，各發何願？今蒙世尊殷勤贊嘆，唯願世尊略而說之。】

　　初敘名定自在王者，此大士，人中之龍。世間有愛，皆遠離之。繫縛解脫，諸漏已盡。那伽常在定，無有不定時，於定自在，名定自在王。白佛下，正 問，適聞世尊，謂地藏菩薩畢是往願，纍劫重誓，不審於纍劫中，各發何願？今蒙世尊於大會中，詞不置口而贊嘆耶。唯願下，請說纍劫之願，願略舉之。佛說法有 廣略二門，今請略說也。

△

【爾時，世尊告定自在王菩薩：諦聽！諦聽！善思念之。吾當為汝分別解說。】

　　誡以諦聽善思者，佛法洪深，願門廣大，唯信力能受。大論雲：專視聽法如渴飲，一心入於語義中，踴躍聞法心悲喜，如是之人應為說。以諦聽善思能成三慧也。下許說。一切諸法，本不可說，不生不滅，法如涅槃。今以因緣故，為分別而解說之。

△

【乃往過去無量阿僧祇那由他不可說劫，爾時有佛，號一切智成就如來、應供、正遍知、明行足、善逝、世間解、無上士、調禦丈夫、天人師、佛、世尊，其佛壽命六萬劫。】

　　初敘劫久遠。爾時下，舉佛名號。號古從口從ㄎ（音考）若加虎，音毫。虎之怒聲，又大呼也。號，啕也。今古積訛，殊難改矣。梵名薩婆若多，般舟名薩雲，秦言一切智相。以一心中得三智故。既得如實智慧成就，則乘此來成正覺，故名一切智成就如來。

　　應受諸天世人最上供養，名應供。正，名諸法不動不壞，遍，名不為一法二法，以悉知一切法無余不盡，名正遍知。明，謂三明，如後；行者，菩薩從 初發意乃至金剛三昧，身業口業清凈隨意行，名明行足。如先佛所去處，佛亦如是去，第一上升，永不復還，名善逝。解，即是知，知世間眾生界一切種煩惱及清 凈，名世間解。諸法中涅槃無上，眾生中佛為無上，以無所斷，名無上士。佛能調伏眾生，善護根門。長阿含雲：善禦六觸，護持調伏，猶如平地，駕四馬車，善調 禦者，執鞭持控，使不失轍。若雲調女人，則不尊重，故名調禦丈夫。佛度余道眾生少，度人天眾生多，故名天人師。一切智慧成就，知眾生非眾生，數常無常等 法，故名佛。具上十號，世所共尊，故名世尊。壽命六萬劫，清凈國土勝應之佛壽歟。然約時數，劫有四種：一、別劫，二、成劫，三、壞劫，四、大劫。若更舒 之，別有六劫：一、別，二、成，三、住，四、壞，五、空，六、大。若更束之，則有三劫：一、小，二、中，三、大。從人壽十歲漸至八萬歲，經多時，八萬歲又 漸減至十歲，為一別劫。（對總名別，即增減劫。）小即別劫，中則成壞隨一，大則總成與壞，合八十別劫為一大劫。今雲六萬劫，應例同極樂佛壽長遠，不當依此 土三劫定判。然唯佛與佛乃能知之耳。

△

【未出家時，為小國王，與一鄰國王為友，同行十善，饒益眾生。】

　　賢愚經雲：若聽人民，若自己身，出家入道，功德無量，非譬為比，高於須彌，深於巨海，廣於虛空。由出家故，畢成佛道。大師明四種出家：一、形 心俱不出，二、形出心不出，三、形不出心出（觀行出家）四、形心俱出，能見佛性。出二死家，方真出家。昔王正第四人，故能成佛。友者，合誌也。誌合，則交 相助益。故取上下二又，以見協力之意。同行二句，正釋友道，誌同道同也。十善，十惡之反。凡四輪王，俱以十善，化民成俗。以十善，乃生天之本。今小王同行 十善，均有普慈之心矣。事佛吉兇經雲：十惡怨家，十善厚友，安神得道，皆從善生。有能守信，福報自然，從善至善，非神授與。故頒宣法教，示現人民，為作福 田。信者得植，後生無憂。如是饒益黎民，不失仁王之化矣。

△

【其鄰國內所有人民，多造眾惡。二王議計，廣設方便。】

　　人民，國之本也。民，眾生也。天地生人之初，其外樸野，其中真純，人各全一混沌。開天之天，是為天民。開而之人，凡民也已。故曰人民。眾惡， 即具造十惡業，大與十善反也。事佛吉兇經雲：既不燒香然燈禮拜，恆懷狐疑、嗔恚、罵詈、惡口、嫉賢；又不六齋，殺生趣手，不敬佛經。若疾病者，便呼巫師蔔 問解奏，祠祀邪神，此從宿行惡道中來，現世罪人，死入泥犁，被拷掠治，酷不可言，皆由積惡，其行不善故。二王商議計校，畢竟如何廣設方宜便巧之法，救此眾 惡之民，不失君師之化也哉。

△

【一王發願，早成佛道，當度是輩，令使無余；一王發願，若不先度罪苦，令是安樂，得至菩提，我終未願成佛。】

　　大論雲：成就眾生有二種：有先自成功德，然後度眾生者；有先成就眾生，後自成功德者。正二王發願之旨。以成佛乃度生根本，能廣化道，故願成 佛。故經言：一人出世，多人蒙慶，福樂饒益，佛世尊也。故先自成，方能度是惡輩，皆入滅度，使無遺余。此正初發心時，便成正覺。一王作念，自未得度先度眾 生，方是菩薩發心。豈應先為己耶。如大論雲：佛說我以清凈天眼，見諸眾生，死此生彼，隨善惡業，受諸果報。我今應先度脫罪輩，令其得無上涅槃之樂。寧使長 在生死，誓終未願成佛。此正發僧那於始心，終大悲於赴難。故二王發願，似有不同也。

△

【佛告定自在王菩薩：一王發願早成佛者，即一切智成就如來是；一王發願永度罪苦眾生，未願成佛者，即地藏菩薩是。】

　　人王發願成道，如執券取物。故雲法性如大海，不說有是非，凡夫賢聖人，平等無高下，唯在心垢滅，取證如反掌。驗此國王，其洵然矣。然塵沙劫事，宛如今日者，乃是佛眼無法不知，無事不見也。

△

【復於過去無量阿僧祇劫，有佛出世，名清凈蓮華目如來。其佛壽命四十劫。】

　　佛出世者，以今釋迦，例同古佛。如因果經雲：菩薩功行滿足，位登十地，在一生補處，生兜率天，期運將至，當下作佛，即觀五事：一、觀生熟與未 熟，二、觀時至與未至，三、觀何國處中，四、觀何族貴盛，五、觀過去因緣，誰為父母。觀已，下生。以今揆古，亦猶然耳。清凈蓮華目，三十二相之一。如寶女 問佛：如來有三十二大人之相，前世宿命，行何功德，而致是相，遍佈於體？佛雲：如來瞳子如紺青色大人相者，乃往古世，常以慈目察眾人故。如來之眼，如月初 生大人相者，乃往古世，無粗暴誌，心性和順故。彼佛即以所得之相，以立其名。所謂面如凈滿月，目若青蓮華。蓋報佛稱為凈滿，諸惡都盡，眾德悉圓，故得天然 妙目如清凈蓮華也。

△

【像法之中，有一羅漢，福度眾生。】

　　像法居正末二法之間，乃塔寺堅固之時。以惟修有為福事。乃下文塑畫形像之伏案也。羅漢，因名乞士，果成應供。一切法高王經雲：四行四得，八富 伽羅，應受世間天人供養，合掌恭敬，無上福田。故長阿含：堅固念轉輪王告太子雲：汝土境所有沙門，履行清貞，功德具足，獨到涅槃，仁惠無厭，衣食知足，持 缽乞食，以福眾生故。言福度眾生。

△

【因次教化，遇一女人，字曰光目。設食供養。】

　　如來既已滅度，羅漢次第教人，化惡為善，革凡成聖。字言光目者，准靈樞經：五臟六府之精氣，皆上註於目，而為之精（睛同）。精之窠為眼，骨之 精為瞳子，筋之精為黑眼。蓋目形類丸，瞳神居中而前，如日月之麗東南而晦西北也。然目能發光者，以藏府之精，皆秉受脾土。脾為諸陰之首，目乃血氣之宗。故 脾虛，則五藏精氣，皆失所司，不能歸明於目矣。今聖女既能孝順二親，恭敬三寶，自然有神膏、神水、神光，真氣、真血、真精、滋目之液，光發異常。若約法 論。目錶定，光錶慧。因定發慧，慧光註目，立此嘉稱也。設食供養，食乃眾生之外命，人持飯食施人，有五功德令得道：一、施命，二、施色，三、施力，四、施 安，五、施辯，是為五福。若施羅漢，福百倍矣。如那律昔以一飯施辟支佛，遂感九十一劫無貧之報，又得道果，故須供養也。

△

【羅漢問之，欲願何等？】

　　佛世應功常儀，食竟必問所願。如迦葉問貧母言：母今意中所願何等？世間豪富、轉輪聖王、及四天王、釋梵諸天？若復欲得須陀洹果，乃至三佛者，悉可得果其願，是也。

△

【光目答言：我以母亡之日，資福救拔，未知我母生處何趣？】

　　亡者，去也，不存也。從入從∟（音隱）謂入於隱處也。然母亡資福，乃孝子正事。父母生我身，依斯乳哺長大成人，此恩此德，歴劫難酬。涅槃經雲：知恩者大悲之本，不知恩者甚於畜生。今光目女欲知母托生之處，可謂知恩得本，越度恆情矣。

△

【羅漢湣之，為入定觀。見光目女母墮在惡趣，受極大苦。】

　　湣其為孝倍常，故為入定觀母。見字屬上句末，顯能觀之慧眼，女母乃所觀之苦境。此准大師釋法華，我以佛眼觀見六道眾生偈，擘見字屬上科雲，明 佛有能見眼，六道眾生明所見五濁。彼經五字伽陀，尚擘下字屬上。況今一連之文，寧不作此讀耶。不然即以觀見二字為下句首，尤通以智境合明也。極大苦者，無 間大地獄也。問：准大論，慧眼不見眾生盡滅一異相，不受一切法。慧眼不能度眾生，無所分別，故生法眼。今羅漢慧眼了知空寂，如何能見其母受苦耶？答：慧眼 知空，謂於境不著，豈如生盲，全無所見耶！故大品雲：慧眼菩薩，無法不見，無法不知，無法不識，是為慧眼凈，明文可據也。況乃因次教化，已有菩薩出假之 意。蓋阿羅漢既與別教十行同除四住，自能進斷界內塵沙。故四明雲：亦有法緣慈悲，隨世利物也。

△

【羅漢問光目言：汝母在生，作何行業，今在惡趣，受極大苦。】

　　作者，造作。如佛所說，三界五道罪垢苦惱，不離於作。一切無橫，非天授與，乃自作而自受也。行以遷流為義。五陰中心所法。因過去無明之惑，起於三業，造作諸法，名為行業。業成報現，故在惡趣，受極大之苦也。

△

【光目答言：我母所習，惟好食啖魚鱉之肉（一本作「屬」）。所食魚鱉，多食其子，或炒或煮，恣情食啖，計其命數，仟萬復倍。尊者慈湣，如何哀救？】

　　所習，指習性、習氣。惡習種子內熏現行，轉習於惡矣。下明作業。惟之為言，獨也。好者，愛而不釋也。女子性柔而滯，有所好，則愛而不釋。今光 目之母，獨好食啖魚鱉之子，而情有所不能釋也。埤雅雲：鱉以眼德，穹脊連脅，甲蟲也。一名神守（魚滿三百六十，龍為引飛出水，內鱉則不去。）古今註，名河 伯從事。（會稽陶歇庵放生詩，有從事愁見拘，波臣苦遭蕩，之句。）詩雲：炰鱉鮮魚，謂鮮魚中鲙者也。炰鱉膾鯉，言熟則有炰鱉，腥則有鲙鯉也。光目之母，習 好於斯乎。此明殺生，下明食法。惟好魚鱉之子，炒煮恣食，則令子母俱亡。然母命是一，子之命不知其幾幾矣。自有家至死，習以為常。所殺母子之命，非可計 算，故雲仟萬復倍。此乃博求眾命，以資一膳，不惟忍心，亦且損福。東坡雲：刀駕（音彎，削也。）魚鱉，以為饈膳，食者甚美，死者甚苦。周颙雲：性命之於彼 極切，滋味之在我可賒。此皆仁人痛怛之詞也。情者，天真感物，發動性之欲也。人欲不可謂之情，氣質妄動，則遁天倍情。人常拘檢，猶恐放之。儻一縱恣，不可 遏絕矣。故傅大士雲：獨自情，其實離聲名，推檢四運併無生，荊棘叢林何處生。可謂善制妄情，而循天真也已。尊者下，求慈救。謂我母既業深罪重，受此大苦。 今懇尊者慈悲憐湣，畢竟如何哀矜而救拔之。

△

【羅漢湣之，為作方便。勸光目言：汝可誌誠念清凈蓮華目如來，兼塑畫形像，存亡獲報。】

　　念佛塑像，即哀救之法。心所主持曰誌。從心從止，像深沈堅定之意。實德曰誠，性命之根。天得之以成天，地得之以成地，人得之而自成。不誠，是 為自壞，摺卻性命之根，崩陷吾天地也。從成，立意直指人真心。復從言者，以散吾之誠，莫如言之漏泄天元。修詞立誠，無事不實，發於言行，皆吾誠之運，致一 之功也。

　　念清凈蓮華目如來者，正所以吐邪倒之根，拔貪嗔之本，修念佛之因，證見佛之果。故佛告比丘：我滅度後，若稱我名，所獲福德無量無邊。故教令稱 本師佛名也。塑畫形像，埏土象物曰塑，繪施五彩曰畫。如優填王問佛言：若佛滅後，其有眾生，作佛形像，當得何福？佛告王曰：若當有人，作佛形像，功德無 量，不可稱計。世世所生，不墮惡道。天上人中，受福快樂，乃至作大梵王。端正無比，後皆得生無量壽佛國，作大菩薩，最尊第一，當得成佛，入泥洹道。今故勸 行二事，令存亡獲報也。

△

【光目聞已，即捨所愛，尋畫佛像而供養之。復恭敬心，悲泣瞻禮。】

　　畫像供養，人所易行。即捨所愛，人所難作。今既捨愛畫像，恭敬泣禮，藉佛救母，以道報親，純孝之心，照耀仟古矣。

△

【忽於夜後，夢見佛身，金色晃曜，如須彌山，放大光明。】

　　夜夢佛身者，雜寶藏經雲：佛法寬廣，濟度無涯，至心求道，無不獲果。乃至戲笑，福不唐捐。故孝女捨愛畫像，悲泣瞻禮，佛即現身，復放光明。至 人應感慈赴物機，色相光明夢慰悲懇。准善見律，夢有四種：一、四大不和夢，（見山崩飛空、虎狼賊逐等）；二、先見夢，（晝見黑白男女，夜克夢見）；三、天 人夢，（天人現善惡夢，令人得善惡事）；四、想夢，（前身或有福罪障，今現善惡夢）。前二不實，後二真實。今是後二夢也。出生菩提心經雲：若有夢見佛形 像，諸相具足莊嚴身，眾生見者應歡喜，念當必作調禦師。今光目所夢，豈非純以出世大孝，感格第一義天，致斯瑞應耶！金色等者，大須彌東面，及小須彌七山， 純是黃金。佛身晃曜，亦如彼山，更放光明，色相愈妙矣。

△

【而告光目，汝母不久當生汝家。才覺饑寒，即當言說。】

　　夢佛身放光告母生處，絕奇之事矣。生汝家，慰其生處；即言說，潛示求救也。

△

【其後家內婢生一子，未滿三日，而乃言說。稽首悲泣，告於光目：生死業緣，果報自受。吾是汝母，久處暗冥。自別汝來，纍墮大地獄。蒙汝福力，方得受生，為下賤人。又復短命，壽年十三，更落惡道。汝有何計？令吾脫免。】

　　文分三節，初述敘生緣。生死下，述訴苦境。蒙汝下，述謝求救。婢子者，奴婦所生之子也。梵名馱索迦，此雲奴。說文雲：男入罪曰奴，女入罪曰 婢。婢，女之卑者。長阿含雲：生子墮地能言，故名聲王。如今初生有能言者，人皆佈畏，名為可畏。今小兒生三日，即稽首泣告，亦事之變怪也。佛力使之，令不 昧宿緣耳。生死二句，情理慘淡。昔賢雲：死生亦大矣，豈不痛哉！業緣十惡之因，果報三塗之處。十地論雲：殺得三果：一、異熟果，謂三惡道。二、等流果，謂 生人中多病短命。三、增上果，謂感外物皆少光澤，不久住故。樹提經雲：何物最穢濁？生死最穢濁。何物落地獄？十惡落地獄。自作自受，無代受者。經雲：作是 得是，皆行所致，無橫與者，其事明白，故總傷嘆之。

　　久處暗冥者，五苦章句經雲：但坐慳貪食，故墮黑繩城。鐵圍兩山間，窈窈何冥冥。神識墮其中，不睹日月精，展轉不相見，但聞叫呼聲。是也。自別 等者，自從也。無常偈雲：親知鹹棄捨，任彼繩牽去，將至琰魔王，隨業而受報，惡業墮泥犁，造業苦切身。故從一大地獄至一大地獄矣。蒙汝下，先敘福力脫過去 罪，後方求救脫將來苦。福力，即稱名塑像，脫獄受生，下賤短命，重業輕報，更落惡道，余殃未盡也。梵名薩拘盧楴，此雲賣姓，即下賤人。四人出現經雲：或有 人生卑賤家，及余貧賤家，無有飲食。雖復得食，臭穢難嘗，生如此家，彼身口意行惡故也。短命者，世壽有三品：下方六十，中方八十，上方百二十。今下壽猶 減，非短命而何？命者，准大集：歌羅邏時，即有三事：一命、二暖、三識。出入息者，名之為命。此識之種，即是命根。依心假立，命為能依，心為所依。今既生 下賤，又復短命，更落惡道，三果備集，豈不苦哉！故即求計脫免也。

△

【光目聞說，知母無疑。哽咽悲啼，而白婢子：既是我母，合知本罪，作何行業，墮於惡道。】

　　先敘事既聞上說事實情真，審知是母，無待更疑。故聲塞而哽咽，號泣而悲啼也。既是下，徵問既說文訓已，已是我母，合知本所造罪矣。載審問者，恐詿訛耳。

△

【婢子答言：以殺害、毀罵二業受報。若非蒙福，救拔吾難，以是業故，未合解脫。】

　　先直答本業受報，惟以殺生、毀罵身口二業，致斯地獄之報。故賢愚經：蘇曼女告諸子曰：殺生之罪，當入地獄，受諸苦惱。數仟萬歲，常為鹿頭、兔 頭、諸禽獸頭阿傍獄卒之所獵射。無央數歲，雖思解脫，其何由乎！荀子雲：與人善言，暖於佈帛；傷人之言，深於矛戟。況毀罵乎！故成論雲：若人惡口，種種罵 詈，隨語受報。故此二業僉報地獄。若非下，反顯福救解脫。殺生居眾罪之上，毀罵在萬惡之先。若非我女蒙羅漢指示，稱名塑像福利以救拔吾難，則吾殺罵二業之 報，何有解脫之期！

△

【光目問言：地獄罪報，其事雲何？婢子答言：罪苦之事，不忍稱說。百仟歲中，卒白難竟。】

　　初、光目問，次、婢子答。不忍者，甚言不能出諸口耳。即欲說之，亦不能形容一二。卒，盡也。竟，終也。縱於百仟歲中，盡白罪苦之事，恐難終窮也。

△

【光目聞已，啼淚號泣而白空界：願我之母，永脫地獄。畢十三歲，更無重罪及歴惡道。】

　　號，大哭也。內心痛裂，外哭號啕，哭久吞聲，名之為泣。含悲白空界雲：願我故母，永脫地獄。畢此一十三齡之短，銷其一十八獄之長。更不載歴惡道，受苦無量也。

△

【十方諸佛，慈哀湣我，聽我為母所發廣大誓願。若得我母永離三塗及斯下賤，乃至女人之身，永劫不受者。】

　　求十方現命現住河沙世界諸佛者，一、顯誓心廣大，二、懇現佛慈哀三塗下賤。如心地觀雲：或有以貪多財，而為恐怖自己財寶，恆求積聚，而不受 用，何況能施貧乏眾生。於己財寶，深生貪著，於他財寶，欲令損減，以是因緣，命終之後，墮大地獄，受無量苦。如是苦報，名為第一正感之果。從地獄出，受畜 生身，身常勞苦，水草不足。經多時中，酬損他財。如是眾生，名為第二正感之果。受是罪已，生餓鬼中。因饑渴苦，無量仟劫不聞漿水飲食之名。其咽如針，其腹 如山，縱得飲食，隨變為火。如是苦身，名為第三正感之果。畢是罪已，來生人間，貧窮下賤，為它所使，於諸財寶，所求難得，於一切時，而不自在。如是余報名 相似果，與今正合。者字，牒上諸事。謂若得脫我母現身生後之報，我即對佛發廣大度生之願矣。

△

【願我自今日後，對清凈蓮華目如來像前，卻後百仟萬億劫中，應有世界，所有地獄及三惡道諸罪苦眾生，誓願救拔，令離地獄、惡趣、畜生、餓鬼等。如是罪報等人，盡成佛竟，我然後方成正覺。】

　　自今日後，標始心也。蓋萬裏之克離初步而不登，三祇之功非始心而罔就。故舊婆沙雲：若離初心，則不成無上道。一切功德，皆在初心。故知此經明 地藏發心，前後四番，後卻是前。今是最初，故曰自今。對佛像前，所依之主也。仟百億劫，所歴之時也。應有世界，括盡依土也。地獄等者，苦眾皆度也。如是 下，正顯度盡眾生，然後自成正覺。番番發願，莫不皆然。故知最初發心功德，億劫稱揚不盡者矣。

△

【發誓願已，具聞清凈蓮華目如來而告之曰：光目，汝大慈湣，善能為母發如是大願。】

　　具，俱也、足也，備聞其言也。大慈湣，遍緣法界也。善能為母發願者，贊其發心黠慧，若但為母發心，何善何能，乃以曠濟之心，求畢母罪。譬如大水而滅小火，豈有不滅者乎！故贊其既善且能也。

△

【吾觀汝母，十三歲畢，捨此報已，生為梵誌，壽年百歲。過是報後，當生無憂國土，壽命不可計劫。後成佛果，廣度人天，數如恆河沙。】

　　離下賤家，生凈行種；易短命子，為長壽仙。此孝女念佛塑像發心之力也。梵誌，正翻凈裔。是凈梵苗裔，承習梵天法。自雲從梵天口生。故獨取梵 名，唯五天竺有，余國即無。長阿含稱為婆羅門。一子求佛發心，其母三報俱轉。初生下賤，以轉前報；次生梵誌，以轉現報；後成佛果，以轉後報。

　　無憂國土，即指極樂，轉憂為樂也。蓋初生地獄，以燒煮為憂；次生婢家，以下賤為憂；畢十三歲，以更墮惡道為憂；後生梵誌，以邪行自大為憂；今 諸憂併息，故生無憂國土。彼佛人民壽命無量無邊阿僧祇，故雲壽命不可計劫。廣度人天者，昔為罪母，乃地獄所度之死囚。將作如來，乃人天能化之大覺。發心塑 像，功莫與京。故一切法高王經，佛告捨利弗：初發菩提之心菩薩摩訶薩，即發心日，已是一切聲聞、緣覺、眾生福田。一切眾生皆於菩薩中生，菩薩所化。故其所 化之眾，如恆沙之多也。

△

【佛告定自在王：爾時羅漢福度光目者，即無盡意菩薩是。光目母者，即解脫菩薩是。光目女者，即地藏菩薩是。】

　　昔成小果，今作大人，回小嚮大也。無盡意，廣如別行疏明。今准記雲：願、行皆無盡故，皆無作故，得無盡名。皆即法界，皆含一切佛法故。解脫菩 薩者，昔墮鐵城，備經辛苦，次生婢家，又復短命，後為梵誌，終墮邪流。今展轉而為不思議大解脫士，佛果可期矣。然光目，由羅漢之指示。女母，因光目而超 升。今於我佛垂化將終，上升忉利之候，能所畢至，子母俱來，夐隔沙劫，一會儼然。打鼓弄琵琶，還來共一家，其斯之謂歟。

△

【過去久遠劫中，如是慈湣，發恆河沙願，廣度眾生。】

　　發心之始，付囑之後，劫數長遠，胡可籌量。如是慈湣句，略結上來四番，廣指恆沙劫願。妙玄引大經雲：若有人問，誰是一切諸善根本？當言慈是。 慈若不具佛十力、四無所畏、三十二相者，是聲聞慈。若具足者，是如來慈。即大法聚，即大涅槃。慈力弘深，具一切福德莊嚴。今地藏菩薩以大涅槃心，修於聖 行，得無畏地，具二十五王三昧，無方大用，是真梵行。故才言慈湣，功德具足矣。

△

【未來世中，若有男子女人，不行善者行惡者，乃至不信因果者，邪淫、妄語者，兩舌、惡口者，毀謗大乘者，如是諸業眾生，必墮惡趣。若遇善知識，勸令一彈指間歸依地藏菩薩，是諸眾生，即得解脫三惡道報。】

　　文初分列惡眾。若遇下，歸依轉報。善惡二法，意內生成。譬之水火，異途施化。故經言：善業應修，惡行應離。善福追人，如影逐形，不可得離。罪 福之事，亦皆如是。勿作狐疑，自墮惡道。罪福分明，諦信不迷，所在長安。佛語至誠，終不欺人。不信因果者，即一闡提。如弊宿婆羅門，常懷異見，言無他世， 亦無更生，無善惡報。常為人言：沙門異見，言殺生乃至邪見者，身壞命終，皆入地獄；言不殺生乃至不邪見者，身壞命終，皆生天上。初未曾見死者還來，說所墮 處。故我不信有後世，及善惡報。此蓋不了業報差殊，故揚撥無因果之談。乃至者，惡事多端，非一二可[既/木]。但不信罪重，故特點出。

　　邪淫者，身三惡端也。非謂幹犯外色為邪，但一起心，則淫泆失正。良由世人不知舉身不凈，妄著妖艷，乖梵天道，障菩提業。為四生因，成三塗果。潤業偏重，故聖制居首。

　　妄語者，虛妄不實也。准正法念：妄語惱人，失實功德。常如黑暗，有命同死。語刀自割其舌，勝於炎火毒蛇，命終墮獄，口出膿血等。

　　兩舌者，一口說兩般話，似有兩個舌頭。經雲：太喜多言語，增貪令他畏，口過自誇誕，兩舌第一處。

　　惡口者，粗惡罵詈人等。法句經雲：雖為沙門，不攝身口，粗言惡說，多所中傷，眾所不愛，智者不惜。身死神去，輪轉三塗，自死自生，苦惱無量。 諸佛聖賢，所不愛惜。假令身雖無過，不慎口業，亦墮惡道。大論說：一鬼頭似豬頭，臭蟲從口出，身有金色光明。是鬼宿世作比丘，惡言罵詈客。比丘身持凈戒， 故有光明；口有惡言，故臭蟲從口出。故增一雲：寧以利劍截割其舌，不以惡言粗語，墮三惡道。

　　毀謗大乘，如前如後，如是諸業眾生，是總結不行善等，必墮惡趣，結成罪處。若遇善知識，去明解脫。若者，不定之辭。惡中儻有毫善，或能遇之， 不則難遇矣。文句雲：或言知只是識；或言聞名為知，見形為識。今教一彈指頃，歸依地藏菩薩，是真善知識，以即脫三惡報故也。准僧祇律，二十念為一瞬，二十 瞬名一彈指。依新婆沙：壯士彈指頃，經六十四剎那。然歸依只一彈指，而惡道仟生解脫，歸依之力，莫可涯量，故勸之也。

△

【若能誌心歸敬及瞻禮贊嘆，香華、衣服，種種珍寶，或復飲食，如是奉事者，未來百仟萬億劫中，常在諸天受勝妙樂。若天福盡，下生人間，猶百仟劫常為帝王，能憶宿命因果本末。】

　　先明供養。初句總標誌心等，如文。香華，准密部說：香是能悅懌三昧。以此供養，即得如來無礙之智。華是寶莊嚴三昧。以此供養，速得如來四八妙 相。梵語震越，此翻衣服。衣，依也。所以庇寒暑，遮醜陋也。種種珍寶，故佛地論，有無量七寶之說。飲食，半者蒲善尼，唐言五啖食。謂飯餅[麯-匊+少] 等，此名正食。自辰至午，隨意啖之。過午不得食矣。半者珂但尼，此雲五嚼食。謂根莖葉華果等，此名不正食，齋後不食果菜，是也。如是奉事句，結上供養而牒 定之。未來下，示福報。正明生天受福。若天下，顯有余福。如百緣經：採華人供佛因緣，命終生忉利天。又栴檀香比丘生時，身諸毛孔，出栴檀香；口出優缽華 香。此由以栴檀香供養毗婆屍佛塔故。

　　德象天地稱帝，仁義所生稱王。如此方五帝三王也。憶宿命等，得宿命智。如阿摩畫經，佛言：彼以心定，清凈無穢，柔軟調伏，便能憶識宿命無數若 幹種事。能憶一生至無數生。劫數成敗，死此生彼，名姓種族，飲食好惡，壽命長短，所受苦樂，形色相貌，皆悉憶識（文）。故雖從天下降而為帝王，了了憶識百 仟劫前，初由瞻禮地藏之因，感生天上之果，最初生天之本，及今為王之末，無不憶識而洞知也。譬如有人，從己村落至他國邑，在於彼處，行住語默。復從彼國至 於余國，如是展轉，更還本土。不勞心力，盡能憶識所行諸國。從此到彼，從彼到此，行住語默，皆悉憶之。是則地藏威神之力，可思議乎哉！明利益竟。

△

【定自在王！如是地藏菩薩有如此不可思議大威神力，廣利眾生。汝等諸菩薩，當記是經，廣宣流佈。】

　　如是句，結能度人。有如句，顯所施用。如此不思議人法之經，可不記之心胸，而廣宣流佈哉！

△

【定自在王白佛言：世尊！願不有慮，我等仟萬億菩薩摩訶薩，必能承佛威神，廣演是經，於閻浮提，利益眾生。】

　　佛法應流沙界，利益不局閻浮。但南洲之人，性識無定，惡業偏多，故煩佛菩薩等偏嚮贍部洲也。

△

【定自在王菩薩白世尊已，合掌恭敬，作禮而退。】

　　如文，定自在王問答竟。

△

【尔时，四方天王俱从座起，合掌恭敬。】

　　拥护四洲地面，防逻恶鬼侵凌，故云四方天王。准世记经：须弥山王四出埵高四万二千由旬。四天大王所居宫殿，有七重宝城。栏楯、罗网、行树、宝 铃各有七重。无数众鸟相和而鸣。东方黄金埵，王名提头赖吒，此翻持国，护持国土故。领乾闼婆，（此云寻香行，天帝俗乐神）。富单那，（此云臭，饿鬼中胜 者，主热病）。南方琉璃埵，王名毗留勒叉，此翻增长，令自它善根增长故。领鸠槃荼，（此翻瓮形，是厌寐鬼）。薜荔多，（此云祖父鬼，饿鬼最劣者）。西方白 银埵，王名毗留博叉，此翻杂语，能作种种语故。领毗舍阇，（此云啖精气鬼，亦云颠狂鬼）。毒龙，（眼毒、声毒、气毒、触毒）。北方水精埵，王名毗沙门，此 翻多闻，福德之名闻四方故。领夜叉，（此云轻捷，飞空疾捷故）。罗刹，（此云可畏，亦名暴恶）。四王各有九十一子，皆字因陀罗，有大神力。然此四天，毗沙 门为尊。若王念及三方天王，即严驾诣毗沙门天王，于一面立。故北方天王，统领三方。从座而起，钦承法要，渴仰在心，故合掌恭敬也。

△

【白佛言：世尊！地藏菩萨于久远劫来，发如是大愿，云何至今犹度未绝，更发广大誓言？】

　　因闻四番弘誓，蹑前起疑而问也。盖谓大士既于久远劫来，发是大愿，自应度尽众生已。今既不尽，而重发者，为愿力有未至耶？果众生之难度耶？故曰云何。

△

【唯愿世尊，为我等说。】

　　为我等说者，事有相关也。以我等正护四方，而南洲偏多恶业。彼虽负大士救拔之心，我亦抱护持世界之失，故愿说之，出我等于疑城，慰众生于未来也。

△

【佛告四天王：善哉！善哉！吾今为汝及未来现在天人众等，广利益故，说地藏菩萨于娑婆世界阎浮提内，生死道中，慈哀救拔度脱一切罪苦众生方便之事。】

　　双赞天王者，一以善巧发问，一以善护世间。言娑婆，则包括大千；举阎浮，则偏向南洲也。生死道中者，以六道皆有生老病死。今以生该老，以死摄 病。故说前后，以略中间，升沉互换，苦乐相通，生死循环，曾无休息。故地藏菩萨以无缘大慈，救济拯拔罪苦众生者。佛言一切众生，常在长狱，十二重城围之， 三重棘篱篱之，六拔刀贼伺之，能于其中得脱出者，甚难甚难。长狱谓三界，十二重城谓十二因缘，三重棘篱谓三毒也。今地藏因是众生，方便度脱，令其解三界 空，不习三有，则度脱三界。知十二因缘起灭，能度痴本，则出十二重城。知淫怒痴三垢无缠，意不复著，则拔三重棘篱。晓了六情皆无本末，则离六拔刀贼。此皆 大士曲垂方便，度脱之事也。

△

【四天王言：唯然，世尊！愿乐欲闻。】

　　华严解脱月菩萨云：相视咸恭敬，一心悉专仰，如蜂念好蜜，如渴思甘露。今亦如是，故言愿乐欲闻。

△

【佛告四天王：地藏菩萨久远劫来，迄至于今，度脱众生，犹未毕愿。慈愍此世罪苦众生，复观未来无量劫中，因蔓不断，以是之故，又发重愿。】

　　初述前慈愿，次示重发意，慈愍此世等。阿难分别经云：佛恩非不大，罪由众生故。世浊多恶人，还自堕颠倒。自作众罪本，命尽往无择。刀剑解身 形，洋铜沃其口。遭逢众厄难，毒痛不可言。若生还为人，下贱贫穷中。故大士慈愍而度脱也。复观未来等，如经云：伤生杌命，其罪莫大。怨对相报，无有断绝。 现世不安，数逢灾凶。死入地狱，出离人形，当堕畜生，为人屠割，以肉供人，未有竟时。世世为怨，还相报偿。神同形异，罪深如是。既由业缘展转相因，譬如葛 藟（音垒），累于樛（音鸠）木，萦牵不断。蔓，葛属，如葛蔓延。左传云：无使滋蔓，蔓，难图也。今业累系身，直如葛之覃延于中谷，唯见其叶之萋萋，何有断 绝哉。此由惑滋业，由业润生，生还造业，业复堕苦，以是之故，复劳地藏大士，又发极重之愿。亦如葛之覃兮，施（音异，及也。）中谷而莫莫也。

△

【如是菩萨于娑婆世界，阎浮提中，百千万亿方便而为教化。】

　　化光通被，应遍及于娑婆；悲愿弘宣，却偏流于赡部。妙玄云：菩萨三业，无非利物。今但云示身说法，不云意者，用彼二业不差物机，即意之善巧 故。今以方便该身意二轮，现通鉴机。下句，正口轮说法也。百千万亿者，期心业用不同，施化方便各别。如大论十七云：法身菩萨，变化无量身，为众生说法，而 菩萨心无所分别。如阿修罗琴，常自出声，随意而作，无人弹者。无散心，无摄心，福德报生，故随人意出声。法身菩萨亦如是。无所分别，亦无散心，亦无说法 相，是无量福德禅定智慧故，种种法音，随意而出。故十轮赞云：现作种种身，为众生说法，具足施功德，悲愍诸众生。是也。

△

【四天王，地藏菩萨若遇杀生者，说宿殃短命报；若遇窃盗者，说贫穷苦楚报；若遇邪淫者，说雀鸽鸳鸯报。】

　　先举十恶报。杀、盗、淫，身三恶也。杀生罪重，故先举之。夫人人爱命，物物贪生，蠢动含灵，皆有佛性。杀而食者，即杀诸佛。常在三涂，受无量 苦。若得为人，诸根不具，寿命损减。如鬼问目连：我生男女，而皆早死，念之断绝，何罪所致？答言：汝为人时，见儿杀生，助其欢喜，共啖其肉。杀故短命，喜 故痛毒。

　　窃盗者，荀子云：窃货曰盗。钱财玉帛是外所依，幡华僧物是内供养。窃外可忏，盗内难救，常在三涂，受无量苦，若得为人，贫穷困苦，诸天舍离。 则外无依怙，内无福德，故致贫穷苦楚。灯指经云：当知贫穷，比于地狱，贫穷茍生，与死无别，辛苦荼毒，世所无偶。经有数千言，广叹贫穷苦楚。

　　邪淫，如前。梵名摩由逻，此云孔雀。性妒忌，自矜尾，不必匹偶，亦与蛇交，物之淫者也。梵名迦逋，唐言鸽。鸽最喜合。凡鸟皆雄乘雌，此鸟雌乘 雄。故孔雀四时有子，鸽逐月有子。梵名斫迦逻婆，此云鸳鸯。匹鸟也。止则相耦，飞则相双，雄雌未尝相离，人得其一，一思而死。故曰鹊好外反，鸳号内思。俗 云：雄鸣曰鸳，雌鸣曰鸯。若生人中，得二种果报，亲厚斗讼，王法所加。

△

【若遇恶口者，说眷属斗诤报；若遇毁谤者，说无舌疮口报。】

　　此示口四报。恶口当一，毁谤摄三。以毁谤时，具妄言等。后生人中，有二余报，常闻恶声，恒有诤讼故也。故报恩经云：佛告阿难：人生世间，祸从口出。当护于口，甚于猛火。猛火炽然，烧世间财；恶口炽然，烧七圣财。一切众生祸从口出，毁身之斧，灭身之祸，正此谓也。

　　毁谤者，毁辱而诽谤也。大方广总持经云：谤法之人极大重业，堕三恶道，难可出离。以谤他故，七十劫中，受大苦恼。况彼愚人，实无所知，而自贡高，乃至诽谤一四句偈，定堕地狱，永不见佛，得无眼无舌之报，故不可不慎也。

△

【若遇嗔恚者，说丑陋癃残报；若遇悭吝者，说所求违愿报；若遇饮食无度者，说饥渴咽病报。】

　　此示意三报分别。善恶所起经云：人于世间，常喜嗔恚，不别善恶。死入太山，数千万岁。出生为人，面目常恶。今见恶色人，皆宿命嗔恚所致。

　　悭吝者，前经云：人得财产，悭贪不肯布施，不爱视诸家。贫穷者不给与，不供事沙门道士，不与乞儿病人。食饮不敢自饱，衣被不敢自完，人呼守财奴。恒荷惭愧。死堕饿鬼，见水走饮，便化消铜脓血。出生为人，贫穷冻饿，匈不能得。今有贫穷乞人，皆宿世悭贪痴种所致。

　　饮食，固人生不可阙者。然必有时度。九横经不量食，瑜伽论食过量，皆致横死，故须撙节。（无度即痴。）荀子云：偷懦惮事，无廉耻而嗜乎饮食， 则可谓恶少者矣。五苦章句云：食无节度，饮酒贪味，是汝重担。不舍担者，后入地狱。据此，则饥渴咽病，犹华报耳。咽喉，咽字，因坚切。咽喉二窍，同出一 腕。（音管，胃府。）异途施化，喉在前主出，为气息出入之要道；咽在后主吞，为饮食粮运之关津。咽病之咽，于歇切。塞也，即噎膈病。此三焦气化不行，故致 气逆胸膈之间，饮食难进咽喉。大宝积云：如咽塞病，即能断命，诚饿鬼之前相也。

△

【若遇畋猎恣情者，说惊狂丧命报；若遇悖逆父母者，说天地灾杀报；若遇烧山林木者，说狂迷取死报；若遇前后父母恶毒者，说返生鞭挞现受报；若遇网捕生雏者，说骨肉分离报。】

　　次明杂业报。畋猎始于宓羲氏。因天下多兽，故教民以猎，驱逐禽兽，为田除害。故春搜夏苗，秋猕冬狩，皆称为猎。今惟为利与口体，恣情杀害，故 堕三涂。出生人中，得惊狂丧命之报。如堕河落堑，马踏车伤等是也。（昔有富长者，生惟一子，娶方七日，为妻采华，堕树而死。长者问故。佛言：昔有一儿，挟 弓射雀，傍有三人助喜。此儿乃前世射雀之人，今父母与妻，昔之助喜三人也。）

　　梵名邬波弟铄，此云父母。[出/子]，（古悖字）子逆也。从子从出，不顾父母也。夫孝，本吾所生，仁自此始，是曰顺德。亡本弗爱其亲，谓之逆 德，非人道也。既行悖逆，自应遭天诛之灾杀矣。（归心录，载齐时相州何君平，母裴氏。少年诞平，后更不孕。父母爱同眼目。年至二十，不听别室。父因使出 外。母怜共私。后父还家，共母杀父，埋之后园。天雷霹，父尸出，后霹平身，具题因缘。亲邻告官，闻彻天听，敕杀裴氏，不听收埋。此乃淫母杀父，悖理逆伦， 犯上罪之猪狗，故表而出之。）

　　烧山林木，伤生多矣。梵网云：若佛子以恶心故，放火焚烧山林旷野。一切有生物，不得故烧。但一切世人，心怀惨毒，焚烧山野。或因风放火，恼害 一切，故得狂迷取死之报。（昔衢州杜司马，初为洛阳尉。城南午桥有民家被火焚煞数人。忽一人踉跄至县门，驰出复入，杜执而询之。首云：某即杀午桥居民者。 结伴五人，劫财物数百千，因纵火焚之。时欲脱走，足不能前。晨出南行，有火遮之。因此北走，复有火爇心。驱入县门，自知不免。杜悉捕贼党，送郡杀之。）准 三法度论，哭地狱，即焚烧旷野及熏烧穴居众生果报处也。

　　前后父母，即继父母也。因非己出之子，故以恶毒加之。如大舜，闵损之后母是也。返生鞭挞现受者，毋谓造化回薄，轮运毂转，责报它生。即现生中，或失手致死，受罪公廷。或子情极，返行鞭挞，何可定也。今人不识此理，恣情鞭朴，恐现报之不爽也。

　　网捕生雏。雏，鸟子也。鸟初生能自啄者曰雏。或网取，或手捕，皆招骨肉分离之报。以人鸟身异，母子情同也。（新淦有杨生者，以网捕禽雀为业。一日，有寒雀栖于树上。生装黏竿登枝，枝折而坠，头刺于竿，透其脑出血淋漓而死。）故大小乘，均制其事耳。

△

【若遇毁谤三宝者，说盲聋喑哑报；若遇轻法慢教者，说永处恶道报；若遇破用常住者，说亿劫轮回地狱报；若遇污梵诬僧者，说永在畜生报。】

　　此明三宝中报。佛如医王，法如良药，僧如瞻病人。今毁谤者，无信心也。十轮经云：若有刹利旃陀罗于三宝所起于恶心，一切诸佛所不能救，常堕地 狱饿鬼畜生，若得为人，盲聋喑哑。乌呼！盲则永不见三宝相矣，聋则永不闻三宝名矣，喑哑则永不能赞三宝德矣。虽生犹死，冥如长夜。故经云：宁吞然炭，无谤 三尊也。

　　轻法慢教者，如坚意经：佛告阿难，我今禅定，怜伤世人不知佛道真正弘深，而以浅伪轻薄之言，欲说嫉心，谤毁道根，或坏道法，轻毁沙门及优婆 塞，恶口妄言。当明此人为罪所牵。故胜天子经云：若有法师，流通此经，此地即是如来所行，于彼法师，当生善知识心，尊重之心，犹如佛心。我若住世一劫，若 减一劫，说是流通此经法师功德，不能究尽。今既轻法慢教，则其谁救护？永处三恶道中，受千万亿苦恼，欲得人身，如盲龟值浮木孔矣。

　　破用常住如前。

　　污梵，如前。诬僧，以无根波罗夷，谤彼比丘。如俱伽离谤身子、目连，行不净行，遂感身生恶疮，堕大莲华地狱。出其大舌，五百钉钉之，五百具犁耕之。则永在畜生，犹狱鬼之余报也。

△

【若遇汤火斩斫伤生者，说轮回递偿报；若遇破戒犯斋者，说禽兽饥饿报；若遇非理毁用者，说所求阙绝报；若遇吾我贡高者，说卑使下贱报；若遇两舌斗乱者，说无舌百舌报；若遇邪见者，说边地受生报。】

　　此明杂业报。汤火斩斫，杀生法也。以汤燖毛，用火灸体，或斩其头，或斫其足。经云：以人食羊；羊死为人，互相吞啖，无有穷已。故曰轮回递偿。

　　破戒者，若破律仪，粗罪易见。似持戒相，细恶难知。十住毗婆沙，佛告迦叶：有四种破戒比丘，似如持戒。一、有比丘于戒经中，尽能具行，而说有 我。二、有诵持经律，守护戒行，于身见中，不动不离。三、有具行十二头陀，而见诸法定有。四、有缘众生行慈心，闻诸行无生相，心则惊怖。是名破戒，似如持 戒。犯斋，如佛答舍利弗。非时食者，是破戒人，是犯盗人，与者亦然，非我弟子。是名盗食非法之人，盗与盗受，片盐片酢，皆死堕燋肠地狱，吞热铁丸。从地狱 出，生猪狗中，食诸不净。又生恶鸟，人怪其声。乃至饿鬼食粪，人中贫贱。准正法念，受遮吒迦鸟身，（恐是斑鸠之梵语，俟载考。）唯饮天雨，仰口而承，不得 更饮余水，是故常困饥渴也。

　　非理毁用，用者器用，或因气自毁，或恶心损人，良由器用，人所必需。耕有犁锄，工有斧凿，家有动用器皿，路有伞盖行具，舟车有篙桨轭轨。（上 音厄，轼也。下音月，车辕端持衡曲木也。）今忽无端毁之，自感需求阙绝之报矣。（昔太仓沙头沈姓者，邻家有网罟车犁之类，必借而阴坏之。一日，子妇归宁。 行未一里，忽雷雨大作，一龙入其家，席卷震荡，了无所遗，一家长幼俱死。）

　　吾我贡高者，吾，我身自谓也。贡，（公去声）献也。下献物于上曰贡，必高举而献之。今执我自大者，自高卑彼，如献物状，乃至生死之根也。故大 宝积云：一切见中，唯有我见，即时能断于智慧命。五苦章句云：自大种姓，贡高骄慢，恃智懱愚，轻邈他人，是汝重担。不舍担者，后入地狱。故其从地狱出，傥 得为人，必生卑使下贱之家。荀卿有云，桥泄者，人之殃也。（桥泄，嫚也。）于斯验矣。

　　两舌斗乱者，以曲为直，以直为曲，向彼说此，向此说彼，斗构是非，坏乱纲常。十轮云：有无量种斗讼违诤，互相欺陵，粗恶乖离，诬罔矫乱，生时既以两舌斗乱，它世自感无舌百舌之报。

　　邪见者，一切违理起者，悉是邪见。今别指者，由此见最恶，能断善根故。中论明二种：一、破世间乐，言无罪福圣贤等。二、破涅槃道，贪著于我， 分别有无，均名邪见。故感余报，生于边疆。五苦章句云：边地无义理，父子相咥（音戏，笑声。又音绖，啮也。）汝，家室互相卖，属人为奴婢，恒当给驱使，动 静加杖楚，虽得为人形，畜生共同侣。故大乘行人，尚畏边地受生也。然首举杀生，众恶之大本，终结邪见，业流之巨壑故耳。

△

【如是等阎浮提众生，身口意业，恶习结果，百千报应，今粗略说。如是等阎浮提众生业感差别，地藏菩萨百千方便而教化之。】

　　初句总标能造恶者，身口意业，明业因。恶习句，明习果。百千报应，明报果。身口等者，凡夫造业，乃有多种。有心与身口相称，有身口与心相违 者，凡动身口，皆由心使。故三业皆以心为根本也。恶习结果者，准弥勒问经，有三种。一、果报果，生地狱等。二、习气果，出生人中，依杀生，有短命果；乃至 依邪见，故痴心增上。（萨婆多论云：牛齝比丘，牛中来。以镜自照，淫女中来。目连戏跳，猕猴中来等。）三、增上果，依彼十种不善业道，一切外物，无有气势 等百千报应者。准优婆塞戒经：众生造业，有四种报。一、现报，（今身作业，今身即受。）二、生报，（今身造业，次后身受。）三、后报，（今受造业，更二三 生已去方受。）四、无报。（犹无记等业）无报复有四种：一、时定，报不定。（此于三时决定不改，由业有可转，故报不定。）二、报定，时不定。（由业力定， 报不可改。然时有可转，故时不定。）三、时报俱定。（业定故，时亦定。）四、时报俱不定。（由业不决定，故时报俱不定。）又涅槃，明烦恼余报等，如是百千 报应，今唯粗略说之耳。

　　如是下，正结差别。由众生作业，有具不具。若先念后作，名作具足；若先不念，直造作者，名作不具足。复有作不具足者，谓作业已，果报不定。复 有作已亦具足者，时报俱定。既众生业感差别，故菩萨教化，亦设百千方便。如十轮经，佛告坚净信菩萨云：此善男子，发心以来，不可思议阿僧祇劫，久已能度萨 婆若海。但依本愿故，化应十方，而于五浊恶世，化益偏厚。亦依本愿力所熏习，及众生应受化业，故从十一劫来，庄严此世界，成熟众生。是故在斯会中，身相端 严，威德殊胜，唯除如来，无能过者。又所起化业，唯除遍吉、观音等诸大菩萨，皆不能及，以是菩萨本誓愿力，速满众生一切所求，能灭众生一切重罪，除诸障 碍，现得安隐，又名为善安慰说者。巧演深法，能善开导初学；发意求大乘者，令不怯弱。以如是因缘，众生受化得度，百千方便教化，为若此也。

△

【是诸众生，先受如是等报，后堕地狱，动经劫数，无有出期。是故汝等护人护国，无令是诸众业迷惑众生。】

　　初示所护意，何故劝天王拥护，以诸众生，先受上来所说华报，次堕地狱，以受果报故也。优婆塞戒经云：有人不解如是业缘，无量世中，流转生死， 虽生非想非非想处，寿八万劫，福尽还堕三恶道。故动经千劫，无出期者。如旧杂譬喻经：昔有六人，为伴造罪，俱堕地狱。佛见之笑。目连问何故笑。佛言：六人 堕狱，共在一釜，各欲说本罪。热汤沸涌，各一语便回下。一言：沙者，世间六十亿万岁，泥犁始为一日，何时当竟？二言：那者，无有出期，不知何时得脱？三 言：特者，咄咄，我当用治生，不能自制，意夺五家分供养三尊，愚贫无足，今悔何益！四言：涉者，言我治生，亦不致诚，财产属它，为得苦痛。五言：姑者，谁 当保我从地狱出，便不犯道禁，得生天乐。六言：陀罗者，是事上头本不为心计，譬如御车失道，折轴车坏，悔无所及（文）。故动经尘劫，无出地狱之期也。

　　是故下，正劝以二字承接，示劝护意。护人等。准光明疏，观心释，护世四天王云：东集、南苦、西道、北灭。四谛理，是四天。观四谛智，为四王。 护四谛境，名护国，护心数是护众生。世者，他也。为他说心数，名护他。众生若不照四谛理，见思二惑，侵害心王，毁损境界，心王亡，境国败，心数人民迸散， 境智俱为鬼神所恼。能观苦集，控御见思，则国安民宁，能为他说四谛，是护他国土，遮彼见思，使彼安乐，是为观心护世四天王也。若不如是，何能令众生于是业 不迷惑耶！央掘云：护真实法，名为护世是也。

△

【四天王闻已，涕泪悲叹，合掌而退。】

　　此由闻上业感差别之相，入心冥契，了本空寂，闻即无闻，是名心闻。故云闻已。其奈众生不了，妄作妄受，故涕泪也。三际无时，十方非界，六道不 知，动有劫数，故悲叹也。于是自心合一，不妄流动，退藏秘密，静待法音。故合掌而退，故知能以力以法，自护护人，称护世四天王也。

△

【地獄名號品第五】

△

【爾時，普賢菩薩摩訶薩白地藏菩薩言：仁者！願為天龍四眾，及未來現在一切眾生，說娑婆世界及閻浮提罪苦眾生所受報處，地獄名號，及惡報等事。使未來世末法眾生，知是果報。】

　　次於業緣業感之後而問地獄業報差別之相，故雲爾時。梵名邲（蒲必切，音弼）。輸跋陀，或三曼跋陀，此雲普賢。准悲華經，乃過去無諍念王第五王 子，名無所畏；以行勝諸菩薩故，故寶藏佛改字普賢。文句雲：伏道之項，其因周遍，曰普；斷道之後，鄰於極聖，曰賢。光疏雲：真似之位，地地相隨，無位不 有。如普賢修普賢行滿。位鄰尊極，此似則高。記雲：已證名真，未證名似。普賢等覺，望極名似，故立賢名。

　　此品發起，假普賢者，以見行彌法界，方能悲願偏弘。以普賢是所信如來藏，又錶證出纏法身，正令一切眾生達阿鼻依正，全處極聖。自心毗盧身土， 不逾下凡一念，方了本源，成其極智。極智返照，不異初心也。然二大士德位相亞，智行相齊，豈不知地獄名與事乎？蓋以地藏分身冥界，教化泥犁，當眾發明，誰 不信受，故特興問耳。

　　仁者，慈育之尊稱。仁為心德之統體。以天地之大德曰生。人函生理，自然惻怛慈愛，與物皆春。故字意從人、從二。二象上天下地。人能克己，渾然與天地一體，廓然太公矣。天錶諸佛，地錶眾生，人心參合其中。直令生佛一體，故言仁者。

　　願為天龍等。因聞不問男女等，罪行業感，悉同受之，故稱無間；後又聞，一切眾生，未解脫等。故願請地藏，為此輩說也。罪苦眾生，乃能受報者。 所受報處，通則指六道；別唯在地獄。惡報等事，受報時所歴之境。略言有九種：若聞法兩舌亂他，墮耽耳狗中；聞法心不餐辨，墮長耳驢中；慳貪獨食，墮餓鬼 中；出生為人貧餓，惡食飼人，墮豬豚蜣螂中；劫奪人物，墮羊中；人生剝皮啖肉，喜盜人物，墮牛馬中；出生為人下使，喜作妄語，傳人惡，墮地獄，烊銅灌口， 拔舌犁耕。喜飲酒醉，墮沸屎泥犁，出為猩猩；為人頑愚，為上鞭下，無所告欣，墮地獄中，出為水牛，貫鼻負重償殃。若廣明之，則有無量。

　　使未來下，明地獄正意。眾生所以受苦者，由不知果報耳。夫空無所有，無相無願，是道之要慧，不可為新學人說。聞無所有，便曠其心，不復修戒。 言一切空，當何所作？夫善知識欲教新學，漸語魔事，令護魔因緣，生死罪苦，五道分明，令信罪福，事事了了，乃可語道。故使未來眾生知果報耳。

△

【地藏答言：仁者，我今承佛威神及大士之力，略說地獄名號及罪報惡報之事。】

　　承佛威神者，教主極聖，仰承固是。言及大士之力者何？普賢是佛嫡子，尊無敵也。行願力深，故以大士尊稱之。傳曰：通古今，然辯否，謂之士。 士，事也，從十。象事之多。宇宙內皆吾職分之事。從一，一以貫之也。故孔子曰：推一合十為士。今普賢萬行亦然，由一而十，乃至由仟而萬，了萬行之一性，度 眾生於一心，能建立極大之事，故雲大士。略說者，謙遜之辭也。

△

【仁者，閻浮提東方有山，號曰鐵圍。其山黑邃，無日月光。】

　　長阿含十九，世記經，地獄品，佛告比丘：此四天下，有八仟天下圍繞其外，復有大海水周匝圍繞八仟天下。復有大金剛山，繞大海水。金剛山外，復 有第二大金剛山。二山中間，窈窈冥冥，日月神天，有大威力，不能以光照及於彼八大地獄。故雲黑邃。邃，深遠也。黑而且邃，闇之極者矣。故立世阿毗曇論雲： 世尊說有大地獄，名曰黑闇。各各世界外邊悉有，皆無覆蓋，此中眾生，自舉手眼不能見。雖復日月及大威神所有光明，不照彼邑。諸佛出世，大光遍照，因此光 明，互得相見。住在兩山世界鐵圍外邊，名曰界外（文）。以在閻浮提東，故曰東方有山等也。

△

【有大地獄，號極無間。又有地獄，名大阿鼻。】

　　無間、阿鼻二大地獄，或合或離，自古難定。准長阿含及觀佛三昧經，合為一獄。經自問、答，何名阿鼻地獄？此雲無間地獄。此經與楞嚴為二獄。經 雲：九情一想，下洞火輪；身入風火，二交過地。輕生有間，重生無間，純情即沈入阿鼻獄。此經出不同譯師各異，致使二獄離合不同。私謂譬如二姓，共居一宅， 一門出入，各有眷屬。外人觀之，不無同異。同出一門，何妨說一；既是二姓，何妨說二。以二獄同在一處，受罪略同，故使一二不定。阿言無，鼻言遮，或言救。 合名無遮、無救。准十輪經：說五逆罪為最極惡。復有四種大罪，同於四逆，犯根本罪（雲雲）。若人犯一一罪者，身壞命終，皆墮阿鼻地獄。佛告僧護，有九種 人，常處阿鼻大地獄中。一、食僧物，二、佛物，三、殺父，四、殺母，五、殺阿羅漢，六、破和合僧，七、破比丘凈戒，八、犯凈行尼，九、作一闡提。是九種 人，恆在地獄。正法念經謂阿鼻地獄苦，仟倍過前十大地獄，壽經一劫。又觀佛三昧海經雲：阿鼻地獄，縱廣八仟由旬，七重鐵城，七層鐵網，刀林劍林等，各各七 重。各有十八寒冰等獄。是則下之四角、飛刀等，皆阿鼻之眷屬也。故立世阿毗曇明更生八獄竟，第九即明外園隔地獄品。熱灰糞屎等皆在其中。則下文以眷屬立 科，仟古定論，後賢不可不知。

△

【復有地獄，名曰四角；復有地獄，名曰飛刀；復有地獄，名曰火箭；復有地獄，名曰夾山；復有地獄，名曰通槍；復有地獄，名曰鐵車；復有地獄，名曰 鐵床；復有地獄，名曰鐵牛；復有地獄，名曰鐵衣；復有地獄，名曰仟刃；復有地獄，名曰鐵驢；復有地獄，名曰洋銅；復有地獄，名曰抱柱；復有地獄，名曰流 火；復有地獄，名曰耕舌；復有地獄，名曰剉首；復有地獄，名曰燒腳；復有地獄，名曰啖眼；復有地獄，名曰鐵丸；復有地獄，名曰諍論；復有地獄，名曰鐵鈇； 復有地獄，名曰多嗔。】

　　皆言復有者，乃阿鼻大獄之眷屬也。其類甚多，故以二字點之。四角者，正法念處經雲；有人實非沙門，自謂沙門。若聞婦女歌舞戲笑莊嚴具聲，不善 觀察，心生愛染，漏失不凈，身壞命終，墮於合大地獄，鐵末火處，（是合地獄第十六處）所謂熱鐵四角地獄。周圍鐵壁，五百由旬。從上雨火雨鐵，一切身分，分 散為末，常煮常燒。准立世阿毗曇雲：黑繩地獄，一切皆鐵。晝夜燒然。是中罪人，獄卒捉持，撲令臥地，隨黑繩界，斫以鐇斧，（鐇音番廣刀斧也）或為八角，或 四棱。復有從項至足，細斷如蔗節。昔在人中，自作教他，斬斫手腳鼻耳，割其背肉等，於中受生也。

　　飛刀者，即刀輪地獄。觀佛三昧海經五雲：刀輪地獄者，四面刀山，於眾山中積刀如磚，虛空中有八百萬億極大刀輪，隨次而下，猶如雨滴，立世所謂 劍雨鐇斧等。雨隨所著處，身分斷絕，頭首分離，如斫木劄，佈散狼藉。昔在人中，行鬥戰事，與人刀杖，遣令鬥戰，聚集多人，肆意殺害，由此業根於彼中生。

　　火箭，准觀佛三昧經，即五百億鐵機地獄。有一鐵床，縱廣正等四百由旬，上安諸[糸+忌]，（音忌，連針也）[糸+忌]間皆有萬億鐵弩，鐵弩旋 頭，百億鋒刃。罪人生鐵機上，萬億鐵[糸+忌]，關從下動，鐵[糸+忌]低昂，無量鐵弩，同時皆張，一一鐵箭射罪人心。一日一夜，六百億生死。立世雲：世 界愚癡眾生，為貪欲故，不孝父母，不敬師長，不順善教，殺害眾生，[食+人]（音寺俗作飼）諸奸人，故受此報也。

　　夾山者，三法度雲：眾合地獄者，罪眾生畏地獄卒，無量百仟，走入山間。入已，前後自然生火遮彼，兩山自合如磨，血流如河，骨肉爛盡，彼於此 間，喜磨眾生為首。正法念雲：二山堅鞭，鐵焰火然，兩廂作勢，一時俱來，拶地獄人。拶已磨之，其身散盡，無物可見。如是磨已，而復還生。復以二山如前拶 磨，如是復拶、復磨，無量百仟年歲。此由眾業所致。

　　通槍，槍，矛+肖也，又剡木傷盜曰槍。立世雲：罪人已度糞屎地獄，見劍葉地獄，心起愛著，如庵羅林。是劍林路，有諸鏘剌，七首剃刀，刀劍鋒刃，遍佈其地，罪人行此林路，備受鉆刺等苦。由殺生增上業報，以鬥戰為首所感。

　　鐵車，楞嚴雲：思報結息，則為火車。案賢愚經，釋迦始起慈心，正在此獄。

　　鐵床，准楞嚴：淫習則有鐵床、銅柱。雜藏經雲：今身淫泆，死入地獄，臥之鐵床，或抱銅柱。獄鬼然火以燒其身。故觀佛三昧經雲：罪人命終，坐鐵床上，如雁王翔，落黑闇處，刀輪上下，斬剉其身。

　　鐵牛，詳下。
　　鐵衣，立世雲：有時獄卒罵詈怖畏受罪之人：惡人起，起莫動。時無量罪人，大驚竦倚，猶如幡林。是時無數仟萬赤鐵袈娑及赤鐵衣，從空來下。罪人 叫喚：衣來，衣來！是衣至已，各各纏裹皮肉筋骨，悉燋爛己，鐵衣自去。由昔人中鞭打捶撻有命眾生。復有出家破戒，受用國土衣服，及以腰繩，以此業報，於中 受生。古德雲：現見袈娑離體，將來鐵褋纏身。蓋謂此也。

　　仟刃，准觀佛三昧經雲：自有眾生，不順師教，興惡逆心，不知恩養，盜師害師，汙師凈食，坐師床座，捉師缽盂，罵師謗師，打師、殺師，以諸毒 藥，持以飲師。若沙門、婆羅門，作諸非法，無有慚愧，剝像破塔，劫法寶物。殺伯叔父母，兄弟姊妹，如是罪人，命終坐於大劍床上，百億劍刃，刃皆出火，燒刺 其身，空中火輪從上而下，直劈其頂，其身碎裂為數仟段。

　　鐵驢如下。
　　洋銅如上。

　　抱柱，准觀佛三昧經雲：世間愚癡眾生，染愛邪淫，命終生銅柱頭，猛火焰熾，焚燒其身。驚怖下視，見鐵床上，有端正女；若是女人，見端正男。心 生愛著，從銅柱上，欲投於地，銅柱貫身，鐵網絡頸，鐵[此/束]諸蟲，唼食其軀。落鐵床上，男女俱時六根火起，有鐵觜蟲從眼而入，從男根出。若汙戒者，別 有萬億諸小蟲輩，如瘭（音標又音漂疽病也）疽蟲，蟲有十二觜，觜頭出火，唼食其身軀。此邪淫報，一日一夜，九百億生死。

　　流火，三法度論：名大哭地獄。謂大鐵山，遍火然，四絕無行處。惡獄卒無慈，嗔恚言，欲何所趣？無事與事，以火燒鐵杵，擊破其頭。彼於此間睏苦萬民，故生彼中。據首楞嚴。味報二相中，二者吐氣，飛為猛火，焦爛骨髓。是也。
　　耕舌如後。

　　剉首，三法度論雲：活地獄者，獄卒以利刀斧，解剝剉斬罪眾生，如斬剉羊頭，皮肉解散。立世雲：昔在人中，有命眾生，拍破其頭。或魚蛇蜈蚣等。種種等業，受碎頭報。

　　燒腳，立世論：名熱灰。罪人從大地獄出，見外熱灰，如平坦空地。見相起心，我應往彼。於是罪人往到彼中，腳踐熱灰，皮肉即爛。譬如蠟塊，投猛 火中。隨其舉腳，皮肉還復。或至膝、至臍、至頸，或沒不現。昔在人中，取有命眾生，置火中、熱灰中、熱沙中。或邪淫它婦，過世法則。或出家破戒，行住坐臥 僧伽藍中，或蹋踐四支提境界，及履支提影。以此業報，於中受生。

　　啖眼，起世經雲：刀葉林小地獄中，以無量諸不善業果報，故有鐵觜烏，忽然生出，飛嚮地獄眾生兩髆之上，安立腳已，即以鐵[此/束]啄彼罪人兩眼而去。正法念雲：罪人入大劍樹鐵林之中，有鐵鷲鳥啄破其眼，而飲其汁。是本與酒惡業果報。

　　鐵丸如前。

　　鐵鈇，長阿含雲：出鐵丸地獄，慞惶馳走，求自救護。宿對所牽，不覺忽至釿斧地獄，縱廣五百由旬。獄卒怒捉罪人，撲熱鐵上，以熱鐵釿斧，斫其手 足、耳鼻、身體，苦毒辛酸，悲號叫喚。偈雲：夫士之生，斧在口中。所以斬身，由其惡言，應毀者譽，應譽者毀，口為惡業，身受其罪。

　　諍論，多嗔，雖分二獄，同成一因。諍論起於貪嫉，以貪嫉故遂多嗔恚，由因感果，故生此中。三法度論雲：復因惡罪，手自然生鐵爪，鋒利若刃，形 如半月。各各生怨結意，彼曾迫我，我今復逼迫，由此生恚，更相誒截，如刈竹葦。彼於此間，結恨心死，故生彼中。須知一切諸法，皆是虛誑，眾生愚癡，嗔罵加 害，乃至奪命。五陰皆空，無我、無人，取相鬥諍，橫加毒害，起此重罪，故墮三塗，受無量苦。是故菩薩語眾生言：汝等莫於根本空中鬥諍，人身尚不可得，何況 值佛。今既墮地獄，悔恨晚矣。

△

【地藏白言：仁者！鐵圍之內，有如是等地獄，其數無限。】

　　如是等指上鐵圍山中諸地獄也。數無限者，一一獄中，各有小獄，不能盡陳也。言有者，以凡夫妄起愛取，取有為境，故有因有果，有苦有樂。故唯識論雲：一切如地獄，同見獄卒等，能為逼迫事。皆是罪人惡業心現，[立+立]無心外實銅狗鐵蛇等事。世間一切事法，亦復如是。

△

【更有叫喚地獄、拔舌地獄、糞尿地獄、銅鎖地獄、火象地獄、火狗地獄、火馬地獄、火牛地獄、火山地獄、火石地獄、火床地獄、火梁地獄、火鷹地獄、鋸牙地獄、剝皮地獄、飲血地獄、燒手地獄、燒腳地獄、倒剌地獄、火屋地獄、鐵屋地獄、火狼地獄。】

　　叫喚，准長阿含，列八熱大地獄，第四叫喚，第五大叫喚，各有十六遊增。以獄卒捉罪人，擲大鑊中，熱湯湧沸；又擲大鏊上，反覆煎熬。故號啕叫 喚，而復大號啕叫喚也。而正法念雲：黑繩地獄，有處名等喚。彼處惡燒，受苦無間，舉在險岸，無量由旬，熱炎黑繩，束縛繫已，後推墮鐵刀熱地之上，鐵狗啖食 一切身分，分分分離，唱聲吼喚。據此，叫喚二獄，只在第二黑繩獄中。[既/木]是八獄相連，故總說耳。長阿含雲：由嗔恚懷毒，造諸惡行，故墮叫喚地獄。由 習眾邪見，為愛網所牽，造異陋行，墮大叫喚地獄。

　　拔舌、糞尿如後。
　　銅鎖，觀佛三昧雲：黑繩地獄者，八百鐵鎖，八百鐵山，豎大鐵幢，兩頭繫頸，獄卒羅剎，驅愜罪人，令負鐵山，鐵繩上走。不勝落地，墮鑊湯中，羅 剎驅起，渴急飲鐵吞石。一日一夜，經歴是苦九十萬遍。此由愚癡眾生，七眾弟子，九十六種梵誌等，法說非法，非法說法，或犯輕戒，久不懺悔所致耳。

　　火象，如僧護前進，見一白象，熾火燒身。佛言：汝見象者，是地獄人。迦業佛時，是出家人，為僧當廚。諸檀越等，將諸供養，嚮寺施僧，或食後 來。檀越白言：大德，日猶故未，可打犍椎，集僧施食。比丘惡口答白衣言：諸比丘等，猶如白象，食不能飽。嚮食已竟，停留後日。以是因緣，入於地獄，受白象 身，火燒受苦，至今不絕。正法念又雲：若人作如是心，象若醉時，能多殺人，我則得勝。為令象鬥，與酒令飲。墮叫喚獄中，有大象生，身皆焰然，一切身分。皆 能打觸，取彼人已，觸破身分，破碎墮落，唱聲大喚，故生火象也。

　　火狗、起世經雲：熱沸灰河兩岸，所有諸狗，身黑紫色，垢膩可畏，啖彼地獄眾生身肉，[(戀-心)/月][(戀-心)/月]咬食。三法度論雲：火鐵然地，驅罪眾生熬令熟，熟已，復驅出，為惡狗所食；食肉盡，風吹使生，還復如故。此間養蠶煮炙，故生彼中。
　　火馬、火牛，准正法念：有人若見牸牛草馬等淫道，心生分別，此與婦女不異，而行淫欲，以是墮合大地獄，生於團處，見彼牛馬，如前憶念人婦女想，欲心熾盛，走嚮牛馬。彼人既近牛馬根門，惡業因故，入彼根門，即入其腹，滿中熱火，彼處受苦。

　　火山、火石，准起世經：獄名眾合。眾生生於兩山，名為白羊，口食熾然極猛火焰。彼等入彼山內，兩山相磨相打相揩，如是合磨打揩各訖，還本住 處。譬如毗佉[少/兔]，共啰毗佉[少/兔]（此二，是閃電名）相合，相磨相揩相打已，各還本處。又守獄者，以大鐵石，熾然猛焰，撲彼地獄眾生，令其仰臥 熱鐵石上；更取別石，以覆其上。如世間硙，磨已復磨，大磨作粖；復更細磨，重研作塵。唯見膿血流出，空有髓骨塵粖而在。
　　火床，同前鐵床。

　　火梁地獄中，鐵梁鐵柱，無非是火；或取罪人懸梁而燒，或以鐵梁壓身而燒也。

　　火鷹，同前鐵鷹。正法念：名烏丘山。其山焰然，焰高五仟由旬。彼有鐵樹，樹有鐵烏，烏身焰然，滿彼樹上。罪人到彼，焰烏破其頭者，取腦，取眼，取鼻，取頰，取心，取肺，取小大腸者。是眾烏食地獄人，分分皆食。罪業力故，食已還生。鷹、烏事同。

　　鋸牙，起世經雲：守獄者取彼眾生，撲著熱鐵地上，以鐵黑繩，拼度其身，即以鐵鋸，鋸彼身破，破已復破，乃至大破。既鋸其體，何必不鋸其牙，此由口惡業所致。

　　剝皮，立世雲：在更生、黑繩二獄中間，有地獄，名大巷。或有罪人，褫皮在地，還割其肉，以積皮上。昔在人中屠膾為業，殺羊豬牛鹿以自活命，或捕魚鳥等，由此業報，彼中受生。

　　飲血、准正法念：合地獄第八別處，名為朱誅朱誅。若人偷盜邪行，若羊若驢，以無人女，是故淫之，或在浮圖，或近浮圖。以是惡業，墮於惡處。常 有惡蟲朱誅朱誅，啖食其肉，復飲其血。既飲血已，斷筋飲髓。或令罪人，自飲其血。如經明妄語地獄十八處，十七名血髓飲。彼處有河，名熱血洋水，彼河熱沸， 以熱銅汁、白镴汁和雜其中。（長阿含名膿血地獄自然膿血，熱沸湧出，罪人馳走，而自食之。）

　　燒手、燒腳一類之事，八熱獄第六燒炙，第七大燒炙。通身俱燒，皮肉燋爛。今從別業，但燒手腳。此由宰殺生靈，斷手斷足，炮燒煮炙，故墮此獄。

　　倒刺，樓炭經雲：撓撈河縱廣二萬裏，河兩邊有鐵樹。立世雲：逆刺睒浮梨，一切皆鐵，晝夜燒然。樹高一由旬，刺長十六寸。獄卒捉罪人臂，牽上刺 樹，而復牽下。牽上刺嚮下，牽下刺嚮上。腹著樹，皮肉即盡；背、脅亦爾，受此殘害。昔在人中，邪淫婦女，或婦人欺背夫主，復有種種增上業報，於彼中生。

　　火屋、鐵屋二獄同，各從所重名之。火屋，純鐵所成。鐵屋，大火所熾。起世經雲：時獄卒取彼眾生，擲置鐵屋室中，熾然大熱，逼切難忍，眾惱和 合，遂大叫喚。彼中更有鐵房、鐵輦、鐵閣、鐵樓，其中炭火沸湧盈益。長阿含名燒炙，其事大同。火狼，樓炭經雲：從撓撈河得出，入狼野幹，縱廣二萬裏。起世 經雲：以諸不善業果報，故於彼獄出生狐狼，粗惡可畏，咬彼地獄眾生身肉，腳蹋口掣，臠臠而食。（雲雲）。

△

【如是等地獄，其中各各復有諸小地獄。或一，或二，或三，或四，乃至百仟，其中名號，各各不同。】

　　初句結上眾獄。其中下，謂此等獄中，又各自有小地獄，以為眷屬，或一二三，或至百仟，名號差別，莫可指陳也。

△

【地藏菩薩告普賢菩薩言：仁者！此中皆是南閻浮提行惡眾生，業感如是。】

　　獨指閻浮眾生者，以誌性無定，習造惡業，感此地獄也。那先比丘經雲：如世間火熱，不如泥犁中火熱。如持小石，著世間火中，至暮不消。取大石，著泥犁火中，即消。亦如有人作惡，死在泥犁中，數仟萬歲，其人不死。此[立+立]由善惡業力，致消與不消。故雲業感如是。

△

【業力甚大，能敵須彌，能深巨海，能障聖道。】

　　此釋業感之由。止觀雲：招果為因，亦名為業。十法界業，起自於心；但使有心，諸業具足。力者，堪任力用也。佛言：一切壯，無過心。心是怨家， 常欺誤人。心取地獄，心取餓鬼，心取畜生，心取人天。作形貌者，皆心所為，其力最多。以須彌之高廣，能抵敵之；溟壑之汪洋，能浚深之；聖道之虛通，能障礙 之。皆眾生業力使然，非甚大而何？山、海二句，舉例能障聖道。有漏業能障三乘聖道，無漏業能障佛性中道。光明文句雲：三障障佛，第一義天之所捨離，故知業 力甚深而廣大也。

△

【是故眾生莫輕小惡，以為無罪，死後有報，纖毫受之。父子至親，岐路各別，縱然相逢，無肯代受。】

　　承上能障聖道之故，而誡勸之。人世間中，頗有是念，些小之過，誰為計算？惟無三昧經，佛告阿難：人生世間，所以不得道者，但坐思惟，穢念多 故。一念來，一念去；一日一宿，有八億四仟萬念，念念不息。一念善者，得善果報；一念惡者，得惡果報。如響應聲，如影隨形。是故善惡罪福各別。如閻羅王告 罪人雲：人生在世間時，罪過小且輕；死在地下泥犁，大且重。故涅槃雲：莫輕小惡，以為無殃，水滴雖微，漸盈大器。良以纖芥之惡，歴劫不亡；毫厘之善，積世 長存。福成，則天堂自至；罪積，則地獄斯臻。此乃必然之數，無所容疑。夫父子天性相關，親之極至者也。父修善，而子作惡，則父生天，而子墮苦，途路既岐， 遭逢難必；縱使偶遇，父安肯以天堂之樂，易子地獄之苦乎？子善、父惡，情理亦然。如賴咤和羅經雲：善惡隨人，如影隨身。人生獨生，死亦獨死。身作善惡，身 獨當之，無有代人者。故佛說四自侵經雲：不計無常，而反貪愛，言有父母兄弟妻子，中外親族。老病死來，善惡苦樂獨自當之，無有代者。故勸勿以小惡為輕，而 故造也。

△

【我今承佛威力，略說地獄罪報之事，唯願仁者暫聽是言。】

　　如文

△

【普賢答言：吾已久知三惡道報，望仁者說，令後世末法一切惡行眾生，聞仁者說，使令歸佛。】

　　普賢謂地藏願我暫聽，略說罪報之言。吾豈不知惡道苦事乎。但仁者久化幽關，為地獄教主，對眾宣說，人必信之，方能使令歸佛耳。無常偈雲：有生皆必死，造業苦切身！唯有佛菩提，是真歸仗處。勸令歸佛，問地獄之正意也。

△

【地藏白言：仁者！地獄罪報，其事如是：】

　　此文可兩屬。作結上，則指前地獄名號，其事如是。起下，即指或有地獄等，如是如是。今為下文總示。義更較妥。

△

【或有地獄，取罪人舌，使牛耕之；或有地獄，取罪人心，夜叉食之；或有地獄，鑊湯盛沸，煮罪人身；或有地獄，赤燒銅柱，使罪人抱；或有地獄，使諸 火燒，趁及罪人；或有地獄，一嚮寒冰；或有地獄，無限糞屎；或有地獄，純飛[金+疾]鑗；或有地獄，多攢火槍；或有地獄，唯撞胸背；或有地獄，但燒手足； 或有地獄，盤繳鐵蛇；或有地獄，驅逐鐵狗；或有地獄，盡駕鐵騾。】

　　初獄，如八師經雲：兩舌惡口妄言綺語，譖人無罪，謗毀三尊，死入地獄。獄中鬼神，拔出其舌，以牛犁之；烊銅灌口，求死不得。

　　取心，夜叉食者。觀佛三昧經雲：諸罪人，生灰河中諸劍樹間，有一羅剎，以叉叉其心出，與夜叉食。以昔時偷盜師長父母罪因緣故，一日一夜，五百億生死，受苦無量。

　　鑊湯煮身，前經雲：鑊湯地獄有十八鑊，一一鑊縱廣四十由旬，滿中沸鐵。五百羅剎，鼓大石炭，燒其銅鑊。火焰相承，六十日不滅。閻浮提日，滿十 三歲。鑊沸如星，化成火輪。此由毀佛禁戒，殺生祠祀，為啖肉血，焚燒山野，生燖眾生，以火焚燒。生鑊湯中，速疾消爛，唯余骨在。鐵叉撩出，鐵狗食之，嘔吐 在地，尋復還活，獄卒驅喊，還令入鑊。

　　赤燒銅柱如前。
　　火燒趁及罪人。趁（醜慎切，嗔去聲），逐也，從也。起世經雲：阿毗大獄，諸眾生輩，以不善業果報，經無量時，見獄東門忽開，獄眾見聞開門，走嚮彼處。走已復走，大速疾走。我等今者，決應得脫。如是走時，身諸支節，轉復熾然。南西北門，亦復如是。

　　一嚮寒冰，樓炭經雲：從狼野幹出，走入寒冰，縱廣二萬裏。人悉入其中，風四起，寒冰（長阿含雲：二金剛山間，有大風起名曰僧佉。）風吹人肌膚、皮肉、筋骨，入髓中便死。以諸不善業果報，而生其中。

　　無限糞屎，地獄經雲：沸屎獄有十八隔，各八仟由旬，十八鐵城，一一有十八隔。隔中四壁，百萬億劍樹，皆生鐵蟲，口吐熱屎，有情飲屎，此蟲唼舌啖心。以前世破八齋戒，及不凈惡業故。

　　純飛[金+疾]鑗，觀佛三昧經雲：罪人落黑暗處，有鐵烏，[此/束]距長利，從山飛來，抓啄罪人。痛急疾走，足下[金+疾]鑗穿骨徹髓，經五百萬億歲。今言純飛，則滿獄皆是矣。此由兵家結寨，四角藏埋鐵[金+疾]鑗害人，故生此中。

　　多攢火槍，與通槍同，唯多火耳。
　　唯撞胸背，准楞嚴經：觸報中歴聽，則能為撞為擊。則此觸果，由觸因得也。

　　但燒手足，起世經雲：從硙疊小地獄出，詣嚮斛量五百由旬小地獄中。守獄者，取地獄輩，以熱鐵斛，遣其量火，燒手燒腳，耳鼻肢節。今從別業別報，故但燒手足。

　　鐵蛇、鐵狗如前。盡駕鐵騾，如僧護比丘，見一驢猛火燒身。佛言：實非是驢。迦葉佛時出家人，當廚，分僧飲食，恆自長受二三人分。持律比丘，如 法訶責。答言：我當僧廚，甚大勞苦，汝不知恩，狀似如驢，但養一身，何不默然。以是入地獄中，驢身受苦。今言盡駕，大約罪人騎鐵驢上，火燒其身耳。

△

【仁者！如是等報，各各獄中，有百仟種業道之器，無非是銅是鐵，是石是火，此四種物，眾業行感。】

　　如是等報，總指上事。由一切眾生，恆生三種不善思惟：思惟五欲，思惟嗔害，思惟欺誑。皆以無明為因，而得生起。身壞命終，墮於惡趣。器者，即 眾生日用之器皿。今銅、鐵、石、火，乃地獄苦具，皆罪人業行所感，非天與人授也。業行雖多，十惡攝盡；三毒為因，七支為緣。施行惡業，構造苦器，還為自身 受用，不能避者。故光記雲：破戒心成，能造地獄，種種苦具，宿豫嚴待，無有一物從外而起。故唯識論雲：如地獄中，無地獄主。而地獄眾生，依自然業，見地獄 主，與種種苦。而起心見，此是地獄處，此夜時、晝時。以惡業故，見狗見烏，或見山壓。以此文證，善惡熏心，令心易見，實無地獄。然而心外雖無地獄，惡業成 時，強自妄見。故決定毗尼雲：我說地獄諸苦事，實無樂趣可來往，刀杖鉾矛+肖眾苦具，亦無有能造作者。由分別故而見有，無量苦毒逼其身，猶如分別諸幻焰， 於此分別悉皆空。其斯之謂歟。

△

【若廣說地獄罪報等事，一一獄中，更有百仟種苦楚，何況多獄。我今承佛威神，及仁者問，略說如是。若廣解說，窮劫不盡。】

　　罪報百仟苦楚，都由一念所成。如正法念雲：雲何惡業無量種種，皆因於心，相續流轉，如河滲流，漂諸眾生，令墮惡業果報之地。在於地獄，受極苦 惱。此諸眾生，雲何如是？為心所誑，為愛所誑，故感百仟種報，楚毒其身也。何況多獄者，但說阿鼻一獄，便有種種罪報苦事，況多獄乎！我今承佛威神，敬答仁 者之問，不過略說如是事耳！若欲廣解獄名罪報，及一一苦具，縱窮一劫之壽，亦不能盡。何也？眾生業力，不可思議。蓋由心業畫師，自業畫作業果地分，種種異 心，別處受苦，有百仟億那由他數怖畏惡事。無有相似，不可譬類。秪由眾生，昔時觸境生著、起愛，今觸境，穢惡、受苦。故苦報、苦事、苦器殊難悉舉。明所化 機竟。

△

【如來贊嘆品第六】

△

【爾時，世尊舉身放大光明，遍照百仟萬億恆河沙等諸佛世界，出大音聲，普告諸佛世界一切諸菩薩摩訶薩及天龍鬼神人非人等：聽吾今日稱揚贊嘆地藏菩薩摩訶薩，於十方世界，現大不可思議威神慈悲之力，救護一切罪苦之事。】

　　上明能化主，及所化機，正畢。世尊乘時贊嘆，以明度脫之緣。故言爾時舉身放光者，顯大地同成智地，會群生鹹入無生。如大品：從足下仟輻相輪 中，放六百萬億光明；足十指、兩踝、膝、[(路-各)+(傅-人)]髀、腰、腹、背、臍、心、胸、肩、臂、指、項、口、齒、鼻孔、眼、耳、毫相、肉髻，各 各放六百萬億光明。從是諸光，出大光明，遍照十方如恆河沙等諸佛世界。若眾生遇此光者，必得阿耨菩提。今所放光，亦復如是。故雲舉身放大光明，遍照萬億沙 界。大音聲，乃三十二相梵聲相。新婆沙論雲：如來梵聲，佛喉藏中，有妙大種，能發悅意和雅梵音，如羯羅頻迦鳥，及發深遠雷震聲，如帝釋鼓。大論雲：如梵天 王五種聲，而從口出。一、甚深如雷，二、清徹遠聞，聞者悅樂，三、入心敬愛，四、諦了易解，五、聽者欲聞無厭。故雲出大音聲。告諸菩薩者，為流通是經。告 天龍等，為擁護是經也。聽者，耳之力。人之外誘，接於目為多，然不若耳之入人深，益人多也。何也？視散而聽收。古人妙契是理，制字從耳，從壬，（古挻 字。）從攏。耳氣一提，則所聽者，德心為之主矣。故須收視返聽。
　　聽吾今日稱揚贊嘆。現者，起也。雖知諸法無性，佛種卻從緣起。眾生以此因而感，地藏以此緣而應。大者，其性廣博，多所含容，大師子吼大益凡聖 也。不可思議者，體相用三，皆叵思議。徒欲言之，言則傷其實；徒欲思之，思則喪其真。何也？既言諸法無性，則無四性計矣。而又佛種從緣，令得四悉檀益。此 則用從體起，用還冥理。體藉用彰，體自空寂。即體即用，任運與拔。體用即非體用，與拔即非與拔，此唯圓教悉檀之益，故曰：大不可思議、威神之力，但慈悲之 道，救拔為先；菩薩之懷，湣濟為用。常應遍遊地獄，代其受苦。故雲：救護一切罪苦之事。

△

【吾滅度後，汝等諸菩薩大士及天龍鬼神等，廣作方便，衛護是經，令一切眾生證涅槃樂。】

　　大經謂如來實不畢竟入於涅槃。今言吾滅度後，何也？蓋以機薪盡而應火亡，順波旬而現滅也。方便言廣作者，方便乃菩薩二利之器，不可須臾暫離。 故維摩雲：無方便慧縛，有方便慧解。謂不以愛見心，莊嚴佛土，成就眾生，於空無相無作法中，以自調伏而不疲厭，是名有方便慧解。不，則縛矣。勸衛護是經 者，以是眾生之良藥。譬如栴檀，能療人病。一切眾生，莫不願得。有人大得栴檀香樹，束薪賣之，無有買者。此經能令人得道，無不度者。吾般泥洹後，留在世 間，無有視者，亦如旃檀束薪賣之，無買者也。故須廣作方便，衛護流通，令一切罪苦眾生，塞無明源，拔生死根，出三塗之惡道，證三德之寂光。庶不負大士威神 慈悲之力，救護罪苦之心也。

△

【說是語已，會中有一菩薩，名曰普廣。合掌恭敬而白佛言：今見世尊贊嘆地藏菩薩，有如是不可思議大威神德。唯願世尊為未來世末法眾生，宣說地藏菩薩利益人天因果等事，使諸天龍八部及未來世眾生頂受佛語。】

　　文分二節。初經家敘威儀。今見下，述贊請利益。有一菩薩，即承命衛經之人，其名曰普廣。從心發心發智，智彌法界，曰普。以智導行，行滿虛空， 曰廣。心是境體，普廣是用。心即法身，普即般若，廣即解脫。由此大士，久證三德，廣濟群生，雖用不離體，而體藉用彰。故從用立名。若廣明其事，即同觀音十 普。（雲雲。）今見下，先述前所嘆威德。大論問：諸佛出於三界，不著世間，無有我及我所，視外道、惡人、菩薩、阿羅漢，一等無異，雲何贊嘆菩薩？答：佛雖 無吾我，無有憎愛，於一切法，心無所著。憐湣眾生，以大慈悲心，引導一切。故分別善人，而有所贊；亦欲破惡魔所願。以佛贊嘆故，無量眾生，愛樂菩薩，恭敬 供養，後皆成就佛道。是故諸佛贊嘆菩薩。雲何贊嘆，以地藏菩藏，久遠劫來，能觀諸法畢竟空，亦能於眾生有大慈悲，行生忍，不見眾生；行法忍，不著諸法。雖 知涅槃是無上實法，而不取證；雖知眾生如幻如化，而能起身口意業，可謂誌願弘曠有大悲心，行如是事，甚為希有。今既已見世尊贊嘆其不可思議大威神德已，然 利益天人，因果等事，更願垂於未來。故請說之。世尊說法，不出施論、戒論、生天論。正修名因，已得名果。下文章章約人天以明因果。若錶別教、三賢、十地， 詳今家教部。天龍等，能頂受之人；佛語，所頂受之法。領納於心名受。人身以頂為尊，今雲頂受，敬之極，信之深也。佛語不受，何言可受耶！

△

【爾時，世尊告普廣菩薩及四眾等：諦聽！諦聽！吾當為汝略說地藏菩薩利益人天福德之事。】

　　誡諦聽者，以是不思議威神慈悲事也。福者，天道佑善也。善則順天，和氣日相湊泊。從示，從[逼-人]，會其意耳。攏者，固有之善也。直心為 攏。性命本來之正，學問易簡之功。洪範陳五福。福壽、富貴、康寧、好德、考終。論語示五德：溫、良、恭、儉、讓。若吾教中，准四天王經，於六齋日，使者、 太子、天王，勤伺眾生，施行吉兇。若於此日，凈心守齋，歸敬禮供地藏菩薩。諸天為遣善神，營衛門戶。兇疫眾邪，陰謀消滅，夜無惡夢。縣官盜賊，水火災變， 終而不害。臨其尋壽終，迎其魂神，上生天上。天上福德，所願自然，七寶宮殿，在意所之。壽終，下生侯王之家，顏色煒煒，見者心歡。逢佛值法，必得泥洹。斯 皆五戒十善，斂情攝欲，六齋使然。正利益人天福德事也。

△

【普廣白言：唯然，世尊！願樂欲聞。】

　　如文

△

【佛告普廣菩薩：未來世中，若有善男子、善女人，聞是地藏菩薩摩訶薩名者，或合掌者、贊嘆者、作禮者、戀慕者，是人超越三十劫罪。】

　　修善者，稱善男女；作惡者，稱惡男女。如閻羅王誨敕罪人雲：汝等今去，為人家作子，當念孝順，報父母恩，曼年盛時，當忍惡為善，篤信三尊，守 戒奉道，修諸功德。莫復作惡，還來至此。夫善，人性之天然精粹者也，其發恰好，美若不可勝言，無一不由中出者，故從美，轉註以心，示人，天根之學。復從二 言者何？言，心聲也。出言善，人亦以善應之。人心同處，可以見天心也。今言由聞地藏之名而合掌等，得其善名也。蓋大士之名，萬行萬德莊嚴。自最初一念救母 孝思，便為六道救苦發心根源，已深廣無涯際矣！迨今十一大劫已來，若欲分別，窮劫不盡。故合掌等，皆超劫罪。如耆婆攬草，無非藥者，普能愈病。一切具足， 如如意珠，盡滿其願。
　　合掌，錶權、實一體；九界是權，佛界是實，今既開顯，生佛一體。此身業供養。或贊相好微妙，或嘆功德深洪，此口業供養。稽首著地，五輪俱圓， 了性空寂，感應道交，乃三業普供。眷戀繫慕，心心無間，或想菩薩之威德，或申自己之悲哀，此意業供養也。是人，點上聞名合掌等者，均能超越三十劫之重罪， 此非不思議威神慈悲之力歟！

△

【普廣！若有善男子、善女人，或彩畫形像，或土石膠漆、金銀銅鐵，作此菩薩。一瞻一禮者，是人百返生於三十三天，永不墮於惡道。假如天福盡故，下生人間，猶為國王，不失大利。】

　　初修因。彩畫等，即法華雲：若人為佛故，建立諸形像（雲雲）。彩，色也。用五色渲染百福之相也。土石膠漆者，或以凈土範塑為相，或以堅石巧琢 為形。准優婆塞戒經，不許用膠，（此土有牛皮、魚腸二膠），得失意罪。而此經用者，外國用樹膠耳（白芨之類）。有言大豆汁（本草黑豆也），可代膠清。若光 宅聽許用牛皮膠，終是不凈之物，後得不凈果報。蓋以畫相無膠，色久脫落；灰佈無漆，身不堅牢。此像設之斷不可闕者。金銀銅鐵，價雖貴賤不同，體乃堅剛不 異。镕鑄為像，永遠莊嚴。修跋拏，翻金。准大論，出山石沙赤銅中。說文雲：金有五色，黃金為長，久埋不變，百陶不輕。阿路巴，翻銀。准大論：出燒石中。爾 雅：白金謂之銀。銅，赤金，銀之次也。阿嚕力經雲：多唎路訶，註雲三金。謂金、銀、銅。從金從同，色與金相似，而德大有間矣。古文取意制字，示不可以貌取 人也。鐵，黑金也。從夷，取常鐵為意。常鐵煉久而得其精純，雖百煉而不耗，謂之真剛。鐵於金品最下，而致用為多，民利不可闕也。已上明造像。准戒經：不凈 錢，不任造像，可換取如法凈錢造像。又不許造半身像。善像不起，墮落生死。
　　作此菩薩，一瞻一禮者，他人以此眾物作地藏菩薩勝相，或有善男女等見之，或但瞻而不禮，或有瞻而禮者。此明修因甚少，下明得果極大。是人即作 像瞻禮者，皆百返生於三十三天，且永不墮惡道之中。以造像本是天業，故感生天上。造像功德經雲：若人臨終，發言造像，乃至如麥穬，（古猛切大麥也）能除三 世八十億劫生死之罪。有十一功德：一、世世眼目清潔。二、生處無惡。三、常生貴家。四、身如紫磨金色。五、豐饒珍玩。六、生賢善家。七、生得為王。八、作 金輪王。九、生梵天。十、不墮惡道。十一、後生還能敬重三寶。故下即雲假如天福等。妙樂雲：豈是欲界人天善根。故後賢講是經者，斷不可准正法念經所列忉利 之三十三，必依吾所引灌頂咒經者，此仟古不磨之定案也。不失大利，通言之，謂雖生人中作王，猶不失作像瞻禮之大利。若深推其意，必以成佛為大利。如經雲： 如是諸人等，漸漸積功德，具足大悲心，皆已成佛道，是也。故妙樂雲：今經欲收無始微善，鹹趣菩提，若已發心，隨有毫善，莫非緣因。今經既同法華，福利自叵 思議。

△

【若有女人，厭女人身，盡心供養地藏菩薩畫像及土石膠漆銅鐵等像。如是日日不退，常以華香飲食衣服繒彩幢幡錢寶物等供養。】

　　初二句興供意。厭女身故，同藥師願中，若有女人，為女百惡之所逼惱，極生厭離，願捨女身。蓋女人因淫業，而致乘愛心而來，陷人之坑，積穢之丘 陵。超日月經明示五礙：一、不得作梵天王，清凈、垢染不同故。二、不得作帝釋，少欲，多欲差殊故。三、不得作魔王，剛強、懦弱相異故。四、不得作轉輪王， 仁慈、嫉妒回絕故。五、不得作佛身，萬德、煩惱各別故。玉耶經中：大彰十惡，一、初生父母不喜。二、舉養視無滋味。三、心常畏人。四、父母憂嫁。五、父母 生離。六、畏夫喜怒。七、懷產甚難。八、少為父母檢錄。九、中為夫[土+胥]禁制。十、老為兒孫所呵。故女中智者，常生厭離也。盡心下，供養法。蘇悉地 經，廣明供事不同。凡供養門，乃普賢毗首羯磨所作，出虛空庫藏法中。依大圓鏡智及成所作智而為之也。
　　盡心二字，須玩。下諸供物，皆事，財施也。若不離自心，竭盡為之，則一切法趣事、趣財，是趣不過，則事全是理，財即是法矣。像設如前。如是日 日不退，可謂心心堅固，念念精勤。華香、飲食、衣服義如前明。繒彩，即五色彩緞。繒字有二音：咨登切，音增，與矰同。繒繳以射鳧雁，箭有綸者。古詩：未必 逢矰繳。是也。慈陵切，音情，帛也。贈神曰繒。今從情聲。幢，梵語脫阇資，中翻幢。熏聞引爾雅雲：阇謂之臺，而言脫者，積土脫落也。今所不取，蓋是梵語。 但名義集，既以寺塔壇幢聯貫而立，則臺義非謬。然說文雲：幢，旌旗之屬。輔行又雲：幡者，旌旗之總名。今佛法供具相狀似彼，故雲幡。則幢幡一類。幡之大者 為幢，幢，翳也、容也。施之車蓋，童童然以隱蔽形容，則似車之蓋。故楚曰幬，關東西曰幢。凡造幡法，切不得安佛菩薩像，及名號等。幡是供具，供於所供，如 何復以像名為之。錢寶物等，眾生之性命，切己難忘，能捨命財，心無吝惜，內息慳貪，獲福無量矣。

△

【是善女人，盡此一報女身，百仟萬劫，更不生有女人世界，何況復受。】

　　轉報事難，惟在精誠，今既盡心供養，而又日日不退，故畢此一期果報之身，從斯百仟萬劫，更不生有女人世界。即指西方極樂，一嚮無有女人。何況復來三界受女身耶！

△

【除非慈願力故，要受女身，度脫眾生。】

　　如摩耶夫人，以大幻願智法門，永為仟佛之母。此以順愛法門，度眾生也。又婆須密多女，說離欲際法門，一切眾生隨類見我，令得一切三昧，此以逆愛法門，度眾生也。[立+立]以慈受三昧，誓願之力，示為女身。先以欲鉤牽，後令入佛智，正此意也。

△

【承斯供養地藏力故及功德力，百仟萬劫不受女身。】

　　供養地藏，乃現行精進及功德力，是善習熏起，種現交熏，功業成辦，故於百仟萬劫永不受女人身。

△

【復次普廣，若有女人，厭是醜陋，多疾病者。但於地藏像前，誌心瞻禮，食頃之間。】

　　醜，臭穢也。陋，鄙惡也。此方黃帝時，有嫫母；齊國有無鹽女，梁鴻之妻孟光，皆天下之醜女，而賢慧者也。准業報差別經：以十業故，得醜陋報： 一好行忿怒，二好懷嫌恨，三誑惑於它，四惱亂眾生，五於父母所無愛敬心，六於賢聖所不生恭敬，七侵奪賢聖資生田業，八於佛塔廟斷滅燈明，九見醜陋者毀訾輕 賤，十習諸惡行。亦以十業多病報：一好喜打拍一切眾生，二勸他令打，三贊嘆打法，四見打歡喜，五惱亂父母，六惱亂賢聖，七見怨病苦，心大歡喜，八見怨病 愈，心生不樂，九於怨病所，與非治藥，十宿食未消而復更啖。以是二十種業，感此醜病。女身相貌醜陋，為夫君之嫌憎，遭眾士之譏呵；身多疾病，致自心之憂 苦，招眷屬之輕陵。三惡[立+立]集，一世多愁，寧不長懷厭棄乎！能感之機，識此之由。但於下明修因。食頃，一飯食時，以少顯多，以短形長耳。

△

【是人仟萬劫中所受生身，相貌圓滿。】

　　此顯暫時瞻禮之功，不可思議。圓則無喎邪之惡相，滿則鮮窊曲之醜形。相貌既得圓滿，身軀自無疾病。

△

【是醜陋女人，如不厭女身，即百仟萬億生中常為王女，乃及王妃，宰輔大姓、大長者女，端正受生，諸相圓滿。】

　　不厭女身，情愛未忘；瞻禮之功，纖毫不爽。故於萬億生中，常為王家之女。如波斯匿之勝鬘，阿阇世之術達矣。王妃，妃，合也，嬪禦之貴，次於後 者。又天子後宮、嫡庶皆稱妃。如末利、韋提希是也。宰輔大姓，乃天子股肱，元勛阿衡；或生剎帝利大姓，或婆羅門大姓；長者女，如須達多之有蘇曼；維摩詰之 有月上也。端正等，梵名阿波羅提目伽，此言端正。別行疏雲：女人端正，七德之初。但端正無相者，或早孤少寡，相祿不佳。今明貌與相相扶，彌顯其德。端則招 夫寵愛，相則招於祿敬。若愛帶慢，何謂為德；愛而敬之，故是相也。今既端正圓滿，相彌妙矣。

△

【由誌心故，瞻禮地藏菩薩，獲福如是。】

　　誌心二字，義深意重，貫於前後，勿輕看過。夫人之轉報，誠非易事。譬耕夫之忽臨帝座，如混者之俄登天府，平地之福，匪伊所思。今所獲福，誠由 誌心。誌者，心之所至也。其醜女以瞻禮而感，地藏以慈力而應，均是心也。若各各性計不忘，則能所條然，凡聖岐矣，安能感應道交，轉報獲福耶！惟瞻禮之際， 了能所之皆空，故感應之時，致假中之叵議。則醜婦與地藏，無二無別，功[立+立]由於誌心。故增一阿含雲：若欲禮佛者，當來及過去，當觀空無法，是名禮佛 義。勒那三藏七種禮，不可不知。

△

【復次，普廣！若有善男子、善女人，能對菩薩像前，作諸伎樂及歌詠贊嘆，香華供養，乃至勸於一人、多人，如是等輩，現在世中，及未來世，常得百仟鬼神日夜衛護，不令惡事輒聞其耳，何況親受諸橫。】

　　文分二節：初能供之機。如是下，所獲之福。能者，信善之實。信而不實者，不能為之矣。伎字，說文從女支聲，婦人小物樂工也；從人支聲，訓與 也。樂者，天子之要事，可以觀風考俗，使民蕩穢滌邪，故禮樂不可須臾去身。若禮記雲：夔始制樂以賞諸侯。自黃帝鹹池以下，代制於樂，不過據此土言之耳。歌 詠者，尚書雲：詩言誌，歌永言。詩序曰：情動於中而形於言；言之不足，故嗟嘆之；嗟嘆之不足，故詠歌之。歌者，樂之聲也，直陳其德也。准山海經：帝俊八 子，始為歌。若吾教中即梵唄也。尋西方之有唄，猶東國之有贊。贊者從文，以結章；唄者短偈，以流頌。比其事義，名異實同。今既作五聲八音之樂矣，及申歌詠 贊嘆之頌矣，復陳香華供養之物矣，不惟信心自為，更以普勸他作，或一或多，隨緣轉化。如是之人，自應獲福，故即雲如是等輩（雲雲）。然作樂供像，何以得鬼 神衛護耶？准禮記曰：禮樂之行乎陰陽，通乎鬼神。漢書雲：夫樂者，聖人所以感天地、通鬼神，況乾闥、緊那皆天帝樂神，今既伎樂歌詠於地藏，寧不感帝釋，遣 幹、緊，令人衛護耶。然惡事不聞耳者，又從何致乎？曰：不聞禮雲：夫樂，清明象天，廣大象地，終始象四時，周旋象風雨，今既作樂供像，自感天地清明氣象， 四時和焉，風雨時焉，安有惡事輒聞於耳。故曰樂者，樂也，君子樂得其道，小人樂得其欲；況今獲福，實從信心得來，何況親身受諸橫哉。若准法華：妓樂頌德， 開人天業，自應早成佛道矣。

△

【復次，普廣！未來世中，若有惡人及惡神、惡鬼，見有善男子、善女人歸敬供養贊嘆瞻禮地藏菩薩形像，或妄生譏毀，謗無功德及利益事，或露齒笑，或面背（一本作「背面」）非，或勸人共非，或一人非，或多人非，乃至一念生譏毀者。】

　　初舉譏毀之類，次明譏毀之相。梵名鳩那羅，此雲惡人，亦雲不好人。惡神，大即指波卑夜，正翻雲惡；小即指嶽瀆山川內惡者一流。惡鬼，大指鳩槃 荼等，小即指倚草附木，妄作威福之類。夫惡有三種：一曰惡，二曰大惡，三曰惡中惡。此之三類，各有三惡（雲雲）。見有等，明造毀之端。佛言：清濁異流，明 愚異趣，忠佞相仇，邪常嫉正。故著欲之人，不好我無欲之行。於是惡類遂生嫉心。所以嫉之者，惡人恐以彼善，形我之惡也；惡神恐其出界，失我之眷屬也；惡鬼 恐其齋戒，失我之血肉也。懷私雖異，為惡是同。曾子雲：人之好善，福雖未至，去禍遠矣；人之為惡，兇雖未至，去福近矣。辯魔書雲：見善養育，如雨露之被草 木；遇惡剿絕，若鷹鹯之逐鳥雀，人何不努力修善，而甘為惡人、惡神、惡鬼哉！譏者，嘲誚之言；毀者，謗壞之事。譏生忌嫉之心；毀起貪恨之念。故知心為起惡 之源，口乃召禍之本。徒謗聖賢，枉壓良善，從虛妄以構詞，自無端而肆毒：初乃輕言譏激，後遂重語讟誣。自作闡提，撥無因果。宣言此輩，徒竊善名，歸供贊 禮，實無功德，唐喪資財，何有利益？那知泥木靈像，遠有所錶，敬誠殷禮，獲福無邊。輕心毀謗，招罪彌劫，愚癡無知，阻退善根。或露齒而輕笑，或面是而背 非，自己非之，復勸人共非；或勸得一人，或再勸多人，而共非之。此言多譏毀惡。乃至一念，言少譏毀惡。那知眾罪，皆從此起。譬夫決江之流，濫觴於甕口；參 天之樹，發檗乎毫芒。唇口是弓，心慮如弦，音聲如箭，一念如機。長夜空發，徒染身口，顧斯後報，可不慎哉！

△

【如是之人，賢劫仟佛滅度，譏毀之報，尚在阿鼻地獄，受極重罪。】

　　獧（音喧，輕也）頑成性，估[人+豆]（上音顛，下音孺，輕薄也。）為情，不知佛道，正真弘深，而以世間輕薄淺近之言，欲設嫉心，謗毀道根。 如是之人，如摺翅鳥，不能飛行。當知是輩，於未來世，永不能至人天善處矣。梵名劫簸（亦作波）秦言分別時節。[風+(拔-手)]陊，秦翻為賢，以多賢人出 世，故名賢劫也。此現在賢劫，共有仟佛出世，今我釋迦，方是第四佛。余有九百九十六佛，一一出而滅，可謂歲月彌之矣。今言仟佛滅度已，而譏毀之報，尚在阿 鼻大獄，受極重之罪，終無底止矣。興起行經雲：世人所作行，或作善惡事，此行還歸身，終不朽敗亡。以謗法之人，極大罪業，墮三惡道，難可出離，可不慎哉！

△

【過是劫已，方受餓鬼；又經仟劫，復受畜生；又經仟劫，方得人身。縱受人身，貧窮下賤，諸根不具，多被惡業來結其心。不久之間，復墮惡道。】

　　歴劫沈淪，永失生天之路；隨緣受報，竟無出苦之期。謗無法味，感報枵虛之餓鬼；不識正道，受形旁背之畜生。梵名阇黎哆，雲餓鬼。此道遍在諸 趣，以諂誑心意，作下品五逆十惡，感此道身。梵名底栗車，雲畜生。此道亦遍諸處，以愚癡貪欲，作中品五逆十惡，感此道身。此二道中，經劫長遠，方始為人。 言方言縱，亦非必定之辭，縱然得復人身，余業猶然未盡。由昔斷滅法財，今感貧窮之報；因曩毀敬尊容，此招下賤之身；兼復諸根殘闕，以致九結纏心。從冥入 冥，隨苦至苦。大乘論，堅意菩薩雲：誹謗大乘法，決定墮惡道，焚燒甚苦痛，業報罪信爾。若從地獄出，復受余惡報，諸根常缺陋，永不聞法音，設使得聞者，復 生於謗法，以謗法因緣，還墮於地獄。噫！可不誡歟！

△

【是故普廣，譏毀他人供養，尚獲此報，何況別生惡見毀滅。】

　　是故二字，緊承永墮阿鼻，彌劫經生而況出也。善人供養，惡輩譏毀，尚獲彌劫之殃，況別生惡見！如彌犁車毀滅佛法，其罪有甚於此矣。故寶雨經雲：若誹謗者，是名愚人，墮於惡處，受諸苦惱，又為一切世間天人阿素洛等之所輕賤故。知誹謗之罪，實居眾罪之先。

△

【復次，普廣！若未來世，有男子、女人，久處床枕，求生求死，了不可得；或夜夢惡鬼，乃及家親，或遊險道；或多魘寐，共鬼神遊；日月歲深，轉復佨（一本作「尪」）瘵，眠中叫苦，慘淒不樂者。】

　　佛說醫經雲：人身中，本有四病，一地、二水、三火、四風。智論雲：四大為身，常相侵害。一一大中，百一病起。冷病有二百二，水、風起故；熱病 有二百二，地、火起故。蓋由四大難調，六腑更反，以有報身，忽嬰疚疾。今乃連年纍月，枕臥床席，不能起居，乃殺戮之余殃，致病惱之久迫。求生而勢不能生， 求死而事難即死。

　　夢惡鬼等，因病迫心，神思瞀亂，夜多惡夢，驚悸重增。唯識論明四夢：一、無明習氣，二、善惡先徵，三、四大偏增，四、巡遊舊識。今夢惡鬼，惡 相先徵也。及見家親，巡遊舊識也。遊險道，則四大偏增。鬼神遊，乃無明習氣也。烏蘇慢，此雲厭。眠內不祥，伏合人心。論衡曰：臥厭不寤，故曰魘寐。久寐不 醒，鬼神共遊，綿歴歲深，形骸睏劣。佨（音汪）弱也，即瘠病之人；瘵（音債）勞瘵，即五勞七傷之類。眠中叫苦等者，以身為苦器，陰是坯瓶，四大浮虛，互相 乖反，稟形人世逢穢濁之時；受質偽身，居怖畏之境。幽冥無量鬼神，以及家親眷屬，依房依廟，附嶽附丘，凡有含靈，[立+立]皆祗響，致使神爽冥昧，識慮昏 茫，至於寤寐多有恐怖。所以眠內不安，晨昏叫苦，心中煎迫，動靜慘淒，皆病中之苦相也。

△

【此皆是業道論對，未定輕重，或難捨壽，或不得愈，男女俗眼，不辨是事。】

　　此釋久病惡相，由業道之冤對耳。故佛告阿阇世王：一切諸法，皆為緣對。世人所為作，各自見其行。行善得善報，行惡得惡報。是故大王，當捨惡從 善。今既業緣對至，將非性命無逃；但未定其罪之輕重，豈便判其人之死生。故應死者，或難即時捨壽。未應死者，尚爾淹滯難愈。恐是五音咒詛，或招三世冤優。 （字匯補音尤，出道藏）魂繫陰司，災生陽世。人間俗陋之眼，焉能辯此業對之事哉。

△

【但當對諸佛菩薩像前，高聲轉讀此經一遍。】

　　夫人節宣不謹，感於寒熱等證，世醫藥餌，可能療治。今是惡業報病，須藉法力方祛。蓋諸佛心者，慈悲為體，能作醫王，善療眾生身心之病。經是法藥，菩薩是瞻病之人。故須對像讀經。然祗轉一遍者，金丹一粒，點鐵成金，至理一言，革凡成聖，何俟多轉乎。

△

【或取病人可愛之物，或衣服寶貝莊園捨宅，對病人前，高聲唱言：我某甲等，為是病人，對經像前，捨諸等物。或供養經像，或造佛菩薩形像，或造塔寺，或然油燈，或施常住。】

　　世人之病有二種：四大是身病，三毒是心病。身病可用藥，心病須修福。法句經雲：人作善惡，殃福隨人；雖更生死，不可得免。故須經福以禳之。可 愛物華美而貴重者，今割其愛，斷病之根也。衣服著以嚴身，寶貝蓄而致富，莊園供遊玩之觀，捨宅安子孫之所，[立+立]我受用，不可闕少，此明所捨之物。對 病人下，宣唱捨物。對病高唱者，令知代施功德，憶持在心不忘。經雲：一切諸物悉皆分散，唯此願王，不相捨離。是也。梵語那莽，此雲某甲。甲是天幹之首，第 一之數，不妨乙丙行列也。或供下，修福之法：供經像者，法是佛母，佛從法生，三世如來，皆供養法。像是世尊遺容，雖泥木塑刻，見者皆生佛想，與真無異，故 供者得福。造佛菩薩形像者，准造像福報經：功德殊多，今略舉一二。經雲：天下人民，能作佛形像者，世世所生之處，眼目凈潔，面貌端正，身體手足，常好柔 軟。生於天上，亦復凈潔，諸天中勝，紫磨金色，端正無比。作菩薩像，功德亦爾。塔寺如前，雜寶藏經雲：造立塔寺，命終生忉利天。然油燈者，施燈經：佛告捨 利弗，有人於塔廟形像，奉施燈明，乃至以少燈炬，如此福德，唯佛能知。成佛一人，或將病人可愛物等，總施招提，供養眾僧。此言隨行一種，即感勝報，非事事 要做也。

△

【如是三白病人，遣令聞知。假令諸識分散，至氣盡者。乃至一日、二日、三日、四日至七日已來，但高聲白，高聲讀經。是人命終之後，宿殃重罪，至於五無間罪，永得解脫，所受生處，常知宿命。】

　　代病捨物，必三白令聞知者，欲令洞聞於心，深知我有如是功德也。假令者，謂藉斯福，病去身安，何善如之。借使大限難逃，世緣永絕，當諸識分 散，氣絕之時，亦應七日之中，高聲唱施讀經，其人必解脫重罪，而超升矣。諸識分散者，處胎經雲：爾時世尊將欲示現識所趣嚮：道識、俗識、有為識、無為識、 有漏識、無漏識、華識、果識、報識、無報識、天識、龍識，乃至人非人識，上至二十八天識，下至無救地獄識（文）。此泛指也，若的就一人，應指八個識神為諸 識也。氣盡者，所謂風先火次，魂神去矣，身虛體冷，形骸蕭索也。
　　宗鏡問：諸根壞日，識遷離時，捨此故身，別受余質，去來之識，相狀雲何？答：顯識經雲：佛告賢護，識之運轉，遷滅往來，猶如風大，無色無形， 不可顯現，而能發動萬物，示眾形狀（雲雲）。是人下，明轉障托生。宿殃重罪，五無間罪，永得解脫。正顯施福殊勝，三寶功深。不惟脫罪受生，且能常知宿命。 自然深知因果，罪福分明，從明入明，必階佛果已。

△

【何況善男子、善女人，自書此經，或教人書，或自塑畫菩薩形像，乃至教人塑畫，所受果報，必獲大利。】

　　況者，譬擬也。謂代其捨施，獲福尚爾，矧自行之，何可比擬。中邊分別論明大乘行，有十：第一是書寫。涅槃雲：於惡世中，書寫經卷，亦勸他人令 得書寫，具足能解，盡其義味。塑畫形像，造像經雲：作佛菩薩形像，其福無量，無窮盡時，不可稱數。如是四天下江河海水，尚可升量，作佛形像，其福甚多，多 四天下江河海水，過出十倍。後世所生，常護佛道，作佛形像，死後不復入於地獄、畜生、餓鬼諸惡道中。故所得果報，必獲大利也。

△

【是故普廣，若見有人讀誦是經，乃至一念贊嘆是經，或恭敬者，汝須百仟方便，勸是等人，勤心莫退，能得未來現在仟萬億不可思議功德。】

　　承上功德，故言是故。對經名讀，以未熟故；背本名誦，以文熟故。根有利鈍，時有久近耶。是經者，地藏經也。言是者，以全體即是，更無二故。今 家六即顯是。以全心是經，經外無心；全經是心，心外無經。故曰：是經一念贊嘆者。前以一念譏毀供養，尚獲彌劫之殃；一念贊嘆是經，必感多生之福。恭敬讀誦 者，獲福與贊嘆同功。汝須下，佛勸誡普廣，應須以百仟方便，勸是等讀誦贊嘆恭敬者。如大方廣總持經雲：佛滅度後，若有法師，善隨樂欲，為人說法，能令菩薩 學大乘者，及諸大眾，有發一毛歡喜之心，乃至暫下一滴淚者，當知皆是佛之神力。以此證知其讀誦贊嘆恭敬者，安知非佛神力，故須方便勸之。勤心莫退者，如堅 意經，佛告阿難：其有好心善意之人，聞佛明法，一心而聽。能，一日可；不能一日，半日可；不能半日，一時可；不能一時，半時可；不能半時，須臾可。其福不 可量、不可訾也。汝當廣為諸比丘僧、比丘尼、優婆塞、優婆夷、白衣人民說之，暫聽尚爾，況恭敬乎？況贊嘆乎，況讀誦乎。故勸勤心莫退，能得不可思議功德於 現未故也。

△

【復次，普廣！若未來世諸眾生等，或夢或寐，見諸鬼神，乃及諸形，或悲或啼，或愁或嘆，或恐或怖。】

　　此中之夢，與前夢不同。前是自身業對，此為遠屬陰纏，皆實夢也。孫真人雲：凡夢皆緣，夢魂役物，其神至於軀體，不能流通，夜則魂夢虛爭，將吉 以報吉，將兇以報兇。故東萊呂氏雲：形接為事，神遇為夢。今乃形接而神遇，故有夢事也。周禮佔六而夢，夢之吉、兇、平居、驚愕，思念覺時道之喜悅、恐懼之 六夢也。寐者，昧也，目悶神藏也。莊子雲：其寐也，魂交是矣。見諸鬼神，此繫多生親屬，托夢現形，乃平居正夢也。諸形者，男女老少不同，人鬼面貌不一，悲 啼等，即驚愕、恐懼之夢。准醫書，乃陰氣所乘，故見鬼神。肺氣盛，則夢哭泣、飛揚；心氣盛，則夢喜笑、恐畏。今是親屬致感，非關陰陽虛實。悲啼愁嘆，親鬼 乞憐之狀也。

△

【此皆是一生、十生、百生、仟生過去父母、男女、弟妹、夫妻眷屬，在於惡趣，未得出離；無處希望福力救拔，當告宿世骨肉，使作方便，願離惡道。】

　　多生眷屬，故現諸形。未接生前，安能念及乎。父母男女，如前。弟，第也，相次第而上也。妹，昧也。猶日始入，歴時少，尚昧也。夫妻，匹敵之義 也。士庶人曰妻，妻齊也。夫賤，不足以尊稱，故齊等言也。在於惡趣等，或沈地府，或墜鬼倫。經歴長途，出離寡助。既失望福救之處，乃遠告多世之親，此鬼神 無聊之極思有求之苦境也。故知，為過去父母等作福，如餉遠人。然正法念經雲：若為亡人修福行佈施。生鬼道者，鬼容得福，以鬼知悔，前身慳貪，故為施時，彼 則歡喜。若生余道，多無得力。今此輩求作方便，願離惡道，恐是餓鬼之類耶。

△

【普廣！汝以神力，遣是眷屬，令對諸佛菩薩像前，誌心自讀此經，或請人讀，其數三遍，或七遍。】

　　何故令普廣以神力遣眷屬讀經耶？以世間愚人識恩分者少，生前六親尚有不顧，況隔數世之親乎。即有念及者，既未識面，縱形夢寐，想不及此。故敕 普廣以神力冥資，速令憶念，使恭對佛菩薩像前，或自讀經，或請人讀。其經數之三、七者何？皆陽數也。三乃天地人之數。自一而在重之，三才備矣。一之二，陽 生陰也；二生三，陰陽參和也。三生萬物，生生無窮矣。七，少陽之數也。此亦二三變體，二得五成七，進得乎九，則為老陽。轉獄鬼於陰司，生人天之陽世，故唯 取三、七之數，不取六、八者，以陰數坎陷，非超冥之道耳。

△

【如是惡道眷屬，經聲畢是遍數，當得解脫。乃至夢寐之中永不復見。】

　　解脫者，離惡道也。或生天上人間，或進三乘聖道，亡親既獲超升，自不現形夢寐矣。

△

【復次，普廣！若末來世，有諸下賤等人，或奴或婢，乃至諸不自由之人，覺知宿業，要懺悔者。】

　　下賤等，辯意經雲：五事常生卑賤，為人奴婢。一、憍慢不敬二親，二、剛強無恪心，三、放逸不禮三尊，四、盜竊以為生業，五、負債逃避不償。然 下賤對尊貴言奴婢。對大家言，各有不同。若以四方言之，北郁單越，無仆使之殊，故無貴賤。余三方有貴賤，以有君民庶之別，大家仆使之殊，故有貴賤別類也。 總束貴賤，合有六品：一、貴中之貴，謂輪王等；二、貴中之次，謂粟散王等；三、貴中之下，謂百僚等；四、賤中之賤，謂臺奴豎子等；五賤中之次，謂仆隸等； 六賤中之下，謂姬妾等。粗束如是，細分難盡。諸不自由者，非下賤奴婢之流，乃皂隸門館之類。月有請受，日藉資生。聞呼喚而來，仰其鼻息；聽發遣而去，承其 聲光，身不自從，非丈夫矣。宿業者，佛告波斯匿王，凡人處世，尊卑貴賤，貧富苦樂，皆由宿行而致斯果。若世之愚頑無覺知者，抑豈甘之，且謂得之。若稍黠慧 有覺知者，豈惟哀之，誠欲脫之。若欲離脫，必須懺摩，滌蕩悔過[僣-曰+心]尤。光明雲：繫屬於他，常有怖畏，不得自在，而造諸惡。故須行懺悔也。梵語懺 摩，此雲悔過，華梵雙標也。輔行雲：懺悔秪是三善業耳。

△

【誌心瞻禮地藏菩薩形像，乃至一七日中，念菩薩名，可滿萬遍。】

　　一七者，世數，極於七也。如一日念之不應，念之七日，必遂所求。故十輪經雲：一日稱地藏，功德大名聞，勝俱胝劫中，稱余智者德。能解諸眾生，一切煩惱縛，故須稱名。滿萬遍者，錶祛萬惡，集萬善也。

△

【如是等人，盡此報後，仟萬生中，常生尊貴。更不經三惡道苦。】

　　此正顯地藏大威神力。如佛告辯意：有五事，得為尊貴，眾人所敬。一、施惠普廣，二、禮敬三寶及眾長者，三、忍辱無有嗔恚，四、柔和謙下，五、博聞經戒。今七日稱名，豈止仟萬生中尊貴，不經惡道，即佛果必可期也。

△

【復次，普廣！若未來世中，閻浮提內，剎利、婆羅門、長者、居士，一切人等及異姓種族，有新產者，或男或女。】

　　但舉南洲者，北洲產於樹下，亦無惡露苦惱。東西二洲，欲事既少，生育應稀。唯有南洲，女人多產多苦。以一切諸眾生母，欲生子時，身體遍痛，受 大苦惱，數坐數起，不能自安。故特標閻浮人耳。剎利等人，雖貴賤不埒，生時善惡誰知？三十八個七日滿足，必須胎產男女。此由宿業因緣，以隨陰陽變化，故周 易八卦，幹陽為父，坤陰為母，生震坎艮之三男，巽離兌之三女，化生萬物也。准增一阿含，若當為女，於母左脅，倚脊嚮腹而住；若當為男，於母右脅，倚腹嚮脊 而住。故知男女皆乘愛而生，以淫欲而正性命也。

△

【七日之中，早與讀誦此不思議經典，更為念菩薩名，可滿萬遍。】

　　何故早與讀經稱名耶？准護諸童子咒經：如來初成正覺，有一大梵天王來詣佛所，作禮說偈，言：有夜叉羅剎，常喜啖人胎，能令人無子，傷害於胞 胎。男女交會時，使其意迷亂，懷妊不成就，及生時奪胎。皆是諸惡鬼，為其作繞害，我今說彼名，願佛聽我說。第一名彌酬迦，乃至第十五名藍婆。此十五鬼神， 常遊行世間為嬰孩小兒，作於恐怖，及說恐怖形相（雲雲）。今故早讀本願經，及與地藏名，則令善神擁衛門戶，惡鬼自遠遁矣。

△

【是新生子，或男或女，宿有殃報，便得解脫，安樂易養，壽命增長。若是承福生者，轉增安樂及與壽命。】

　　文分二節：初轉宿殃報者；准瑜伽論雲：又於胎藏中，或由先業力故，或由母不避不平等力所生，隨順風故，令此胎藏，或發、或毛、或皮、及余支 分，變異而生。今既誦經稱名，便令新生男女，宿殃之報，盡得解脫也。安樂易養者，胎藏極成滿時，其母不堪持此重胎，於第四日，內風便發，生大苦惱。又此胎 藏，業報所發生分風起，令頭嚮下，足便嚮上，胎衣纏裹，而趣產門。其正出時，胎衣遂裂，分之兩腋，出產門時，名正生位。生後名觸，謂眼觸等。但生時有多種 不同，或順生，或逆生，甚有一足先下，謂之踏蓮生，母腸同出，謂之盤腸生。此最險惡，命在須臾。今既誦經念名，則安然快樂，生養甚易。

　　壽命增長者，大梵復白佛言：此諸女等，欲求子息保命長壽者，常當繫念修行善法。於月八日、十五日，受持八戒，清凈洗浴，誦我所說陀羅尼咒者，所生童子，安隱無患，盡其形壽，命不中夭。今既誦經稱名，自不為惡鬼嬈害，故得壽命增長也。

　　若是下，增現福。承福生者，修行道地經雲：人行不純，或善或惡，至三十八七日，在母腹中，隨其本行，自然風起。宿行善者，便有香風，可其身 意，柔軟無瑕，正其骨節，令其端正。莫不愛敬。又母腹風起，或上或下，轉其兒身，而令倒懸，頭嚮產門。其有福者，時心念言：我投浴池，水中遊戲，如墮高床 華香之處也。惡者反是。今又早為誦經稱名，又承宿福而生，故應安樂者，轉增安樂；應壽命者，重增壽命矣。

△

【復次，普廣！若未來世眾生，於月一日、八日、十四日、十五日、十八日、二十三、二十四、二十八、二十九日乃至三十日，是諸日等，諸罪結集，定其輕重。】

　　世之持齋者，有三長齋、月六齋、十齋不同。今先定齋日之數。准文殊菩薩善惡宿曜經：每月一日，梵雲缽阇底下，（唐言梵王）是建名日。宜為善 業，苦節修行佈施等事，[立+立]吉。八日、二十三日，是力戰日，婆娑善神下，宜力用之事。十四日、二十九日，是勇猛日，藥芻神下。二十四日，是兇猛日， 嚕達啰尼神下。二十八日，是最勝日。缽摺底神下。（唐雲天魔神）十五日、三十日，是吉相日，必多盧神下（唐雲魂靈神）宜祭先亡，及佈施供養父母、尊者、諸 天，持齋戒施食，及諸祭祠吉。故取此十日為齋日也。但乃至二字，自古講者，皆雲超略之辭。今日數已至二十九，而又超至三十日，譯師不通甚矣。非也。含蓄深 意，人不知也。余考乃字古訓為難意，而用為語辭之難心之難，不可象也。故象口氣逶迤上出，難之又難也。其字噃，示人以意：今言一日至三十日，如是十日無 間，至難至難也。若不信此解，若為通此二字乎？是諸下三句，明是日意。准佛祖統記，引提謂經，明三長齋。佛謂提謂長者曰：四時交代，歲終，三覆以校，一月 六奏，諸天帝釋、太子、使者，閻羅鬼神，俱用正月、五月、九月、旦日，案行王、民、龍、鬼、鳥、獸，為善惡者。與四王，一月六奏，使無枉錯，覆校眾生罪福 多少。福多者，敕司命下閻羅五官，除罪增祿。故使持是三長齋。

　　引四天王經，明六齋。帝釋敕四王，各治一方。白月八日，遣使者案察眾生善惡；十四日，遣太子；十五日，王親臨。黑月三日亦如是。若王親下，星宿鬼神俱時隨從。如遇修行齋戒，諸天相慶，即為註祿增算。

　　引十齋經，明十齋。每月十齋日，持佛菩薩號，乞福滅罪，（於六齋日加月旦等四日，如本經。）今國律，令諸州十直日，不得行刑，正據此義。又凈 度三昧經雲：八王日（立春、春分、乃至立冬、冬至）諸天帝釋鎮臣三十二人、四鎮大王、司命、司祿、五羅大王、八王使者，盡出四佈覆行。復值四王，十五日、 三十日所奏，案校人民立行善惡。地獄王，亦遣輔臣小王，同時俱出，有罪即記。前齋八王日犯過，福強有救，安隱無他，用福原赦。到後齋日重犯，罪數多者，減 壽條名，克死歲月日時，關下地獄。地獄承文書，即遣獄鬼錄名，獄鬼無慈，死日未到，強催作惡，令命促盡。福多者，增壽益算，天遣善神，營護其身。移下地 獄，拔除罪名。除死定生，後生天上。已上齋法，各出佛經，各宜遵奉，永處福堂，毋得故違，自取殃咎。故詳示於此。

△

【南閻浮提眾生，舉止動念，無不是業，無不是罪。何況恣情殺害、竊盜、邪淫、妄語，百仟罪狀。】

　　南洲之人，心識無定，況意根中，善、惡、無記三性，生成法則。但凡夫之人，起惡念時多。舉，即是動；止，即是靜，動靜之間，念起不一。安般經 雲：一彈指頃，心有九百六十轉。仁王經雲，一念有九十剎那，一一剎那中，復有九百生滅。菩薩處胎經雲：一彈指頃，有三十二億百仟念，念念成形，形形有識。 一念善，有無量善果報；一念惡，有無量惡果報。故雲舉止動念，無不是業。但凡夫造業，凡動身口，皆由心使。若心不善，方能損物；若內有善，方能順福。雖復 損益不同，然三業之本，以心為源。故動念成業，念善是福，念惡成罪，然檢點自心，於二六時中，大約罪多於福也。何況縱恣六情，任造三業耶！遺教經雲：縱此 心者，喪人善事。譬之駑馬，極力控制，尚難調伏。若縱其奔逸，損物無疑。殺害、竊盜、邪淫身三惡業，妄語該口四業，如前。百仟罪狀，即一殺業，有上中下； 乃至貪嗔癡，亦有上中下，細舉不勝。故總雲百仟。須知結罪由心，業有輕重，如嗔重則罪重，嗔輕則罪輕。成論雲：或以事重，故有定報；或以心重，故有定報。 如人以深厚纏毒，殺害蟲蟻，重於輕心殺人。若心無嗔，雖殺上境，乃至父母，亦不成逆。故知諸業，例有輕重，雖分輕重，然受報時，纖毫不爽，可恣任其情乎。

△

【能於是十齋日，對佛、菩薩、諸賢聖像前，讀是經一遍。東西南北，百由旬內，無諸災難。當此居家，若長若幼，現在未來，百仟歲中，永離惡趣。】

　　六齋、十齋，增減不同。大論六十五雲：六齋日，諸天來觀人心。十五日、三十日，上白諸天。又六齋日是惡日，令人兇衰，若有是日受八戒持齋佈施 聽法，是時諸天歡喜，小鬼不得其便，利益行者。故止觀取齋日建首，有以也。但持齋法，稍有不同。闡義引祭統雲：齋之為言，齊也。齊不齊，以致齋者也。及其 將齋也，防其邪物，訖其嗜欲，耳不聽樂。今釋氏以不過中食為齋，亦取其防邪訖欲，齊不齊之義也。故請觀音疏雲：齋者，只是中道也。中後不得食者，錶中道法 界外，更無別法也。故若在釋門，緇素皆過午不食為齋。近世通行，白衣唯不茹葷飲酒為齋，故不同也。法句經雲：祠祀種禍根，日夜長枝條，唐苦敗身本，法齋度 世仙。故於六十齋期，應持齋佈施，讀誦本願經耳。此正明讀經，下明利益。讀經中，初明方無災難。若有一人，果於齋日，每讀經一遍，則使四方百由旬境內， [立+立]無災難。地反物為祆，（音[糸-小]）天反時為災，所謂蠲除祆災是也。次明家離惡趣。讀經秪一遍耳，何獲報之殊勝耶？正顯地藏不思議利益事也。 然今非無讀經者，竟不獲報，何也？曰：此有二意，一、方內之人，及居家之屬，前生罪惡深重，則是定業難逃；二、誦經者，心或不同，誌心者，誦經得力，故能 轉宿殃；不誌心者，誦力既淺，福不勝罪，故難轉也。

△

【能於十齋日，每轉一遍。現世令此居家，無諸橫病，衣食豐益（一本作「溢」）。】

　　橫病者，乃疫癘流行，福衰忽染，雖是惡鬼妄作禍福，即繫自無善力所招。今既誦經，永絕橫病，衣食豐益，最是要事。光明雲：依因衣食，諸結惱 熱。藥師雲：為衣食故，造諸惡業，今因齋日轉經，故感豐饒之報，不惟無業，亦且增福。即使貧無衣食者，亦致豐益之報矣。經之利益，可思議耶！說利益事竟。

△

【是故普廣，當知地藏菩薩，有如是等不可說百仟萬億大威神力利益之事。】

　　結如是等一句。顯上所明者，乃舉其[既/木]耳，如地藏十輪及佔察善惡二經，廣詳其事。

△

【閰浮眾生，於此大士，有大因緣。】

　　因緣，秪是感應異名。大者，皆欲令其開、示、悟、入佛之知見，大事因緣也。故大士金口親雲：但於佛法中，所為善事，一毛一渧，一沙一塵，我漸 度脫，使獲大利。大利者，即法華所謂無量珍寶，不求自得，即菩提涅槃也。如是大因緣，非始今日。於無量阿僧秪劫來，於閻浮提，隨機化物，種熟脫三。時時不 廢。譬子墮水火，父母騷擾救之；子有疾病，父母心偏愛之。以南洲眾生，罪業偏重故也。故南洲眾生，亦獨於大士，信心不置。故上下貴賤，緇素男女，無一不從 地藏菩薩，求其救拔水火，療治疾病，譬如磁石吸鐵，應感同時，有大因緣，深可省悟。

△

【是諸眾生，聞菩薩名，見菩薩像，乃至聞是經三字五字，或一偈一句者，現在殊妙安樂，未來之世，百仟萬生，常得端正，生尊貴家。】

　　此言聞名見像者，明旋復之功也。原夫生佛同一覺體，覺海之性澄圓，圓澄之覺元妙，不覺無明風動，妄分見覺聞知。局於區宇，隔別成礙。於是見不 超色，聞不出聲。今旋其妄聞，聞菩薩之名；旋其妄見，見菩薩之像。則令所聞之名，契入真空之境，名亦無名。所見之像，會同法性之身，像何可像？名無名，而 真聞了了；像無像，而真見昭昭。如是，則隨拈經中或三個字，當下破三惑，消三障，成三智，證三德，顯三身。或拈五個字，隨處破五住，出五道，立五根，長五 力，成五分也。一偈則一門超出，一句則一性圓明。如是二四六八，隨行增數。現在則獲殊妙安樂，念念與本願同流，心心共菩薩俱現。未來之世，常得相好，端嚴 清正。在處恆生尊貴之家。如佛告波斯匿王雲：仁慈謙順，敬長愛小，則為貴人。兇惡強梁，憍恣自大，則為賤人。又曰：三界輪轉，無有定品，積善仁和，生於豪 尊，習惡放恣，便生卑賤。以此觀之，人不可作惡，應自修之。世尊說利益竟。

△

【爾時，普廣菩薩聞佛如來稱揚贊嘆地藏菩薩已，胡跪合掌，復白佛言：世尊！我久知是大士，有如此不可思議神力，及大誓願力，為未來眾生，遣知利益，故問如來。唯然頂受。】

　　初、經家敘儀，次、陳所請意。胡跪者，音義指歸雲：不合雲胡跪。蓋梵世遺種，居五竺間，蔥嶺之北。諸戎羌胡，今經律多翻互跪，以三處翹（渠遙 切）聳，故名互跪，即右膝著地也。以右膝有力，跪能久，起止便故，著地令安。若女尼體弱，佛聽長跪也。言久知者，則普廣亦地藏一流人，自具有不思議神力， 及大誓願力，故能知之。既知而又問者，正冀如來於大會宣揚，令未來眾生，知地藏菩薩利益如此，故問之耳。唯然，乃應答無疑之速辭。近指上文，遠則照映前 文，汝等諸菩薩，當記是經，廣宣流佈之語。然彼時定自在神，但承命流通，不請經名者，審知地藏神力之事未竟。一也。逆知普廣復有請詳利益之事，二也。故知 主賓酬唱，更互發揚，譬之砧誤相扣，上下相應。故下唯然頂受之語。

△

【世尊！當何名此經，使我雲何流佈。】

　　當何、雲何，皆設疑之詞。自說經以來，贊嘆地藏功德，除佛一人，無能及者。夫名之所以為名，召其實者也。今地藏實德既言不可思議，則不以名而 名之矣。故雲：當何名此經？名既不立，使我等又依何法門而流佈耶！故雲：使我雲何流佈？周禮：泉行曰佈，言世間之錢，如泉水之流通而散佈也。經之流佈，亦 如是耳。

△

【佛告普廣：此經有三名：一名地藏本願，亦名地藏本行，亦名地藏本誓力經。】

　　經名，如綸貫。又解本願者，心所欲得名願。視欲為深且專。願乎外，盡人欲也；惟天理，為性之欲，乃人本心，從原。教人反求其本，欲其可欲之善 也。而從頁（胡結切），何也？心求得之，俯首以停思。不，則貪也已矣，癡也已矣。此雖儒釋，然地藏之本願，亦豈外於是乎。無非欲人復還本元覺性，同歸秘 藏。是大士本時之願也。
　　本行，即本昔之行。故吾約此，准妙玄本門十妙，以明本地十不思議，文義始暢。方顯中間近成種種不思議事，皆跡中之願行也。
　　本誓力者，梵語僧那，此雲弘誓。一雲僧那大誓，僧涅自誓。僧那言鎧，僧涅言著，名著大鎧，正言[月+冊]那訶，翻甲。[月+冊]（蘇幹切）捺 陀，翻被，翻衣。謂被甲衣甲。密部中明三十二甲（雲雲）。即大品大誓莊嚴也。梵名娑羅，此雲力。陰持入經雲：彼力，應以何為義？答：無能壞為力義，有所益 為力義，有膽為力義，能得依為力義。今地藏自元初發心以來，不為天魔沮壞，一力也；在所利益眾生，二力也；有膽偏化地獄，三力也；能為六道得依，四力也； 此地藏本時誓願之力，故名本誓力經。

△

【緣此菩薩久遠劫來，發大重願，利益眾生。是故汝等，依願流佈。】

　　此願地藏之名，亦從本願而立。因大願故，利益眾生。是故汝等亦應依其本願，而流佈之。故集家單以本願立題，深有以也。

△

【普廣聞已。合掌恭敬，作禮而退。】

　　恭敬二字，每見講家置論，使後生末學，不知何所取義乎，今略明制字之原，以見心學之在是也。嘼（古恭字）敬德之容。手容主恭，故指兩手交為 義。人之平居，散其手，其心放，貌以之惰。斂其手，其心必收，貌以之莊。內外合者也。俗書，不知即此是心。復加以心作恭，是謂心有內外也。主一也。古人聚 精會神之學。貌而敬者，強捉於外。其中竊發，將不能自持。口雲敬者，其行必惰，空言胡能勝實惡！若何而致力耶？曰：勿忘，勿助長也，從茍（已力切。音急， 行之亟也。）者，教之以勿忘也。媛則無功，裁覺昏沈，速自喚醒。裁覺散亂，速自絕斷。久者，教之以勿助長也。急則拘迫，胸中有物礙之，血氣弗舒，何以能 久！心，吾形之主也。敬者非它（「它」一本作「宅」），吾心自為主也，何待別借一心，來治此心。雖畏勿畏，雖休勿休，綿綿若存，天德周流，心常活而毋死。 悚為起敬，戒為持敬，畏為克敬，肅為嚴敬，穆為玄敬，欽為聖敬。一敬德之生，孰淺深也。茲惟聖學淵原，觀古人之心畫，則知其心學矣，何可為文字之學，障性 靈，塞悟門，竟不一究心焉。那知字學，誠能豁性靈，開悟門，故略示之，毋謂余好搜冥索隱而炫奇也。

△

【利益存亡品第七】

△

【爾時，地藏菩薩摩訶薩白佛言：世尊！我觀是閻浮眾生舉心動念，無非是罪。脫獲善利，多退初心。若遇惡緣，念念增益。】

　　心念指六識，舉動是功能。由六七二識和合，濁亂八識主人。八識復令前五識，貪聲著色，嘗味嗅香，觸身軟滑，處處夤緣，故曰無非是罪。脫獲善利 二句，言持心不固。僧護經雲：閻浮提人，為性難信。由行善而獲利益，自宜進功無間，乃因獲利，反退初心。故佛說寶雨經雲：菩薩見一切有情，受諸苦惱。雖復 成就微少善根，暫時非久。是也。若遇惡緣等，謂四大毒器，有穢斯充；六賊狂主，是境皆著。無復逆流之期，唯有循環之勢。淪滯生死，封執有為。諸佛為其斂 眉，菩薩於茲泣血。此由執心不定，而致斯惡。故大師雲：應知諸身，皆由心造。譬如大地一，能生種種芽。是也。（凈度三昧經雲：罪福相纍，重數分明，後當受 罪福之報，一一不失。一念受一身，善念受天上人中身；惡念受三惡道身。百念受百身，仟念仟身，一日一夜種生死根。後當受八億五十萬雜類之身。百年之中，種 後世裁，甚為難數。魂神逐種受形，遍三仟大仟剎土。體骨皮毛遍大仟剎土地，間無空處。又處胎經雲：吾從無數劫，往來生死道，捨身復受身，不離胞胎法。純作 白狗形，穢骨億須彌，何況雜色狗，其數不可量。故賢愚經雲：人身難得，遇惡因緣，則便易失；以惡多善少，一日之中，罪念百仟，善念無一。）故知人能伏心為 道者，其力最多。其奈閻浮眾生，雜慮紛飛，不能固守，善退惡增，是其慣習也歟！

△

【是等輩人，如履泥塗，負於重石，漸睏漸重，足步深邃。】

　　初喻南洲眾生，善退惡增，如履淖泥之途，常處生死之界，既深且邃，求出應難也。

△

【若得遇知識，替與減負，或全與負。是知識有大力故，復相扶助，勸令牢腳。若達平地，須省惡路，無再經歴。】

　　若得者，含幸不幸二意。謂其人儻有微善，即遇知識，何幸如之；儻無善緣，終不一遇，不幸甚矣。知識有近遠。近指父母眷屬，為作福事者；遠指 佛、菩薩等，銷滅其罪者。替，代也。負，（防父切，音附。）背荷物也。減負、全負，論作福之功，有半有全，使死（編者註：「死」擬改為「得」）者減罪，即 減負也。罪若全銷，即全負也。下釋能負意。謂此知識有大力故。增一阿含說：因人五力，（信等五力）佛果十力。准大論：菩薩亦具十力。有是力故，不惟替負， 復能扶持相助，勸令堅牢腳跟，儻滑倒泥塗，終難起矣。又復勸其若達平穩之地，應須回省前履之惡路，無再經過涉歴也。相扶，喻教十善；牢腳，喻持心無退。平 路，譬升出人天；省惡，譬念三塗苦。再經，喻莫更重入苦趣也。

△

【世尊！習惡眾生，從纖毫間，便至無量。】

　　此合前舉心動念等文。謂何以舉心動念，乃至遇惡增益耶？以習惡故。惡習，指種子。習惡，指現行。由有惡習種子，故使習惡現行，是以從纖毫而至 無量也。佔察經雲：求心形狀，無一區分而可得者。但以眾生無明癡暗熏習因緣，現妄境界，令心念著，於種種法上，妄生種種法想。謂有、謂無，謂彼、謂此，謂 是、謂非，謂好、謂惡，乃至妄生無量無邊法想。故光明玄雲：登難墜易，多緣諸惡身故。記雲：良以眾生，無始熏習，惡多善少，致令心念，多緣惡身。五乘未 駕，先遊四趣。登難墜易，誰曰不然。修觀行人，於十界心，常當循省，不可不知。止觀所以簡非心也。

△

【是諸眾生，有如此習。臨命終時，父母眷屬，宜為設福，以資前路。】

　　初二句，示修福戒殺意。以眾生有如此惡習故，種現交熏，因果相感。若眷屬不為設福，憑何以資前路乎！無常偈雲：常求諸欲境，不行於善事，死王 催伺命，親屬徒相守。諸識皆昏昧，行入險城中。將至琰魔王，隨業而受報。勝因生善道，惡業墮泥犁。唯有佛菩提，是真歸仗處。故宜設善福，資前路也。

△

【或懸幡蓋，及然油燈，或轉讀尊經，或供養佛像及諸聖像，乃至念佛、菩薩及辟支佛名字，一名一號，歴臨終人耳根，或聞在本識。】

　　此中修福有二栽果：一修事福果，懸幡設蓋然燈，一敬三寶果，轉經供像稱名。普廣經雲：若四輩男女，若臨終時，若已過命。於其亡日，造作黃幡，懸著剎上，使獲福德，離八難苦，得生十方諸佛凈土。

　　幡蓋供養，隨心所願，至成菩提。幡隨風轉，破碎都盡，至成微塵。幡一轉時，轉輪王位；乃至吹塵，小王之位。其報無量。然燈供養，照諸幽冥，苦 痛眾生，蒙此光明，得互相見。緣此福德，拔彼眾生，悉得休息（文）。有此福利，故為懸幡、然燈也。供像如前，念佛如後。正法念經：夜摩天王為諸天說偈雲： 若人心念佛，是名善命人，不離念佛故，是為命中命。念法念僧亦然。使是名號得歴耳根，納在八識，終無毀壞。譬之金剛入腹，經久不爛，要必穿腸而出。故須熏 聞佛種，所謂法音經耳，功報彌劫。一歴耳根，永為道種，不其然乎。（另本於「永為道種」後為「阿梨耶識即本識也。以與生死作本，故名為本。」）

△

【是諸眾生，所造惡業，計其感果，必墮惡趣。緣是眷屬，為臨終人，修此聖因，如是眾罪，悉皆銷滅。】

　　此合前文，遇知識與全負也。死者既多習惡，能無業纍牽纏。因不爽果，惡必遭殃。若不修聖福之因，何能免將來之果！毗曇論雲：趣者，名到，亦名 為道。謂彼善惡業因道，能運到生趣處故。亦可依所造之業，趣彼生處。又歸嚮義，謂所造業，歸嚮於天及地獄也。如大乘同性經，楞伽王白佛，雲何眾生捨此壽 命，受彼壽命？捨此故身，受彼新身？佛言：眾生捨此身已，業風力吹，移識將去，自所受業，而受其果。故圭峰大師雲：欲驗臨終受生自在不自在，但驗尋常行心 自由不自由。二六時中，常當省察。旨哉言乎！是則既造惡業，必墮惡趣。今得免者，緣眷屬為修種種聖因，故使如是眾罪，如猛風之吹浮雲，似大水之滅小火。故 知眾罪消滅，乃知識大力，全為負之也。

△

【若能更為身死之後，七七日內，廣造眾善，能使是諸眾生，永離惡趣，得生人天，受勝妙樂。現在眷屬，利益無量。】

　　此合復相扶助等五句文。謂有力知識，不惟為其全負重石，且能扶其達於平地。正指死後為其修福也。梵語末剌諵，此雲死。如十二品生死經，人死有 十二品（雲雲）。故法句雲：夫身者，眾苦之本，患禍之元，吾我縛著，生死不息，皆由身歟！今欲離世苦本，應須為其造善也。七七日，如後。譬夫亢陽如久，必 思甘雨之澤；災癘若多，克待良醫之藥。病得藥以身安，旱沾雨而土潤。故得永離惡趣，得生人天，若達平地矣。既生天上，而永處福堂；或在人間，而長享豪富。 受勝妙快樂之時，亦須省其惡路。固守此心，無令退失善念，再經惡道也。優婆塞戒經雲：為亡追福，施已命終，是人福德，隨所施物，任用久近，福德常生。是福 追人，如影隨形。或有說言，終已便失，是義不然。何以故？物壞不用，二時中失，非命盡失（文）。故得資生人天，受勝妙樂，不惟亡者獲樂超升，即現在獲益， 亦無量矣。

△

【是故我今對佛世尊及天龍八部人非人等，勸於閻浮提眾生，臨終之日，慎勿殺害及造惡緣，拜祭鬼神，求諸魍魎。】

　　此承上臨終修福，存亡俱獲利益，而勸諭之言。我今者，將利益存亡事一肩擔任也。臨終日者，四自侵經雲：五欲之樂，不可常得，病著床時，擾動不 安，死命忽至，身當敗壞，安得久乎！慎勿等者，慎，恆謹也。人心有假，修於昭昭，肆於冥冥。惟慎為真心，故從心從真。勿者，禁止也。慎而復禁，斷斷誓不殺 害矣。惡緣，助成殺害事者。拜祭鬼神，拜者，俯伏致敬也。人之拜，詘一身為之。獨指其手者，手容主恭，禮之所以為美也。說苑雲：祭之為言索也。索也者，盡 也，乃孝子所以自盡於親也。然祭，生於報本之心。心[懺-仟+術]何以將之，因以食道饋焉，庶其或歆，一精誠之教也。今是拜祭鬼神魍魎，詳乳記。（普曜 經，迦葉雲：自念祠祀來，已歴八十年，奉風水火神，日月諸山川。夙夜不懈廢，心中無他念，至竟無所獲，值佛乃安寧。是也。）

△

【何以故？爾所殺害乃至拜祭，無纖毫之力利益亡人。但結罪緣，轉增深重。】

　　十方譬喻經雲：天上天下鬼神，知人壽命罪福，當至未至。不能活人，不能殺人，不能使人富貴貧賤。但欲使人作惡犯殺，因人衰耗，而往亂之，語其 禍福，令人設祠祀耳。故知空祭鬼神，無纖毫之力，利益亡人也。灌頂經亦雲：雜物之精，浮遊人村，既其無食，作諸變怪，扇動人心。或有魃魅邪師，以倚為福， 覓諸福祐，欲得長生。愚癡邪見，殺生祠祀。死入地獄、餓鬼、畜生，無有出時，可不慎之！故但結罪緣，轉增深重。故四自侵經雲：有事天地水火日月山川諸鬼神 者，永無所益。故在周旋生死之裏，不能脫出羅網牢獄。諸經廣明其事，惜世人不能信也。

△

【假使來世，或現在生，得獲聖分，生人天中。緣是臨終，被諸眷屬，造是惡因。亦令是命終人，殃纍對辯，晚生善處。】

　　文分二節：初應生善處，二惡牽不生。聖分即七菩提分、八聖道分、菩薩果分。即法華我等亦應有分，分字同。謂亡者平日自有善因，應得善果之分， 及生人天之中，祗緣臨終之時，被眷屬造殺業因，受殺者索命，必經歴冥司對辯，殃纍雖清，遲延生處。道世師雲：父母喪亡，廣殺生命。父亡於斯重苦，母終偏增 湯炭。是以宛轉三界，綿歴六道，四趣易歸，萬劫難啟。痛慈母之幽靈，湣逆子之酬毒。正斯謂矣，可不傷哉！

△

【何況臨命終人，在生未曾有少善根，各據本業，自受惡趣。何忍眷屬更為增業。】

　　此中況意謂上之有善業而應生善處者，尚被惡業拘牽，晚生善處。況其自無善根，應受惡趣者。今更加殺害，寧不重增惡業耶！譬如抱石沈淵，人更投 物壓之，求出應難矣。故優婆塞戒經雲：若父喪已，墮餓鬼中，子為追福，當知即得。若說殺生祠祀得福，是義不然。何以故？不見世人種伊蘭子，生栴檀樹；斷眾 生命，而得福德！若欲祀者，當用香華乳酪酥果，為亡追福（文）。故下何忍二字，謂忍心甚矣，增業多矣！

△

【譬如有人，從遠地來，絕糧三日，所負擔物，強過百斤（一本作「斤」）。忽遇鄰人，更附少物，以是之故，轉復睏重。】

　　有人，喻閻浮眾生。從遠地來等，譬自從無始生死曠大劫來，久乏三善根之資糧，腹空力怯可知矣。而所負五陰重擔，又強過於百斤。此謂於五陰法 中，不知本空，妄計人我，具造十惡。一一互具，如百斤重擔。此正合上臨命終人自無善根也。忽遇下，合各據本業等文。鄰人合眷屬，體心者是親友，不體心者如 鄰人。更附少物，合臨終更加殺害，轉復睏重，合更為增業也。

△

【世尊！我觀閻浮眾生，但能於諸佛教中，乃至善事，一毛一渧，一沙一塵，如是利益，悉皆自得。】

　　此言於佛法所修善事，即毛渧等，亦皆自得也。（大悲經雲：若有眾生於諸佛所，一發信心，如是善根，終不敗亡。如人析一毛為百分，取一分毛，沾 一滴水，持寄我所。言莫令此水而有增減。如來即受彼寄，置恆河中。如是水滴，不增不減，共大水聚，漸入大海。假使是人，住世一劫。我亦得住一劫。彼人至劫 盡時，而來我所，作如是言：我本寄水，今有無耶？如來爾時知彼水滴在大海中，見知住處不增不減，平等如故，持還彼人。阿難，如來有大神通，於受寄人中，最 尊最勝。若於佛所寄付如是微細水滴，經於久遠而不虧損。細毛喻心意識，恆河喻生死流。一滴水諭一發心微少善根，大海喻如來，所寄人喻清信等，住一劫喻如來 受彼寄水，終不虧損。如是阿難，若於佛所，一發信心，善根不失，何況諸余勝妙善根。我說是人，一切悉是趣涅槃果。）

△

【說是語時，會中有一長者，名曰大辯。是長者久證無生，化度十方，現長者身。合掌恭敬，問地藏菩薩言：大士！是南閻浮提眾生，命終之後，小大眷屬，為修功德，乃至設齋，造眾善因，是命終人，得大利益及解脫不？】

　　初、經家敘贊，二、長者正問。長者如前，梵語缽底婆，此雲辯才。辯，說也，展轉無滯，辯別分明，故曰辯才無礙。有四種：一義，二法，三詞，四 樂說。長者具此四德，故名大辯。辯言大者，一義中演無量義，一法中演無量法，一詞中演無量詞，盡未來際，樂說此三法門，故立此嘉稱。此出名，下贊德。久證 無生者，無，訓為不。所謂諸法不生，般若不生，不生不生，名大涅槃。如是涅槃，久已證得，地位高廣，等覺之流。因欲化度十方，故現長者之身。

　　正問中，是南閻浮提等，因前文廣明臨終死後，應宜修福，故躡而問之。功德，指懸幡等。設齋，即飯僧等。善因，佈施造像等。命終下，正疑問。命 者，帝降之衷，性之天根也，學者要自得之。氣稟於天，亦謂之命。清濁厚薄差，而智愚賢不肖攸分矣。天之氣數，亦謂之命。凡厥有生，壽夭貧富貴賤，皆前定 矣。此皆命之借義也。君有大令曰命，從令從口，會意。君尊如天，萬物天所命，萬事君所命，故雲命。故朱文公雲：命，猶令也。此儒宗精妙之義，然未知命之所 以然，乃乘前世業因緣，中有托胎之時，八識投入其中，一息隨母出入，命根立於此時。是則識托身存，命在其中，故曰色心連持不斷為命。若一息不還，色質敗 壞，則魂神去矣，謂之命終。是則生之也，非天命之而生；終之也，非天奪之而終。乃緣會而生，緣盡而終也。造者，造作，凡諸善事之作，必假身口七支，構造經 營，然必由心而起也。得利益解脫者，謂陽上修福，能使死者實得利益，而解脫生死耶？謂不得利益，而不脫生死耶？

△

【地藏答言：長者！我今為未來現在一切眾生，承佛威力，略說是事。】

　　如文。

△

【長者！未來現在諸眾生等，臨命終日，得聞一佛名，一菩薩名，一辟支佛名，不問有罪無罪，悉得解脫。】

　　既言臨終得聞，則平時不念可知；既言聞一名等，不及其余，又可知。然其不問有罪無罪，悉得解脫者，何功力之神妙若此耶？良由事急而心專也。如 人或就刑戮，或禁狴牢，或被怨賊所追，或為水火所逼，一心求脫斯苦，故於念處即成。其平時念者，或言行不稱，或信力輕微，無相續之心，有間斷之意，故平日 之功反緩，而臨終之念速成。如昔國王問那先沙門言：人在世間作惡，至百歲臨終時念佛，死後得生佛國，我不信是語。那先言：如持百枚大石置船上，因船故不 沒。人雖有本惡，一時念佛，不入泥犁中。其小石沒者，如人作惡，不知念佛，便入泥犁（文）。豈非事急心專，故功勝平時。如人入陣，不惜身命，名為健人。故 知善惡無定，因緣體空，跡有升沈，事分優劣。真金一兩，勝百兩之疊華；爝火微光，爇萬仞之聚草。即觀張鐘（一名善和，一名馗。）臨終之事，便信此經解脫之 言。

△

【若有男子女人，在生不修善因，多造眾罪，命終之後，眷屬小大為造福利，一切聖事，七分之中，而乃獲一。六分功德，生者自利。】

　　我佛為俗眾說法，必先戒論、施論、生天論，以施、戒乃生天之善因也。無奈一切眾生，不了世間所有，一歸空無。安隱之時，多事萬端，不為身計， 已招萬罪。殃禍響應，無常對至，縛著相隨，不離五陰六衰之獄。故曰不修善因，多造眾罪。命終下，為修福利者，懸幡、設蓋、然燈，皆是福業。回此福業，資生 天上福堂，人間福處。故雲福利。聖事者，聖訓為正。誦經、供像、念佛等，皆法門正事。能令出世，獲三乘聖果，故雲聖事。七分獲一，得之甚少也。然功不唐 捐，生者自得六分矣。故往生經雲：亡後作福，死者七分獲一，余者屬現在者。兩經相同也。

△

【以是之故。未來現在善男女等，聞健自修，分分己獲。】

　　此承上文，反顯自修全得利益也。聞健者，謂耳聰強健之時。健者，建也，能有所建為也。此勸人極早為之耳。蓋健乃乾德純陽之精，從人從建，乃法 天立誌。誌立，氣自隨之。易曰：天行健，君子以自強不息，是也。故隨願往生經，普廣菩薩白佛言：若善男女，未終之時，逆修生七，然燈懸幡，請僧轉經，得福 多不？佛言：其福無量。又言父母親族，命終受苦，為其修福，得福多不？佛言：七分獲一。緣前生不信道德故。若以亡者嚴身之具，屋宅園林，以施三寶，可拔地 獄之苦（文）。案夷堅誌，載鄂渚王媼作寄庫，令仆李大書押事，聞健自修，不可不為。今世有人作生七者，有預寄庫者，毋謂癡媼村嫗妄想事，而輕之忽之也。

△

【無常大鬼，不期而到，冥冥遊神，未知罪福。七七日內，如癡如聾，或在諸司，辯論業果。審定之後，據業受生。未測之間，仟萬愁苦，何況墮於諸惡趣等。】

　　梵語薩迦耶薩，此雲無常。大論雲：一切有為法，盡屬因緣，新新生滅，故曰無常。一、相續法壞無常，二、念念生滅無常。宗鏡明二種四相：一、約 粗果報說，即生老病死。二、約細惑業說，即生住異滅。與大論二無常同。大鬼者，按孝經援神契雲：泰山天帝孫主召人魂。（東嶽府有太保，追攝生魂鄂元帥。追 攝死魂孟元帥。酆都九曲追魂斬鬼韋元帥。故青靈經雲：人物之死俱有鬼，如冥報記，載唐校尉馮翎、李山龍，武德中暴亡，心上不冷，家人未斂。七日而蘇，自說 被冥收錄，升王階。王命升座誦法華經。山龍開經題，同罪仟人，承福獲免。王命吏放還。有三人謂山龍曰：王放君，可不多少遺我等？吏曰：是前收錄君使。一是 繩主，以赤繩縛君者。一是棒主，以棒擊君頭者。一是袋主，以袋吸君氣者。見君得還，故乞物耳。雲雲。）故華嚴經雲：人欲終時，見中陰相。若行惡業者，見閻 羅持諸兵杖，囚執將去。故雲無常大鬼。

　　正法念雲：有於胎中死，有生時命終，有才行便亡，有能走忽卒，故雲不期而到。內德論雲：百齡易盡，五福難常。命川流而電逝，業地久而天長。是此之謂也。

　　神者，大論雲：凡夫人憶想分別，隨我心取相，故計有神，即中陰身也。如天人陸玄暢雲：人稟七識，識各有神，心識為主，在黑闇中，遊行虛空。所謂三塗極迍而杳杳，四流無際而茫茫。故雲冥冥遊神。

　　罪福，即十惡十善。魂神既未知自己罪福何如，故於七七日內，如癡狂無知，如耳聾無聞。正初死時也。或在下，明死後考較。諸司准道藏，有攝魄追 魂，捉生落死，賞善罰惡，察過糾非，嶽府顯應太保攝魂朱將軍，更有勾押推勘判官，管追罪人照證案主者。准凈度三昧經，閻羅王下，有五官：一鮮官禁殺，二水 官禁盜，三鐵官禁淫，四土官禁兩舌，五天官禁酒。此皆冥府諸司也。辯論業果善惡，各有三品，造時心境不同，各隨所作，得其果報。天無枉濫，平直無二，隨其 所作，天網治之，故須辯論也。

　　若審定之後，據業受生者，如論雲：一切不善，皆是地獄因。此不善之余，生畜生餓鬼中等。按冥祥記，趙泰死，府君令泰作水官都督，知諸獄事。見 一城，方二百余裏，名為受變形城。地獄考治已畢者，當於此城更受變報。泰入其城，見數百局吏，對校文書。雲殺生者，當作蜉蝣，朝生暮死。劫盜者，當作豬 羊，受人屠割。淫泆者，作鶴鶩獐麋。兩舌者，作[至+鳥]梟鵂鹠。捍債者，為驢騾牛馬。故雲據業受生。准正法念經及俱捨論，直是罪人惡業熏心，令心變異， 無中妄見，實無閻羅在中，判諸罪人也。但既以業熏，妄見其境，罪人謂實非虛。故於初死之後，未審之前，未測自己罪福多少，仟思萬慮，愁憂多苦，已不可言。 況墮諸惡趣，此苦尤甚也矣。

△

【是命終人，未得受生。在七七日內，念念之間，望諸骨肉眷屬，與造福力救拔。】

　　統紀明七七齋。瑜伽論謂人死，中有身若未得生緣，極七日住，死而復生；如是展轉生死至七七日，決定得生。若有生緣即不定。今尋經旨，極善惡， 無中有。（中有亦名中陰。極善即生凈土，其次生人天，極惡即入地獄，即日死亡，不經中陰。）又引釋氏要覽雲：今人亡，每七日必營齋追福，謂齋七者，令中有 種子，不轉生惡趣也。今世人於七七日作功德者，正所以慰亡人之望救耳。

△

【過是日後，隨業受報。若是罪人，動經仟百歲中無解脫日。若是五無間罪，墮大地獄，仟劫萬劫，永受眾苦。】

　　隨業受報，因果不亡也。法苑雲：有形則影現，有聲則響應，不見形存而影亡，聲續而響乖。善惡相報，理路然矣。幸願深信不猜來肖。准經，有現 報、生報、後報不同。長阿含六，佛言：夫不善行，有不善報，為黑冥行，則有黑冥報；夫行善法，必有善報；行清白行，必有白報。是罪人等，則受黑冥報矣。此 乃中下之品。或墮邊小之獄，及餓鬼、畜生，展轉三塗。故動經仟百歲，解脫無日。五無間罪，乃十惡上品，故永無出期。四始經雲：身行不善，口行不善，意行不 善，身壞命終，極受苦報。是也。

△

【復次，長者，如是罪業眾生命終之後，眷屬骨肉為修營齋，資助業道，未齋食竟，及營齋之次，米泔菜葉，不棄於地，乃至諸食未獻佛僧，勿得先食。】

　　初勸營齋，此明奉齋三寶，非指過午為齋。米泔菜葉不棄地者，當盛於器中。齋後施與畜生。准佛說護凈經：必須清凈手濤米洗菜，亦不得以不凈手觸 凈食。未獻等，示齋法。大論引經，佛金剛身，不恃仰食。為度眾生，現有所啖，其實不食。為佛設食，佛未食者，人不能消。故未獻佛僧，勿得先食。護凈雲：一 切賢者施設福會，於先嘗啜，此食多作殘食，唐作此會，不如不作，何故？諸天不歡，鬼神不喜。此人於先嘗者，五百世中，受餓鬼苦。故誡斷勿先食也。

△

【如有違食及不精勤，是命終人了不得力。如精勤護凈奉獻佛僧，是命終人七分獲一。】

　　初明不如法，次明能如法。精勤護凈等經雲：諸有設食之處，一切如法作齋飯，不可不慎。自今已後，欲得福者，如法作齋食，可得福德，諸天歡喜，百神慶悅，天神擁護。經不虛言，福報如影響。經文明示如此，惜世人不知信也。

△

【是故長者！閻浮眾生，若能為其父母乃至眷屬，命終之後，設齋供養，誌心勤懇，如是之人，存亡獲利。】

　　誌心勤懇，即精勤護凈之意。唯精，能誌心。精者，功夫造極也。從米從青者，初脫粟而黃，猶粗也；米，舂近心，色微若青，此生意所函，天真之至粹者也。如是殷勤懇切，自得存亡獲利。大辯助顯竟。

△

【說是語時，忉利天宮有仟萬億那由他閻浮鬼神，悉發無量菩提之心。】

　　何故鬼神至此發心？上明祭祀鬼神無益，徒自令人造業。鬼亦有良，寧不愧恥，故發心為護法鬼神耳。問：鬼神自發心？佛與地藏教之發心？答：自它共離皆不可，但是感應道交而論發心耳。

△

【大辯長者作禮而退。】

　　既同在會，退至何處？以問法時，出位前禮，酬唱既竟，禮退歸位。即錶各各自住三摩地耳。

△

【閻羅王眾贊嘆品第八】

△

【爾時，鐵圍山內有無量鬼王，與閻羅天子，俱詣忉利，來到佛所。】

　　閻羅宮城住處已備前文。閻羅，鬼官之總司，無量鬼王俱為所統。王來，臣必隨之。主到，伴必衛之故。俱詣忉利，同到佛所，此承世尊之光音，地藏之威神也。（准智度論，一切山河樹木土地城郭，一切鬼神，皆屬四天王管，故皆隨從共來。）

△

【所謂惡毒鬼王、多惡鬼王、大諍鬼王、白虎鬼王、血虎鬼王、赤虎鬼王、散殃鬼王、飛身鬼王、電光鬼王、狼牙鬼王、仟眼鬼王、啖獸鬼王、負石鬼王、 主耗鬼王、主禍鬼王、主食鬼王、主財鬼王、主畜鬼王、主禽鬼王、主獸鬼王、主魅鬼王、主產鬼王、主命鬼王、主疾鬼王、主險鬼王、三目鬼王、四目鬼王、五目 鬼王、祁利失王、大祁利失王、祁利叉王、大祁利叉王、阿那咤王、大阿那咤王。】

　　惡毒乃鬼王之首，故前列之。惡毒即十惡三毒。既惡且毒，立斯穢稱。三毒屬意，為身口七惡之本。本末兼明，故名惡毒。然此等鬼王，皆是不思議菩 薩，大權應化。以惡攻惡，以毒出毒，意令人人了修惡即性惡，會事毒即理毒，故用惡毒，以為化門。即大經毒鼓之喻，亦外書亭毒之意。列子雲：生之育之，亭之 毒之。（亭謂品其形。毒謂成其質。）後人第知毒之為大不善，詎知其為篤義，（毒轉聲為篤）乃大善也。

　　多惡者，一念尚具諸惡，增廣多有無量。外現忿怒之惡相，內起慈悲之善心。

　　大諍，諍即鬥諍。長阿含，佛告帝釋，怨結之生，皆由貪嫉，故使眾生等刀杖相加。帝釋白言：實爾，貪嫉之生，何由而起？佛言：貪嫉之生，皆由愛 憎。故祖師雲：但離憎愛，洞然明白。然世人不了五蘊本空，故爭咽喉下不急之氣。莊子所謂，婦姑勃溪，此由心為毒主，口為禍器。未有諍訟違形，而存大化者。 故鬼王以大諍法門化人無諍也。

　　白虎、血虎、赤虎。虎乃山獸，亦名大蟲，猛而有威，慢而多暴。白虎，西方之獸。血虎，口似血盆。赤虎，毛如火赤。鬼頭如虎，故各以虎名。

　　散殃，殃，咎也、禍也。東嶽經雲：世間眾生不信因緣善惡果報，不敬天地，不孝父母，不尊師長，欺負神理，背前面後，口是心非，已被嶽府曹官聖 眾，晨夕考較，紀錄罪咎。致令災禍橫生，官司牢獄，纍歲經年，不能安泰。家門啾唧，每遇兇衰；盜賊侵欺，希見太平（文）。故致鬼王臨其家門，有殃者，禍者 之事矣。

　　飛身，飛行夜叉之類也。

　　電光，眼光如電閃爍，令見者怕怖。

　　狼牙，狼大如狗，青色，善逐獸。古之造式者，木用槐癭棗瘤，而以狼牙為柱。取其靈智，故字從良。此鬼牙尖外嚮，如狼之牙。按白澤圖，丘墓之精，名狼鬼。善與人鬥，為桃矢[至+鳥]羽射之，化為飄風；脫履捉之，不能化也。

　　仟眼，觀音仟眼在手，獄卒六十四眼在角，此鬼仟眼，不知如何安立。

　　啖獸，此鬼以獸為食者，然鬼亦獸耳。婆沙明鬼趣形狀，多分如人，亦有面似豬，或似余惡禽獸。

　　負石，即負石擔沙，填河海之類。

　　主耗、主禍，二事相因，故太上雲：天地有司過之神，依人所犯輕重，以奪人算。算減則貧耗，多逢憂患，人皆惡之，刑禍隨之，吉慶避之，惡星災 之，是也。（昔櫟陽尉郭鄩，官不得調，奇蹇屯厄，動與物忤。至親密友，亦漸疏斥。常有二物，狀如猿猴，跳躑其旁，出入相隨。一夕愁寐，忽來告別，雲：吾乃 主世虛耗者，君以隱慝獲罪，神命隨主君厄，今數滿當去，可安享矣。）

　　主食，食乃民生之祿，善者享之，惡者減之。故散棄五谷者，太上惡之，收其華息，世多饑饉。及暴殄天物者，每凍餒而死也。

　　主財，嶽府有主財案主者，浮陀摩尼缽，主護人財物。故有財不施，鬼啖其傍而妒之。然太上尤禁橫取人財者，故其妻子家口，漸至死喪。若不死喪，則有水火盜賊、遺亡器物、疾病口舌諸事，以當妄取之直，財各有所主也。

　　主畜，畜有四生，住有三處。嶽府有管胎卵濕化及水族案者。

　　主禽，主獸皆嶽府之神，飛曰禽，羽族之總名。言為人禽制，故名禽。走曰獸，毛蟲之總名。言力多難擒，圍守可獲，故名獸。此諸禽獸，各有鬼王主 之，若止觀引大集十二時獸者。輔行雲：五行中，名十二肖。肖，似也。此十二神似彼故也。准大集，東海琉璃山，有虎、兔、龍。南海玻璃山，有蛇、馬、羊。西 海白銀山，有猴、雞、犬。北海黃金山，有豬、鼠、牛。（所住之窟，經各有名。）一一方各有二羅剎女，供養三神。其窟，皆菩薩住處。一一獸，皆修聲聞慈，曾 於過去佛所發願，一獸每一日夜遍閻浮提，余安住修慈。從七月一日，鼠為首；二日牛。乃至十三日，還從鼠起。此即獸王菩薩，故他方恭敬也。

　　主魅，魅謂魑魅，老精物也。詳香乳記。

　　主產，東嶽懺雲：結秀成胎，稟兩儀之造化；送生保產，乃二聖之綱維。普濟普度，九天監生，明素真君，多男多女，九天衛房，聖母元君。又鬼子母姊，名灸匿，亦主人產生。

　　主命，准經，毗沙門主護四天下人命。嶽府有管天下生死案判官。更有保生真人碧霞元君。

　　主疾，如前。

　　主險，高山峻嶺，大海溟淵，險難之處，身命所繫，應死者錄之，不應死者護之。此猶險之小處。准大論，地獄有二部，一寒冰，二炎火。皆以身觸受罪，此名大黑暗處，危難險道，即鬼所主之處耳。

　　三目，二目中間豎亞一目，如摩醯狀。四目，額上又橫開二目，與蒼頡同。五目，於上下中，豎生一目也。

　　祁利失王等，未見翻譯。金光明有薩多琦黎，翻大力天。名義集載惡祁尼，此翻火神。然考立世阿毗曇，的是山名。論夜叉品雲：時閻浮提中，有兩眾 山。恆河之南，名婆多耆利山；恆河之北，名醯摩跋多山。一切神住河南者，皆名婆多耆利；在河北山者，皆名醯摩跋多。婆多耆利領河南一切諸神，醯摩跋多領河 北一切諸神，故名為王（文）。今閻王界既在閻浮之南，而祁利山又在恆河之南，南屬離火，故祁尼祁利，而翻大力火神。均屬火天也。失字未詳。叉具雲：叉耶， 秦言盡。即大力盡王。統領小王鬼神也。阿那咤，准大經，八臂那咤，乃天中力士，則未可的指，然其名既同，未可知也。（那咤即多聞天王之長子。）

△

【如是等大鬼王，各各與百仟諸小鬼王，盡居閻浮提，各有所執，各有所主。是諸鬼王與閻羅天子，承佛威神及地藏菩薩摩訶薩力，俱詣忉利，在一面立。】

　　已上三十四位，皆是大鬼王。每一王下，各有眷屬小王，數有百仟。此非他方之鬼，盡住南洲也。各有執者，執，守法也。取彼有罪，明正典刑，指其 事也。天文有執法，代天討罪，豈得而容私乎。蓋言守法之執事也。太上亦雲：天地有司過之神，依人所犯輕重，以奪人算。是也。言主者，古之制字。這、即主心 之神明，實主我身。居其所不動，而應萬物，象天君奠位之形。、神也，不得形則不顯，故配他字乃成形，故從、，而配王。王，君也。天地萬物，鹹統於一。王心 無、，身且不能治，何以治天下乎！今諸鬼王，內各有、，故能主萬物也。如取人枷鬼，提點鬼神，追魂斬魄，捉生落死，及各案主者，諸司法錄事等，故言各有所 執、所主也。是諸下，明來意。幽冥鬼王何能上隮忉利？此承我佛與地藏威神之力也。一面立者，住足名立，人縱而生，立則戴天履地，儼然正直之容。故從大，在 地上為意。敬佛尊君，故立而不坐也。

△

【爾時，閻羅天子胡跪合掌。】

　　按道明和尚所傳十殿冥王，閻羅天子在五殿。統紀雲：十王名字，藏典傳記可考者六。閻羅，五官：（二名。見三長齋引提謂經。）平等，（華嚴感應 傳，郭神亮為使者，追至平等王所。因誦若人欲了知偈，得放回。）泰山，（譯經圖紀法炬譯金貢泰山贖罪經。）初江，（夷堅誌，郭生夢入冥府，王揖坐，謂曰： 我是西門王郎，冥司錄我忠孝正直，不害物，得作初江王一紀。）秦廣，（夷堅誌，南劍陳生既死，其弟之女見二鬼導至宮殿，曰秦廣王也。王謂女曰：欲救伯可轉 入師經。女寤，家人來得經，請僧誦仟遍。兄夢弟來謝曰：已獲生天也。）今唯閻羅一王興問者，大約第五殿乃正中之位，統攝諸王，故特加天子之名。以帝釋天為 父王，命閻羅為天子，主攝冥司，所謂地下縛啰呬天是也。

△

【白佛言：世尊！我等今者與諸鬼王，承佛威神及地藏菩薩摩訶薩力，方得詣此忉利大會，亦是我等獲善利故。我今有小疑事，敢問世尊，唯願世尊慈悲宣說。】

　　初敘來意。等者，非等余九殿獄王也。准長阿含：小仟世界，有一仟閻羅王。況三仟大仟。又況十方沙界之三仟大仟閻羅乎！然佛出此南洲，此界冥王 為正，亦是等，慶幸之語。由閻羅鬼王等，併以業緣感報，三時受苦。如弟子死復生經，吏白王言：大王為奉佛凈戒耶？王曰：坐我不奉佛故，追罪來作此獄王。今 到天宮，見佛聞法，自然獲得增上善利，故下此慶語。我今下，咨請。雖雲小疑，障信則大，故須問明。唯願以大慈悲，為我宣說此旨。作與樂拔苦之因緣也。

△

【佛告閻羅天子：恣汝所問，吾為汝說。】

　　恣，縱也。謂凡有所疑，不必隱匿，縱意問來，吾無不為汝說者。如洪鐘在架，隨扣隨鳴。錶佛心慈悲無齊限也。

△

【是時，閻羅天子瞻禮世尊，及回視地藏菩薩。】

　　瞻禮，敬佛求法之儀。回視，事有所專也。何以回視之？問法之儀，必對佛而禮，身在中央，則菩薩在傍，故回首視之。

△

【而白佛言：世尊！我觀地藏菩薩，在六道中，百仟方便而度罪苦眾生，不辭疲倦。是大菩薩，有如是不可思議神通之事。】

　　在六道等，佔察經雲：依本願自在力故，權巧現化，影應十方，而於五濁惡世，化益偏厚，巧演說法，能善開導，此皆方便力也。大要現梵天，令除憍 慢；化人道，令修施戒；地獄代其受苦；餓鬼令其飽滿；修羅調伏惡心；畜生使得智慧，併令俱出苦輪，同到智地。無量劫來，不辭疲倦，此智慧勇猛不思議之神通 也。言蟬者，人所作也。其上從ㄓ，其下從又（古右字），持中，何也？曰：天下萬事，皆本於心中者，非他也，人心天然之矩。事來，執吾中而往，貫萬若一，無 過不及，是謂天則。今地藏以百仟方便，現種種神通，皆本中道一心，而應萬機之事，度苦眾生，併歸中道。其為大事因緣可思議乎哉！

△

【然諸眾生，脫獲罪報，未久之間，又墮惡道。】

　　未久雲者，如等活地獄，對四天王壽。人間五十年，為上天一日夜；縱經百年，冥司祗得二日，豈非才出即來，深惡其不憚煩也。

△

【世尊！是地藏菩薩，既有如是不可思議神力，雲何眾生而不依止善道，永取解脫？】

　　此中問意兩關發疑。一謂菩薩既有如是神力，自應令彼依善道而永取解脫矣。二謂六道既受大士之化，亦應久依善道而永取解脫矣。今不然者，為地藏神力不逮歟？為眾生心力不及歟？梵語膩地，此雲依。維摩經雲：十善是菩薩凈土，眾生能依十善，自然解脫生死。

△

【唯願世尊，為我解說。】

△

【佛告閻羅天子：南閻浮提眾生，其性剛強，難調難伏。】

　　其性者，習性也，故曰剛強。若是法性，從本柔和。剛者，堅強也。此非中正純粹之幹砘（音剛），乃動於血氣之剛暴。譬之惡象駑馬，難於調伏也。

△

【是大菩薩，於百仟劫，頭頭救拔如是眾生，早令解脫。是罪報人，乃至墮大惡趣，菩薩以方便力，拔出根本業緣，而遣悟宿世之事。】

　　眾生性雖剛強，難於調伏，在地藏不捨大慈，而頭頭救援。頭頭，猶言處處。謂仟頭萬頭也。如是眾生句，正點難調伏者。剛者教之以柔，強者教之以 和，難調伏者必令調伏。如王良、造父，善能調伏馬性，必令中軌而後已。今於三寶施戒，必令修持，清凈戒生，得凈解脫。故罪報之輕小者，即與救拔。縱犯上 罪，應墮阿鼻大惡趣者，亦以巧方便力，使拔根本業緣。

　　梵名阿浮訶那，此雲拔除罪根。須知諸惡，隨業受報，而以三毒為本。三毒之中，貪愛為根。如捉佈一頭，余則盡隨。智論雲：若不斷愛，愛則潤生。 是故四生，皆由愛起故。故成論雲：如樹根不拔，其樹猶生。貪根不拔，苦樹常在。故知生死，貪愛為本，若滅貪欲，名第三諦。十輪經雲：滅除一切惑障習氣，猶 如烈日銷釋輕冰。故無常偈雲：明眼無過慧，黑暗不過癡。今根本業緣既拔，自悟宿世之事。譬古鏡之重揩，其常光而自現矣。

△

【自是閻浮眾生，結惡習重，旋出旋入。勞斯菩薩，久經劫數，而作度脫。】

　　自者，謂如此方便救拔，自應頭頭解脫已。今不能者，乃眾生自造惡業，以自縛之。非菩薩之咎。結惡習重，緊要之語。生死根元略言三結，（身見、 戒取、疑。）廣說八十八使（雲雲）。由此結惡，造十習因，（淫習、貪、慢、嗔、詐、誑、怨、見、枉、訟習）受六交報。是以才出三塗，而旋入劇處。致勞地 藏，久經塵劫，起無量方便，作度脫因緣。豈非眾生惡習牽連，致纍化門，久不能扃耶！

△

【譬如有人，迷失本家，偽（一本作「誤」）入險道。其險道中，多諸夜叉，及虎狼師子蚖蛇蝮蠍。如是迷人，在險道中，須臾之間，即遭諸毒。】

　　文分三節：初、迷本入險。有人，譬惡道眾生。因果不忘名有。人者，忍也。能忍五濁之苦也。常寂光土為本家。十惡眾生，原是如來之子；三塗苦 處，無非常寂之家。以不知真如法一，不覺無明風動，漂流異國，墮落他鄉。既忘本處，便迷歸路，遊行逐境，險道斯臻。文句釋法華險難惡道，通譬九界生死因 果。故曰分段變易，即果險難。見思五住，即因險難。由此因緣，故言惡道。今據下文生人天中，令受妙樂，祗以三塗為險道。由不依施戒生天之論，致偽墮三惡道 中。

　　二、險道多惡，以多諸夜叉等。夜叉，有智有通，飛行捷疾。譬利使邪見，謗無因果，智辯速疾也。正心地觀雲：心如夜叉，能啖種種功德法。故虎狼 等，畜類愚頑，以譬鈍使。准俱捨論：憍慢盛故，生於師子虎狼中；嗔恚盛故，生於蚖蛇蝮蠍中。則虎狼師子，應俱譬慢使。今約三毒為身口之本，故以虎喻慢使。 如分別善惡經，憍傲常慢人，後生為猛虎故也。狼譬貪使。以狼求食不滿不止，故曰貪狼。師子錶癡使，由昔持戒雖嚴，而無凈慧。執戒慢人，故墮畜類。因戒力 故，得為獸王。無慧即癡，故以譬之。蚖蛇蝮蠍譬嗔使，蚖名守宮，在壁曰蝘蜓，在洲曰蜥蜴。以毒盛故，不觸而螫，譬非理嗔。楊子雲：蚖其肆矣。蝮，蜪蠡（上 音陶，下音延）也。螫手則斬手，螫足則斬足，為害於身也。蠍虎，螫人毒蟲。然觸則螫，譬執理嗔。不以蜈蚣譬戲論嗔者，以三塗無戲論也。

　　三、在險遭毒。如是迷人，謂迷真重故，不識四諦，以致流落十使險道之中。須臾遭毒者，以一念有九十剎那，一剎那中九百生滅。念念減損，無有增 長。猶山瀑水，不得停住；亦如朝露，勢不久停。故曰遭毒只在須臾。諸毒者，准涅槃：蛇，有四毒：見毒、觸毒、嚙毒、螫毒。虎狼師子熊羆貓貍鷹鷂之屬，諸毒 備具。非險道而何哉！

△

【有一知識，多解大術，善禁是毒，乃及夜叉諸惡毒等。忽逢迷人，欲進險道。而語之言：咄哉！男子！為何事故，而入此路？有何異術，能制諸毒？】

　　知識指地藏。所謂唯我一人能為救護，故雲一。思益經雲：於墮邪道眾生，生大悲心，令入正道，不求恩報，故名導師，即知識也。以多解大術，善禁 是毒，故名知識。以妙方便，隨機開導，廣說施戒生天之論，普示諦緣道品之門。智慧弘深名多解，方便巧妙曰大術。善禁毒者，說道品對治集諦之毒，如多貪不凈 觀等。（善信經，有神藥樹，名摩羅陀只王厭天下萬毒。有神蛇，身長一百二十尺。蛇行索食。有黑頭蟲，身長丈五，與蛇相逢。適舉頭嚙蟲，聞藥香，屈頭欲走， 身羅藥樹，斷作兩段。頭半生得走，尾便臭爛。諸毒聞此蛇臭，眾惡毒氣皆消滅。）忽逢下，明大士指出三塗。莫知遇而遇之，曰忽逢。將入而未入，曰欲進。正與 偽入照應。語之者，示其道也。蓋昔已化令出苦，無奈誌性不定，復造惡業，重入三塗，故憂驚而告語之。咄哉，喚醒之辭。男子，警惕之意。男子名丈夫。大經 雲：能見佛性，名為丈夫。今既迷佛性，故以男子警知本有。十輪雲：如迷方者，所逢示導，是也。何事者，驚問也。此路，指三塗。佛言眾生以三惡道為家，故指 為此。以此路，二種人到。所謂威神、業力，非此二事，終不能到。故驚問雲：為是神通救苦而入？為是造業感報而來耶？有何異術等，審難之辭。謂汝有何等奇異 法術，力能制禦諸毒耶？異術，錶異方便。對治諸惡法門，助顯第一義諦。

△

【是迷路人，忽聞是語，方知惡（一本作「險」）道，即便退步，求出此路。】

　　忽聞者，聞四諦也。以昔未聞，今忽聞之耳。例同須達初聞佛字，身毛皆豎，忽見光明也。知惡道者，畏苦集也。輔行雲：念念恆簡是非，設起非心， 應以當教是心滅之。非心，即是險道。寶雨經雲：謂諸有情安住世間，具足顛倒，墜險惡路，隨於非處，我今令彼諸有情等入真實路。由是如來，為諸有情，起於大 悲，是也。便退步，止十惡修十善也。求出路，離三塗求人天也。

△

【是善知識提攜接手，引出險道，免諸惡毒，至於好道，令得安樂。】

　　准涅槃經：具足梵行，自修種種善法，令諸學人，漸遠惡法，增長善法，名善知識提攜接手。如前復相扶助，提之攜之，接手挽之，引出險道。離三塗 之苦事，免諸惡毒，斷習惡之結使，生人天之好道，得涅槃之安樂也。十輪雲：譬如明月，於夜分中，能示一切失道眾生平坦正路。隨其欲往，皆令得至。此善男子 亦復如是。於無明夜，能示一切迷三乘道、馳騁生死曠野眾生，三乘正路，隨其所應，方便安立，令得出離（文）。據此亦應約九界因果明險道。過五百由旬，到涅 槃寶所，方為安隱。今祗約三塗人天敵論者，化五濁迷流之要著也。先以小接，次令入大，方便巧逗，妙化隨機，毋謂是經祗生人天也。點逗於此，前後例之。

△

【而語之言：咄哉！迷人，自今已後，勿履是道。此路入者，卒難得出，復損性命。是迷路人亦生感重。】

　　語言者，勸修善道。咄哉者，重警令寤。以廢盡方便之力，才令得免惡道。故重警醒，汝當深念此苦，更不可重造惡業，載入三塗也。所以勸告者，嗟 惡慧之邪修，自甘心於險道。遇斯境界，豈可緘言。念彼愚癡，寧容坐視。況世尊悲心付囑，留大願而普濟迷津。菩薩如教奉行，示同事而化令成佛。如其見迷路而 不指正途，慈悲安在？睹沈溺而不思拯接，方便何存？故語之言：此生死路，一入難出。復損害法身慧命，真險處也。迷人亦感重者。曩因不知，偽入生死險處。今 忽提醒，重登安樂之鄉，如飄流者忽爾還家，沈淵者俄然登岸，豈不深感而極重哉！大論雲：應先以眼見道而後行，行時當精勤。精勤行時，常念如導師所教。念 已，一心進路，不順非道，正此謂也。

△

【臨別之時，知識又言：若見親知及諸路人，若男若女，言於此路多諸毒惡，喪失性命，無令是眾自取其死。】

　　臨別時，將他化也。令轉勸者，冀展轉傳化，化化不絕也。親知，稟內道未解脫者；路人，未受道在生死者。男女，錶授定慧。言此路者，復以苦集， 轉教前人以路多惡毒，必失性命，故須知苦斷集，慕滅修道，毋自喪失法身慧命也。已上正教轉告。下示轉告意。言是眾，則何異同胞。言取死，則實切吾念。重自 取死句。如五苦章句經雲：昔閻羅王有弘普之慈。諸墮地獄者，現身問之。汝等何為是間？罪人對曰：我等死時，不知行諸惡。自然追逐，送我來到是間。王曰：自 汝所作，今當受之。吾不枉汝（文）。豈非自取死耶！譬如抱石投淵，自沈自墜；飛蛾赴火，自燋自爛。非天與人授也。

△

【是故地藏菩薩具大慈悲，救拔罪苦眾生，生人天中，令受妙樂。是諸罪眾，知業道苦，脫得出離，永不載（一本作「再」）歴。】

　　此承險道之喻，以法合明也。具大慈悲，以同體故言具。與樂即拔苦，拔苦即與樂，故言大。從理具體上起事，造神通而救拔也。生人天等，正顯慈悲 實用。人天，乃受道之器。故須先生人天，受諸快樂，正合前是善知識提攜接手，乃至令得安樂之文。是諸下，明罪眾知悔。諸罪眾，乃所化之機；知業苦，是親歴 之事。故願脫獲出離，永不載歴乎此。起世經，閻羅王受洋銅灌口苦後，自發願言：願我從今捨身已，更得身時，但於人間受生，如來法中信解，剃除須發，著袈裟 衣，既出家已，願得道證，不復於後世受生（文）。閻王尚爾，況其它乎！故觀佛三昧經，諸菩薩訶責餓鬼言：汝於前身無量世時，作無限罪，謗誹不信。墮阿鼻 獄，受諸苦惱不可具說，汝今應當發慈悲心。諸餓鬼聞已，稱南無佛，尋即命終，生四天處。悔過自責，發菩提心。諸佛心光，不捨是等，攝受是輩，如羅睺羅。教 避地獄，如愛眼耳。今地藏亦然。故罪苦眾生，發此悔心也。正合咄哉迷人，乃至自取其死之文。

△

【如迷路人偽（一本作「誤」）入險道。】

　　合上譬如有人乃至即遭諸毒之文。

△

【遇善知識，引接令出，永不復入。】

　　合上有一知識乃至亦生感重之文。

△

【逢見他人，復勸莫入。自言因是迷故，得解脫竟，更不復入。】

　　合上臨別之時，乃至無令是眾自取其死之文。合方便救拔竟。

△

【若載（一本作「再」）履踐，猶尚迷偽（一本作「誤」），不覺舊曾所落險道。或致失命，如墮惡趣。】

　　直合上難調難伏，結惡習重，旋出旋入之文。謂既出三塗，已生人天，自應精勤修習，無奈習惡未除，重造惡業，更入三塗，猶尚迷本，偽入險道，竟 不覺舊日曾所漏落之險難惡道。或有落險不失命者，以夙微善，出險亦速。或有入險，致失命者。如墮惡趣相似，不惟不拔根本業緣，併迷宿世之事矣。

△

【地藏菩薩方便力故，使令解脫，生人天中，旋又載（一本作「再」）入，若業結重，永處地獄，無解脫時。】

　　地藏等三句，遠合前菩薩以方便力，乃至遣悟宿世之事。近合地藏菩薩具大慈悲，乃至令受妙樂之文。旋又載入句，合前自是眾生結惡習重，乃至而作 度脫之文。故央掘雲：我亦不為負債之人，如申頭羅，速往速反，與今文雅合。（申頭羅者，外國幻人作飛人戲，令空中來去，往反至速。）業結重者，造上品十惡 一類，既結此業，寧望解脫乎！蓋於無我法中，執有造業，既迷真諦，自違寂理。故雲：縛從自縛，解從自解。若於法法求空，自然門門解脫。閻羅正嘆竟。

△

【爾時惡毒鬼王合掌恭敬白佛言：世尊！我等諸鬼王，其數無量，在閻浮提。或利益人，或損害人，各各不同。然是業報，使我眷屬遊行世界，多惡少善。】

　　惡毒為眾鬼王首。故率先陳白。先敘鬼數、住處。數無量者，絓是九州房廟，萬國之靈，水府山精，風師雨伯，三仟眷屬，五百徒黨，其為數也，無能 量之。若論住處，有正邊不同。正處，在閻浮提五百由旬之下，閻羅所統。邊處不定。有威德者，住山谷空中海邊，皆有宮殿。無威德者，依不凈糞穢草木冢墓屏廁 故嫻，皆無捨宅，併在閻浮提中。

　　或利益下，明鬼行業。准長阿含，佛告比丘：一切男女生時，皆鬼神隨逐守護。今人何故有為鬼神所觸嬈者，有不為鬼神所觸嬈者？以世人為非法、行 邪見、作十惡業，如是百仟人，乃有一神護耳。若修善法、見正信、修十善業，如是一人有百仟神護。故有為鬼神觸嬈有不為觸嬈。故善者利人處多，惡者損人處 多。夫論鬼神之法，特喜妖邪冥密之中。或處幽巖，乍依高隴。絕澗深叢之裏，荒郊野艿之中。異種音聲，特奇形勢，搖動凡識，恐怖愚情。假使威光，虛偽怪相， 擅作威福，妄行損增，萬別仟差，所作不等。

　　然是下，明鬼感報，准正法念經，明其因行，乃由貪嫉、邪佞、諂曲、欺誑、積財不施（文）。乘是業因，報生鬼道。惡心熏種，殊難悛革。故我之眷 屬，遊行世間，多惡少善。外書雲：鬼神者，其禍福發揚之驗乎世者也。（宜律師問天人陸玄暢雲：涪州相思寺古跡。曰：此迦葉佛時，山神羅子明，是佛弟子，生 憎破戒者。發願作惡鬼，啖破戒人。因願受身，作此山神。所主土地七仟余裏，年啖萬人以上。迦葉教化調伏，受五戒，因不啖人，恐後心變，故佛留跡。又南海循 州北山，興寧縣界靈龕寺，多有靈跡。此文殊弟子，為此山神，多造惡業。文殊湣化，遂識宿命，請留跡禮事，得離諸惡。文殊為現。今者是，於貞觀三年，山神命 終，生兜率天。別有一鬼來居，即舊神親家，大造諸惡。舊神憐之，請文殊為現小跡。後神又從正法，故大小跡現。）

△

【過人家庭，或城邑聚落、莊園房捨。或有男子女人，修毛發善事，乃至懸一幡一蓋，少香少華，供養佛像及菩薩像。或轉讀尊經，燒香供養，一句一偈。】

　　初明鬼神遊處。竊原世人，造善於幽，得報於顯，世謂陰德，人鹹信矣。造惡於顯，得報於幽，斯理灼然，寧不信耶？故聖人陳福以勸善，示禍以戒 惡。夫殃福蓋有其根，不可無因而妄致；善惡當收其報，必非無應而徒已。蓋准長阿含二十，佛告比丘：一切人民所居捨宅，皆有鬼神，無有空者（雲雲）。況有行 空諸天，遊世眾鬼。冥祥記，載普趙泰（字文和，清河貝丘人。）心痛而死。二人引至太山，南入黑門。有絳衣人坐大屋下，以次呼名。問生時所作罪福，汝等實 言。此恆遣六部使者，常在人間，疏記善惡，具有條狀，不可得虛。故太上雲：天地有司過之神，又有三臺北鬥神君、三屍神、竈神，凡人有過，大則奪紀，小則奪 算，故不可不慎也。

　　次明所修善事，無論多少，乃至極小如毛、極細如發之善事。又無論其營建精藍，裝塑聖像，乃至懸掛一幡一蓋，燒散少香少華，供養佛菩薩像。如趙 泰按行地獄，出獄門，見有二人，賫文書來，語獄吏言：有三人，其家為其於塔寺懸幡燒香，救解其罪，可出福捨。俄見三人，自獄而出。已有自然衣服，完整在 身。南詣開光大捨。泰亦隨入，金玉床上，見一神人，殊好非常。府君恭敬作禮。泰問何人？吏曰：號名世尊，度人之師，有願令惡道中人皆出聽經。時有百萬九仟 人皆出地獄。故大品雲：一華散空，乃至畢苦，其福不盡。論雲：言至畢苦者，二死盡也。蓋言成佛散華之福，猶尚不盡（文）。燒香之福，其例實多。或轉讀地藏 本經及諸大乘經，燒香供養，不論全部全卷，乃至一句一偈。荊溪雲：一句一偈，增進菩提；一色一香，永無退轉。正此謂也歟哉！

△

【我等鬼王，敬禮是人，如過去現在未來諸佛。敕諸小鬼，各有大力，及土地分，便令衛護。不令惡事橫事，惡病橫病，乃至不如意事，近於此捨等處，何況入門。】

　　我等句，示鬼王敬善。敕諸下，示遣護卻惡。問：鬼是惡儔，何能見作毫善，敬禮如三世佛耶？答：所言佛者，修一切善法而得。今男女修諸善事，佛 果斯栽，故鬼神敬之，如過去莊嚴劫之仟佛，現在仁賢劫之仟佛，未來星宿劫之仟佛，一體無二也。抑豈敬禮如佛，現在能卻諸惡。以由諸王，即敕小鬼，各有大力 者，及土地分者，便令擁衛門戶。分內所司之地，雲土地分，即今方隅社令是也。惡事橫事，如羅雲忍辱經雲：願與福違，夜常惡夢，妖怪首尾，飛禍縱橫。今既修 福，無惡橫之事，所生常安，眾禍消滅矣。惡病橫病者，梵語迦摩羅，此雲黃病。又惡垢，亦癩病。珊若婆，此雲廢風病，一發不起。阿薩阇，此雲不可治病。弘明 集雲：必死之病，雖聖莫蠲。可療之疾，待醫方愈。上皆不治之惡病也。更有瘟災疫氣，相染相侵。或耗家財，或致喪命。如宋司馬文宣，頗信佛法。弟喪月余，忽 一鬼附其靈座。時南林、靈味二寺僧與鬼言論款曲。鬼雲：昔為尊貴，以犯眾惡，受此鬼身。去寅年，有四百部鬼，大行疾癘，所應鐘災者，不忤道人耳。而犯橫極 眾，多濫福善，故使我來監察。則橫病所觸，皆不修善所致。今既修福，身強少病，財福榮尊也。不如意者，家業衰耗，事不諧偶，所處不寧，心常恐怖。今既修 福，鬼神衛護，尚不令諸惡近其住處，況縱之使入門耶！

△

【佛贊鬼王：善哉！善哉！汝等及與閻羅，能如是擁護善男女等，吾亦告梵王帝釋，令衛護汝。】

　　何故如來贊喜？蓋鬼王率多兇惡。如鬼子母仟子，五百在天上嬈害諸天；五百在世間嬈諸人民，極妒害惡，令人祠祀烹殺，使入地獄。今諸鬼王與閻羅 天子，既能如此擁護修善男女，使無橫事惡病及不如意事，不許近捨，可謂善之至矣。故一善其改惡以護世，一善其卻橫以增禧，故雙嘆之。吾今亦告語統小仟世界 之大梵王，主攝欲界之桓因，均以天力衛護汝等，轉鐵床洋銅之現厄，脫幽冥主攝之宿緣，併由護法衛善而致之也。

△

【說是語時，會中有一鬼王，名曰主命。】

　　惡毒陳事既竟，主命越班白己事者，何也？夫世人之生也，有命而已矣。其修善者，謂之衛生；其作惡者，謂之戕生。春秋成公篇雲：民受天地之中以 生，所謂命也。是以有動作禮義威儀之則，以定命也。能者養之以福，不能者敗以取禍。今世人不會鬼王護人之意，唯循惡趁毒，可謂自戕生命，逆天甚矣！然命之 所重，在生死之間。生也命存，死也命絕。寶雨經雲：如因風力，有出入息，能令一切有情活命。然命之生死，如日月之出沒；而業之善惡，如形影之追隨。故於生 死之際，必須修善衛生。主命白事，意在斯乎。然言主者，不過司命存亡，非能與奪人命，令生之死之。獄府主死生案者，是其職事耳。

△

【白佛言：世尊！我本業緣，主閻浮人命，生時死時，我皆主之。】

　　首舉業緣者，以一切眾生，隨自業轉。若造作增上慳貪身語意惡行，往生琰摩界中，感饑渴業，經百仟歲，不聞水名，豈能得見，況復得觸。此餓鬼之 最劣者。若惡中兼佈施因，生鬼道中，大有威德，為諸鬼王。雖威德為王，恆為諸天驅役，守門防邏，導從給使，亦繫往業。其主命之職，亦循業而為之。故雲我本 業緣，主南洲人命。其生時死時，乃吾之專司而不能違也。

△

【在我本願，甚欲利益。自是眾生不會我意，致令生死俱不得安。】

　　意者，思量之稱。謂我心思量要如此，無奈人不體心，拂戾我意。既觸吾心，便不護彼，故令生者死者，俱不得安樂。乃人自取殃禍，非我之過咎也。

△

【何以故？是閻浮提人初生之時，不問男女，或欲生時，但作善事，增益捨宅，自令土地無量歡喜，擁護子母，得大安樂，利益眷屬。】

　　轉釋之意在何？夫人托胎，皆乘夙業。修行道地經雲：人形不純，或善或惡。當至人道，父母合會，精不失時，子來應生。其母胎通，無所拘礙。心懷 歡喜，父時精下，即失中陰，則入胞胎。故勸此時但做善事，益捨宅之威光，增土地之歡喜。捨，於中捨，息也；宅，擇也。擇吉處而營之也。土，吐也，吐生萬物 也。地，諦也，五土所生，莫不信諦也。准長阿含，初生之人，互相是非，地膚不現，共取粳米食之，其身粗醜，有男女形。互相瞻視，遂生欲想。共在屏處，為不 凈行。余人呵責，自悔過言：我所為非，即身投地。女人見其投地不起，即便送食。故世間便有不善夫主之名。以送飯與夫，遂名為妻。其後眾生遂為淫泆，為自障 蔽，遂造屋捨。以此因緣，始有捨名。淫泆轉盛，遂成夫妻。有余眾生，壽行福盡，從光音天命終，來生此間，在母胎中，因此世間有處胎名。此夫妻捨宇胎產之源 也。土地乃護宅護身之主，既歡喜已，自來擁護，令子母均得大安，併利益眷屬。利益有二：生時子母無恙，初令合門歡喜，子既增隆福善，後能昌熾門闌。夙行善 者，彌增福壽；夙行惡者，亦消其罪也。

△

【或已生下，慎勿殺害，取諸鮮味，供給產母；及廣聚眷屬，飲酒食肉，歌樂弦管，能令子母不得安樂。】

　　殺害一事，今古同憐，無非體天道好生之心，存人生難得之命。豈可為我口體之養，誕兒之慶，傷生杌命，剖腹刮鱗，違天之仁，幹神之怒乎！故雲棲 大師曰：生子不宜殺生。人無子則悲，有子則喜。不思一切禽獸，亦各愛其子。慶我子生，令他子死，於心安乎？夫嬰孩始生，不為積福，而反殺生造業，亦太愚 矣。昔周豫學士嘗煮鱔，見其鞠身嚮上，而以首尾就湯。剖之，見腹中有子。乃知鞠身避湯者，以愛子之故。烏呼！雖人畜不同，愛子之心一也。何得慶我母子之 生，使彼母子抱苦就終，含悲嚮盡，既受屠割，復嬰煎熬，苦痛難言，徹骨入髓。當此之時，吾之一點仁心蚤殄，彼之無窮怨氣長存。欲其不索報於來生，吾未之信 也。廣聚眷屬等，所以慶己子之生也。主命禁勿殺者，所以增子之福壽也。
　　古雲：酒是和神之藥，肉為充饑之膳，古今同味，今何見鄙？良以肉由殺命，酒能亂神，不食是理，寧可為非。鴦掘經，佛言：一切眾生，生死輪轉， 無非父母兄弟姊妹，猶如伎兒，變易無常。自肉他肉，則是一肉。是故諸佛，悉不食肉。況飲酒斷智慧種，食肉斷慈悲種，來種尚斷，安保現種之不斷乎！若遵主命 之訓，不惟消災謝過，併能集福延齡，請細思之。毋泥俗習，歌樂如前。弦管絲竹之音，併此亦誡者。蓋飲酒食肉亂性而傷慈，歌樂管弦蕩情而逸誌。既違天地之仁 德，大乖主命之慈心，減捨宅之威光，觸土地之護意，子母不得安樂，其過也將誰歸？

△

【何以故？是產難時，有無數惡鬼及魍魎精魅，欲食腥血。】

　　轉釋之意，謂有惡鬼欲食腥血也。以生時在地之血，惡露臭處，鬼魅來嬈，癲邪所中，死屍所觸，蠱道顛鬼，各伺犯之。如四交道所墮肉段，烏[至+ 鳥]雕狼各來爭之。諸邪妖鬼，欲得兒便，周匝圍繞，亦復如是。護凈經雲：餓鬼常守捕婦女產，藏血不凈，以為飲食。分別善惡經偈雲：好調嬈老小，乞兒與病 人，後為臊餓鬼，食產乳惡露。鬼之惡業，殊可憐湣矣。

△

【是我早令捨宅土地靈只荷護子母，使令安樂，而得利益。】

　　主命自謂，我既主人之命，人之將生，幹繫在我。故先令土地荷護子母。是使其如背負物，不可失墜一般，故雲荷護。醯摩跋陀，翻捨主，恐是護宅神 名。安樂利益者，使安隱而生，聽呱聲之報。父有添丁之喜，家無斷火之憂。固土地之荷護，實主命之遣令。准道藏，人間生男女時，九天玄女，遣天神於空中稱唱 奉恭。生男，唱奉一仟六百聲，欲其在家之奉親，出仕之奉君也。生女，唱恭一仟六百聲，令其歸夫家時，恭敬其公姑與夫也。奉恭欲唱，吉兇只在片時，此之謂 也。

△

【如是之人，見安樂故，便合設福，答諸土地。翻為殺害，聚集眷屬。】

　　初句，點產家男女，既見產育安樂，應思安樂之故，功由土地。便合設福善之業，以酬宅主之恩。今翻殺害生靈，聚集眷屬，飲酒食肉，歌樂弦管，觸 神之怒，失思甚矣。先明萬歴三十三年，槐亭蔡公（諱承植）守嘉興，禁諭殺牲祀神。其略曰：鬼神享用，與人間不同。人好酒肉，便以酒肉祀神。譬如蛆蟲啖糞， 便以糞貢人，豈不得罪於人？蓋神明清凈，聞人間酒肉汙穢，厭惡不暇，豈肯鑒嘗。故郊祀者，止用淡酒。承祭者，戒酒戒葷，亦可知已。至於餓鬼不能飲水，何能 食肉？目連救母事可鑒已。凡祀神明，宜焚香設齋。併誦金剛經一卷。神自鑒納，陰司極重此經。若仍前殺牲汙神，不惟無益，且遭罪譴。余謂蔡明府，真是現宰官 身，為萬鬼萬民說法了也。惜世人不知信奉，自取過咎，奈之何哉！

△

【以是之故，犯殃自受，子母俱損。】

　　犯殃等者，經雲：有夜叉羅剎，常喜啖人胎，能令人無子，傷害於胞胎。及生時奪命，為其作嬈害，則生子夭殤。乃由人殺害自致，非土地不護也。

△

【又閻浮提臨命終人，不問善惡，我欲令是命終之人，不落惡道。何況自修善根，增我力故（一本作「者」）。】

　　法句經雲：命如華果熟，常恐會零落，已生皆有苦，孰能致不死。古雲：生則八識扶持，死則四大離散。迅矣百齡，終歸磨滅。遁環三界，運轉靡停。 故經雲：有始有終，既生則滅，誰能禁其不死耶！但臨終之時，平時所造善惡之業，其相俱時頓現，隨業趣生。法句雲：人作善惡，殃福隨人。雖更生死，不可得 免。然在我本意，不問其生平作善作惡，俱令生於善處，不令落於惡道也者。何況其人原不作惡，自修施戒，彼既善根修成，令我亦增威熾。其感報之時，必生天上 人間矣。

△

【是閻浮提行善之人，臨命終時，亦有百仟惡道鬼神，或變作父母，乃至諸眷屬，引接亡人，令落惡道，何況本造惡者。】

　　凈度三昧經雲：若人造善惡業，生天墮獄，各有迎人。病欲死時，眼自見來迎。應生天上者，天神持天衣伎樂來迎；應生它方者，眼見尊人，為說妙 言；若為惡墮地獄者，眼見兵士持刀盾矛戟索圍繞。所見不同，口不能言。各隨所作，各得其果（文）。故知臨終之時，實有惡鬼嬈亂。即使嚮行善者，尚難卻其播 弄。或變作父母兄弟，伯叔姑姨，令心著愛，精神瞀亂。鬼即以似父母等身，引入惡道。何況本造惡者。蓋世人將死，天帝行下文書。死期未到，太山鬼神，促令造 罪，令落惡道，當知即此輩播弄，更有誰乎！故大論引分別業經。佛告阿難：行惡人好處生，行善人惡處生。阿難曰：是事雲何？佛言：惡人今世罪業未熟，宿世善 業已熟。故今雖為惡，而生好處。或臨死時，善心心數法生，亦生好處。行善人生惡處者，今世善未熟，過去惡已熟。故今雖為善，而生惡處。或臨死時，不善心心 數法生，亦生惡處。故俱捨雲：若人臨終，起邪見心，是人以先不善為緣，故墮地獄。是則即使無鬼引接，尚難必其善者決生善處，惡者定生惡處。況本造惡之人， 自然引入惡道矣！

△

【世尊！如是閻浮提男子女人，臨命終時，神識惛昧，不辨善惡，乃至眼耳更無見聞。】

　　臨終識惛者，人身中識神，或時頓去，或去有先後，唯第八識最後去。亦何有知？涅槃雲：如人捨命，受大苦時，宗親圍繞，號哭懊惱，其人惶怖，莫 知依救！雖有五情，無所知覺。肢節戰動，不能自持。身體虛冷，暖氣欲盡。見先所修善惡報相，如日垂沒，山陵堆阜，影現東移，理無西逝。眾生業果亦復如是。 故臨終時，諸根黯然，識不能辯，眼耳雖在，何能見聞？

△

【是諸眷屬，當須設大供養，轉讀尊經，念佛菩薩名號。如是善緣，能令亡者離諸惡道，諸魔鬼神，悉皆退散。】

　　當須設供者，事之要處也。譬船行險處，急宜著力。稍有錯時，人船俱失。良由前陰將絕，中陰身起。中陰有二種：一善業果，二惡業果。因善業故， 得善覺觀。因惡業故，得惡覺觀。隨業因緣，嚮受生處。五戒經雲：生死險難，實可驚怖。故須設大供養，轉經稱名。供言大者，謂傾己資財，竭力營辦。然於供養 之際，須離謂實之心。若香若華，體是法界。能供所供，性本真空。稱量由生，順性常住。普獻三寶，等供十方。雖曰施財，是真法供，故名為大，念佛菩薩。若光 明疏雲：觀心既然，觀佛亦爾，故言念佛。此指理觀，今但稱名也。大品雲：若有一人稱南無佛，乃至畢苦，其福不盡。大論問：雲何但空稱名字，便得畢苦，其福 不盡？答：是曾聞佛功德，能度人老病死苦。若多若少供養，及稱佛名字，得無量福（文）。故大悲經雲：若能至誠心念佛功德，乃至一華散於空中，於未來世作天 梵王，其福不盡。以其不盡，終至涅槃。今既資以供經稱名之善緣，自能令亡者離三塗惡道。變形魔鬼，不卻而自退散矣！

△

【世尊！一切眾生，臨命終時，若得聞一佛名、一菩薩名，或大乘經典一句一偈，我觀如是輩人，除五無間殺害之罪，小小惡業，合墮惡趣者，尋即解脫。】

　　上言設供、讀經、稱名三種功德，資冥福，離惡道，卻鬼神。多福之功也。今但於佛菩薩，祗一名而已，於經典只一句一偈而已即能除極重五無間罪。 （註：此能除五無間罪，似非經文原意。）一偈，天竺但數自滿三十二，即為一偈。號阿耨窣睹婆或輸盧迦波。此亦有大因緣，故臨終得聞，上品大罪既除，其小小 中下惡業，合當墮邊小獄者，當下解脫超升。如赫日銷霜，寧有余愆。故華嚴雲：寧受地獄苦，得聞諸佛名；不受無量樂，而不聞佛名。所以於往昔，無數劫受苦， 流轉生死中，不聞佛名故。
　　問：雲何但聞佛名，便得道耶？答：有眾生福德淳熟，結使心薄，若聞佛名，即時得道。如新凈白氈，易為受色。聞佛名福，功叵量矣。主命述意竟。

△

【佛告主命鬼王：汝大慈故，能發如是大願，於生死中護諸眾生。若未來世中，有男子女人，至生死時，汝莫退是願，總令解脫，永得安樂。】

　　此如來贊勸之文。言大慈則同諸佛之心，發大願則同菩薩之念。今既以佛心為心，能發如是大願，即是佛菩薩矣。今故勸汝，凡未來世中男女臨生死時，汝莫退救護之願。不問有罪無罪，大惡小惡，總令解脫三塗，得在人天安樂，真不負我今日之叮嚀矣。

△

【鬼王白佛言：願不有慮。我畢是形，念念擁護閻浮眾生。生時死時，俱得安樂。】

　　如文。

△

【但願諸眾生，於生死時，信受我語，無不解脫，獲大利益。】

　　世記經：佛言一切男子女人，初始生時，皆有鬼神隨逐擁護。若其死時，彼守護鬼，攝其精氣，其人則死。故主命願人生時死時，慎勿殺害，應修善 緣。大集雲：若修慈者，當捨身命時，見十方佛，手摩其頂。蒙手觸故，心安快樂，尋得往生清凈佛土。故雲棲有祭先不宜殺生，以資冥福。夫八珍羅於前，安能起 九泉之遺骨，而使之食乎。無益而有害，智者不為也。

△

【爾時，佛告地藏菩薩：是大鬼王主命者，已曾經百仟生作大鬼王，於生死中，擁護眾生。是大士慈悲願故，現大鬼身，實非鬼也。】

　　凡論本跡，本同而跡異。蓋從本垂跡，跡不異本；因跡顯本，本不離跡。本跡雖殊，不思議一。故舉百仟劫已前為本，是與佛無二道也。今此鬼身，乃 慈悲願上所現。譬一月在天，影臨眾水。若執影為真，則失本矣。故曰現大鬼身，實非鬼也。昔生公說法虎丘，有一鬼現身，日來聽法。生公諭其托生。鬼答以詩 雲：做鬼經今五百秋，也無煩惱也無愁，生公勸我為人去，只恐為人不到頭。今大鬼王，經百仟生，豈非乘願力來，現鬼身而說法也者。

△

【卻後過一百七十劫，當得成佛，號曰無相如來。劫名安樂，世界名凈住。其佛壽命不可計劫。】

　　當得成佛者，初住百界作佛也。無相者，不但無生住異滅之相，無相亦無，故名無相。然以鬼相而成無相，非頑同太虛，空無一物，無相即相也。以後 之無相而觀鬼相，非猙獰兇惡，示有諸怖相即無相也。今日之鬼相，即不思議之妙有。它世之無相，即不思議之真空。有即空故，有不可得；空即有故，空不可名。 空有既亡，中道不立。若鬼若佛，其名安寄。若相無相，其體奚存。名號既爾，劫界亦然。孰謂鬼神恆受驅使不安樂乎，劫劫本自安樂；孰謂鬼神攝屬冥司，不凈住 乎，界界由來凈住；孰謂鬼壽所有日月，祗五百歲乎，佛壽不可計劫。故知以本而驗跡，跡還同本；以因而望果，果不異因。發本之意，妙在斯乎。

△

【地藏！是大鬼王，其事如是不可思議。所度天人，亦不可限量。】

　　其事不可思議者，約本而嘆跡也。如阿難救焰口經雲：其中為於主宰，統領上首之者，皆是住不可思議解脫菩薩。慈悲誓願，分形佈影，示現化身在六 道中，同類受苦。設於方便，為善知識。成熟利樂一切有情，證大涅槃（文）。是則主命鬼王等及閻羅天子，亦豈實業受生，三時受苦者哉。又復應知一切皆是浮塵 諸幻化相，當處出生，隨處滅盡。幻妄稱相，其性真為妙覺明體。若了此意，則於諸聖權實化門，思過半矣。

△

【稱佛名號品第九】

△

【爾時，地藏菩薩摩訶薩白佛言：世尊！我今為未來眾生，演利益事，於生死中，得大利益。唯願世尊聽我說之。】

　　大士特說此佛名品者，由前來多番說稱念佛菩薩名，不問有罪無罪，悉皆消滅，得生人天，乃至畢苦。今故略出十名，以為杓（音標）鵠，次顯多佛， 以至沙河也。為未來眾生有二意：一體佛天宮付囑之心，二顯己南洲救拔之念。佛慈未艾，我願無窮。良由過去者已獲超淪，現在者今沾至化，唯是未來眾生，罔知 出要，偏造惡緣。若不垂超脫之方，乃甘與淪胥之苦。如詒厥孫謀，所慮深遠，故雲為未來眾生演利益事。

　　利益有世間、出世間之不同，及藏、通、別、圓之不等。今是出世上利，圓教果益。然言於生死中得大利益者。夫論生死，乃眾生大患。如佛說四不可 得經，佛言：世有四事，不可以護致。一曰年幼，顏色煒燁，眾人愛敬。一旦忽耄，頭白齒落，欲使常少不老者，終不可得。二謂身體強健，謂為豪強，疾病卒至， 眾患難喻，欲免常安無病，終不可得。三謂欲求長壽，五欲永存，非常對至，如風吹雲。冀念長生，終不可得。四謂父母兄弟，恩愛榮樂。宿對卒至，如湯消雪，欲 求不死，終不可得。古今以來，天地成立，無免四難之患。以斯四苦，佛興於世（文）。今欲脫此四苦，莫過稱佛名號之利益矣。大經雲：假使一月常以衣食供養一 切眾生，不如有人一念念佛所得功德十六分之一。假使鍛金為人，車馬運載，乃至眾寶，各滿百數，以用佈施，不如發一心嚮佛，舉足一步，所得功德，無量無邊 （文）。以故東土倡始於遠公，西京大盛於善導。吾祖疏觀經而論十疑，四明鈔妙宗而修大悲。永明萬善同歸，慈雲二門要行。展轉沿習，代不乏人。至明萬歴間， 雲棲和尚出，德業充符，聲名洋溢，純提凈土，戶曉家傳。蓋由此法門，能橫截惡道，直造本源。是故西天東土，鹹稱異妙方便。功德不可思議，誠非余行可及。然 須諦信不疑，精勤無間。行住坐臥之中，春夏秋冬之內，穢心滌蕩，凈念聯綿。有不脫苦超升者，佛祖皆為誑語矣。故今地藏說此救世妙法，令未來眾生，出苦有方 也。

△

【佛告地藏菩薩：汝今欲興慈悲，救拔一切罪苦六道眾生，演不思議事。今正是時，唯當速說。】

　　初述所說事，謂汝欲救六道眾生，起此無緣同體慈悲。誠拔苦之要門，乃利生之妙術。神丹點鐵，至理革凡。功德巍巍，誠難思議。汝欲說者，今正是時。如來化緣將熄，滅度靡常，不此申救，更待何時。故敦逼其速說也。

△

【吾即涅槃，使汝早畢是願，吾亦無憂現在未來一切眾生。】

　　此示敦逼之意。涅槃，奘三藏翻圓寂。德無不備稱圓，障無不盡稱寂。肇公雲：泥洹盡諦者，豈直結盡而已。則生死永寂滅故，謂之盡矣。然吾即涅槃 句，人不忍聞。如遊行經，天人等皆嘆言，如來滅度，何其駛哉。世尊滅度，何其疾哉。大法淪翳，何其速哉。群生長衰，世間眼滅。譬如大樹根拔，枝條摧摺。又 如斬蛇，宛轉回遑，莫知所湊。是時諸天，亦復皆於空中，徘徊騷擾，悲號躄踴。是也。然機薪既盡，孰能留應火之不亡耶。使汝早畢是願者，亦縱辭也。大士之 願，何能蚤畢。甚言此法之妙，縱吾即入涅槃，縱使汝早畢是願，吾亦不憂現在未來一切眾生矣。何也？有此稱名之法，人人可不墮苦，併趣人天修行，終至成佛無 疑。能體佛心而達佛意，善繼誌而述事者，莫過我地藏慈尊矣，故許令速說而贊慰之也。

△

【地藏菩薩白佛言：世尊！過去無量阿僧祇劫，有佛出世，號無邊身如來。若有男子女人，聞是佛名，暫生恭敬，即得超越四十劫生死重罪。何況塑畫形像，供養贊嘆，其人獲福無量無邊。】

　　佛佛皆指過去者，自地藏發心已來所值之諸佛也。凡所舉佛名，皆後遠於前。顯己發心，遠且久也。有佛出世四字，慶幸之語。觀經疏雲：若佛出世， 方能闡智慧日，識三寶之光明；開甘露門，知十號之妙味。因說生解，於寶適悅。故喻如優曇華，時一現耳。無邊身者，三身皆有此意。唯識論雲：一自性身，謂諸 如來真凈法界，具無邊際真實功德。是一切平等實性，即自性身，亦名法身，此法身之無邊也。又雲：自受用身，謂諸如來三無數劫，修習無量福德資糧，所起無邊 真實功德，此報身之無邊也。華嚴雲：清凈妙法身，湛然應一切。應，即應身。一切，即無邊，此應身之無邊也。故知三身即一，一即三身也。下顯益。男子女人， 標能聞機。初聞佛名，暫生恭敬者，暫謂歴時不久。生謂當下發心，恭謂束身翹仰，敬謂心無異緣。即此一念微解，無非本性佛法。故於暫生恭敬心中，早已成名字 佛。超越四十劫生死重罪，復奚疑哉。然此聞名暫敬，但得理性初開，便能超極重罪。又何況塑畫形像而嚴飾之。陳羅香華而供養之。梵唄功德而贊嘆之。其人所獲 之福，自然量不可測，邊莫能窮，唯佛與佛乃能知見耳。

△

【又於過去恆河沙劫，有佛出世，號寶性如來。若有男子女人聞是佛名，一彈指頃，發心歸依。是人於無上道，永不退轉。】

　　恆河沙劫，較前更多矣。寶性者，蓮華面經雲：諸佛如來，是眾生寶。寶有七種，而金寶居首。真諦釋金四義。一色無變，二體無染，三轉作無礙，四 令人富。以譬法身常凈我樂四德，乃性寶也。顯益中，聞是佛名，一彈指等者，三乘之士，歴僧祇劫而功行無成。念佛之門，於彈指頃而位階不退。異哉奇功也。發 心歸依，希有經，廣較三歸功德。雲教四天下，及六欲天，得四果，不如三歸依功德多。故增一阿含，佛說偈雲：諸有歸依佛，不墮三惡趣。盡漏處人天，便當至涅 槃。此憑自性佛寶，以歸寶性，故於無上之道，永不退轉。此唯約圓教，才聞佛名，以根利故，或超入十信，即凈六根。或頓入初住，開佛知見。故位不退，從初信 至七信，見思粗垢，任運先落。見圓真諦理。行不退，在八九十信，入假位中，起四門諸行，斷內外塵沙，備俗諦理。念不退，在圓初住去，念念進趣果海，任運流 入真源。故智論雲：無生法忍，即是阿惟越致地。若約得意為言，名字即佛，橫具三不退（雲雲）。
　　問：才聞寶性佛名，彈指發心歸依，何能於無上道，得永不退轉耶？答：北齊悟中論，而頓入初住。南嶽證法華，而位登十信。其例可識，奚復疑斯。 准觀經疏引涅槃雲：一切眾生即是佛。如貧女捨寶，眾物具存；力士額珠，圓明頓在。但未遇智者點示其處，日受貧窮之厄，時懷失珠之憂。才聞指示，即知本有。 貧女發藏，受用靡窮。力士見珠，歡喜無量。故知眾生解後，與佛毫無差忒。永不退轉，自應仰信也。

△

【又於過去有佛出世，號波頭摩勝如來。若有男子女人，聞是佛名，歴於耳根，是人當得仟返生於六欲天中，何況誌心稱念。】

　　波頭摩，亦名缽特摩，此雲紅蓮華。勝者，佛地論雲：四蓮，以紅蓮為勝。故央掘雲：第一缽曇摩，清凈柔軟義，塵水所不汙，是故稽首禮。顯益中， 仟返生六欲天中者何？以蓮華處泥不染，出水恆芬。錶聞名者，雖生欲天，實不著粗弊五塵。以解離聞性本空，生天亦寂。以空處即假，權示天身，以度實生著欲之 者。聞名尚爾，況誌心稱念者乎，他日必證波頭摩勝矣。佛蓮仟瓣，錶仟法明門，故雲仟返。

△

【又於過去不可說不可說阿僧祇劫，有佛出世，號師子吼如來。若有男子女人，聞是佛名，一念歸依，是人得遇無量諸佛摩頂授記。】

　　長阿含十六，佛告迦葉婆羅門雲：所謂師子者，是如來至真等正覺，於大眾中，廣說法時，自在無畏，故號師子。汝謂如來師子吼時，不勇悍耶？勿造 斯觀，如來師子吼，勇悍無畏。故雲：譬如師子吼，蠕動皆怖畏。如來震法音，降伏諸外道。則佛號師子吼，正取說法之相也。故今一念歸依，便得遇無量諸佛，各 與摩頂授記，將來必得種智，說法如師子吼。其有聞者，或喜或怖。穴處者隱縮。水居者深入。山藏者潛伏。廄象振鎖，狂逸而去。鳥飛空中，高翔而遠逝矣。

△

【又於過去，有佛出世，號拘留孫佛。若有男子女人，聞是佛名，誌心瞻禮，或復贊嘆，是人於賢劫仟佛會中，為大梵王，得授上記。】

　　拘留孫，梵名也。此雲所應斷。（此約五住二死，斷處立名。）又翻作用莊嚴。（此約修因證果為名）此非賢劫第九，減至六萬歲時出世之佛。准萬佛 名經，有無量七佛之名。若謂下有賢劫之語，應是賢劫首佛。則於上過去之言既妨，復於下恆沙之劫有礙也。顯益中，聞佛名屬意，是顯正因佛性。瞻禮屬身，是顯 緣因佛性。贊嘆屬口，是顯了因佛性。由此三因種緣，故於賢劫仟佛會中，皆為大梵天王，修四等心，行業清凈。普為三有，請轉法輪。故於佛佛之下，親受上妙之 記。即以梵身，成大覺果。法苑曰：今據賢劫一代，分為壞空成住。就此今住劫，有仟佛出現。三佛已往，今是第四。依立世阿毗曇論，十一劫是未來，八劫是過 去，今釋迦佛，當第九劫內成佛。
　　問：此賢劫中，成壞空劫，佛不出世，唯取住劫。此住劫中，未來唯十一小劫，何得頓有九百九十六佛，一時出世耶？答：實如所難，會意稍難。今依 二經，略知途路。藥王藥上經雲：佛言：我曾往昔無數劫時，於妙光佛末法之中，出家學道，聞是五十三佛名，心生歡喜。復教它人，令得聞持。展轉相教，乃至三 仟人，異口同音，一心敬禮，即得超越無數億劫生死之罪。其前仟人者，華光佛為首，下至毗捨浮佛。於莊嚴劫得成為佛，過去仟佛是也。此中仟佛者，拘留孫為 首，下至樓至如來，於賢劫中，次第成佛。後仟佛者，日光如來為首，下至須彌相佛，於星宿劫中，當得成佛。若依佛名經，過去九十一劫，有佛名毗婆屍如來。過 去三十劫，有佛出世，名屍棄如來。即此劫中，復有佛出世，名毗捨浮如來。

　　問：此九十一劫，為大，為小？答：是大劫也。何以得知。依舊婆沙論雲：釋迦菩薩因地，從毗婆屍佛以來，種相好業。至今第九住劫，以經九十一大 劫。故舊俱捨論雲：由禮底沙佛，精進力故，即得超九大劫，究竟成佛。故知九劫既大，余九十一劫，寧不是大耶。既是大劫，故仟佛出世，無所疑也。又依立世阿 毗曇，二十住劫中，過去八劫，已有三佛出世，釋迦當現在第九劫出世。即以前九劫，已有四佛出世。未來猶有十一劫，焉知不有多佛出世。准此義意，縱是小劫， 多佛出世，亦自無妨。良由眾生根有強弱，故感見不同。恐後賢致疑，略示梗[既/木]耳。

△

【又於過去，有佛出世，號毗婆屍佛。若有男子女人聞是佛名，永不墮惡道，常生人天，受勝妙樂。】

　　毗婆屍，亦名維衛，此雲勝觀。俱捨論雲：三無數劫滿，逆次逢勝觀。此由釋迦於勝觀佛，初種相好故。然若以此為過去莊嚴劫仟佛中之後三佛，則拘 留孫為賢劫中之首佛，更無疑矣。須知應依前論，不可近指。以毗婆屍佛甚多，安可專指釋迦種相初逢之勝觀也。顯益中，聞是佛名，即不墮三惡道。此非易事。准 論，釋迦世尊，初阿僧祇，從此常離女身、及四惡趣。准妙玄釋簽，第三僧祇。始離五障，方乃不墮。常生人天者，如戒疏，初僧祇，得五種功德。一生人天。二生 貴家。三男身。四根具。五知宿命。文句雲：不生三惡，位不退。不生邊地，諸根完具，不受女身，即行不退。常識宿命，即念不退（文）。故知不墮惡道，常生人 天，誠非易易者。今圓根最利，故才聞佛名，即解自性，故能頓得。人天勝妙樂者，詳長阿含世記經。雖生人天，唯以法喜禪悅為樂。如大莊嚴論。佛說偈雲：無病 第一利。知足第一富。善友第一親。涅槃第一樂。此乃受即不受，無受即受也。

△

【又於過去無量無數恆河沙劫，有佛出世，號寶勝如來。若有男子女人聞是佛名，畢竟不墮惡道；常在天上，受勝妙樂。】

　　梵名啰怛囊毗婆。啰怛囊，翻寶。毗婆，翻勝。寶之勝者，必是何物。華嚴雲：如海中有四珠，一切眾寶，皆從之生。若無此四珠，一切眾寶，漸就滅 盡。諸小龍神，不能得見。唯娑竭羅龍王，密置深寶藏中。此深寶藏，有四種名。一名眾寶積聚。二名無盡寶藏。三名遠熾然。四名一切莊嚴聚。此雖寶中之勝，然 是世寶，次第以對常樂我凈出世之寶。此之四德，唯佛與佛，乃能證得。如娑竭羅龍王，密置寶藏是也。余人未證，如小龍神，不能得見是也。此四德出生不貲，如 一切眾寶，皆從之生是也。故光明玄雲：如世珍寶，凡情所貴。乃則如理究竟可貴之寶，名於凡情可重之寶，故佛號寶勝也。顯益，大意如前。光明流水品，十仟魚 得聞寶勝之名，尚盡生忉利。況男女聞名，寧有不得勝妙樂者。

△

【又於過去，有佛出世，號寶相如來。若有男子女人聞是佛名，生恭敬心，是人不久得阿羅漢果。】

　　佛名寶相者，亦約相寶，以譬性寶。華嚴雲：又大海中，有四熾然光明大寶。一名日藏。二名離潤。三名火珠。四名究竟無余。若大海無此四寶，四天 下金剛圍山，乃至非想非非想處，皆悉漂沒。（即大論所謂消水珠是也。）日藏，錶大圓鏡智。離潤，錶妙觀察智。火珠，錶平等性智。究竟，錶成所作智。若如來 法海，無此四智饒益眾生，三界六道，悉皆漂沒。故大師雲：無去無來，法性實相，實相尊貴，故名寶相是也。顯益中，聞佛名已，生恭敬心，則身不瞻禮，口不贊 嘆，審矣。而男女輩，不久之間，得阿羅漢果，功德深矣。

　　若約三藏論，如經，日藏光明，能變海水為酪。今謂世第一，十五心見道，十六心入須陀洹果，轉賢為聖，正如變水為酪。離潤光明，能變海酪為酥。 今言見道後，起於修道，斷欲界九品思中前六品盡，入斯陀含，正如變酪為酥。火珠光明，能然海酥。以三界斷欲界後三品思盡，永不來欲界受生，正如燒然海酥。 究竟無余光明，能然海酥永盡無余。以四果斷上下五分俱盡，無復余思，永不受後世之生，正如然海酥永盡無余矣。今約藏教以對圓位，則初信至七信，三界見思任 運斷盡，與藏教第四果阿羅漢齊。故妙玄雲：同住四住，此處為齊。若伏無明，三藏則劣，正斯之謂。今本約圓為正，所以先約三藏小果者，欲開藏教之阿羅漢，成 圓佛之阿羅漢果也。

△

【又於過去無量阿僧祇劫，有佛出世，號袈裟幢如來。若有男子女人聞是佛名者，超一百大劫生死之罪。】

　　此約莊嚴標相，以彰佛德洪名。心地觀雲：袈裟，即是如來寶幢之相。著袈裟時，生寶幢想，能滅眾罪，生諸福德，猶如良田，能善增長菩薩道故。猶如甲胄，煩惱毒箭不能害故。以如來因修萬行，致此果德莊嚴。故男女聞名，頓超百劫生死之罪。

△

【又於過去，有佛出世，號大通山王如來。若有男子女人聞是佛名者，是人得遇恆河沙佛，廣為說法，必成菩提。】

　　山王，即須彌山。七金環拱，峙立海中，故特稱王。大者，高八萬四仟由旬。通者，光明四面照映。此喻報身佛也。小般若雲：譬如有人，身如須彌山 王，是身為大不。須菩提言，甚大。大師雲：此即非果而果，因大故果大。得法五陰，成就法身，故言大如須彌，以譬性色。色大故，般若大，如山大，神亦大。習 果既圓，報果亦滿，故言大身。則大通是般若因，山王是報身果，四智究竟莊嚴也。顯益中，凡有聞此佛名者，得遇恆河沙佛為說法者，因聞大通之般若，故感諸佛 為說般若，令全性以起修。既聞山王之果體，故感諸佛授記，令從因而至果。聞一佛名，而得修性一如，因果成就，佛力不可思議，果報亦不可思議矣。

△

【又於過去有凈月佛、山王佛、智勝佛、凈名王佛、智成就佛、無上佛、妙聲佛、滿月佛、月面佛，有如是等不可說佛。】

　　凈月者，佛真法身，猶若虛空。應物現形，如水中月。月喻佛身，法身如空，心光皎潔。從真垂應，影現水中。此明三身一體也。

　　山王，梵名勢禮捺啰惹，此雲山王。大方等陀羅尼經，華聚菩薩贊佛雲：世尊金色如金山，猶如日光照世間，能拔一切諸苦惱，我今稽首大法王。同。

　　智勝，即一切種智。大品雲：薩婆若（秦言一切智相）是聲聞、辟支佛智。道種智是菩薩智。一切種智是諸佛智。以一切種類相貌皆知，故於諸智稱勝。

　　凈名王，五住二死凈盡凈，自在故。立此勝稱。（集一切福德三昧經，東方去此三十二剎，國名普無垢，佛號凈名王。釋迦於久遠阿僧祇劫，為最勝仙，從聞集一切福德三昧，後生彼國，今得成佛。）

　　智成就，以權實二智悉成就故。

　　無上者，尊極之號也。有所斷者，名有上士。既無所斷，名無上矣。如佛說無上處經雲：若眾生於佛無上處，起信嚮心者，於天人中得無上果。

　　妙聲，正法念雲。山谷曠野，其中多有迦陵頻伽，出妙音聲。如是美音，若天人緊那羅等，無能及者。唯除如來音聲，故曰妙聲。

　　滿月，月面二佛，大意相同。如經雲：如十五日月，圓滿具足，眾星中王，最上最勝。佛面清凈圓滿，亦如月耳。有如是等不可說佛者，不復具出劫數，及聞名利益，故總結之。則知地藏自發心來，迄至今日，其所值如釋迦者。各各付囑度脫。亦如今日天宮，不可得而思議矣。稱名竟。

△

【世尊！現在未來一切眾生，若天若人、若男若女，但念得一佛名號，功德無量，何況多名。】

　　夫道與俗反，名與實乖。得其趣者，玄會幽理。何以然耶？如俗中祖考。不許述其名字。而法門佛名，稱揚獲福無量。良以諸佛如來，大慈湣物，降靈 在俗，濟度為先。有心希仰，無不蒙益。或以口稱，或以心念，或以身禮，三業加敬，三業清涼。漸拔有根，出於界繫。有斯大德，稱者得福。彼流俗者。與上相 違。十輪雲：若念一佛，則見一佛。若念多佛，則見多佛。若念小身佛，則見小身佛。若念大身佛，則見大身佛。若念無量身佛，則見無量身佛等。故以一佛，況多 名也。

△

【是眾生等，生時死時，自得大利，終不墮惡道。】

　　圓澄法師雲：六道凡夫，三乘賢聖。性覺寶光，各各圓滿，本不名諸佛。亦不名眾生。但此心不守自性，隨迷悟之緣，作業受苦，名曰眾生。修道證 真，遂名諸佛。佛湣眾生妄想執著，而不證得，猶是稱法界性，說念佛門。儻得其門，則等諸佛於一朝。不得其門，則徒修因於曠劫。故凡眾生於生死時，果能念 佛，或一佛，或多佛，各自得諸大利，終不墮於惡道。但此是大士所值之佛，親承供養，得諸利益者。然諸經論，唯贊西方阿彌陀佛，接引娑婆，願力偏重。是以普 賢行願，獨指彌陀為至。若人於生死時，果能真誠稱念，感應尤多。所謂不動步而歸凈土，安俟階梯。非思量而證彌陀，豈存言念。悟迷只在自心，超沈豈由他法。 諦信力行，自見功程耳。

△

【若有臨命終人，家中眷屬，乃至一人，為是病人，高聲念一佛名，是命終人，除五無間罪，余業報等，悉得銷滅。】

　　乃至一人念一佛名者，此從多人多佛，略至極少也。大悲經雲：一稱南無佛名者，以是善根，入涅槃界，不可盡也。更何疑五無間罪之不銷耶！極重逆 罪既銷，余之中下業報，豈不悉滅哉。（除者，去之也。非聽除而不銷也。）昔大智律師，發願常生娑婆，作大導師。復見慧市法師雲：方土雖凈，非吾所願。由是 於凈土門，略無歸嚮。見修凈業，復生輕謗。後遭重病，神識迷茫。頓覺前非，深自克責。仍覽天臺十疑論，初心菩薩，未得無生忍，要須常不離佛。又智論雲：具 縛凡夫，有大悲心，願生惡世救苦眾生，無有是處。譬如嬰兒，不得離母。又如弱羽，只可傳枝。自是盡棄平生所學，專尋凈土教門。十余年來，未嘗暫捨。又唐法 照大師，往五臺竹林寺，見文殊在西，普賢在東，為眾說法。照作禮，問曰：末代凡夫，智識淺劣，佛性心地，無由顯現，未審修何法門，最為其要？文殊曰：諸修 行門，無如念佛。我因念佛故，得一切種智。又問：當雲何念？文殊曰：此世界西，有阿彌陀，願力難思。汝當繫念，令無間斷，命終決定往生。說已，為照摩頂而 退。慧日法師求黑觀音，感現光相，所說略同。故念佛一門，斷斷不可不信也。

△

【是五無間罪，雖至極重，動經億劫，了不得出。承斯臨命終時，他人為其稱念佛名，於是罪中，亦漸銷滅。】

　　疑雲：無間業重，何得一人稱一佛名，即得銷滅耶？如增一經雲：眾生三業造惡，臨終憶念如來功德者，必離惡道趣，得生天上。正使極惡之人，以念 佛故，亦得生天。故知無間罪業雖重，經劫難出，承臨終念佛之力，則倒惑不起，法性現前，故能滅也。故華嚴經雲：設聞如來名，及與所說法，不生信解，亦能成 種。況今眷屬，信心為稱佛名，豈有不滅者乎。譬如師子筋為琴弦，一奏，一切余弦悉斷。亦如牛羊驢馬諸乳，同置一器，若以一滴師子乳投之，悉化為水。今既行 菩提心，為其念佛，銷滅重罪，何俟致疑。

△

【何況眾生自稱自念，獲福無量，滅無量罪。】

　　此況結者，正勸人自念為勝。以它人代念，滅罪尚爾，何況自念者哉。故大論二十四問：臨終時少許時心，雲何能勝終身行力？答：是心雖少，而力猛 利。如火如毒雖少，能成大事。是垂死時心，決定猛健，故勝百歲行力。是後心，名大心，以捨身及諸根事急，故念佛時，罪皆成福。如耆婆攬草，無非藥者，普能 愈病。釋摩男所執一切砂礫，皆變為寶。全心滿目，無非佛境。所觀罪福，即是實相。既純實相，覓罪福了不可得，復何論有量無量耶！今且順俗，故言自稱自念， 獲福滅罪，尤勝於前倍倍矣。

△

【校量佈施功德緣品第十】

△

【爾時，地藏菩薩摩訶薩承佛威神，從座而起，胡跪合掌，】

　　如文

△

【白佛言：世尊！我觀業道眾生，校量佈施，有輕有重。有一生受福，有十生受福，有百生仟生受大福利者，是事雲何？唯願世尊為我說之。】

　　業道者，殺害等罪行，名黑黑業，及不善業；佈施等福行，名白白業，及以善業。今於善業中，明施福一事。故雲我觀等。佈施多種，財施、法施、俗 施、道施，輕重較量，如綸貫。受福二字，世、出世間最重要事，皆由佈施而得。大士此問，實為出苦良方，成佛法根也。是事雲何句，正疑施因是等，受福何故不 同？問：為地藏真不知耶？為眾生疑耶？答：實知、不實知，非凡情所測。若准雜藏經，昔有人至波羅提木叉寺，得庵羅樹華，其色如金，持入佛塔，見釋迦牟尼佛 像相好；續念佛功德，心熱毛豎。即以華上佛。出問一道人：一華散佛，得幾許福？答：如此深事，我不能知，當問讀經者。即往問之。曰：我無天眼神通，不能知 見果報，可問坐禪六通羅漢。即便往問。阿羅漢即為觀之，見其捨身次第，受天上人中福德，乃至八萬大劫，福猶不盡。過是，不復能知。即遣化人詣彌勒所，問得 幾許果報。彌勒言：不能知，正使恆河沙等一生補處菩薩，尚不能知，況我一身。佛有無量功德，福田甚良，種種果報無盡。待我將來成佛，乃能知之。據此，即不 實知，誰曰不然。故仰願世尊為我說之。使後世知佈施之福有如是耶。

△

【爾時佛告地藏菩薩：吾今於忉利天宮，一切眾會，說閻浮提佈施校量功德輕重，汝當諦聽，吾為汝說。】

　　此正答在問處。以閻浮提人能行佈施者，必報生天上。故於天宮眾前，說佈施功德輕重。當諦聽者，夫佈施之業，乃眾行之源，且財物無常，五家爭奪；凡愚吝惜，靡有捨心，遂使妻兒角目，兄弟鬩墻，眷屬乖離，親朋隔絕。如是之[侃/言]，實由慳貪為本。故須諦實聽宣施福也。

△

【地藏白佛言：我疑是事，願樂欲聞。】

△

【佛告地藏菩薩：南閻浮提，有諸國王、宰輔大臣、大長者、大剎利、大婆羅門等，】

　　等者，等居士也。大論三十二雲：若有人佈施及持戒故，生剎利家。若著於智慧經書，而不惱眾生，佈施持戒故，生婆羅門家。居士者，小人而巨富，此由前施福，今感富貴報也。

△

【若遇最下貧窮，乃至癃殘喑啞、聾癡無目，如是種種不完具者。】

　　此即悲田，尤宜種福。最下貧窮，舉人中最卑劣者，此即作惡不施之後身。故大愛道經雲：有財不施，世世受貧。以前世或許施貧者，令他歡喜，後悔 不與，故招最下貧窮之報。癃殘等：癃，罷病，平原傳：臣不幸有疲癃之疾；又背凸曰癃，如周公隆其背；又膀胱不利亦曰癃。殘，則肢體不全。喑啞，則口不能 言。聾，則不聞。癡，則不別。無目，則不睹物。乃人中最可憐者。此由前世見乞者來，面目顰蹙，惡口罵詈；或時鞭撲，或自無信施，見他行施不能隨喜，反生毀 呰，令他不信。或家中財物妻子共感，多人有分；於中獨吝，偏用有過，不肯惠施，障人修福，惡深罪重，故感此報也。經雲：要觀前世因，今生受者是；要知後世 因，今生作者是。福報如影響，不可不知也。

△

【是大國王等，欲佈施時，若能具大慈悲，下心含笑，親手遍佈施；或使人施，軟言慰喻。是國王等，所獲福利，如佈施百恆河沙佛功德之利。】

　　具大慈悲，標施本也。本有與拔名具，嚮行善施名能，不揀高下名大。須達經雲：乃至於一眾生，行於慈悲，至[殼/牛]牛頃，此得福多（文）。此 能調心，慈悲湣物，隨所施為，皆成大善。若視相修福，內粗外細，唯成雜業矣。下心等，顯慈悲實處。下心，則降尊貴而就卑劣；含笑，則示喜捨而無吝情。地持 雲：若施下流，不起輕想。是也。親手等，忘己富貴，湣人貧賤，而等施之。如佛告須達，應至心施、信心施、隨時施、自手施、如法施。軟言慰諭含二意：一、使 人代施時，以軟言慰諭，當為我好施，毋輕慢也。二、自施它施，皆用軟言，慰諭前人，所謂惟願仁者，不生恨心也。處胎經雲：供養諸福田，不選必遇聖；行施作 福業，不選擇高下；此福聖所譽，最尊為第一。故所獲利，如佈施百恆河沙佛功德之利。以心平等，無分別故。如維摩居士語善德長者雲：若施主等心施一最下乞 人，猶如如來福田之相，無所分別，等於大悲，不求果報，是則名曰具足法施。正合今文。

△

【何以故？緣是國王等，於是最貧賤輩及不完具者，發大慈心。是故福利有如此報，百仟生中，常得七寶具足。何況衣食受用。】

　　初文，明所施如法；是故下，顯得報殊勝。地持雲：菩薩自量財物多少，隨其所應，而行惠施。見來求者有二種人：一者非是貧下，孤獨無所依怙；二 者貧苦孤煢下賤，無所依怙。作是念言：若我財多，當令俱足。若財少者，先當周給貧苦下賤無依恃者（文）。此慈心偏緣苦惱眾生，乃施門周急之意。是故所得福 報，百仟生中七寶尊貴者，尚能常得具足，況尋常衣食受用乎。良由能施之人，有智愚之別；所施之境，有悲敬之殊。悲是貧苦，敬是三寶。悲是田劣而心勝，敬是 田勝而心劣。若取心勝，施佛不如施貧。故像法決疑經雲：有諸眾生，見他聚集作諸福業，但求名聞，傾家財物以用佈施；及見貧苦孤窮，呵罵驅出，不濟一毫，名 為顛倒作善。不正作福。如此人等，甚可憐湣。用財甚多，獲福甚少（文）。今既憐湣之心，生於悲田，自然報施之福，獲乎後世矣。

△

【復次，地藏！若未來世有諸國王至婆羅門等，遇佛塔寺，或佛形像，乃至菩薩聲聞辟支佛像，躬自營辦，供養佈施。】

　　初，能施之人。遇佛塔下，所施之田。塔瘞捨利，寺供聖像。裝塑之福，經論廣明。今乃遇像興供，植福敬田。（東晉名臣陶[人+品]，字士行。建 旟南海。有漁人每夕見海濱光。因白[人+品]遣尋。俄見金像，淩波趣船。檢背銘，乃阿育王所造文殊菩薩像。昔育王既統此洲，學鬼王制獄，酷毒尤甚。文殊現 處鑊中，火熾水清，生青蓮華。王心感悟。即日毀獄。造八萬四仟塔，建立形像，此其一也。沙門慧遠迎供東林閣上。隋末賊發，一老僧辭像，像曰：爾年老，但 住。時寇入山索金，僧曰無。乃以火炙。曰：僧受炙死，穢臭伽藍，何如寺外？賊將出欲煞。曰：行年七十，不負佛教，待正念申頸，可下刀。賊見申頸，即斫。刀 反刺心，刃出己背。群賊奔走，至遠師墓。時天清朗，忽有雲屯黑下佈，雷電四繞，霹賊六人。由是賊徒不敢入山，瑞像靈應，一何巍巍！）智論：比丘問佛，孫陀 羅難陀出家證果事。佛告比丘：過去毗婆屍佛涅槃後。難陀時為大長者。於辟支佛塔廟中，青黛塗壁，畫作辟支佛像。因發願：世世生尊貴家，身相金色，值佛得 道。從是九十一劫，不墮惡道，天上人中，身體端正，有三十相，豪尊富貴。今日與我同生，出家得道（文）。如是供施辟支佛功德。尚爾，況菩薩像乎！況如來像 乎！犀因玩月紋生角，象被雷驚華入牙。感應之道，物理如然。儻遇福田，毋庸空過。

△

【是國王等，當得三劫為帝釋身，受勝妙樂。】

　　國王等遇塔寺佛像等供，感生帝釋梵王者，如法華，若人於塔廟畫像之文，大師約諸塵供養，明天業，故感帝釋梵王也。中含，比丘白佛：何因緣，名 釋提桓因？佛告比丘：本為人時，沙門婆羅門貧窮睏苦，施以飲食錢財燈明等，以堪能故，名釋提桓因。今既供施佛形像等，則感生無疑。三劫，三小劫也。據因而 感，唯佛能知。受勝妙樂，詳世記經忉利天品。（正法念經雲：三十三天，受五欲樂，喻如金輪王所受之樂，比於天樂，十六分中不及其一。雲雲。）

△

【若能以此佈施福利，回嚮法界，是大國王等，於十劫中，常為大梵天王。】

　　凡修行必回嚮者，如回聲入角，音則大；杯水投海，則不涸；少物上王，得報多。故須回嚮也。有三意：一、回事嚮理。元由理具，方有事用，今回此 心，嚮於實際。二、回自嚮他，昔迷理遍，善嚴自身，今順本性，回嚮眾生。三、回因嚮果，三業毫善，皆成緣了二因，因必顯果，同歸究竟三德。

　　梵名達磨馱都，此雲法界。今回我修嚮法界者，如經雲：竊惟我所修，施等諸善根，皆依法界流，是諸佛所行。准妙玄：即是十法界，體是三諦。以十 數皆依法界。法界外，更無復法。能所合稱，故言十法界。回事嚮理，即真諦空界；十法界皆空故。回自嚮他，即俗諦假界，十法界皆假故。回因嚮果，即中諦中 界，十法界皆中故。故知此十，皆即法界，攝一切法。清涼所謂法界者，一切眾生，身心之本體。空即假中，無一二三，統該萬有，即是一心。故須回嚮法界也。

　　下明感果大國。王等指能施人，以善修佈施，不貪著其事，故施事雖同，而施報有異。由回嚮與不回嚮也。十劫為大梵天者，准阿毗曇論，初梵壽半 劫，梵福樓天壽一劫，大梵劫半。據法苑雲：欲界中壽一劫是小劫，初禪三天壽劫是中劫，二禪已去壽劫是大劫。准此，今之十劫，乃是中劫。展轉色天受梵福也。 大論雲：第一清凈心故，生大梵天。中阿含明四梵福：若有信人，能起偷婆（塔也）者，是初受梵天之福；若有補治故寺者，是第二梵福；若有能和合聖眾者，是第 三梵福；若佛初轉法輪，諸天世人勸請者，是第四梵福。比丘白言：梵天之福，竟為多少？佛言：閻浮裏地眾生所有功德，如是展轉行，從四天下至他化自在天之 福，不如一梵天之福。故知佈施回嚮，與前回別矣。

　　若能了三輪本寂，四相原空，無住生心，生心無住，則與般若相應，能具足檀波。故曰：無不從此法界流，無不還歸此法界，必成佛無疑也。

△

【復次，地藏！若未來世，有諸國王至婆羅門等，遇先佛塔廟，或至經像，毀壞破落。乃能發心修補。】

　　梵名窣堵波，此雲廟。廟者，貌也，仿佛佛菩薩等之形貌也。安（一本作按）塔廟有三意：一錶人勝，二令他信，三為報恩。所以寶塔蘊其光明，精捨 圖其形像。建苦海之舟航，為信根之枝幹，睹則發心，見便忘返，益福生善，惟此為先。今毀壞破落者，因年代日遠，法教衰替，寺像雖立，敬福罕儔，若不修飭， 日就衰羸。故須發心，致誠修補。像法決疑經雲：造新不如修故，作福不如避禍。然欲修造，理須如法；造作雖少，得福無量；若不依法，縱多無益。百緣經載一大 富長者，生兒端正殊妙，為天人愛敬。漸大見佛，得阿羅漢。此因過去毗婆屍佛捨利塔小毀，有童子入塔，見此破處，和顏悅色，集喚眾人，共塗治塔，發願而去。 緣是功德，九十一劫不墮三塗，天上人中，受福無極。今值於我，出家得道。准僧祇律：佛於拘薩羅國遊行，時婆羅門耕，見世尊過，持牛杖柱地禮佛。佛見便笑。 比丘白佛：何因故笑？佛言：是人今禮二佛。禮我杖下有迦葉佛塔。諸比丘願見。佛令從婆羅門索地，與之。佛即現出七寶塔，高一由延，廣半由延。婆羅門見已， 便白佛言：我姓迦葉，是我迦葉土埠，佛於彼處，作迦葉塔。諸比丘白佛：得授泥不？佛言：得授。即說偈言：真金百仟擔，持用行佈施，不如一團泥，敬心治佛 塔。時世尊敬過去佛，便自作禮。比丘亦禮。佛言：人等百仟金，持用行佈施，不如一善心，恭敬禮佛塔。（華手經雲：若見塔廟毀壞，當加修治。若泥若塊，乃至 一磚，終不退轉無上菩提。）故知修補佛塔經像，功德不可思議也。

△

【是國王等，或自營辦，或勸他人，乃至百仟人等，佈施結緣。】

　　國王自修勸人，可謂深知罪福。如佛說自愛經，佛告捨衛國王雲：夫為國王，宜有明導，率民以道，請求來福。王曰：誠如佛教。夫不種栽，無緣獲其 果。故正法念經雲：若有眾生，識於福田。見有佛塔，風雨所壞，若僧房捨。以福德心，塗飾治補，復教他人令治故塔。命終生白身天。其身鮮白，入珊瑚林，與諸 天女，五欲自娛，業盡退還，若生人中，其身鮮白。成論同妙玄雲：第四箜篌天，有十住處。五名白身。簽雲：塔福最多，白為色本。今國王等善業上行，德風下 偃，君民同修十善，自他共報仟生。故知佈施之報，如執燵取物，不爽毫發者也。

△

【是國王等，百仟生中，常為轉輪王身；如是他人同佈施者，百仟生中，常為小國王身。】

　　國王等行施，自合上升；何復報為人王耶。如五道罪福經雲：人而豪貴，國王長者，從禮事三寶中來；為人大富，財物無限，從佈施中來。故知若不於 佛法中修行佈施，終不能獲斯勝報。今由小王而報轉輪聖王；由臣民而轉小國王身。位既高深，福亦崇厚矣。妙玄雲：皆是散心持戒，兼以慈心勸他為福，故報為人 主飛行皇帝，四方歸德，神寶自然應也。釋簽雲：夫輪王者，先行七法：一、給施貧乏，二、敬民孝養，三、四時八節以祭四海，四、時修忍辱，五、六、七、除三 毒，然後沐浴，受齋發誓，神寶自應。大論雲：一切人中，轉輪聖王最為第一。小國王者，如粟散佈四方，總為金輪所統。故能勸者為大王，所勸者為小王。宿行隨 身，福報如影響也。

△

【更能於塔廟前，發回嚮心。如是國王，乃及諸人，盡成佛道。以此果報，無量無邊。】

　　捐資修補塔寺，復回嚮者何？須知上所行者，皆是事施，報感人天，非涅槃因。如達磨大師初到大梁，武帝問曰：朕即位已來，造寺度僧，有何功德？ 磨曰：實無功德。此是人天小果，有漏之因。帝曰：如何是真功德？磨曰：凈智妙圓，體自空寂，如是功德，不於世求。准此深意，必須回事嚮理，方與般若實智相 應。故知修補塔寺，復加回嚮，鹹超三有，盡成五智。以回嚮所感果報，無可測量，靡有邊際。回嚮為大利，蓋謂此也。

△

【復次，地藏！未來世中，有諸國王及婆羅門等，見諸老病及生產婦女，】

　　無常經，佛告諸苾芻：有三種法，於諸世間，是不可愛，是不光澤，是不可念，是不稱意。何者為三？謂老、病、死。若老病死世間無者，如來不出於 世，為諸眾生說所證法，及調伏事。故老病產婦，最是悲田植福處。老則根熟氣喘，飲食須人，老而無子，目為獨夫。西天邠坻首給；東土文王先哀，以其無歸也。 病則百骸酸痛，一命絲懸，若無奉事，待斃奚辭。故我佛誨敕，看病為第一福田。在世之時，自亦巡僧寮看病，以其可憐也。產婦初行分娩，惡露盈身。若不時施飲 食，母子相與俱亡，以其極苦也。故此三類，尤仁人所應動心而周給者也。

△

【若一念間，具大慈心，佈施醫藥、飲食、臥具，使令安樂。】

　　准毗曇論，明時節，合有十二重：第一名剎那，翻為一念。可謂時之最少也。於此具大慈者，約與樂邊論，以樂是一切眾生所愛重故。然既遇悲田，應 生大悲，何言大慈？如大論雲：若說慈，則已說悲、喜、捨。又慈是真無量，慈為如王，余如人民。所以者何？先以慈心，欲令眾生得樂；見有不得樂者，故生悲 心。以慈能具悲，故言大。既言一念，即同體慈也。

　　醫藥等，民生四事，日用急需。病者非藥餌莫療，身命非飲食不立。臥具衾襆綩綖之類，尤是老病產婦之要物。衣服，該臥具中。如是佈施，方使身安 心樂故。大論雲：若人饑渴，給足飲食，感恩則深。佛說施遠行人、遠來人、病人、看病人。風寒眾難時施，是為時施。病者施藥，饑渴與飲食，起少病業因緣，故 得兩腋下滿相，最上味相。好衣服臥具金銀珍寶施，故得金色身相、薄皮相。故知如來相業，鹹從施得也。

△

【如是福利，最不思議。一百劫中，常為凈居天主；二百劫中，常為六欲天主，畢竟成佛，永不墮惡道，乃至百仟生中，耳不聞苦聲。】

　　佈施名福，必得三利，故言福利。最不思議者，軍前曰最，乃前軍第一人。此言不可思議中，第一不思議也。然薩婆多論雲：房捨、臥具、飲食、湯藥 是世間法，非是離世難得之法（文）。今何雲最不思議耶？此由正行施時，一念具大慈心，便是成佛根本。則知生欲色天，先報世樂；畢竟成佛，施福方終。故知最 不思議，正應畢竟成佛句。

　　百劫為凈居天者，大論雲：慈心好修善修福，極遍凈天。三界中遍凈最為樂，故言極遍凈。准此，應在色界三凈天中。今為凈居天主者，何也？以慈 心，是清凈心施故。此中百劫，據大劫說。二百劫為六欲天主者，准大論說：眾生緣慈，是有漏，但緣欲界。故報生六欲天中。言二百劫，據小劫也。問：欲天頻遭 劫火，何能永享六天之福乎？答：准長阿含，三災壞世界，而不壞人。次第修禪，上生色界。欲天既成，又還來，展轉受樂矣。問：同一慈心行施，何乃感報回別 耶？答：行施之時，慈有勝不勝，心有凈不凈，故感欲色兩界不同，壽命長短有異。如大論三十三雲：未離欲佈施。生人中富貴，及六欲天中；若離欲心佈施，生梵 世天。上乃至廣果；若離色心佈施，生無色天中。離三界佈施，為涅槃故，得聲聞道；佈施時厭惡憒鬧、好樂閑靜，得辟支佛；佈施時，起大悲心，欲度一切，第一 甚深畢竟清凈智慧，得成佛道。諸佛法不可思議，隨眾生應度者，作如是說。然仟山勢止嶽邊，萬派聲消海上，正意在畢竟成佛耳。而於行施未成佛間，永不墮三惡 道，常在人天受福，於百仟歲中，耳尚不聞苦聲，況乎身歴惡道。（正法念經雲：若見病睏，余命未盡，施其漿飲，或施其財，以續彼命。命終生深水天，如帝釋快 樂，從天命終，不墮三途，得受人身。從生至生，不遭病苦，無有惱亂。

△

【復次，地藏！若未來世中，有諸國王及婆羅門等，能作如是佈施，獲福無量。更能回嚮，不問多少，畢竟成佛，何況釋梵轉輪之報。】

　　文分二節，初結上施福。更能下，結前回嚮。能作等，猶言佈施不可不作也。如賢愚經，長者須達，共身子捉繩經精捨，身子欣然含笑。達問何笑？ 曰：汝始於此經地，六欲天中宮殿已成，即借道眼，悉見六天嚴凈宮殿。復更徙繩，身子慘然憂色。問何憂色？曰：汝見此地中蟻子耶？（梵名臂卑履也）曰：已 見。身子言：汝於過去毗婆屍佛，亦於此地起立精捨。而此蟻子在此中生。乃至七佛已來，汝皆為佛起立精捨，而此蟻子亦在中生。至今九十一劫，受一種身，不得 解脫，生死長遠，唯福為要，不可不種。此唯人天之福，猶在生死之裏；若不為自求人天福報，盡回嚮法界眾生，則不問施之多少，畢竟成佛矣。何況句，反顯也。 謂佛果尚能克就，況釋梵輪王人天小果有不成就者哉！妙玄四下雲：輪王是人主位，釋梵是天主位。皆約報果明位。果義既有優劣，修因必有淺深。五道罪福經雲： 賢者好佈施，天神自扶將。施一得萬倍，安樂壽命長。今日大佈施，其福不可量。皆當得佛道，度脫於十方。果報不可思議矣。

△

【是故地藏！普勸眾生，當如是學。】

　　當如是者，誡勉進之意。謂必當普勸眾生，當依上來佈施回嚮而學之也。如堅意經，佛告阿難，廣為說佈施，種生死糧。譬如種谷，隨種而生。未有不種而獲果實。種善得福，福自歸身。故敕地藏，普勸眾生應當如是而學之也。較王臣施福竟。

△

【復次，地藏！未來世中，若有善男子、善女人，於佛法中種少善根，毛發沙塵等許，所受福利，不可為喻。】

　　何故於佛法中種少福多？大論雲：雖有種種福田，佛為第一福田，以無量佛法具足。是故獨說植於佛田。佛田能獲無量果報，余者雖言無量，而有差 降。長阿含，佛告究羅檀頭婆羅門，天及世間人，唯佛為最上，欲求大福者，當供養三佛。蓋由眾生於無始世界中，不知於三寶佈施，故皆盡滅。是三寶有無量法， 是故施亦不盡，必得涅槃也。故大經雲：若於佛法僧，供養一香燈，乃至獻一華。生不動國，此即凈土常嚴，不為三災所動。妙樂雲：人天之善，[立+立]可開為 緣因。今經欲收無始微善，鹹趣菩提，若已發心，隨有毫善，莫非緣因。今地藏本願，正開未來毫善得福也。不可喻者，諸佛成就無盡功德，故於中植福，福亦無 盡。大論雲：佛田清凈，拔愛等諸煩惱穢草。凈戒為平地，大慈悲為良美，除諸惡邪堿土。三十七品為溝塍，十力、四無所畏、四無礙智為垣墻，能出生三乘涅槃果 報，植種於此，無上無比田者，其福無盡（文）。故所受福利，不可譬喻也。

△

【復次，地藏！未來世中，若有善男子、善女人，遇佛形像、菩薩形像、辟支佛形像、轉輪王形像，佈施供養，得無量福。常在人天，受勝妙樂。】

　　初標能施人，次明所施田。佈施供養修殊勝之因，常在人天受微妙之果。以佛、菩薩等，教人出苦，是眾生敬田。輪王雖生死未出，其以十善化世，兼 有水土，乃黎氓恩田。故有佈施供養，均得無量之福。大論雲：財為惡心因緣，常應自捨；何況施得大福，而不佈施。慳為兇衰相，為之生憂畏，洗之以施水，則為 生福利。故得福無量也。常在人天等，正得福處。
　　何故經文前後，必說人天受樂。准大論，以人中結使薄，厭心易生；天中智慧利，故二處易得道，余道不爾。復次，言天，則攝一切天，言人，則攝一 切地上生者。何以故？天上則天大，地上則人大，是故前後舉人、天也。一往則在人中天中受樂。究竟指菩提涅槃，覺法寂滅之樂。故光明疏，以人錶三十賢位，天 錶十地聖位，受第一義天之樂。大論雲：人修佈施者，名聞滿十方，智者所愛敬，入眾無所畏，命終生天上，久必得涅槃。是也。

△

【若能回嚮法界，是人福利不可為喻。】

　　大論雲：佛說二種施中，法施為第一。以財施果報有量，法施果報無量。財施欲界報，法施三界報，亦出三界報。若不求名聞財利力勢，但為學佛道弘 大慈悲心，度眾生老病死苦，是名清凈法施。若不爾者，為市易法。復次，菩薩知諸法實相，如涅槃不盡；福德入諸法實相故，而亦不盡。故福利不可為喻也。

△

【復次，地藏！未來世中，若有善男子、善女人，遇大乘經典，或聽聞一偈一句，發殷重心，贊嘆恭敬，佈施供養。是人獲大果報，無量無邊。】

　　遇者，遘也，慶幸之語。以佛法難聞難遇，今此一旦遇之，如饑者之遇王膳，鼓腹而歌；旱苗之遇甘雨，勃然而興，其樂為何如哉！大乘者，即方等諸 經。准起信論有三。一、體大，謂一切法真如平等不增減故。二、相大，謂如來藏具足無量性功德故。三、用大，能生一切世間、出世間善因果故。一切諸佛，本所 乘故；一切菩薩，皆乘此法到如來地故。既為出世大人所乘，名大乘也。

　　聽聞等者，涅槃經雲：聽法因緣，則得近於大般涅槃，以開法眼故。世有三人：一、無目，譬凡夫人，常不聞法。二、一目，譬聲聞，雖暫聽法，其心 不住。三、二目，譬菩薩，專心聽法，如聞而行。以聽法故，得知世間。如是三人，今既聞是章句，信心清凈，則生實相法眼，即使一偈一句，亦復增進菩提。故須 發殷勤尊重之心，贊嘆人法而恭敬之，佈施人法而供養之。故善恭敬經，佛告阿難：若有從他聞一四句偈，或書之竹帛。所有名字，於若幹劫，取彼和尚阿阇黎等， 荷擔肩上，或背負頂戴，常將一切音樂之具，供養是師，尚不能具報師恩。若於和尚所起不敬心，恆說於過。我說愚癡，極受多苦，於當來世，必墮惡道。是故我教 汝等，常行恭敬尊重之心，愛重三寶甚深之法，必獲無量無邊之大果矣。

△

【若能回嚮法界，其福不可為喻。】

　　付法藏經雲：一切眾生，欲出三界生死大海，必假法船方得度脫。法是眾生真善知識，作大利益濟諸苦惱。所以然者，一切眾生，誌性無定，隨所染 習。近善則善，近惡則惡。若近惡友，便造惡業，流轉生死，無有邊際。若近善友，起諸敬心，聽受妙法，必能令離三塗苦惱；由此功德，受最勝樂。如昔婆羅門詣 華氏城，炫賣髑髏。諸優婆塞，即以銅筋穿耳，徹過者多價，半徹者少價，不通者不與直。婆羅門問故。答曰：徹者，此人生時聽法，智慧高勝，相與多價。半者， 雖聽經法，未善分別，故與少直。全不通者，都不聽法，故不與價。持此全徹髑髏，起塔供養，尚得生天；況能至心聽受經法，供養恭敬持經人者，此之福報，實難 窮盡，未來必當成無上道。故佛說堅意經。佛告阿難，其有好心善意之人，聞佛明法，一心而聽，能一日，可；不能一日，半日可；不能半日，一時可；不能一時， 半時可；不能半時，須臾可。其福不可量不可訾也（文）。是故智者，欲得無上安隱快樂，應當至心勤聽經法。今既自聽大乘經典，復更贊嘆恭敬供養大乘人、法， 總回嚮法界，其所得福，當與十方虛空同量，故不可譬喻也。

△

【復次，地藏！若未來世中，有善男子、善女人，遇佛塔寺大乘經典。新者佈施供養瞻禮贊嘆，恭敬合掌，若遇故者，或毀壞者，修補營理。或獨發心，或勸多人同共發心，】

　　大乘經典，即黃卷赤軸寶篋瑯函，若新裝潢者，則當佈施於人供養，令其瞻禮贊嘆恭敬合掌，即名法施也。若遇毀損破壞者，即當修治補完，經營料 理。昔賢雲：或開閉箱篋，蟲蠹朽爛；或挽脫漏偽，紙墨破裂。自不修理，不肯流傳，未免得罪法寶，有違佛制。若不能修治，不可燒化。如五百問雲：戒律不用， 流落，可燒不？答：不得。不知有罪燒，捨墮；若知燒有罪，故燒，犯決斷；與方便破僧同。亦如燒父母。故目得迦雲：諸余葉紙，佛經磨滅，應拭故者，更可書 新。明文昭晰，勿蹈重愆。此明自發心修理，下乃勸人同發，若如是為之，即菩薩人矣。

△

【如是等輩，三十生中，常為諸小國王；檀越之人，常為輪王，還以善法，教化諸小國王。】

　　受勸者，為小王以附化；能勸者，作輪王而統禦。四自侵經雲：能施與者，今世後世長得安隱，為生死糧。世世豪富，皆蒙得安。有佈施者，邊人助 喜，得福無量，況其施主手自斟酌。後世所生，福隨身報，若影隨形，響之應聲矣。檀越者，內傳雲：梵雲陀那缽底，譯為施主。陀那是施，缽底是主。而雲檀越 者，本非正譯。略去那字，取上陀音，轉名為檀。更加越字，意道由行檀捨，自可越度貧窮。妙釋雖然，終乖正本。准大論：檀有多名：世間檀，（凡夫人施。聖人 作有漏心施是。）出世間檀，（聖人雖有漏心施，以結使斷故為出世。）聖人所稱譽檀，（出世凈檀。）聖人所不稱譽檀，（即世間檀。）佛菩薩檀，（知諸法實相 故施。）聲聞檀，（功德不具足，但得少許分。）其間有凈不凈（雲雲）。還以善法教化小國王者，金輪化世，必以同行十善為本。例昔有五王，往來友善。其最大 者，字普安王，習菩薩行；余四小王，常習邪行。大王欲度，呼來上殿，七日娛樂，四王告別。大王憐湣，語小王言：各說所樂悅樂之情。一王願春月樹木榮華遊戲 原野為樂。一王願常作國王，出入行來為樂。一王願婦兒端正，極情快意為樂。一王願父母眷屬，常共美食素琴為樂。大王言：此非久樂！四王言：王樂雲何？大王 言：我樂不生不死，不苦不樂，不饑不渴，不寒不熱，存亡自在，此是我樂。四王言：此樂何處？大王言：吾師號佛，近在祗桓。諸王歡喜，同詣佛所。作禮退坐。 大王跪白：我等今得為人，闇鈍無知，深著世樂，不知罪福。願為我等說其苦諦。佛為廣說八苦。四王聞已。心開意悟，即得須陀洹道。白普安王言：大王真是大權 菩薩，化導我等，令得道跡，大王之恩。我本觀諸宮殿，心情愛著，不能遠離。今睹宮殿，如視穢廁。無可樂者。即捨位付弟，各出家為道。此輪王教化小王之例。 詳如長阿含，金輪王統化四洲以十善也。

△

【復次地藏，未來世中，若有善男子、善女人，於佛法中所種善根，或佈施供養，或修補塔寺，或裝理經典，乃至一毛一塵一沙一渧。】

　　此皆結上之文。然每言佛法中者，蓋奉事余道，不出生死，徒自勤苦，非涅槃故。福田經，佛告天帝：九十六種道中，佛道最尊；九十六種法中，佛法 最真；九十六種僧中，佛僧最政。所以者何？由如來從阿僧祇劫，發願誠諦，殞命積德，誓為眾生。六度四等，眾善普備，得慧成滿。三界天尊，無能及者。其有眾 生，發一敬心嚮如來者，勝獲大仟世界珍寶施矣。是為最尊無上之道，故教善男女等，必須於佛法中種善根也。准大論，有三善根：無貪、無嗔、無癡。一切諸善 法，皆從三善根生增長。今言善根因緣，供養之具，所謂華香燈明，及法供養，持戒誦經等，以善心供養，故名為善根。佈施非即是福，但能破慳貪，開善法門。善 根名為福，故不間毛塵沙渧，[立+立]取乎心。心大則大，心小則小。若心冥法界，即福等虛空。如大論，佛與阿難從捨婆提城乞食。時婆羅門王立制，若與佛食 與語，當罰金錢五百文。佛與阿難空缽而出，見一老婢，持破瓦器盛臭潘澱，（上音番，淅米汁；下音殿，淺水也。猶言米汁不多耳。）出門棄之。見佛空缽，心念 欲施。佛知申缽從乞，婢即凈心施佛。佛語阿難：此婢因施，十五劫中，天上人間，受福快樂，不墮惡道；後得男身，出家成辟支佛。當時，佛邊一婆羅門，即言： 汝是凈飯王之太子，何故為食而作妄語？佛即出舌，覆面上至發際，而語之言：汝頗見如此舌人，作妄語不？彼即生信心。言：我不解小施報多。佛言：汝頗曾見希 有事不？答言：我曾見尼拘陀樹，蔭覆五百乘車。佛問樹種大小？曰：大如芥子三分之一。佛言：誰信汝？彼言實爾。佛言：我見此女，凈心施佛，得大果報，亦如 此樹，因少報多。時婆羅門心開意解，嚮佛懺悔。佛為說法，得須陀洹果。即大唱聲言：一切眾人！甘露門開，如何不出？諸人聞已，皆送五百金錢與王，請佛供 養。王與群臣，亦歸依佛。佛為說法，悉獲道果。故經雲：可以為施，不限多少。是也。

△

【如是善事，但能回嚮法界，是人功德，百仟生中，受上妙樂。】

　　初句，通指已上所修善事，雖有上中下別，既回嚮法界，亦何間於大小。是以百仟生中，修因不替，施福常存，資法身而五果皆常，益慧命而四德鹹 顯。上妙法樂，受用靡窮。如雜藏經：目連見一天女，坐一蓮華上，縱廣百由旬，此華獨妙，殊於余者。所欲資生之具，宮殿飲食，隨念欲得，盡從華出，進止隨 身。目連問言：作何善行，受報如此？答言：迦葉佛滅度後，遺零捨利，諸弟子輩，建七寶塔，高廣四十裏。時我作女人，出見塔佛像，信敬情發，念佛功德，脫頭 上華，奉獻於像。以是因緣故，受報獨妙如此。是則華因小善，得報如斯。其修塔寺，回嚮法界，自應百仟生受上妙樂矣。

△

【如但回嚮自家眷屬，或自身利益；如是之果，即三生受樂，捨一得萬報。】

　　初二句，翻其不能回嚮之心，使福果局限有盡。眷屬者，天性相愛，更相臣順也。才言自家，便不能念及它人，胞與之義乖矣。自家眷屬者，五苦章句 經雲：父子、夫婦、兄弟、家室、知識、奴婢。有五因緣：一怨家，（父子互相殺害）二債主，（父母財，子散用）三償債，（子財供給父母）四本願，（先世發願 善心歡喜）五真友（先世以道，共相承事）。今凡夫之人，罔識來源，不計無常，而反貪愛。言有父母、兄弟、妻子、中外親族。疾病忽至，睏劣著床，曉語親族， 分取吾痛，皆言不能。疾者乃覺，五種親戚，謂當益己，當助汝等勤勞治生，隨時給足。使身隨貪，自縛自侵。憂念九族，妨廢善行，壞亂善心。老病死來，善惡苦 樂，獨自當之，無有代者。未得道者，皆有此念，不能施與守道為德。嗚呼！今世人至死之際，猶復彌留而不察者。如來深為憐湣，故特點逗此言，令人回施。故言 若為眷屬自身，秪得三生受人天福果，福盡還墮。故永嘉雲：住相佈施生天福，猶如仰箭射虛空，勢力若盡還墮地，招得來生不如意。經說：住相佈施，名第三生 怨，正此謂也。捨一得萬報者，如舊雜譬喻經雲：昔捨衛城外，有婦人清信，佛自至門乞食，婦以飯著佛缽中，卻行作禮。佛言：種一生十，種十生百，種百生仟， 種仟生萬，種萬生億，得見諦道。其夫不信，默於後聽佛咒願。夫曰：言何過甚。施一缽飯，乃得爾福，復見諦道。佛言：汝見尼拘陀樹，高幾許耶？答：高四五 裏，歲下數萬斛。問：其核大小？答如芥子。佛言：汝語過甚。何有種一芥子，乃高四五裏，下數十萬子。答：實如是。佛言：地是無知，其報力尚爾，何況人是有 情歡喜，以一缽飯上佛其福甚大。夫婦心開意解，即得須陀洹道。此出如來金口，寧不信耶！然以未回法界得果，秪三生與萬報耳。正較竟。

△

【是故地藏！佈施因緣，其事如是。】

　　此結示因果，總嘆不盡，以完地藏較量業道施福之問。故總指王臣男女等所修之因，所得之果。故雲：其事如是。無奈世人信者，施不盡力；不信者， 全不能行。今舉事證之，譬喻經說：昔有二比丘，俱得須陀洹果。一人常行教化乞丐，以用作福。一人但直坐禪自守，不樂作福。語乞者言：何不坐禪，空自勤苦？ 修福者言：佛常說比丘當行佈施。後俱命終。生長者家。作福者為長者子，奴婢承給，衣食自然，快樂無極。坐禪者，生為婢子，在地獨坐，饑渴啼哭。俱知宿命。 時長子語婢子言：我本語汝，當佈施，不肯用語，是汝自過，何為啼哭？後時俱求出家，皆得阿羅漢。長者子常直端坐，人皆競送衣食來與。其婢子者，在外乞求， 人無與者，常受饑渴。以是因緣，行道之人，不但持戒禪誦，亦當佈施作福。大愛道經雲：今世滅罪，後世得申。有財不施，世世受貧。故入道必以智慧為本，智慧 必以福德為基。譬之鳥備二翼，鰷舉萬尋；車足兩輪，一馳仟裏。緣了之資成正因，事度之助開佛性，不可不信也。正說竟。

△

【地神護法品第十一】

△

【爾時，堅牢地神白佛言：世尊！我從昔來，瞻視頂禮無量菩薩摩訶薩，皆是大不可思議神通智慧，廣度眾生。】

　　爾時者，說四章方竟時也。梵名涅哩鋤，此翻堅牢。有二義：一約事，取力能承載發生，資益地味，養育萬民，安立群品。二約法，以智度法門，常無 改變。常也，能荷山川；樂也，能生萬物；凈也，地力自在；我也，具此四德，稱神。（禹貢言底績者皆地耳，覃懷底績是也。）以具事、法二義，故名堅牢地神。 問：地神男耶？女耶？答：女神也。准長阿含二十，佛告比丘：有四大天神：一地神，二水神，三風神，四火神。昔者地神惡見，言地中無水火風。佛言：地中有水 火風，但地大多故，地大得名。次第說法，地神歡喜。佛為說四諦，地神即遠塵離垢，得法眼凈。白言：我今歸依佛法僧，盡形壽不殺，乃至不飲酒。聽我於正法中 為優婆夷。水火風神亦然。故知是女神也。釋題中以坤母配夫主幹父，非臆說歟。

　　白佛者，意道弘經必藉地，轉法須賴食；地固由我主之，食亦由我生之。若吾不護持，其何以流通哉。故於天宮大會之前，無量地神之內，毅然任護法 之重擔。故越班而陳白也。先標我從昔來，顯已發心，匪朝伊夕。瞻視頂禮等，顯所值聖流之多，皆非聊爾之人。大不可思議，神智之褒美；通慧乃度生器具，即三 密妙輪。如散脂大將雲：我現見不可思議智境。光疏雲：若境可以智知，可以口說者，境則非密；不可智知，不可識識，不可名，不可說，是名不可思議密境。今諸 菩薩皆以三密廣度眾生，故皆是大不可思議之通慧也。

△

【是地藏菩薩摩訶薩，於諸菩薩，誓願深重。世尊！是地藏菩薩，於閻浮提有大因緣。】

　　總標地藏誓願，偏與閻浮有緣。皆在下文。

△

【如文殊、普賢、觀音、彌勒，亦化百仟身形，度於六道，其願尚有畢竟。】

　　文殊、普賢、彌勒如前，觀音如後。准十輪經，除文殊、普賢、觀音等諸大菩薩，余皆不及地藏。今地神併謂文殊等悉遜一籌，非謂功德有優劣，正以 誓願有畢竟不畢竟耳。亦化等，如大論雲：遍吉菩薩一一毛孔，常出諸佛世界，及諸佛菩薩，遍滿十方，以化眾生。文殊分身變化，入五道中，或作聲聞、緣覺，或 作佛身。如首楞嚴三昧經中說：文殊過去作龍種尊佛。七十二億，作辟支迦佛。（文殊師利般涅槃經，佛告跋陀羅曰：此文殊師利，有大慈悲。生於此國多羅聚落， 梵德婆羅門家。生時宅化蓮華，從母右脅出，身紫金色，墮地能語。寶蓋隨覆。於佛所出家，住首楞嚴定。佛涅槃後四百五十歲，當至雪山，為五百仙人宣揚十二部 經。化令住不退已，至本生空野澤，尼拘樓陀樹下，入首楞嚴三昧。毛孔出金色光，遍照十方世界，度有緣者。身如紫金山，正長丈六，圓光嚴顯，面各一尋。圓光 內五百化佛。一一化佛，有五化菩薩，以為侍者。是文殊師利，有無量神通變現，不可具說。
　　又五臺辯聰入京，有老僧附書，使於城北尋勃荷投之。既至廣慈河側，聞小兒呼勃荷。以書投之。急食，忽人立而化。始知老僧為文殊。勃荷乃普賢 也。此屠者趙氏，所畜十五年矣。唯食勃荷，故名。寒山、拾得其類也。）觀音，如普門品三十二應，及諸傳記，所載尤多。彌勒，如傅大士、佈袋僧之類，此據近 者言耳。（慧上菩薩經雲：昔拘樓秦佛時，有比丘名無垢，閑居山窟。近有五神仙。有一女人，遇雨入窟，雨晴出去。五仙見之，各言比丘奸穢。無垢聞之，即踴身 虛空。五仙投地伏罪，即是慈氏。）以諸大士應現無方。故總雲，亦化百仟身形等，然其願念，皆有盡時，非不畢竟也者。

△

【是地藏菩薩，教化六道一切眾生，所發誓願劫數，如仟百億恆河沙。】

　　如前

△

【世尊！我觀未來及現在眾生，於所住處，於南方清潔之地，以土石竹木，作其龕室。是中能塑畫，乃至金銀銅鐵作地藏形像，燒香供養，瞻禮贊嘆。】

　　真智靡方，不局東西南北；法身無像，豈假銅鐵金銀。然地乃供像之所，像為起敬之門。被俗之儀，不壞假名談實相；闡性之法，必由假相悟真容。故 依處而作相也。然言於所住處，亦地神據跡之言。若論其本，何所論處？四智無以辯其端，五眼罔能窺其奧。如十輪經，好疑問菩薩白佛言：此善男子，從何而來？ 所居佛國，去此遠近。佛言：如是大士，隨所止住諸佛國土，隨所安住諸三摩地（雲雲）。據此，豈局一方一處耶！今言南方作室者，按起世經，當閻浮洲南二鐵圍 山外，有閻摩王宮殿住處。地藏偏現身地獄，作幽冥教主。故就垂形之處，作室於南。即大集會中，從南方世界，現香雨華雲而來之意。蓋以午為中道，離為南方， 為正、為日、為明麗。離中虛故明，像諸法空，則智日當陽，遍照天下。故據跡處作室供像，正令人人出坎陷之幽途，升離明之陽地，以陰主死而陽主生也。清潔地 者，准密部諸儀作壇法，必須穿去穢土，取下凈土，於空閑幽林，或河邊凈地，作之方稱如法。故今亦雲：於清潔地。龕，（枯含切）龍窟也，從合，取蟄而坯戶之 意，靜之極也。夫龍為陽之精，天道之變化備矣。陽首潛龍乃以不見成德，何哉？正見天道渾渾，無聲無臭。龍潛弗潛，混沌穿漏，庶以見現而不現，隱而不隱，會 陰陽而一致，泯修性以同源，斯即諦觀不別，絕學之法門也。余如文。

△

【是人居處，即得十種利益：】

　　此顯人尊處勝。蓋既聞地藏菩薩不思議誓願威神，即能信解，而復作室塑像供養禮贊。初則一念信解，次則兼行六度。既是尊重弟子住處。隨所住地，[立+立]名吉祥。故每萃休徵，有十種利益也。

△

【何等為十？一者、土地豐壞（編者註：「壞」字疑為「壤」字之誤，又一本作「穰」），二者、家宅永安，三者、先亡生天，四者、現存益壽，五者、所求遂意，六者、無水火災，七者、虛耗辟除，八者、杜絕惡夢，九者、出入神護，十者、多遇聖因。】

　　初句徵，一者下，列次第相生，則有十利。首相（「相」一本作「標」）土地，以立其居；次明家宅，以安其身。乃至鬼神護助，以終遇聖因。豐壤 者。豐，盛大也。豐則祭當備物，故取豆大而滿為豐，從蠟（孚容切，生意滿盈也）盛而又盛也。按禹貢，厥土惟白壤。註雲：無塊柔土曰壤。白以見其色之純，壤 以見其性之美。周官大司徒，辯十有二壤之物，而知其種，以教稼穡樹藝。然辯土宜有二：以色，以性。大[既/木]五色好土，皆種藝豐壤。如雲：厥土黑墳，厥 土赤墳等。故周禮地官註壤赤土。以萬物自生則言土，以人所耕藝則曰壤。壤，和綏也。逸雅訓瀼，取肥濡之意。世記經雲：閻浮提所有國，名曰沃壤豐樂，多出珍 寶，林水清凈是也。（准長阿含閻浮提地南狹北廣，縱廣七仟由旬，人面像此地形。）既得豐壤之土地，則家宅可永安矣。家從宀從[字-子]從[眾-四]（眾 字）則父子兄弟夫婦同室而和樂矣。宅從[字-子]從乇，（托字）則擇吉托處，休徵著而災青殄矣。生者既安，福資祖禰，（音妳）亦蒙善業，[立+立]得生 天。先亡尚爾，況作室嚴像乎。例如金光明雲：若有眾生，為供養經典故，莊嚴屋宅，乃至張懸一幡一蓋，及以一衣。欲界六天已有自然七寶宮殿，是人命終，即得 生彼。各各自然有七天女，共相娛樂，日夜常受不可思議微妙快樂。今亦雲然，不惟先亡生天，亦使現在益壽。光明雲：閻浮提內藥草樹木根莖枝葉華果滋茂，美色 香味，皆悉具足。眾生食已，增長壽、色、力、辯、安。六情諸根，具足通利。是也。既有壽已，而諸事不諧，曷足貴乎。今凡所祈求，莫不遂意。從誌曰遂，亦稱 也。所謂隨意所用，受於快樂，種種飲食衣服臥具、宮殿屋宅、樹木林苑、河池井泉，悉皆具足，無不遂意是也。遂意在內，災祥在外。若所謂水火者，民生不可一 日闕者也。蓋水流濕，潤乎萬物。故居北方坎位。火就燥，熯乎萬物，故居南方離位。水火既濟，則萬物生成；儻火水不時，則萬物焦爛。何況商羊現舞，回祿潛 臨，則災禍非淺矣。（按白澤圖，火之精，名必方，狀如鳥。一足，以其名呼之，則去。水之精，名罔象，狀如小兒，赤目黑色，大耳長爪。以索縛之，則可得烹 之，吉。）內外雖獲安寧，又須辟除虛耗。耗，說文雲：稻屬。呂氏春秋雲：飯之美者，玄山之木，南海之耗，是也。若荀子雲：多而亂曰耗，則是減損虛耗。董仲 舒策雲：察天下之息耗，是也。（註：息，生也；耗，虛也。俗謂正月十六日為耗磨日。官司不開倉庫。）光明雲：若此國土，有諸衰耗，種種艱難，以我等力故， 令如是種種百仟衰耗之事，悉皆滅盡。是也。

　　晝既諸緣順適，夜須眠夢安祥。今百凡惡夢，如木之根皮，杜塞而不申；如麻之頭緒，斷絕而不續也。日居月諸，坐享貞吉；晝出夜入，尤望安寧。今 修福善，出入神護。光明雲：我等四王二十八部諸鬼神等，及無量百仟鬼神，以凈天眼，過於人眼，常觀擁護此閻浮提。是也。已上九種，皆世間利益；第十聖因， 乃出世利益。聖，正也。乃出世正聖之修因也。如聞法悟道、修齋、佈施、塑像、修塔、補治經像之類。涅槃經雲：善知識者，令人漸遠惡法，增長善法，本未有 定、慧、解脫、解脫知見，即便有之；未具足者，則得增廣。如是聖因，恆多值遇。若不因修供大士，曷克臻此十利乎。

△

【世尊！未來世中，及現在眾生，若能於所住處方面，作如是供養，得如是利益。】

　　通結修因得益二文。十輪經雲：善男子，假使有人於其彌勒，及妙吉祥，併觀自在、普賢之類，而為上首，殑伽沙等諸大菩薩所，於百劫中，至心歸 依，稱名念誦，禮拜供養，求諸所願。不如有人，於一食頃，至心歸依地藏菩薩。令諸有情所願滿足，如如意寶，亦如伏藏。如是大士，為欲成熟諸有情故，久修堅 固大願大悲，勇猛精進，過諸菩薩。是故汝等應當供養。偈曰：假使百劫中，贊說其功德，猶尚不能盡，故皆當供養。所以供養者，得如是之利益故也。

△

【復白佛言：世尊！未來世中，若有善男子、善女人，於所住處，有此經典，及菩薩像。是人更能轉讀經典，供養菩薩。我常日夜以本神力，衛護是人。乃至水火盜賊大橫小橫，一切惡事，悉皆消滅。】

　　初明經像住處。次明力護滅惡。此見地神護法之心，與光明會上發願護經同。彼雲：若隨是經典所流佈處，我當在中，常作宿衛。是也。水火銷滅，即 上六七八三事。大橫，如藥師經，九橫死。小橫，如九橫經。一切惡事，如光明所謂，以是經故，惡夢蠱道、五星諸宿、變異災禍、一切惡事，消滅無余。無量鬼神 及諸大士，晝夜精勤，擁護四方，令無災禍，永離諸苦，應心適意，隨其所樂。豈非惡事銷而善事萃，災橫滅而禎詳集者乎！世有不信之人，謂是誘進之語。豈不聞 積善之家，必有余慶；積不善之家，必有余殃。又不聞，出言善，仟裏之外應之；出言不善，仟裏之外違之。言行乃君子之樞機，動天地，感鬼神，得不敬且慎乎。

△

【佛告堅牢地神：汝大神力，諸神少及。】

　　大神力，即指下文。諸神，即是同類。如善財參安住地神時，百萬地神，各放光明。謂此等地神僉不及爾之神力也。

△

【何以故？閻浮土地，悉蒙汝護。乃至草木沙石稻麻竹葦谷米寶貝，從地而有，皆因汝力。】

　　初二句總釋，乃至下，別釋。光明會上，地神自言。而此大地，深十六萬八仟由旬，從金剛際，至海地上。悉得眾味增長具足，豐壤肥濃，過於今日。 草木等，然世界初成之後，草木稻麻等種子，從何而有？准長阿含，有大亂風，從不敗世間吹種子來生此國。一根子，二莖子，三節子，四疐（音帝與蒂同。棗李曰 疐之。）中子，五子子。是為五子。固因地神威力，亦由眾生業感。准業報差別經雲：復有十業，能令眾生得外惡報。若有眾生，於十不善業多修習故，感諸外物， 悉不具足（雲雲）。若修十善業，與上相違。此因眾生惡業熾盛，以致地神不護，滅損萬物。若多修德，增其威力，萬物加美。故地神雲：是金光明，若廣說時，我 及眷屬，所得功德，倍過於常。增長身力，心進勇銳。世尊！我服甘露無上法味已，閻浮提地豐壤倍常。如此大地，眾生所依，悉能增長一切所須之物。令諸眾生， 隨意所用，受於快樂。今故贊雲：閻浮土地，乃至寶貝，凡是地所有者，皆因汝力而致之也。（貝，海介也。其物甚瑣，其質天然有文。背穹而渾，天之陽也；腹乎 而開，地之陰也。象其腹行。古之民也樸，貨貝而寶龜。故制字從貝為母，一聽民便。後世始鑄泉，泉行而具廢，權歸於君矣，然於利民用。攏又下衰，造楮以厲 民，終莫之能行也。）

△

【又常稱揚地藏菩薩利益之事，汝之功德，及以神通，百仟倍於常分地神。】

　　稱揚贊嘆，乃普賢十願中第二門。蓋一念稱揚，萬德自具。故諸佛子凡來法會，初見久聞，宣流梵唄。今地神不惟能主閻浮提物，復更贊揚地藏利益之 事，則為護法地神，其福業慧業，自然深廣；功德神通，亦叵思議。較余地神超過萬倍。何也？良由大士威德神通，不可思議。譬之諸天甘露，不問貴賤長幼，若有 嘗者，無不長生而不死也者。

△

【若未來世中，有善男子、善女人，供養菩薩，及轉讀是經。但依地藏本願經一事修行者，】

　　初明人法。但依下，令專修。即制心一處，無事不辦也。梵語膩地，此雲依。依，憑也。憑此經功，出離苦海也。涅槃明四依，此即依了義經，不依不 了義經之指。古語雲：仟羊之皮，不如一狐之腋。故知眾典不及此經。以人有思議、不思議；經有開顯、未開顯。今專讀不思議、開顯之經，罪頓消而功速成，何事 多求，雜亂心誌。此即南嶽有相安樂行也。言修行者，謂如說而行。若聞而不行，如說食數寶，何濟饑貧。諺雲：說得一丈，不如行得一寸，是真實訓世語耳。

△

【汝以本神力而擁護之，勿令一切災害及不如意事，輒聞於耳，何況令受。】

　　敕地神擁護者，以此善信，若佛現在，足稱四信。今於滅後，可當五品。以讀經是第二品，供養乃第四兼行六度品。始由一念信解，以至深信觀成。當 知五品觀行為如佛，故令擁護也。本神力者，約事，指主地為本；約法，指四德為本。由此本故，神力倍余擁護者。如光明堅牢白佛言：說法比丘，坐法座時，我常 晝夜衛護不離。隱蔽其形，在法座下，頂戴其足。一切災害等，所謂我等諸王，及諸鬼神既捨離已，其國當有種種災異，彗星現怪，流星崩落，五星失度，兩日 [立+立]現，日月薄蝕，惡虹數現，大地震動，暴風惡雨。此災既起，侵害人民。故雲災害。又雲，谷米湧貴，饑饉凍餓，怨賊侵掠，人民多苦。其地無有可愛樂 處，此不如意事也。今既供像讀經，唯依本願修行，此等災害不如意事，尚不輒聞於耳，況眼見身受耶。

△

【非但汝獨護是人故，亦有釋梵眷屬、諸天眷屬，擁護是人。】

　　初句謂不但汝地神獨護。若果如上修為，亦有梵釋諸天眷屬皆來擁護矣。如四天王白佛言：是人若得聞是經典，能得未來現在種種無量功德，我當隱 蔽，不現其身，為聽法故，當至所止講法之處。大梵天王、釋提桓因、大辯天神、功德尊天、散脂鬼神，大將軍等，二十八部鬼神大將，摩醯首羅，摩尼跋陀鬼神大 將；鬼子母，及五百鬼子，無量百仟萬億那由他鬼神諸天，如是等眾，為聽法故，悉自隱蔽，不現其身，至是人所止講法之處。金光明、方等圓經，天龍神鬼，擁護 若斯，況今開顯最上之典，其梵釋天等擁護之力，奚俟更言哉！

△

【何故得如是聖賢擁護？皆由瞻禮地藏形像，及轉讀是本願經故，自然畢竟出離苦海，證涅槃樂。以是之故，得大擁護。】

　　初句徵，聖謂真正，賢名善直。又主者名聖，眷屬名賢。以正直者為天為神耳。皆由下，釋。釋中三意：初二句，正釋意；自然二句，示獲益。言苦海 者，准長阿含，四大海水鹹苦，有三因緣。一、有自然雲，遍滿虛空，至光音天，周遍降雨，洗濯天宮，滌蕩天下，從梵迦夷天宮，乃至八萬天下諸山，須彌山王， 皆洗濯滌蕩，其中穢惡鹹苦，諸不凈汁，下流入海，合為一味。二、昔有大仙人，禁咒海水，長使鹹苦，人不得飲。三、雜眾生居，其身長大，或百由旬，至七百由 旬。呼覲吐納，大小便中，故海水鹹苦。今指業海，苦有萬端；既由禮讀，出離無難。言自然，則不加勉強。說畢竟，則到底不虛。是故行者應當至心。若至心者， 所求必獲，出苦證樂，此正教主天宮付囑之心，亦地藏幽途化人之念。切在專行，因果不爽如毛發者也。以是二句，結護意如文。

△

【見聞利益品第十二】

△

【爾時，世尊從頂門上，放百仟萬億大毫相光：】

　　自爾時至告諸大眾，皆經家所敘之文。恰於地神護法品後放光者，為證前起後，令諸眾生睹相悟心，各各自知一段不思議本有之常光也。從頂二句，總 標。梵名烏瑟膩沙，此雲佛頂。而言門者，禪秘要經雲：人身三分，臍為中原，頭為殿堂，頂為天門，故曰頂門。蓋頭為一身之主，頂乃一首之尊。故大論，阿私仙 人雲：頭中頂相，無能見上，若天若人，無有勝者。錶一切種智，超因極果也。門有能通、當體二義。由此地藏妙像嘉名，瞻禮稱念，而進於極果者，能通之功也； 此頂人人本具，略不假借。則六道與地藏，總是一身；眾生與如來，原非兩體。當下即是，奚假從門而入。當體之意也。上者，從頂放光，錶自極智體上，起此大光 明用。其體原一，生佛同具故。而用不一，隨機施設故。此即一念三仟至理，互具互遍，故有百仟萬億大毫相光，即錶三德。大即法身，以遍滿故。毫相即解脫，外 實內空故。光即般若，照了萬法故。身大故，毫光亦大；毫空故，大光亦空；光照故，大毫亦照。三一不相離，一三非可混。不[立+立]別縱橫，生佛同具證。既 總標已，下別明之。

【所謂白毫相光、大白毫相光、瑞毫相光、大瑞毫相光、玉毫相光、大玉毫相光、紫毫相光、大紫毫相光、青毫相光、大青毫相光、碧毫相光、大碧毫相 光、紅毫相光、大紅毫相光、綠毫相光、大綠毫相光、金毫相光、大金毫相光、慶雲毫相光、大慶雲毫相光、仟輪毫光、大仟輪毫光、寶輪毫光、大寶輪毫光、日輪 毫光、大日輪毫光、月輪毫光、大月輪毫光、宮殿毫光、大宮殿毫光、海雲毫光、大海雲毫光。】

　　毫相是一，即用之體。光色不同，即體之用。法華文句：以五色譬五道，青譬地獄因果，黃譬餓鬼，赤譬畜生，白譬人天，（修羅分屬四趣，仍闕黑 色）小色像譬二乘，大色像譬通菩薩，短色像譬別菩薩，長色像譬佛因果。諸文開合隨意，正法念，加長短等；此由法華九界同歸，三乘鹹會，故文句作此引用。今 就地藏偏哀六道三塗故，且譬五道，事有專屬耳。

　　白毫相光，三十二相之一。梵語叔離，此雲白色，西方正色也。白乃本質，居眾色之先。白可受彩，起諸光之色。攬而可識曰相，熾然如焰曰光。大輪 雲：白毫眉間峙，白光逾琉璃。在因行佈施時，適可前人意，起自在業因緣，又咨嗟歌誦閑居之德，故有眉間白毫。外具八楞，中空右旋。三十二相功德，增為仟 倍，乃成額上白毫相。一仟毫相功德，增為百倍，乃成一頂骨相。是故如來，最為尊勝。今從極頂放毫相光，全彰不思議事也。言大者，較前尤為勝妙。下仿此。

　　瑞毫相光。以玉為信曰瑞，又祥瑞也。天以人君有德，將錫之歴年，钖之五福，先出此為信。今錶六道，乘地藏力，三塗清升，人天成佛，故現此祥瑞之毫光也。
　　玉毫相光，玉乃天地精英，具溫潤之德，（文賦山有玉而增潤）琢磨可能成器。此錶五道，離火宅之燥，增性山之潤，出三塗之非器，入四聖之瑚璉也。

　　紫毫相光，梵名羅差，或勒叉，此雲紫色。乃黑赤之間色，以錶雜類眾生獲益。止觀雲：眾生稟益不同，或雜益、不雜益是也。

　　青毫相光，梵名尼羅，此雲青色。東方屬木，由水而生，似黑而淺，色則揚矣。以錶地獄黑業，由之生氣滿盈，發菩提樹之枝柯矣。

　　碧毫相光，說文謂石之青美。增韻雲：深青色。此錶地獄中利根。如調達在獄，樂如三禪。阇王入拍[毛@匊]地獄，暫入即出之類。

　　紅毫相光，梵名阿盧那，此雲赤色。南方屬火，氣盛而明，從大火為意。但視紅微晦，故特言紅。紅從糸、從工，乃女工紡績織纴功力也。此錶畜生，由聞名見像，即發心加行。所迷正因，由之而顯，同紅字之功力矣。

　　綠毫相光，綠，瀏也。泉水上視，瀏然綠色，是青黃之間色；總錶獄鬼同入法流也。
　　金毫相光，梵名伊尼延，此雲金色。金有五色，黃金為長，久埋不變，百陶不輕。以錶餓鬼雖久埋惡趣，而佛性不失，中道藏開，頓離枵虛也。
　　慶雲毫相光，西京雜記雲：瑞雲，曰慶雲，曰景雲。雲五色曰慶，或曰卿。此錶離五住煩惱，顯五分法身之祥徵也。
　　仟輪毫光，此下輪光，較散光尤勝。蓋錶說圓法，被圓根，入圓門，獲圓益。故十輪雲：輪者，如滿月光，清涼無礙，遍諸虛空，照觸一切，無障境 界。逸雅訓綸言：彌綸周匝也。精蕰雲：車所由以運轉者，以其形圓也。而其妙，尤在中虛矣。言仟者，仟輻之轂（一本作「輪」），錶六道一念仟如，至此顯著， 圓轉無礙也。

　　寶輪毫光，與上同，此重寶字。如契經雲：若剎帝利種，紹灌頂位。於十五日，齋沐升殿。東方忽有金輪寶現，其輪仟輻，具足轂輞，舒妙光明，來應王所，定是金輪王。此錶五道具圓根者，蒙地藏以法水灌頂，超入圓嚮金輪，將紹法王之位也。其間或入鐵輪，乃至摩尼輪，不可定判。

　　日輪毫光，現日天子宮殿也。日，實也。光明盛實，錶菩薩智光無私照也。大論雲：如日天子，憐湣眾生，與七寶宮殿俱，繞四天下。從初至終，常不 懈息。日光普照，無憎無愛，隨其高下深淺悉照。菩薩亦如是，從初發心，為度眾生，無有懈息。出於世間，住五神通，處於虛空，放智慧光明，滅邪見戲論。譬如 朝露，見日則消。是也。

　　月輪毫光，現月天子宮殿也。月，缺也。滿則缺也。此錶大士具智斷二德，故能除五道熱惱，益四眾清涼。然此二輪，正錶大士權實二智，照理鑒機也。

　　宮殿毫光，光現宮殿也。釋宮如題。殿，乃堂之高大者，具岧峣高聳之奇，昭輪奐周明之美。錶三塗超出人天，顯五道同歸佛果。故現高顯之相也。

　　海雲毫光，以光雲遍覆，如海無垠。此錶生佛一如，依正不二；染凈同源，苦樂無異。如海莫測邊涯，如雲原無分別。故知情生分別，法法條然，智入一無，事事平等，終於海雲，良有以也。

△

【於頂門上，放如是等毫相光已，出微妙音，告諸大眾天龍八部人非人等，聽我今日於忉利天宮，稱揚贊嘆地藏菩薩於人天中利益等事，不思議事，超聖因事，證十地事，畢竟不退阿耨多羅三藐三菩提事。】

　　初二句，結前，出微下，正告。如是者，指嘆之詞，以佛頂毫光，勝妙第一。故指而嘆言，有如是耶？然如名不異，是曰無非。則生佛同由實相，是非 [立+立]契真如。此我佛付囑之本心，亦大士領命之初意。凈穢總入一光，依正同成一色。故經家敘出不思議境，而嘆言如是。故知最初放光，錶極聖三密，而說 法為要，故光從口出。此錶六道克就圓因，將趣極果，而證入為要，故光從頂放。光相似同，意各有攸歸也。大眾是總，天龍等是別，皆所告之機。聽我者，不惟事 關深遠，化涉始終，且又囑人天於未來，絕不類尋常之小事。必須專心承聽，方曉叵量威神。於人天下，結嘆四章。利益等事，結名章；以稱名讀經，人天俱解脫 故。不思議事，結體章；然體屬理，今何指事，當知始終所依，迷悟[立+立]具，即理之事，故獨當不思議事。超聖二句，結宗章；宗必因果同成故。不退菩提， 結用章；地藏巧施方便，為令成就菩提。
若准法華四：一、初句嘆教一，設教被機，人天得益故。次句嘆理一，[立+立]由理具，方有事用故。三、四二句，嘆行一行必超因，能證果故。第五 句，嘆人一，既得畢竟菩提，世出世間，第一人故。皆言事者，與法華如來為一大事因緣故，出現於世同。蓋世出世間，內外善惡，大小聖凡，無一不事事者，但作 用不同。譬之琴瑟箜篌，音韻似一，吹彈者異耳。然觀結嘆文意，似都指後，何也？蓋由觀音所問之事，與前[迦-加+嚮]異。特顯四章之妙，通貫前後；以後形 前，愈彰深致，不可以前劣後優，隨文失指也。

△

【說是語時。會中有一菩薩摩訶薩，名觀世音。從座而起，胡跪合掌。】

　　此見賓主擊揚之妙契，師弟敲唱之相應。世尊所以對眾而結嘆，意啟觀音乘贊而躡問。故佛說是語時，觀音即起白佛，啐啄同時，斯之謂矣。西音名阿 那婆婁吉低輸，此雲觀世音。觀是能觀之智，以三智照正性，察本末也。世音是所觀之境，萬像隔別，類音殊唱，菩薩弘慈，俱令脫苦。境智合標，名觀世音。 （[禾+末]羅矩咤國，印度最南海濱，此南大海中，名補陀落迦山，有石天宮，觀自在菩薩常住處。）

△

【白佛言：世尊！是地藏菩薩摩訶薩，具大慈悲，憐湣罪苦眾生，於仟萬億世界，化仟萬億身，所有功德及不思議威神之力。】

　　世尊欲稱揚眾事，觀音接口便問其由，則知所問所答者，皆不外乎是矣。然必假觀音者，以誌同道合，均與閻浮提有大因緣也。如贊地藏具大慈悲，乃 至不思議神力，此亦觀音之實事耳。准悲華經：乃過去無諍念王，第一太子，名曰不眴。受寶海梵誌所勸，遂發弘誓。故寶藏佛言：汝觀天人及三惡道一切眾生，生 大悲心，欲斷眾生諸苦惱故，欲斷眾生諸煩惱故，欲令眾生住安樂故，今當字汝為觀世音。汝行菩薩道時，已有百仟無量億那由他眾生，得離苦惱。汝為菩薩時，已 能大作佛事（雲雲）。以其德業相齊，方能發起，故假大士承機申請也。

△

【我聞世尊與十方無量諸佛，異口同音，贊嘆地藏菩薩雲：正使過去現在未來諸佛，說其功德，猶不能盡。】

　　諸佛同贊之言，有意無文。其意有二：遠則指佛在伽羅帝耶山諸牟尼仙所依處大集會上，廣為贊嘆，一也。近則指佛在忉利天宮，十方諸佛同集，分身 地藏偕臨。正當釋迦贊地藏眾事之時，安知諸佛不同贊乎。二也。何故正使三世諸佛，說其功德猶不盡耶？以地藏行山，高逾須彌；願海深過溟壑。況智慧神通，皆 不思議，奚能稱量耶！

△

【嚮者又蒙世尊，普告大眾，欲稱揚地藏利益等事。】

　　嚮者之指，亦有遠近。遠指贊嘆品初之文，近指放光後告眾之事。

△

【唯願世尊，為現在未來一切眾生，稱揚地藏不思議事，令天龍八部瞻禮獲福。】

　　此明稱揚地藏之意，正為天龍八部，瞻禮獲福耳。良由一切眾生，妄著我人，惰慢成性，封迷纍劫，不識三尊。愚蠢沿流，罕逢十聖。寧知命如風燭， 難可駐留。形同石火，豈容長久。況復五濁交侵，四蛇常逼。不禮三寶，難越四流。是故行者常須作意，不得自墮。恐無常忽至，瞻禮無門。譬鼠入角，路窮何趣。 故佛偈雲：命如風中燈，不知滅時節，今日復明日，不覺死輪至。冥冥從業緣，不知生何道？況瞻禮佛菩薩時，則滅無量生死之罪，而集百仟善緣之福。如增一阿含 雲：禮佛有五功德：一端正，二得妙聲，三多饒財，四生處高貴，五生天上。故使人天瞻禮地藏，自然獲福矣。

△

【佛告觀世音菩薩：汝於娑婆世界，有大因緣，若天若龍，若男若女，若神若鬼，乃至六道罪苦眾生，聞汝名者，見汝形者，戀慕汝者，贊嘆汝者，是諸眾生，於無上道，必不退轉，常生人天，具受妙樂，因果將熟，遇佛授記。】

　　初總贊。若天下，別贊。標娑婆有緣，乃機感偏宜。然大士化緣，無剎不現也。大因緣者，謂生起助成，有不思議極大之功。止觀雲：善知識者，是大 因緣。所謂化導令得見佛。如無盡意問雲：以何因緣，名觀世音？佛以七難二求，答出其事。別行疏雲：因緣甚多，略言境智。若就眾生，則以善惡兩機為因，聖人 靈智慈悲為緣。若就聖人，觀智慈悲為因，眾生機感為緣。此即因聖緣凡，因凡緣聖，大[既/木]不出四悉檀（雲雲）。別贊中，以三雙六只之機，及六道罪福之 感，以顯大因緣也。天、龍，上下一對；男、女，內外一對；神、鬼，幽顯一對。略其中間剎帝利、婆羅門、及出家、在家二眾、聲聞、緣覺、菩薩，故雲乃至，然 偏舉天龍等，以皆有生老病死也。聞名等，即普門品聞名及見身，能滅諸有苦。是戀慕者，以大士威神具大悲施無畏故，令群生眷戀思慕。長阿含雲：歡喜欲見，憶 念不忘，生戀慕心。是也。戀慕不已，即申贊嘆。然威神之力，嘆莫能窮。詳普門品。是諸下，明效驗。既蒙利益，畢竟成佛。雖現身應物，列四八之殊。其說法被 機，分十九之異。而大士本意，在阿耨菩提。常生人天等，明其未成佛道之間，畢竟不墮惡趣。人天受樂，修集善因，因圓果熟，遇佛授記。此皆大因緣事也。故大 品雲：菩薩摩訶薩欲知諸法因緣，當學般若波羅蜜。則雖普度眾生，入涅槃界，譬如幻師，度幻弟子，彼此離情絕見矣。

△

【汝今具大慈悲，憐湣眾生，及天龍八部，聽吾宣說地藏菩薩不思議利益之事。】

　　初三句正點能聽宣利益事，此應具引別行疏中慈悲普之文。以大士凡見一切苦惱眾生，起大慈悲，令菩提芽生。故雲：三業致請，蒙脫苦芽。四弘為誓，使沾上樂。即是真身拔苦，應身與樂耳。何言今具耶？秪為憐湣未來眾生，欲得聽宣地藏益事，故點汝今二字也。

△

【汝當諦聽，吾今說之。】

△

【觀世音言：唯然，世尊！願樂欲聞。】

　　悉如文。

△

【佛告觀世音菩薩：未來現在諸世界中，有天人，受天福盡，有五衰相現，或有墮於惡道之者。】

　　三界諸天，各乘宿業。宿福深厚，增進聖倫。前福薄劣，惡業仍牽。涅槃雲：天上雖無大苦惱事，然其身體，柔軟細滑，見五相時，極受大苦，如地獄 苦，等無差別。如蜜和毒藥，初美後苦。准新婆沙論：諸天命終，先有二種五衰相現，一小二大。小五衰者：一、身出惡聲，二、身光微昧，三、浴水著身，四、著 境不捨，五、身虛眼瞬。大五衰者：一、衣服今穢，二、華冠光萎，三、兩液流汗，四、體生臭氣，五、不樂本座。小五相現，若不歸依求救。大五衰現，必從天死 退下。正法念經雲：業盡懷憂惱，捨離諸天女，退時大苦惱，不可得譬喻。故須求救也。或有墮惡道者。隨其業力，墮五趣中。如摺伏羅漢經雲：昔忉利天，有一天 壽垂盡，有七種瑞現：光滅、華萎、色變、衣塵、腋汗、身瘦、及離本座。即自思惟，壽終下生鳩夷那竭國，疥癩母豬腹中作豚，即其例也。

△

【如是天人，若男若女，當現相時，或見地藏菩薩形像，或聞地藏菩薩名，一瞻一禮，是諸天人，轉增天福，受大快樂，永不墮三惡道報。】

　　初示怖相修因。若男女天等，當小大衰相現時，或見地藏像，及聞大士名。身心[立+立]運，瞻禮鹹臻，勝福既修，衰相則滅。是諸下，明轉報增 福。如天帝釋，小大衰相忽現，心生怖畏。作是念言：誰能救我，如是衰厄，我當歸依。便自了知，除佛世尊，無能救護。尋詣佛所，求哀請救。佛為說法，便得見 諦。令彼衰相一時皆滅。歡喜踴躍，作愛語伽陀：大仙應當知，我即於此座，還得天壽命，唯願尊憶持。今於地藏瞻禮者，轉衰增福，亦如是耳。（准長阿含雲：使 彼諸天增益五福。一天壽、二天色、三天名稱、四天樂、五天威德。）永不墮惡道者，如前作摟之天，愁苦不知何計。余天語言：唯佛能脫卿之罪。即到佛所，作禮 發問。佛言：欲得離摟身，常誦三自歸。天即歸依。卻後七日，下生維耶離。作長者子，始生墮地，亦跪三歸。年嚮七歲，於道邊戲，遇身子、目連，兒為作禮，請 佛到家。佛為說經，兒及父母親屬，皆得阿惟越致。以此觀之，若瞻禮地藏，豈止永不墮惡，亦能頓入聖階。故知懺悔功力，能致身心俱樂。

△

【何況見聞菩薩，以諸香華衣服飲食寶貝瓔珞佈施供養，所獲功德、福利，無量無邊。】

　　以上見像聞名，單事瞻禮，增福受樂，不墮惡趣。何況見聞，復申供養乎。故所獲功福，無量無邊也。如彌勒菩薩所問經論問：雲何佈施果報？答：佈 施有一種果，所謂受用果；復有二種果，所謂現在受果，未來受果；復有三種果，即此二種，復加般若。今獲功福，正與般若相應，故如虛空無邊量也。

△

【復次，觀世音！若未來現在諸世界中，六道眾生，臨命終時，得聞地藏菩薩名，一聲歴耳根者，是諸眾生，永不歴三惡道苦。】

△

【何況臨命終時，父母眷屬，將是命終人捨宅財物寶貝衣服塑畫地藏形像。】

△

【或使病人，未終之時，眼耳見聞，知道眷屬將捨宅寶貝等為其自身塑畫地藏菩薩形像。】

　　悉如前。

△

【是人若是業報合受重病者，承斯功德，尋即除愈，壽命增益。】

　　何故須為病人，於地藏處，修供塑像，以能愈病益壽也？止觀雲：怖畏惡道，人命無常，一息不追，仟載長往。幽途綿邈，無有資糧，苦海悠深，船筏 安寄。年事稍去，風刀不奢，豈可晏然，坐待酸楚。譬如野幹，失耳尾牙，詐眠望脫（雲雲）。故為修福，當下除殃，抑豈愈病，更益遐齡。譬之服五石者，不止病 差，兼得身充也。

△

【是人若是業報命盡，應有一切罪障業障，合墮惡趣者，承斯功德，命終之後，即生人天，受勝妙樂，一切罪障，悉皆消滅。】

　　業報命盡者，乃福命俱盡也。然雖福命俱盡，功福修之不爽。故應有五逆之罪障，十惡之業障，合墮惡趣受苦者，因承賣宅塑像功德，即生人天受樂， 併前罪業二障，悉皆消滅無余。如大經：耆婆語阇王言：修一善心，能破百萬種惡。如少金剛，能壞須彌；亦如小火，能燒一切；如少毒藥，能害眾生。小善亦爾， 能壞大惡。雖名小善，其實是大。為是義故，應須懺悔，人能為此，則善資冥福矣。

△

【復次，觀世音菩薩！若未來世有男子女人，或乳哺時，或三歲、五歲、十歲已下，亡失父母，乃至（一本作「及」）亡失兄弟姊妹。是人年既長大，思憶父母，及諸眷屬，不知落在何趣？生何世界？生何天中？】

　　乳哺時者，嬰孩在繈褓也。乳，胸汁（「汁」，一本作「前」）肉囊也。兒所飲汁，乃母血所化。兒未生，在身為血；既生，血上升為乳。五道受生經 雲：兒生三歲，凡飲一百八十斛乳，（古三升當今一升）除其胎中食血分。說文雲：哺，咀也。從口，甫聲。正母嚼與之時。如易林雲：烏雀食谷，張口受哺。逸雅 雲：小兒氣急曰哺。哺，露也。哺而寒露，乳食不消，生此疾也。今大人食多受寒，胸口作餲哺臭，是也。自乳哺至三歲等，雖失親，前後不同，而無知大小何異。 年既長大，而思憶者，乃孝子之良心，有不容已者。梵動經雲：我身四大六入，從父母生。乳哺養育，衣食成長，摩捫擁護。然有終其身，而不一思身所從來，鞠育 劬勞者。盍思羔羊跪乳，慈烏反哺，雀雛竊谷被捕，雀子念母忍饑，可以人而不如禽獸乎！今所以思憶者，蓋不知眷屬落在何趣，升沈莫測也。不知生何世界，中邊 難定也。不知生何天中，散定罔諳也。故寤寐思之，欲知其處耳。

△

【是人若能塑畫地藏菩薩形像，乃至聞名，一瞻一禮，一日至七日，莫退初心，聞名見形，瞻禮供養。】

　　莫退初心一語，是最要之誡。今世之人，擇善固執者，吾旦旦慕之而未遇。如營福者，始欲為多，末遂減少。其學道者，初期克進，後乃怠疲。所謂靡 不有始，鮮克有終。有始有卒者，其惟聖人乎。故經雲：魚子庵羅華，菩薩初發心，三事因中多，及其結果少。誡厥初心莫退，深有以也。

△

【是人眷屬，假因業故，墮惡趣者，計當劫數；承斯男女兄弟姊妹，塑畫地藏形像，瞻禮功德，尋即解脫。】

　　假因業者，假即因成、相續、相待之三假也。以虛妄不實，故名為假。止觀雲：因成，約外塵內根。相續，但約內根。相待，豎待滅無之無，橫待三無 為之無心。一切凡夫，未階聖道，介爾起計，悉皆是見。以有見故，三假苦集。煩惱隨從，結業蕪蔓，生死浩然，故雲墮惡趣中，計當劫數。此言眷屬，因業受生 也。承斯下，藉福超升。尋即解脫者，由機速應速，利益速也。譬如父母，念子心重，多智多財，具大勢力。眾子在難，即能拔之。今地藏菩薩慈悲心重，權實智 深，聖財充足，神力自在，隨其眷屬墮惡趣者，當下即解脫矣。

△

【生人天中，受勝妙樂。是人眷屬，如有福力，已生人天受勝妙樂者，即承斯功德，轉增聖因，受無量樂。】

　　古德雲：已生善道，增益功勛；未脫苦輪，早生凈土。正二文之意。轉增聖因，則入三乘之位，受出世之樂矣。如增一阿含，佛告比丘：凡夫之人，不 作功德，不得四事供養，復不免三惡道苦，是謂身心俱不樂。作功德阿羅漢，四事供養，無所乏短，復免三惡道苦，是謂身心俱樂。今既增聖因，則身心俱樂矣。

△

【是人更能三七日中，一心瞻禮地藏形像，念其名字，滿於萬遍，當得菩薩現無邊身，具告是人眷屬生界。】

　　塑像瞻禮外，竭殷勤一心稱名，內勤恭敬，機感傾誠，現身速應，所謂菩薩清涼月，常遊畢竟空，眾生心水凈，菩提影現中。感應之無差也。問：今有 其人矣，纍年不蒙寸效，何也？答：須知一心，有事有理，二途無取，胡能感聖？譬如臨鏡背視，對谷吞聲，奚能致影響乎。無邊身者，約事，則無邊即邊：約理， 則邊即無邊。今以禮像稱名事一之心，契入如虛空無邊理一心內，如空谷答響，明鏡現形，故現無邊之身，具告所生之界也。

△

【或於夢中，菩薩現大神力，親領是人，於諸世界，見諸眷屬。】

　　上是顯機顯應，故於稱禮之際，現身告知其界。眷屬冥機冥應，故於夢中相告。即同善見律天人現夢，乃實夢也。然須了知，善惡凡聖之事，無非是 夢。初由夢人，不知夢眷屬生界，故塑地藏夢像，夢中瞻禮稱名，夢裏現身告界，故曰：如夢勤加，空名惑絕。回觀世間，皆夢中事，唯大覺朗然，稱大夢覺耳。

△

【更能每日念菩薩名仟遍，至於仟日，是人當得菩薩遣所在土地鬼神，終身衛護；現世衣食豐益（一本作「溢」），無諸疾苦。乃至橫事不入其門，何況及身。是人畢竟得菩薩摩頂授記。】

　　此中修因既勝，感果亦勝，較前[迦-加+嚮]不同矣。土地鬼神，即主土谷，護人民者，亦有護宅護身者。今皆令永護其身。現得三樂，後得妙記。 一、衣食豐益，則長幼安享矣；二、無諸疾苦，則身心調適矣；三、絕諸橫事，則居諸事靜矣。此現世人中之報，事猶小耳。至其人畢竟得菩薩摩頂安慰，親授記 莂，則真因克就，妙果斯臻，世出世間，無不成就，威神利益，為若此也。

△

【復次，觀世音菩薩！若未來世，有善男子、善女人，欲發廣大慈心，救度一切眾生者，欲修無上菩提者，欲出離三界者。】

　　此是大菩薩心，習行般若波羅蜜故，能發起度人之心。然慈悲本具，昔著我人，故分彼此。今知同體，故發等心。以大慈故，念眾生得樂，亦與樂事； 以大悲故，湣眾生受苦，亦脫苦境，故言救度一切眾生。遍緣法界名廣，普度群迷曰大。欲修無上菩提者，此明自求佛果。正止觀推無作四諦，了己法性，與一切 法，無二無別，上求下化，發菩提心也。出離三界者，即圓教初信至七信，見、思先去，長別三界苦輪也。

△

【是諸人等。見地藏形像，及聞名者，至心歸依。或以香華衣服、寶貝飲食、供養瞻禮，是善男女等，所願速成，永無障礙。】

　　文分三節。初見聞歸依。二、或以下，竭誠供養。三、是善下願事成就。准上文，發菩提心，乃上品悉地事也。如蘇悉地經雲：能令種種悉地成就，增益福德，乃至成滿法王子法，況余世事。故不惟所願速成，併永無障緣阻礙也。

△

【復次，觀世音！若未來世，有善男子、善女人，欲求現在未來百仟萬億等願，百仟萬億等事。】

　　願念在內，事相據外。約世出世間，則有仟萬億。或求現生果遂，或期他世從心。准十輪經雲：此善男子，隨所在處，若諸有情，或為多聞、凈信、凈戒、凈慮、神通、般若、解脫、妙色聲香味觸、利養、名聞、功德、華果、樹林、床敷捨宅等。是也。

△

【但當歸依瞻禮供養贊嘆地藏菩薩形像。如是所願所求，悉皆成就。】

　　准密部諸儀，皆明三品五品悉地。今准十輪雲：或為種種世出世間諸利樂事，於追求時，為諸憂苦之所逼切。有能至心稱名念誦，歸敬供養地藏菩薩摩訶薩者，此善男子，功德妙定威神力故，令彼一切皆離憂苦，意願滿足。是也。

△

【復願地藏菩薩，具大慈悲，永擁護我。是人於睡夢中，即得菩薩摩頂授記。】

　　歸供合法，求懇如心，故感大士夢中授記，此即適發心與記也。摩頂，示慰於極果；授記，獲證於圓因。若非信力堅固，安有如是瑞相。

△

【復次，觀世音菩薩！若未來世善男子、善女人，於大乘經典，深生珍重，發不思議心，欲讀欲誦；縱遇明師教視（「視」，一本作「示」）令熟，旋得旋忘，動經年月，不能讀誦。是善男子等，有宿業障，未得消除，故於大乘經典，無讀誦性。】

　　男女二眾，舉受法之機；大乘經典，乃方等之法。帝王之道，載於冊，曰典，故五帝之書，曰五典，國之常經也，從冊，在[平-十]（音幾）上，尊 崇之意，敬若天然，乃可開吾之天。我佛法中，亦能開吾第一義天也。深生珍重者，以佛法如如意珠，能出生眾寶，故珍敬而愛重也。言發不思議心者何？羅雲忍辱 經雲：佛之明法，與俗相背；俗之所珍，道人所賤。故著欲之人，不好我無欲之行（文）。今既珍重發心讀誦，則心法一體，其誰能思議其心之深淺哉。此明發心 勝。
次正明根鈍。明師者能備了性相、行位、因果，堪為人中模範者，此仟生萬劫，殊難遭遇。今幸遇之，而教其閱視經典，令熟讀而熟誦之。其奈根性魯鈍， 旋得熟之，旋又忘之；經年纍月，不能對本而成讀，背本而成誦也。下示根鈍意，宿業障未消，故於經典無讀誦性耳。根鈍，如前。宿業障，有多因緣。蓋讀誦經 典，是了因種；由宿不誦習，而了因無種。溈山雲：今生空過，來世窒塞。是也。或往昔不能親近佛法，不敬沙門、婆羅門，障人說法，障人學經，障人讀誦，障人 書寫，乃至沈湎曲檗，失智慧種。故今生縱遇明師教習，不能讀誦也。

△

【如是之人，聞地藏菩薩名，見地藏菩薩像，具以本心，恭敬陳白。】

　　聞名見像，陳白本心者，以地藏之名，從智慧而生；而大士之像，由功德而立。故稱名供像，即發慧性。然須恭敬，始能感動。以誠能動物，不誠，未有能動者也，況大士乎哉。

△

【更以香華、衣服飲食、一切玩具，供養菩薩，】

　　假物將意，藉事顯心。香取清遠潛通，華錶圓滿悅懌，衣服見寂忍不捨，飲食顯慧命常存，玩具彰遊戲神通，故借斯儀，錶我誠敬也。

△

【以凈水一盞，經一日一夜，安菩薩前；然後合掌請服，回首嚮南，臨入口時，至心鄭重。】

　　用凈水者，藉緣發慧也。以智者樂水，水有流通滌穢之用，潤物滋生之功。今藉以滌宿障，潤愚燥，滋讀性，通慧門也。故神水經雲：水在河中為河 水，水在井中為井水，水入佛缽為佛水，入腹中為真水，以清治濁，以正治邪，眾邪斷絕，知水為真。今故用之。一盞，錶一道清凈。一日夜，錶制心一處。日錶智 明，夜錶愚暗也。安菩薩前，求加被進取。合掌請服，錶一心佩戴。迥首嚮南，錶背坎嚮離。逸雅雲：鄭，町（音庭上聲）也。其地多平，町町然也。則錶冥契平 等，大慧者矣。

△

【服水既畢，慎五辛、酒、肉、邪淫、妄語，及諸殺害，一七日，或三七日。】

　　此示助開慧性，故須慎五辛等。楞伽，大慧問：彼諸菩薩等，誌求佛道者，酒肉及與蔥，飲食為雲何？佛答雲：一切肉與蔥，及諸韭蒜等，種種放逸 酒，修行常遠離。五辛者，梵網雲：大蒜（廣韻作胡荽），茖蔥（茖音格，山蔥也），慈蔥（蔥之正名），蘭蔥（小蒜），興渠（蔥蒺也，即阿魏）。夫葷、辛是二 義（葷臭，辛辣）。葷而非辛，阿魏是；辛而非葷，芥姜是。是葷是辛，五辛是也。
　　梵語摩偷，或宰唎，皆翻酒。有谷酒、果酒、藥酒不同。若俗眾，以酒為必用之物。如漢書雲：酒者，天之美祿，所以頤養天下，享祀祈福，扶衰養疾。在法眾，為必誡之物。如大莊嚴論雲：佛說身口意，三業之惡行，唯酒為根本，復墮惡行中。
　　制肉如前。邪淫，諸惡業中，惟淫業為最；邪念一萌，邪緣相湊，種種善願由此消，種種惡孽由茲起；故森羅鐵榜，必以淫為萬惡首也。竟不思月下華 間，為樂有限；那得知鐵床銅柱，受苦無窮。然庸夫俗子，顯蹈明行，罔知顧忌；至學士文人，讀書講道，侈談情種，胡可屈指也。妄，殺害等如前。一七、三七， 明誡慎期限，必求轉鈍為利，去愚成智。一七不發，三七未有不蒙感應，但除狐疑不信，及不致誠者，此克期求感之意也。

△

【是善男子、善女人，於睡夢中，具見地藏菩薩，現無邊身，於是人處，授灌頂水。其人夢覺，即獲聰明（一本作「利」），應是經典，一歴耳根，即當永記，更不忘失一句一偈。】

　　發慧之相，不易卒至，若非精誠致感，何由冥應赴機。言睡夢者，有睡而不夢，有睡而夢者。准迦旃延論雲：不染汙心眠夢，是謂眠不睡相應；染汙心 眠夢，是謂睡眠相應。今是染汙心眠夢。具見等，錶勝身應圓根也。若非深成觀行，何能見無邊身。故大師雲：入觀如夢，出觀如覺，四明判歸似位，或是鄰極之 似，或是鄰真之似，今以觀行見無邊身，即是鄰真之似。錶初住八相成道，分身百界等。授灌頂水，即是鄰極之似。法水灌頂，紹法王位，此雖因心感果，初必至 後。夢中授記，克證無難，容有鄰極之似矣。梵名毗灑迦，此雲灌頂。以五智如來之水，灌其頂門。如剎帝利澆頭王子，必紹大寶之位。此明夢中瑞相。下正明發 慧。
　　其人，指上鈍根求慧男女。夢覺者，夢是無明顛倒之法，觀是覺智悟理之法。於迷能解，故言夢覺。須知佛名，如大夢覺。今觀行如佛，義言夢覺。或 發似解，或入分真，皆有夢覺之義。即獲聰明者，非同世人耳聰目明，如王充之過市成覽，楊雄之遇目輒通。乃謂既感夢覺，即父母所生肉耳，徹聞三仟大仟世界種 種音聲；即父母所生肉眼，徹見三仟大仟世界種種之色。深信觀成，故發勝慧，正在六根清凈位矣。大論雲：如經說一切眾生，無知佛心者；若佛以神力令知，乃至 [蟲+昆]蟲亦能知。今地藏大士，以神力令其人知，安往而不知？故一切經典，歴耳根而永記，更不忘失一句一偈，乃轉其旋得旋忘之宿障也。
　　問：一佛說之經，動有八萬四仟之卷，何能盡憶而不忘失乎？答：菩薩與聞持陀羅尼力，故能受，堅憶念陀羅尼力，故不忘。大論雲：佛說法雨，從佛口出，除行般若波羅蜜菩薩，更無能受者。今既能受，大士般若之力歟。

△

【復次，觀世音菩薩！若未來世有諸人等，衣食不足，求者乖願，或多病疾，或多兇衰，家宅不安，眷屬分散，或諸橫事多來忤身，睡夢之間，多有驚怖。】

　　衣食不足等，人所最苦者。如王捨城燈指長者，（生時指光如燈，故名。由昔以金補塔中泥像一指得之。）其家巨富，如毗沙門。後因群賊劫掠，財物 罄盡，妻拏捨棄，僮仆逃失；素親厚者，反如怨仇。強從乞食，輒遭輕懱。於是嘆雲：諸貧窮者，行來進止，言說俯仰，盡是[僣-曰+心]過。貧窮之人，如起屍 鬼，如遇死病，難可療治。貧亦如是，多諸艱難。又復能生饑寒、怨憎、輕躁、遍陜、憂愁、慘毒、嫌責罪負，如是眾苦，從貧窮生。嗚呼！怪哉！貧有大力，能使 所親捨我極速。故陸機雲：親落落而日稀，友靡靡而愈索！徐文長雲：業曠家人棄，門寒結客稀！故於一貧一富之間，交情於是乎見矣。此由宿世之慳貪，致有今生 之禍患耳。橫事忤身，忤，逆也，違戾也，即法華橫罹其殃也。睡夢驚怖，如周禮之觭夢，（觭音雞，奇怪夢。）列子之懼夢也。光明雲：惡異眾邪蠱道，變怪相 續，臥見惡夢，晝則愁憂。文句雲：惡夢者，心靈潛密，業現其中，夢見不適意事（文）。故多驚怖也。

△

【如是人等，聞地藏名，見地藏形，至心恭敬，念滿萬遍。是諸不如意事，漸漸消滅，即得安樂；衣食豐溢，乃至於睡夢中悉皆安樂。】

　　至心恭敬，徹到源底也。聞名不惑，於名見相，不著於相，冥契真實中基，方曰至心。若以如是心，念滿萬遍，則萬惑全祛，萬德圓顯。故凡有不如意 事，漸至消滅，即得安隱而快樂也。昔之衣食不足，今反豐饒盈益，乃至睡夢驚恐，亦悉得身心安泰而和樂矣。轉禍為祥，捷於桴鼓，誠不思議之事也。

△

【復次，觀世音菩薩！若未來世有善男子、善女人，或因治生，或因公私，或因生死，或因急事，入山林中，過渡河海，乃及大水，或經險道。】

　　初標當事之人，次明所歴之處。治生者，荀子雲：少而理曰治。（少謂舉其要而有條理，謂之治。）易曰：天地之大德曰生，謂治其資生之事也。公私者，或為公家，或因私營；公，平正也，私，生於自營，然而徇之，則是禽獸逐逐於欲也。

△

　　或因生死者，或報產生、死亡，不得不入乎其間也。急事者，急難之事。或官府拘拿，或盜賊劫奪，或水火忽來，或冤家偶遇，凡有倉卒急遽患難之 事，皆是也。當此之時，必要入乎高山、茂林，必須渡乎浚河、大海，或涉大水之洋。或奉公差遣，或為私營求，不免經過乎險難之道矣。若論私營，即該經商貿 易，越海求珍。如賢愚經雲：田殖百倍，商估仟倍，仕宦萬倍，入海吉還，得無量倍。故入乎海也。

△

【是人先當念地藏菩薩名萬遍，所過土地，鬼神衛護，行住坐臥，永保安樂，乃至逢於虎狼師子，一切毒害，不能損之。】

　　此顯稱名之益。是人通指九界，以初地菩薩尚不免虎狼之難，況降斯以下者乎。必萬遍者，舉極數，見至誠也。故所過土地之處，自得無量大鬼善神擁 衛保護，於行住坐臥四威儀中，永保安樂而無虞也。逢虎狼等，十輪雲：若諸有情，為諸毒蛇毒蟲所螫，或被種種毒藥所中，及諸虎狼師子，有能至心稱名，一切皆 得離諸怖畏，保全身命。此由地藏菩薩，善入諸佛燈炬明定之力，令彼佛土，所有一切眾邪蠱毒諸惡蟲獸，悉皆消滅，故名不可思議事也。

△

【佛告觀世音菩薩，是地藏菩薩，於閻浮提，有大因緣。若說於諸眾生，見聞利益等事，百仟劫中，說不能盡。】

　　此結地藏偏嚮閻浮之意。十輪雲：歸敬地藏者，所求皆滿足，具足施功德，悲湣諸眾生。假使百劫中，贊說其功德，猶尚不能盡，故皆當供養。正同今文。故略明之，共有八種不思議事也。

△

【是故觀世音，汝以神力，流佈是經，令娑婆世界眾生，百仟萬劫，永受安樂。】

　　此二大士，均與南洲有大因緣，故藉以流通，可謂同聲相應，同氣相求。則閻浮提六道眾生，何患罪障之不消，功福之不萃，自然於百仟萬劫，永受人 天三乘之安樂矣。十輪偈雲：地藏真大士，施諸眾生樂，救脫三有苦，雨無量種雨。如是無上真經，誠是眾生之眼目，暗室之明燈，貧窮之寶藏，病疾之良醫。何可 不急與流通者哉！長行竟。

△

【爾時，世尊而說偈言：吾觀地藏威神力，恆河沙劫說難盡，見聞瞻禮一念間，利益人天無量事。】

　　如來之眼，同於仟日，照察古今，同於掌果，故曰吾觀等。如佛告天帝釋雲：是地藏菩薩摩訶薩，有無量無數不可思議殊勝功德之所莊嚴一切世間聲 聞，獨覺所不能測。此大菩薩，如如意珠，雨眾財寶，隨所希求，皆令滿足（雲雲）。故於見聞瞻禮，暫生一念，其利益人天，有無量事，故於恆沙劫說亦難盡威神 之力也矣。

△

【若男若女若龍神，報盡應當墮惡道，至心歸依大士身，壽命轉增除罪障。】

　　釋提桓因問經雲：釋提桓因及忉利諸天，遣樂神般遮翼問訊世尊。佛報言：使汝帝釋及忉利天，壽命延長，快樂無患，所以然者？諸天世人及阿須倫諸眾生等，皆貪壽命安樂無患。故今亦雲壽命轉增，併除罪障耳。

△

【少失父母恩愛者，未知魂神在何趣？兄弟姊妹及諸親，生長以來皆不識；或塑或畫大士身，悲戀瞻禮不暫捨，三七日中念其名，菩薩當現無邊體。示其眷屬所生界，縱墮惡趣尋出離。若能不退是初心，即獲摩頂受聖記。】

　　文有三節。初二行頌思憶事。次三行頌告生界，皆如文三一行頌得現報受記，准首楞嚴有四種記：謂未發心、適發心、現前、無生，皆與記。今是發心 記，此約世諦說也。若凈名雲：從如生得記？從如滅得記？如無生滅，則知無記。思益：願不聞記名。大品：受記是戲論。此皆約第一義諦說也。但他經，記善不記 惡；記男不記女。今皆記者，同法華之開顯也。

△

【欲修無上菩提者，乃至出離三界苦，是人既發大悲心，先當瞻禮大士像，一切諸願速成就，永無業障能遮止。】

　　諸願成就如前。無業障遮止者，即別、圓出假位中教化眾生，不被塵沙之惑，無漏之業障礙化導也。

△

【有人發心念經典，欲度群迷超彼岸，雖立是願不思議，旋讀旋忘多廢失。斯人有業障惑故，於大乘經不能記。】

　　梵語多羅，秦言岸。大論雲：若聞多字，即知一切法。此彼岸不可得，已到波羅蜜之彼岸也。業障惑，即是三道。夫根性有利鈍，為行有進怠。今既發 心念經，為度群迷，[立+立]躋彼岸，是亦精進之流，固非懈怠者。但立願雖妙，其如根性實鈍，乃旋得旋忘，且多廢失，此由習因不深，夙業障重，闕多聞誦習 之功，故少記憶之性也。

△

【供養地藏以香華，衣服飲食諸玩具。】

△

【以凈水安大士前，一日一夜求服之。】

　　悉如文。

△

【發殷重心慎五辛，酒肉邪淫及妄語，三七日內勿殺害，至心思念大士名。】

　　問：五辛雖臭，不損物命，何故食者能障聖道，即墮無間耶？答：性殊穢濁，能生多過。楞嚴雲：熟食發淫，生啖增恚。十方天仙，嫌臭遠離；餓鬼舐 吻，常與鬼住；福德日銷，長無利益。故雜阿含雲：食五辛人，觸穢三寶，死墮糞屎地獄，出作野幹豬狗；若得人身，其體腥臭。故天竺沙門覺稱雲：吾國食肉五辛 者，驅出城外，僧鏡錄雲：竺曇猷禮天臺石梁，遇聖僧謂曰：汝母懷妊時，行經蔥園，胎氣犯穢，不可住寺。仙傳雲：樂子萇舉家飲仙酒升天，獨從子墜地。天神 言：此人茹蒜，故不得往。是故道藏雲：誦黃庭經，忌食五辛。道士受法，忌淹穢五辛。今諸師家多忽此事，故載詳出之。

△

【即於夢中見無邊，覺來便得利耳根（一本作「根耳」）。應是經教歴耳聞，仟萬生中永不忘。以是大士不思議，能使斯人獲此慧。】

　　初正頌，後結示。此由大士總持深廣，能令鈍者利，愚者慧，故名不思議事。（唐高僧傳記隋襄州景空寺有岑阇黎，姓楊，臨原人。於寺西傘蓋山泉側，造誦經堂。每誦金光明經，感得四天王來聽。後讀藏經，皆悉不忘，今豈不然乎。）

△

【貧窮眾生及疾病，家宅兇衰眷屬離，睡夢之中悉不安，求者乖違無稱遂。】

　　如文。

△

【至心瞻禮地藏像，一切惡事皆消滅，至於夢中盡得安，衣食豐饒神鬼護。】

　　衣食豐饒，繫鬼神所主。如外書說，天平吏主豐，臘判官主儉。今既至心瞻禮地藏聖像，則衣食增益，使儉者豐，闕者饒矣。

△

【欲入山林及渡海，毒惡禽獸及惡人，惡神惡鬼併惡風，一切諸難諸苦惱。】

　　妙臂經，明蛇毒有一牙、二牙、三牙、四牙不同。遭一、二牙毒，猶可治；若三牙，死多生少；四牙，決死不救。惡人即嘯聚綠林之輩，斷道抄掠之 儔。惡神即嶽瀆山林一切諸神，擅作威福者。惡鬼即羅剎，食人之鬼。惡風者，請觀音雲：黑風洄波。仁王般若有六色風，黑赤青天地火也。別行疏雲：風以黑怖之 甚也。僧護經雲：疾風、猛浪、沒溺、破壞、餓鬼所啖，險之甚矣。余如文。

△

【但當瞻禮及供養，地藏菩薩大士像，如是山林大海中，應是諸惡皆消滅。】

　　寶雨經雲：雲何菩薩如師子吼？譬如師子哮吼之時，惡獸野幹各於方處驚駭馳走，一切惡獸無能損壞。是也。應驗傳雲：外國百余人，從師子國泛海嚮 扶南，忽遇惡風，墮鬼國，便欲盡食一舶。眾人怖，稱觀音。中有一小乘沙門，不肯稱名。鬼索此沙門，狼狽學稱，亦得免難。觀音應驗既爾，地藏利益亦然。故稱 名瞻禮，諸惡消滅也。

△

【觀音至心聽吾說，地藏無盡不思議，百仟萬劫說不周，廣宣大士如是力。】

　　至心如前。所以勸至心聽者，事既無盡不可思議，若不冥三諦極致，何能窮邊徹底，以盡大士之奧藏耶！無盡即圓三諦，如雲即色是空，非色滅空，此 圓空無盡也。如雲一切諸法因緣果報無盡，乃至悉能含受一切佛法，故名無盡，此圓假無盡也。如雲法若盡若不盡，皆是無盡，相即是空，空則無有盡與不盡，故知 非盡非無盡，是真無盡義，此圓中無盡也。如此無盡可思議乎哉，故百仟萬劫，塵說剎說，熾說，亦不能周悉其事。故我今於天龍大會之中，廣為宣揚地藏如是威神 之力也。如是二字，亦指三諦，不然何能顯地藏種種因緣，莫不即空假中，故號不思議，如是之力耶。

△

【地藏名字人若聞，乃至見像瞻禮者，香華衣服飲食奉，供養百仟受妙樂。若能以此回法界，畢竟成佛超生死。】

　　前四句結上聞名瞻像等，必受人天妙樂；後二句結上回嚮法界，必超生死成佛。以具有四悉檀利益故也。所以爾者？以地藏名字等，作世界分別說，能 令人得歡喜之益；若各各為人說名相等，能令人得生善之益；若天人五衰相現，乃至跋涉險道，稱名禮像，轉禍為祥，令人得破惡之益。若將上事回嚮第一義諦，能 令人得入理之益。然一一皆回法界者，蓋地藏但有名字，名字性空，不住內外中間，但垂影像，像性亦離，等於鏡相空華，香華等供，體是因緣，不離中道佛性。百 仟劫中受妙樂者，受陰空洞，畢竟無能受者，皆回法界之力也。故止觀雲：若推一法，即洞法界，達邊到底，究竟橫豎，事理具足，上求下化，備在其中，方稱發菩 提心。菩提名道，道能通到，橫豎彼岸，名發心波羅蜜。故得畢竟成圓教法身之佛，永遠超分段變易生死，故須一一嚮法界也。

△

【是故觀音汝當知，普告恆沙諸國土。】

　　是故者，承上八種事故而言也。謂如此無盡不思議事，非爾觀音，莫能知之，莫能告之，故勸當知普告也。言普告，則應通九界；言諸國，則豈局同居。故知地藏法門，包法界而無外，極橫豎而嚮歸也者。

△

【囑纍人天品第十三】

△

【爾時，世尊舉金色臂，又摩地藏菩薩摩訶薩頂。】

　　爾訓為即，即是與觀音說見聞利益已訖，更將人天囑纍地藏之時（世界）。又大會既聞地神、觀音兩番流通，歡喜已竟，宜聞囑纍人天生善之時（為 人）。又聞上不思議利益之事，已破諸惡法墮苦之緣，時眾更欲聞囑纍地藏救拔，則永對治諸惡之時（對治），又聞上兩番不思議事，得道者已竟，更聞囑纍大會之 眾，無不悟理之時（第一義）。有四悉檀因緣。復申囑纍。故言爾時。舉金色臂者，金色本黃，錶乎中道；臂有提拔之功。正顯提攜六道，[立+立]歸中道一性。 故復舉之。前摩頂，慰勞度生辛苦；今摩頂，囑纍救拔勞煩。前一手摩無量頂，乃錶一多自在；今一臂摩一頂，以錶本同一道。則顯六道九界，更無二道也。

△

【而作是言：地藏！地藏！汝之神力，不可思議；汝之慈悲，不可思議；汝之智慧，不可思議；汝之辯才，不可思議。正使十方諸佛贊嘆宣說汝之不思議事，仟萬劫中不能得盡。】

　　世尊特於人天大會，連呼地藏之名者，誠愛之深，托之重也。如國大王將崩，儲君幼稚、頑劣，欲托孤大臣輔弼，必執手頻呼愛卿。以子幼而國大，日 久而心長。中有滿腔說不盡之意。故我佛舉臂摩頂，雙喚其名也。汝之神力下，佛自贊德，如國王托事，亦先贊老臣之德。今閻浮眾生，誌性無定，若不假超群之器 具，安能救沙界於冥陽。故下所贊眾德，不越能化三輪。初句，贊身輪現通。諸聖罔測名為神，八自在我名為力。不可思議者，准大論，有五事不可思議：謂眾生多 少、業果報、坐禪人力、諸龍力、諸佛力。佛力最不可思議。菩薩入於禪定，生不可思議神通，（即如意疾遍神通也）故一念中，悉到十方諸佛世界，作無量身。一 切賢聖不能行、不能到，故不可思議。

　　然身輪現通，必由意輪鑒機而起。意輪即是慈悲與拔。若欲與拔，必須現通。故曰身輪由意。此即地藏大慈大悲，實能一時遍施與拔，故不可思議。

　　然雖內鑒外現，若無智慧辯才，安能赴機說法，故知慧辯正贊口輪。蓋身之神通，非智慧不轉。故龍樹菩薩雲：以智慧力故，能轉一切諸法。所謂小能 作大，大能作小。能以仟萬無量劫為一日，又能以一日為仟萬劫。是菩薩世間之主，所欲自在，何願不滿。以是因緣，故菩薩乘神通力，能速疾超越十方世界，得非 智慧為神通之本乎。十輪雲：智慧深廣，猶如大海；辯才無滯，如水激輪，故不可思議。

　　此由大士圓具秘密三輪，故能垂形沙界。我佛贊德，詎曰徒然。正使下，引同諸佛。正，對假說，言假使，則意涉浮泛；言正使，則詞彰真實。然地藏 大士何能使十方諸佛贊嘆耶？如大論雲：若有菩薩，具足十地、六波羅蜜、十力、四無所畏、四無礙智、十八不共法等無量清凈佛法，為眾生故，久住生死，不取阿 耨菩提，而廣度眾生。如是菩薩，諸佛贊嘆。正今諸佛同聲贊嘆之意也。然又何故贊說其事，仟萬劫不能盡耶？亦如論雲：菩薩出於三界，變化無央數身，入於生 死，教化眾生。如是佈有事，皆從甚深般若波羅蜜生，正今贊嘆不盡之意也。

△

【地藏！地藏！記吾今日，在忉利天中，於百仟萬億不可說不可說一切諸佛、菩薩、天龍八部大會之中，載（一本作「再」）以人天諸眾生等，未出三界，在火宅中者，付囑於汝。無令是諸眾生墮惡趣中，一日一夜，何況更落五無間及阿鼻地獄，動經仟萬億劫，無有出期。】

　　前呼名，愛語喜聲也；今呼名，苦語悲聲也。前乃贊德，今為囑事故爾。記吾等，囑令勿忘末後之說，如父遺命孝子銘骨勿諼也。大會等者，藉眾證 明，顯是大事，非細故也。此與法華，長者付業，聚會親族不同，何也？彼教久化之機，至此大功克就，聚眾付業，推門落臼，更有何難。此付未調之眾，為令佛種 不斷，似救子於水火，竟不知如何了局，故不同也。言載以者，以，將也。前已將人天付囑，今重將此眾纍爾也。未出等者，自我佛入滅之後，洎彌勒道成之前，於 其中間，凡在三界五欲火宅中者，今得得交付囑托於汝，總令是輩，不墮三惡道，乃至一日夜最少之時。況不急救援，令更落無間阿鼻大地獄中，極受苦痛，經仟萬 億劫，難期出獄之時哉！寄語諸賢，毋負佛恩，早求出苦，急渡生津，勉旃！勉旃！

△

【地藏！是南閻浮提眾生，誌性無定，習惡者多。縱發善心，須臾即退。若遇惡緣，念念增長。以是之故，吾分是形百仟億化度，隨其根性而度脫之。】

　　此文，不過復疏前事，明吾所以付囑之意。是南閻等，遠提業感品中，一切眾生，未解脫者，性識無定等文；近提利益存亡品，地藏所白，我觀是閻浮 眾生等文。以是下，顯提佛自分身，潛映地藏化身二段文。此正同付法藏經雲：一切眾生，誌性無定，隨所染習。若近惡友，便造惡業，流轉生死，無有邊際。若近 善友，敬心聽法，必離三塗，受最勝樂。（如華氏國白象，聞法生慈，見殺增害。豈況於人，而不染習。）但善類登山，理為難上；惡如崩墜，實可易行。是以天宮 閑曠，來蹤蓋寡；地獄籠樊，往人爭湊。故吾分形化度，織此之由耳。

△

【地藏！吾今殷勤以天人眾付囑於汝。未來之世，若有天人及善男子、善女人，於佛法中，種少善根，一毛一塵、一沙一渧，汝以道力，擁護是人，漸修無上，勿令退失。】

　　初二句重提前事，然觀殷勤二字，不覺泣數行下。夫殷者盛也，勤者勞也，心之委曲也。此以下事上之心，身盛勞而心委曲，孜孜奉以周旋，不敢稍有 跅弛也者（跅音托，弛音始。跅落無檢局，弛廢不尊禮度也。漢武帝紀：跅弛之耳。）今我佛鷓未來眾生，降尊就卑，屈上湊下，不覺言之至此乎！

　　未來下，示付囑之意。謂一切眾生，同有佛性，闡提雖惡，性善具存。儻於未來之世，其有天人善男女等，不昧原初之念，於佛法無上福田，能下小 種，以立善根，不論毛塵沙渧，汝當以權智道力，擁護是等少善之人，漸令修習阿耨菩提。如菩薩本行經雲：若有人，能於佛法，少作微善，如毛發許，所生之處， 受報弘大，無有窮盡（文）。故知施福由心，豈關施物巨細。故囑汝擁護，勿令中間有退失也。如處胎經雲：盲龜浮木孔，時時猶可值；人一失命根，億劫復難是。 海水深廣大，三百三十六，一針投海中，求之尚可得。一失人身命，難得過於是。故知一退其失非細。今願地藏，當如慈母之育嬰孩，必使成立，毋稍懈怠，致令夭 亡。是吾今日於忉利大會，將人天眾，殷勤囑汝之苦心也。

△

【復次，地藏！未來世中，若天若人，隨業報應，落在惡趣。】

　　經雲：假使百仟劫，所作業不亡，因緣會遇時，果報還自受。故知影形相隨，誰能逃避。昔有人，死至閻王所，考厥罪惡，應墮鐵城。而人姊子，乃王 正妃，勸王念我親弟，勿治其罪。王囑其住我宮內，不可外出，被獄吏所捉。其人不覺自詣鐵城，王不能救。隨業受報，不容絲毫勉強也矣。准業報差別經：墮四惡 趣，各有十業（雲雲）。

△

【臨墮趣中，或至門首。是諸眾生，若能念得一佛名、一菩薩名，一句一偈大乘經典。是諸眾生，汝以神力，方便救拔，於是人所，現無邊身，為碎地獄，遣令生天，受勝妙樂。】

　　臨墮至門首者，若一到獄，急難得出，故於臨入之時，即令念佛免苦。如譬喻經雲：昔有國王，弒父自立。有阿羅漢，知王余命，不過七日，命終必墮 阿鼻，一劫受苦。尋往化之，教至心稱南無佛，七日莫絕。臨去重告，慎勿忘此。王便叉手，一心稱說，晝夜不廢。至七日命終，魂神竟至阿鼻。乘前念佛，知是地 獄，即便大聲稱南無佛。獄中罪人，聞稱佛聲，一時同稱，猛火即滅，皆得解脫，出生人中。後阿羅漢重為說法，得須陀洹。又觀佛三昧經雲：佛告比丘，我滅度 後，若稱我名，南無諸佛，所獲福德，無量無邊。（大慈經佛告阿難：南無佛者，此是決定諸佛世尊名號音聲，故稱言南無諸佛。）增一經雲：眾生三業造惡，臨終 憶念如來功德者，必離惡道趣，得生天上；正使極惡之人，以念佛故，亦得生天（文）。一菩薩名者，如文殊、遍吉、觀音、勢至等，蒙度脫者，不勝枚舉矣。一句 一偈者，普賢觀經雲：若誦大乘經，思第一義，甚深空法，於一彈指頃，除百萬億那由他恆河沙劫生死之罪。冥報記載：王生將墮地獄，忽遇一僧，雲是地藏菩薩。 教令熟誦若人欲了知偈，可免地獄。少頃，喚至王前，王問有何功德？答雲：唯持一偈。王令誦之，聲徹地獄，罪人聞聲[立+立]蒙解脫，即令放回，勉其修善。 豈非地藏神力，現身碎獄，生天受樂之驗歟。故知念佛菩薩名，及誦經偈，皆得超淪，受勝妙之樂也。

△

【爾時，世尊而說偈言：現在未來天人眾，吾今殷勤付囑汝，以大神通方便度，勿令墮在諸惡趣。】

　　現未天人，性既無定，或造惡業，重落三塗；總藉地藏展大神通，用異方便，必令度脫，毋使流轉也。

△

【爾時，地藏菩薩摩訶薩，胡跪合掌，】

△

【白佛言：世尊！唯願世尊不以為慮。】

　　皆如文

△

【未來世中，若有善男子、善女人，於佛法中，一念恭敬。我亦百仟方便，度脫是人，於生死中，速得解脫。】

　　現前介爾之心，甚小甚微，故曰一念。佛說四自侵經雲：未見群類，茍懷一介，誌不轉易。假使有人，至心欲度，當諦思計，一心行道。當知無常，假 借是身，萬物歸空，皆非我所。曉知無者，則度天下十方人民。故知仟念萬念，始乎初念；只此一念，即感地藏慈悲喜護，湣傷萬姓萌類之兆，令其於生死速得解 脫，更何疑哉。

△

【何況聞諸善事，念念修行，自然於無上道，永不退轉。】

　　此中況意，謂一念甚微之恭敬，尚蒙解脫生死，況乎凡聞諸善，念念無間修行者哉。四自侵經雲：道人觀察可否之事，內自省身，譬如夢幻。喻如軍 徵，百萬之眾，恃怙名將，以卻怨敵。道人伏心制意，修法奉道，順行戒禁，身意清白，佈恩施德，除棄忿怒、憍奢、諍訟，專精行道，無得無礙，誌在軌跡，若將 帥眾也。先自正心，爾乃身行；身心俱正，則無所失；以無所失，得道絕去。故十輪雲：照行善者，猶如朗日。故令自然於無上道，永不退轉也。

△

【說是語時，會中有一菩薩，名虛空藏。】

　　梵語[言+我][言+我]曩獻惹，此雲虛空藏。此經始文殊發問，謂非大智，莫識地藏端倪。終空藏收科，以非太虛，安泯大士化跡。乃攝有歸空， 全假即空意也。而空藏問福利者，乃從空談有，全空即假意也。空假不二，當體即中。圓融妙行，同歸秘藏。故終乎虛空藏也。准虛空藏菩薩經：此娑婆西過八十恆 河沙世界，有佛剎，名一切香集依。其中眾生，成就五濁，佛名勝華敷藏如來。彼有菩薩，名虛空藏。頂上有如意寶珠，無量釋迦毗楞伽寶而為圍繞。此珠光明蔽余 光明悉滅無余；所有功德，唯除如來，余無及者。准密部，即毗盧如來四親近菩薩中，寶波羅蜜流出南方寶生部者，是此菩薩也。

△

【白佛言：世尊！我自至忉利，聞於如來贊嘆地藏菩薩威神勢力，不可思議。】

　　經初光音遍及，空藏即集天宮，故始終備聞如來贊嘆地藏之事。勢力者，如思益雲：我投足之處，震動三仟大仟世界及魔宮殿。觀經雲：以智慧光，普 照一切，令離三塗，得無上力，故言勢力。不思議者，此是菩薩甚深行處，雖施為萬有，令眾生得益，鹹獲本然，初無實法。如化人現作化事，不過令人得樂。空藏 終篇，意在斯也。

△

【未來世中，若有善男子、善女人，乃及一切天龍，聞此經典及地藏名字，或瞻禮形像，得幾種福利？】

　　准地持，福即佈施、持戒、忍辱、依禪、依精進、修行施戒、四無量等，是名福分。蓋善名福利，感報恬愉。今既讀經聞名，瞻形禮像，必有所得福 利，不審有幾種耶？須知福利由心，心能造福；心尚叵得，福利奚存。然化門引物希嚮，福利為要。況密部中，凡供養門，皆攝入虛空庫藏。則福利之事，尤空藏之 專司，而應問者也。

△

【唯願世尊，為未來現在一切眾等，略而說之。】

　　必求略說者，導物生善之要門也。書有作善降祥之訓，易明積善余慶之言，若不詳陳乎福利，未免阻絕其善門。故願略說耳。至若嚴禱祀以僥福鬼神，隨因果而怖報冥寞，此利心之邪求，詎可同年而語哉。

△

【佛告虛空藏菩薩：諦聽！諦聽！吾當為汝，分別說之。】

　　夫善說法者，無說無示；善聽法者，無得無聞。何有分別諦聽之異指乎？然若一嚮冥真，恐成斷見；若一嚮順有，恐成常見。斷常遍邪，違中道遠矣。 要於拈空非空之際，談有不有之時，不涉言詮而舌根恆轉，無離音響而聞性原空。所謂善能分別諸法相，於第一義而不動。乃如來分別之指，空藏諦聽之意耳。

△

【若未來世，有善男子、善女人，見地藏形像及聞此經乃至讀誦，香華飲食衣服珍寶佈施供養，贊嘆瞻禮，】

　　如文

△

【得二十八種利益：一者、天龍護念，二者、善果日增，三者、集聖上因，四者、菩提不退，五者、衣食豐足，六者、疾疫不臨，七者、離水火災，八者、 無盜賊厄，九者、人見欽敬，十者、神鬼助持，十一者、女轉男身，十二者、為王臣女，十三者、端正相好，十四者、多生天上，十五者、或為帝王，十六者、宿智 命通，十七者、有求皆從，十八者、眷屬歡樂，十九者、諸橫消滅，二十者、業道永除，二十一者、去處盡通，二十二者、夜夢安樂，二十三者、先亡離苦，二十四 者、宿福受生，二十五者、諸聖贊嘆，二十六者、聰明利根，二十七者、饒慈湣心，二十八者、畢竟成佛。】

　　初句總標，下乃別列。天龍乃造化之權衡，為陰陽之管轄；邦國藉保綏之德，黎民仰覆護之功。今既讀經持名瞻禮供養，故感天龍護之、念之，令善果聖因，由之增長；家緣世事，用是克諧。故首舉之，示福利之本也。

　　二、三、四三益，事跡相連，果由因而增進，因藉果而積集。因果相資，自然菩提不退。如十輪經，地藏白佛言：我當濟度此四洲渚世尊弟子，一切苾 芻及苾芻尼，鄔波索迦、鄔波斯迦，令其增長覺分，聖諦光明。增長趣入大乘聖道，增長成熟有情大慈大悲，增長五眼灌頂，生天涅槃，如是善果，日日增長。集 者，聚集。大論雲：值遇經法，修善持戒，佈施禮敬等，種涅槃因緣（文）。如是聖上之因，莫不聚集；善果聖因，既日增集，自然道心牢強，誓力勇健。於位行 念，自無退轉矣。增者，從微至著，以期滿足。集者，自少至多，所冀成就。於此兩楹之間，菩提不退也。

　　五、衣食豐足，助道備也。衣以蔽形，食以支命，身安道隆，賴是衣食。此雖小緣，能辦大事。凍餒不安，道法焉在。故十輪雲：一切皆得如法所求，衣服、寶貝、醫藥、床敷、及諸資具，無不備足。

　　六、疾疫不臨，修道之要。病乃退道之緣，能令色力減損。准長阿含：乃他方世界，有鬼神來；此間鬼神，放逸淫亂，不能護人。他方鬼神，侵嬈此世 間人，撾打捶杖，接其精氣，使人心亂，故有疾疫之災。十輪雲：若諸有情，惡鬼所持，成諸病者。有能供養地藏菩薩，一切皆得解脫，無畏，身心安適，故疾疫不 臨也。

　　七、離水火災。病為內障，災為外障。左傳以人火曰火，天火曰災。（篆文[災-火]中加一，[災-火]與川同。川壅為災。說文從[字-子]，屋 也。火其屋為災。故從火[字-子]下為意。）今謂潢潦之水，燎原之火，損物傷生，[立+立]是天災。十輪雲：若諸有情，為火所焚，為水所溺，有能供養地藏 菩薩，一切皆得離諸危難，安隱無損。此不必引大三災之水火也。

　　八、無盜賊厄。離宿怨對也。十輪雲：若諸有情，為諸怨賊軍陣，及余種種諸怖畏事之所纏繞，身心慞惶；懼失身命。有能供養恭敬地藏菩薩，一切皆得離諸怖畏，保全身命。

　　九、人見欽敬。地持雲：菩薩種姓具足，故眾所敬重，供養贊嘆，言必受行，無所違犯。今既供養地藏菩薩，故致斯福利。

　　十、神鬼助持。尤末世修道善利。長阿含二十雲：若有修行善法，見正信行，修十善業，如是一人，有百仟神護。今既供養地藏菩薩，故得神鬼助持，修行無障也。

　　十一、女轉男身。十二、為王臣女，十三、端正相好，皆如前。

　　十四、多生天上。准辯意經：五事生天（即是五戒）。十輪雲：隨其所應，安置生天，涅槃之道。

　　十五、或為帝王。（西域，如勝軍、優填等。東土、如五帝、三王等。）

　　十六、宿智命通。達命元由也。士有百行，智為其首。由讀經稱名，了因之力也。
　　十七、有求皆從。十輪雲：若諸有情，或為種種世、出世間諸利樂事，於進求時，若能恭敬供養地藏菩薩，意願滿足。

　　十八、眷屬歡樂，此修行外護知識。十輪雲：若諸有情，愛樂別離，怨憎合會，有能恭敬供養地藏菩薩，一切皆得愛樂合會，怨憎別離。

　　十九、諸橫消滅。如前。

　　二十、業道永除，以修讀經等無漏之業，故三界有漏業道，一併永除滅矣。

　　二十一、去處盡通。地持雲：人具足故，男相成就，堪為一切功德法器，於一切時，自在遊處；一切眾生，往來同事，人間曠野，隨意無礙。今既修供地藏菩薩，故得行來出入，到處通達也。

　　二十二、夜夢安樂。如前。

　　已上，皆自身福利。

　　二十三、先亡離苦，乃上資祖禰也。

　　下明當來福利。

　　二十四、宿福受生。思益經雲：菩薩有四法，得先因力，不失善根。一、見他人闕，不以為過。二、於怒人，常修慈心。三、常說諸法因緣。四、常念菩提。今承持誦供養地藏，宿世之福，或受生天上人間，[立+立]享如意福樂也。

　　二十五、諸聖贊嘆。以修勝福，善譽遐流。大論雲：菩薩聞甚深不可思議佛法，能定心信樂，不生疑悔。如是菩薩，諸佛所嘆，今既信受地藏不思議事，故感諸聖贊嘆也。

　　二十六、聰明利根。如荀子雲：目不兩視而明，耳不兩聽而聰。今由一心讀經，成法行機。故義理入耳，不俟更聞；經書過目，寧須載讀。默識心通，根性越倫也。
　　二十七、饒慈湣心，此利生之要行。以慈有五利：刀不傷，毒不害，火不燒，水不沒，嗔惡見喜。地持雲：菩薩以安隱樂饒益眾生，非安隱樂，教令除斷。是也。
　　二十八、畢竟成佛。此是究竟利益。匯江河淮濟而註之海，同成鹹味；镕瓶盤釵釧而入於爐，盡作精金。此我佛付囑之心，地藏承命之意。所謂唯此一事實，余二則非真。故兩文皆以此終焉。

△

【復次，虛空藏菩薩！若現在未來天龍鬼神，聞地藏名，禮地藏形，或聞地藏本願事行，贊嘆瞻禮，】

　　此中修因，與上似同，何故列作二文？須知上加種種供養，緣了兼修。此但聞禮贊嘆，了因獨進，以此小異，故別列之。正顯聞益尚爾，況思修兼行乎。

△

【得七種利益。一者、速超聖地，二者、惡業消滅，三者、諸佛護臨，四者、菩提不退，五者、增長本力，六者、宿命皆通，七者、畢竟成佛。】

　　前後之益，俱約圓論。一、速超聖地，即指圓十地之聖種性。以圓人根利智猛，故於住行嚮位，速得超入聖地也。

　　二、惡業銷滅。惡業對善業論。既聞地藏不思議事，則了修染修惡，全體即是性染性惡。故於五品觀行，圓伏五住，進入信位，見思先亡，則分段生死，從斯永離。故知雖舉惡業，自得三障圓銷。

　　三、諸佛護臨。既在似位，已鄰真因，得佛法之氣分，感諸佛之護臨。臨，蒞下也。與上帝臨汝，意同。從品，眾也；從臥，無為也。上之臨下，不自用而用人。故能聽物之為，而不自為也。今諸佛臨下，正如月之臨江，固不庸心於其間也。

　　四、菩提不退。如前。

　　五、增長本力。即修因外熏，增真如本力。以深行菩薩，具足悲智二增，故彌增本力也。

　　六、宿命皆通。准諸論說，謂於生處。自性能知過去宿命，及知他心。若諸有情，施他種種大妙飲食，由彼業力，能引此智。如阿摩晝經雲：無明永滅，大明法生，阇冥消滅，光曜法生。故能憶宿命無數劫事。

　　七、畢竟成佛。地持雲：菩薩依智故，攝受正福種種巧便，為諸眾生，乃至無上菩提，若報，若報因，若報果，一切依福起，福依智起，此二具足，最 勝最上，得無上菩提。若福智不具，終不能得。今修讀經持名之智，及瞻形禮像之福，故致成佛。此名因攝果，攝自他之利益也。別流通竟。

△

【爾時，十方一切諸來不可說不可說諸佛如來，及大菩薩，天龍八部，聞釋迦牟尼佛稱揚贊嘆地藏菩薩，大威神力，不可思議，嘆未曾有。】

　　十方至八部等，結上雲集之眾。諸佛菩薩，在光前集，乃發起之根源；天龍八部，在光後集，正發起之眾也。聞釋迦下，總結上來所嘆不思議事。然余 人亦有贊嘆，今獨言釋迦者，有二意：一、舉主攝伴，如群辟之言，出於王命，皆曰王綸，是也。二、歸功化主，如三公謨猷，功成之後，歸美天王。是也。余如 文。

△

【是時，忉利天雨無量香華，天衣珠瓔，供養釋迦牟尼佛及地藏菩薩已；一切眾會，俱復瞻禮，合掌而退。】

　　忉利天王獨供者，既是檀越，又在其宮，故得專之也。香錶因通果海，成就五分法身；華錶圓因克果，具足四十一位。天衣從樹而生，輕細自然，錶證 寂滅之忍。珠瓔，別行疏雲：或眾寶瓔珞，或眾寶珠。今是眾寶珠成，故曰珠瓔。錶得四勝法。大集雲：戒定慧陀羅尼以為瓔珞，莊嚴法身。是也。然珠瓔在頸，頸 是所嚴，錶中道性德。此行稱性，如瓔珞在頸而能嚴也。皆言雨者，則是從正空中道第一義天，繽紛而下也。無量者，因果之法，[立+立]由一心，了達此心，本 具河沙性功德法，有何限量？以此無量諸法，供養釋迦，能說之教主；以及地藏，能行之願王。心有所專，故不言余眾。已者，謂能供之物，皆冥實際；所供之主， 本住三摩。能所既空，感應斯泯，賓主镕融而一際，財法絕寂而無垠。故雲：已也。上是申供，下乃禮退。一切眾會，即前所集之眾，今將各還本住。俱復瞻仰，重 師道而戀戀靡忘，重申禮拜，尊經法而心心無間。合掌，錶十界一體。而退，顯萬類同歸。然而不同諸經結皆大歡喜者，以見在會大眾，從此重增勝心，效地藏之僧 那，救三塗而不了。遵迦文之囑纍，弘是典而彌窮。上同聖母之愁憂，卻類天王之悲嘆。則聞法之大喜，固內蘊襟懷，而濟世之殷憂，已外彰眉宇。經家不敘斯語 者，意見乎言之錶也。 
