addTerms(4,

'心', `指無形的精神作用，也就是佛教所說的八個識：[[眼識]]、[[耳識]]、[[鼻識]]、[[舌識]]、[[身識]]、[[意識]]、[[末那識]]、[[阿賴耶識]]。`,

'心王', `萬法都是從心中生出來的，心就是萬法之王，故稱心王。`,

'心地', `１．心為萬法之本，能生一切諸法，故曰心地。２．修行人依心而起行，故曰心地。`,

'心香', `（喻）中心虔誠，猶如焚香供佛一樣。`,

'心波', `（喻）連續不絕的意念。`,

'心珠', `（喻）眾生的心性潔淨如珠。`,

'心通', `即宗通，遠離一切言說文字妄想，悟證自己本性叫做心通。`,

'心馬', `（喻）心意不定。又曰心猿意馬。`,

'心燈', `（喻）心中靈明不昧。`,

'心月', `（喻）心性皎潔如月。`,

'心冰', `（喻）心中有疑惑不解。`,

'心光', `佛慈悲心所發出來的光。`,

'心行', `指人的心理活動。`,

'心印', `心者佛心，印者印可或印定之義。禪宗不立文字，不依言語，只以心傳心，以佛心印定眾生心，證不二相。`,

'心佛', `１．依心成佛的意思。２．是心是佛的意思。３．心中所現之佛，叫做心佛。`,

'心戒', `制止心念邪惡的戒律。`,

'心咒', `諸佛的神咒，有大咒，小咒，一字咒等分別，心咒就是一字咒。心是真實精要的意思。`,

'心宗', `[[佛心宗]]的簡稱，亦即[[禪宗]]。`,

'心要', `最精要的法義。`,

'心垢', `煩惱的別名。`,

'心師', `我作我心之師的意思。[[涅槃經]]說：「<verse>願作心師，不師於心。</verse>」`,

'心乘', `修心的教法，指佛教。`,

'心智', `心是體，智是用，體用雙全叫做心智。`,

'心量', `心生起妄想以度量種種的外境，這是對凡夫的心量而言，若是如來真證的心量，則是離一切外在的影響而住於無心。[[楞伽經]]說：「<verse>觀諸有為法，離攀緣所緣，無心之心量，我說為心量。</verse>」`,

'心經', `[[般若波羅蜜多心經]]的簡稱。`,

'心猿', `（喻）人心散動如猿猴。`,

'心源', `心為萬法之源。`,

'心緣', `起心而攀緣外境。`,

'心縛', `心為妄想所縛。`,

'心證', `心與佛相印證。`,

'心識', `心與識。心梵語是[[質多]]，集起為義，指阿賴耶識所含藏積集的善惡種子；識梵語是[[毗若南]]，主要的意義是了別為性，是指依意根生起的前六識，了別的作用。`,

'心觀', `指[[天台宗]]的[[一心三觀]]。`,

'心心', `１．前心與後心。２．心王與心所。`,

'心心數', `心王與心所。心數即心所的別名。`,

'心相', `１．心的行相。２．心臟的相貌。`,

'心相應行', `與心王相應而起行之法，即心所有法，簡稱心所。`,

'心所|心所有法', `[[心所有法]]的簡稱，也就是為心所有的各種思想現象，共有五十一法，即遍行五，別境五，善心所十一，煩惱六，隨煩惱二十，不定四。茲列表說明如下：
{{!心所}}參見[[五位百法]]之圖。`,

'心所有法', `見心所條。`,

'心性', `即吾人永恆不變的心體，亦即如來藏心、自性清淨心。`,

'心性三千', `意謂一念之心性含有十界三千之法。`,

'心法', `１．經典以外所傳授的佛法。<br>２．一切諸法，分為色法和心法二種，色法是指一切有形的物質，心法是指一切無形的精神。`,

'心法身', `吾人的心性即法身，為在纏如來，所以叫做心法身。`,

'心解脫', `又名[[慧解脫]]，[[無學]]之一。`,

'心即是佛', `意謂人人心中皆有佛性，只要向吾人的心靈去下功夫，就可以成就佛道。`,

'心用四分', `心識的作用有四種。見四分條。`,

'心生滅門', `[[起信論]]所說的一心二門，即[[真如門]]與[[生滅門]]。`,

'心佛及眾生是三無差別', `謂心、佛、眾生三者毫無差別，佛就是眾生，眾生就是佛，其差別只在迷悟兩個字，迷失了自性就是眾生，體悟到自性就是佛。`,

'手印', `手指所結成的印契。`,

'文殊', `文殊師利的簡稱，菩薩名，以大智著稱，與普賢常侍於釋迦如來的左右。`,

'文殊三昧', `能發無相微妙智慧的三昧，因此智慧是文殊菩薩所特有，故名文殊三昧。`,

'文殊師利', `菩薩名。見文殊條。`,

'文字般若', `凡是佛所說的一切教法，或是佛弟子所說的一切言教，不論是聲教或是文字所印刷的經典，都稱為文字般若。`,

'方丈', `寺廟的住持和尚。相傳維摩居士所住的石室，長寬祇有一丈，方丈之名，即是由此而來。`,

'方外', `僧道的別稱。`,

'方廣', `方是方正之義，廣是廣大之義，方廣就是一切[[大乘經]]的通稱。`,

'方便', `隨方因便，以利導人。`,

'方便心', `指方便實行布施、愛語、利行、同事等四攝法的心。`,

'方便土', `方便有餘土的簡稱，即二乘與沒有證得法身的菩薩所住的國土。`,

'方便智', `行方便的智慧。`,

'方便化身', `指彌陀報身中之化身。`,

'方便法身', `二種法身之一，即應身與化身的總名。見法身條。`,

'方便菩提', `三菩提之一。`,

'方便般若', `[[方便智]]與[[般若慧]]。證悟了真理叫做般若慧；通達利益他人之方法和手段，叫做方便智。`,

'方便有餘土', `見方便土條。`,

'方等', `方是廣之義，等是均之義，佛於第三時，廣說藏通別圓四教，均益利鈍之機，故名方等。`,

'方等時', `釋尊[[五時說法]]之第三時，此時在佛說阿含經之後，因見一切聞法的人都已得到決定信心，於是大小乘並說，往往在說法中，貶抑小乘，褒讚大乘，以引起鈍根者恥小慕大，促其進趣菩薩位，在八年之間，曾講過勝鬘、維摩等經。`,

'方等經', `[[大乘]]經的總稱。`,

'木魚', `以木製成的魚，在讀誦經文時叩擊之。据說魚類晝夜常醒不眠，今以木刻成魚形而叩擊之，目的在警惕眾人不可昏沉懶惰，應該晝夜精勤修行佛法，直到成功為止。`,

'止', `[[定]]的意思，[[禪定]]的別名。`,

'止犯', `止是停止，犯是不作善法，停止不作善法，叫做止犯。`,

'止持', `止作二持之一。見二持條。`,

'止持戒', `制止罪惡行為的戒法，如五戒八戒等是。`,

'止觀', `[[止]]與[[觀]]。止是止息一切妄念，觀是觀察一切真理。止屬於定，觀屬於慧，止觀就是定慧雙修的意思。`,

'止觀宗', `[[天台宗]]的別名，因天台宗是以止觀為主要的修法。`,

'止觀十觀', `[[陰界入]]、[[煩惱]]、[[病患]]、[[業相]]、[[魔事]]、[[禪定]]、[[諸見]]、[[增上慢]]、[[二乘]]、[[菩薩]]。`,

'止觀法門', `止是定的意思，觀是慧的意思，所以止觀法門，就是修定慧的法門。`,

'比量', `[[因明學]]的三支量之一，即比喻量，如隔墻見角，比知有牛，隔岸見煙，比知有火。比量，即推比量度之意。`,

'比丘', `出家受具足戒者的通稱，男的叫比丘，女的叫比丘尼。比丘含有三義，即一、乞士，就是一面向社會群眾乞化飲食，以資維持色身，一面又向慈悲的佛陀乞化法食，以資長養法身。二、破惡，此惡是指心中的種種煩惱而言，出家人修戒定慧三學，撲滅貪瞋痴等煩惱，以便達到了生脫死的目的。三、怖魔，六欲天的天魔希望一切的眾生皆為魔子魔孫，永遠受他的控制，可是出家的佛弟子目的卻在跳出三界，以解脫為期，大家都很認真修行，不為天魔外道所擾亂，於是魔宮震動，魔王怖畏起來，故謂之怖魔。`,

'比丘尼', `出家受具足戒的女性的通稱。`,

'公案', `禪家指點學人，在言語或動作上的垂示，叫做公案。`,

'毛道', `又名[[毛頭]]，是[[凡夫]]的別名，因凡夫的心念不定，猶如輕毛隨風飄舞不定。`,

'毛頭', `又名毛道。見毛道條。`,

'水大', `四大之一。見四大條。`,

'水月', `水中之月。水月有影無實，以喻諸法無有實體。`,

'水災', `[[大三災]]之一。在四劫中的壞劫時，火風水三災相繼而起，其中水災最為厲害，它蕩盡整個世界。`,

'水輪', `成立世界的[[四輪]]之一，在空輪之上有[[風輪]]，風輪之上，光音天的雨水造成深十一億二萬之水層，此水層即名水輪。`,

'水懺', `唐悟達禪師，膝上生人面瘡，遇異僧掬水洗之，瘡癒，因著慈悲水懺法三卷。`,

'水想觀', `[[觀無量壽經]]所說的十六觀之一，即觀想[[極樂世界]][[八功德水]]的相狀的觀法。`,

'水風火災', `劫末所起的[[水災]][[風災]][[火災]]。`,

'火大', `[[四大]]種之一，以溫熱為性，調熱為用，因周遍於一切物質，故曰大。`,

'火宅', `[[法華經|妙法蓮華]]說，三界無安，猶如火宅，意謂三界好像是一所被火燒著的房子一樣，人們住在裡面，苦不堪言。`,

'火災', `劫末所起的大三災之一。見大三災條。`,

'火淨', `五種[[淨食]]之一，即將一切瓜果食物，先以火燒煮使熟之後才食。`,

'火塗道', `[[地獄]]的別名，與刀塗道血塗道等合稱為[[三塗]]。`,

'火焚地獄', `[[焦熱地獄]]的別名，因墮落在此地獄中的罪人，時常被猛火所焚燒，故名。`,

'不生', `１．[[阿羅漢]]的譯名，因阿羅漢已經了脫生死，不再生於三界六趣之中。<br>２．[[如來]]的別名，因如來常住在不生不滅的境界之中。`,

'不生斷', `吾人的煩惱斷盡時，三途惡道的苦果也永遠不再生，不生就是斷滅，所以叫做不生斷。三斷之一。`,

'不生不滅', `不生也不滅，是常住的別名，也是永生的意思。[[涅槃經]]說：「<verse>涅言不生，槃言不滅，不生不滅，名大涅槃。</verse>」`,

'不死門', `不死就是涅槃，入於涅槃之道，叫做不死門。`,

'不共法', `如來的功德與眾不同，故名不共法，有小乘十八不共法和大乘十八不共法兩種。見十八不共法條。`,

'不共業', `二業之一。見二業條。`,

'不共佛法', `佛的十八種功德法，惟佛獨有，不與三乘共有，故云不共。見十八不共法條。`,

'不共般若', `１．[[佛說般若經]]，分為共與不共兩種，能共通於聲聞緣覺菩薩之法的，叫做共般若，只談菩薩所行之法的，也就是不共通於聲聞緣覺的，叫做不共般若。<br>２．[[天台]]以共般若為通教，不共般若為別圓二教。`,

'不共無明', `又名[[獨頭無明]]，二種無明之一。`,

'不見舉', `比丘犯了罪卻說不犯，叫做不見，舉治這種不見的過失，叫做不見舉。三舉之一。`,

'不但中', `觀空假之外一切都是中，叫做但中，是離去空假二邊，但取中道，於理未圓，這是別教所說的中觀，若觀即空即假即中，收空假而為中，叫做不但中，這是圓教所說的圓融中觀。`,

'不但空', `二乘人觀察一切事物，只見但空而不見不空，所以叫做但空，亦名偏空；菩薩不但見但空，而且也見不空，所以叫做不但空，亦即中道之空，這是天台四教中通教的空觀。`,

'不退', `不再退轉的意思。有三種的不退，即一、[[位不退]]，證到圓教的初信位，破了見惑，進入聖人的境界，便永遠不再退回到以前凡夫的地位；二、[[行不退]]，證到圓教的十信位，破了思惑與塵沙惑，此時專門濟度一切眾生，永遠不會再退回到以前二乘的地位；三、[[念不退]]，證到圓教的初住位，不但證悟了自己的靈性，而且得到無生法忍，此時的心便安住在這種真實智慧的念頭上，永遠不會再退失。`,

'不退地', `不退失其地位的意思。`,

'不動地', `十地之一。見十地條。`,

'不動滅無為', `生於色界第四禪天，滅苦樂二受粗動，所得的真如，名不動滅無為。`,

'不淨行', `又名非梵行，梵是清淨的意思，非梵行是指淫事，因愛染污心，故名不淨行。`,

'不淨肉', `不清淨的肉。`,

'不淨觀', `[[五停心觀]]之一，即觀察自己和他人的身體皆污穢不淨，可治貪欲。`,

'不淨說法', `又名[[邪命說法]]，不論說正法或邪法，其心邪，皆名不淨說法，如別有企圖，說虛妄語，令他生信，或不說佛法，徒說世事，或飲酒食五辛，犯正淫或邪淫後，即著衣入佛堂說法，觸穢三寶，或誹謗有德人，而自稱讚，或不悟一乘真實法，致使所說停滯於權教有相之法，或貪利養故而說，或欲勝他人而故說，或所說與經義相違，凡此種種，皆名不淨說法。`,

'不與取', `他人不與而自取，即[[偷盜]]之義。`,

'不還向', `[[聲聞]]乘四向之一。見四向四果條。`,

'不還果', `[[聲聞]]乘四果之一。見四果條。`,

'不斷光', `[[十二光|十二光佛]]之一，即阿彌陀佛的光明，彌陀的光明，常存三世，恆照世間而不斷絕。`,

'不斷常', `沒有暫時間斷的意思。`,

'不懺舉', `[[三舉]]之一，即惡比丘破了戒不肯懺悔，眾僧勸說不聽，於是舉治之而擯於僧團之外。`,

'不二之法', `指如如平等而無彼此分別的一實相法。`,

'不清淨施', `在布施的時候，未能做到施者受者與施物無實有之三輪體空境界，叫做不清淨施。`,

'不增不滅', `１．就實相之空理而言，如般若經說：「諸法空相，不生不滅，不垢不淨，不增不減」。意思是說諸法就是真空，真空即無增減。<br>２．就法之無盡而言，眾生無盡，佛亦無盡，而說二界無增減。`,

'不變真如', `謂真如的體性，畢竟平等，無有變易。`,

'不變隨緣', `謂雖隨緣而現萬有，但其本體不變。`,

'不住生死', `不著生死的相。`,

'不取正覺', `佛得無上正等正覺，然後成佛，簡稱為正覺，不取正覺就是不成佛之義。`,

'不過中食', `過中午十二時便不再食東西。諸天早食，佛午食，畜生午後食，鬼夜食，佛弟子當學佛行，斷六趣因，故比丘每日均須不過中食。`,

'不通懺悔', `不能夠懺悔。`,

'不相應行法', `謂非如心王心所之無形，亦不如色法之有形，與這三法皆不相應，而是宇宙萬有變化的幻象，故名不相應行法，共有二十四法。`,

'不染污無知', `以劣慧為體，因慧劣故，不解事物的義理，其無知非因染污而起，故名不染污，不知無數法門差別，故名無知，台家謂之塵沙惑，此惑不障出世生死，而障修道成佛，故菩薩必須須斷之。`,

'不可思議', `不可以心思之亦不可以言議之的意思。`,

'不可說不可說', `佛經中的極大數目字，比阿僧祇劫等數目，還要大得多。`,

'不思議變易生死', `菩薩修道時，因工夫進步的緣故，由前一期的心境，轉移到後一期的心境時，前後的感覺，截然不同，回顧前塵，有如死後再生，故亦名為生死，然而實際上只是心的生死，並非身的生死，只算心境的一度變易，而此變易，最為神奇而不可思議，故名不思議變易生死。`,

'中有', `又名中陰。見中陰身條。`,

'中劫', `二十小劫為一中劫。見一中劫條。`,

'中尊', `位在中央的尊體。`,

'中觀', `觀想[[中諦]]之道理，為[[三觀]]之一。`,

'中諦', `[[天台宗]]所立[[三諦]]之一。`,

'中道', `不偏於空，也不偏於有，非空非有，亦空亦有，不落二邊，圓融無礙，謂之中道。[[法相]]以唯識為中道，[[三論]]以八不為中道，[[天台]]以實相為中道，[[華嚴]]以法界為中道。`,

'中道觀', `觀想中正不偏之理的觀法，為天台三觀之一。`,

'中道義', `中道的勝義，即離互相對立的二邊，連中亦不要，絕諸對待的勝義。`,

'中道實相', `諸法非空非有，亦空亦有，不落二邊，圓融無礙，叫做中道實相。`,

'中道第一義諦', `簡稱[[中諦]]，即有就是空，空也就是有，圓融而無礙，不偏於一邊。`,

'中陰|中陰身', `又名[[中有]]。見中陰身條。`,

'中陰身', `又名[[中有]]，即人死後尚未投胎之前，有一個由微細物質形成的化生身來維持生命，此化生身即是中陰身。此中陰身在最初的四十九天中，每七天一生死，經過七番生死，等待業緣的安排，而去投生。`,

'中陰了生', `人死之後，尚未投生，於中陰中，就能了知它將來托生之處了。`,

'中千世界', `見大千世界條。`,

'中隨煩惱', `即[[無慚]]（不自慚恥對不住自己）[[無愧]]（不自羞愧對不住他人）二種煩惱，此二種煩惱是隨逐六[[根本煩惱]]而起的[[枝末煩惱]]，因其遍於所有惡性之心，凡作惡事皆有此二心，範圍比小隨煩惱大，所以叫做中隨。`,

'中後不食', `中午之後不再吃東西。`,

'五力', `五根堅固發生力量，叫做五力，即[[信力]]、[[精進力]]、[[念力]]、[[定力]]、[[慧力]]。信力是信根增長，能破諸邪信；精進力是精進根增長，能破身之懈怠；念力是念根增長，能破諸邪念；定力是定根增長，能破諸亂想；慧力是慧根增長，能破三界之諸惑。`,

'五行', `１．[[布施行]]、[[持戒行]]、[[忍辱行]]、[[精進行]]、[[止觀行]]。<br>２．[[聖行]]、[[梵行]]、[[天行]]、[[嬰兒行]]、[[病行]]。聖行是指菩薩修習戒定慧三業；梵行是指菩薩以清淨心去運用慈悲，為眾生拔苦與樂；天行之天是天然之理的意思，菩薩順著天然之理，而成妙行，叫做天行；嬰兒行之嬰兒是譬喻人天小乘，菩薩以慈悲之心，示現人天小乘之行，叫做嬰兒行；病行是菩薩為度眾生，以大慈悲心與一切眾生同受煩惱與病苦。`,

'五品', `指[[圓教]]五品外凡位，即一、[[隨喜品]]，聞實相之法，而信解隨喜的人；二、[[讀誦品]]，讀誦法華，及諸大乘經，而助觀解的人；三、[[講說品]]，將所見解的佛法說出，以利益他人的人；四、[[兼行六度品]]，是兼修六度，以助觀心的人；五、[[正行六度品]]，是正行六度，以自度度他，事理具足，觀行轉勝的人。十住以上，稱為聖者，十住以下皆是凡夫，為別於十信內凡，故稱外凡。`,

'五性', `[[法相宗]]將一切眾生的[[根機]]，分為五類，叫做五性。一、有可修成阿羅漢果的無漏種子者，名[[定性聲聞]]。二、有可修成辟支佛的無漏種子者，名[[定性緣覺]]。三、有可修成佛果的無漏種子者，名[[定性菩薩]]。四、兼有以上二種或三種的無漏種子，則將來所證之位，遇緣成熟，並不一定證何種果者，名[[不定性]]。五、並無以上三乘的無漏種子，但有可修成人天果的有漏種子者，名為[[無性]]。`,

'五辛', `五種帶有辛味的蔬菜、即大蒜、茖蔥、慈蔥、蘭蔥、興渠。學佛人要戒食五辛，因五辛中含有極充份的刺激性，熟吃能使人淫火焚身，生啖又易使人增高瞋恚，學佛人一有了慾念和瞋恚，便會蒙蔽智慧，增長愚痴，妄動無明，造諸惡業。`,

'五見', `又名[[五惡見]]，即[[身見]]、[[邊見]]、[[邪見]]、[[見取見]]、[[戒禁取見]]。身見是執著五蘊假和合之身為實有；邊見是偏於一邊的惡見，如有些人以為人死之後一切都歸於無，所謂人死如燈滅，這叫做[[斷見]]，又有一些人以為人死之後仍是為人，豬馬牛羊死後仍是為豬馬牛羊，這叫做[[常見]]，這種執斷執常的見解，都偏于一邊，故名邊見；邪見是邪而不正的見解，如謗無因果，壞諸善事是；見取見之見即指我見、邊見、邪見，取是取著不捨，對於上述三種不正見，執以為是，名見取見；戒禁取見就是執行或受持邪戒，錯認以為是正戒，如一般人持牛戒狗戒等，以為是生天之因，又有一般人塗灰斷食，錯認以為是涅槃之道是。`,

'五沒', `五種退沒的相，即天人將退沒於下界時，所現的五種衰相。見五衰條。`,

'五宗', `１．指大乘之五宗，即[[天台宗]]、[[華嚴宗]]、[[法相宗]]、[[三論宗]]、[[律宗]]。<br>２．指[[禪宗]]之五宗。見五家條。`,

'五家', `禪宗的五宗，即一、[[臨濟宗]]， 由晚唐時期的[[臨濟]]義玄所創。二、[[曹洞宗]]， 由晚唐時期的洞山良價及其弟子曹山本寂共同創立。三、[[雲門宗]]， 由五代時期的雲門文偃所創。四、[[法眼宗]]， 由五代時期的法眼文益所創，他融合了[[華嚴經]]的思想。五、[[溈仰宗]]， 由唐代高僧靈佑（溈山靈佑）及其弟子慧寂（仰山慧寂）共同創立，此宗以其獨特的圓相傳法為特色。`,

'五法', `[[楞伽經]]與[[唯識論]]等，把一切有為無為，有漏無漏諸法，歸納為五法，即一、[[相]]，即森羅萬象的事物，情與無情，千態萬狀，其形相各各不同；二、[[名]]，即依彼種種相，假設種種名，以作表詮；三、[[分別]]，即於萬物的相及名，思量之，識別之，於是有所謂大小、高低、美醜、是非等出現；四、[[正智]]，指無漏心心所，離虛妄分別，觀名相互為其客，離常離斷，如理而知；五、[[如如]]，由正智所證的境界，心境皆寂，一如真如的體性。此中前二是所變境，第三是能變心自緣其所變境，三者皆屬[[有漏法]]，第四是就法相正觀法性，屬於[[無漏法]]，第五是心境一如，湛然寂滅。`,

'五受', `吾人的心識領納外境時所產生的五種感受，即[[憂受]]、[[喜受]]、[[苦受]]、[[樂受]]、[[捨受]]。`,

'五食', `能夠長養[[出世]]善根的五種法食，即[[念食]]、[[法喜食，禪悅食]]、[[願食]]、[[解脫食]]。念食就是修道的人常持正念，以長養一切善根；法喜食就是修道的人愛樂妙法，心生喜悅，以長養其慧命；禪悅食就是修道的人因得禪定而心身喜悅，以長養其慧命；願食就是修道的人以誓願持身，以長養一切善根；解脫食就是修道的人解脫惑業的繫縛，於法得自在，以長養一切之菩薩善根。`,

'五衰', `[[天人]]將死時有五種衰相現前，即一、[[頭上花萎]]，就是頭上所帶的花冠漸漸枯萎；二、[[衣裳垢膩]]，就是無縫的天衣生出污垢來；三、[[身體臭穢]]，就是天人身上的光明不但消失，而且流出很多臭的氣味來；四、[[腋下汗出]]，就是兩𪊴之下流出很多的臭汗；五、[[不樂本座]]，就是以上種種不好的衰相出現之後，天人便對自己的寶座生出不樂的感受，天女眷屬也厭離他們而走開。`,

'五忍', `一、[[伏忍]]，別教菩薩於十住十行十迴向三賢間，未斷煩惱種子，而制伏之不使起之位；二、[[信忍]]，於初地至三地間，既見法性而得正信之位；三、[[順忍]]，於四地至六地間，順菩提道而趣向無生果之位；四、[[無生忍]]，於七地至九地間，悟入諸法無生理之位；五、[[寂滅忍]]，於第十地及妙覺間，諸惑斷盡而涅槃寂滅之位。忍者忍可，或安忍之義，即心安住於其理而不動搖。`,

'五悔', `五種的懺悔方法。[[天台]][[智者大師|智顗]]為了修習[[法華三昧]]的人，依据[[彌勒問經]]、[[占察經]]與[[普賢觀經]]等之意，而訂出五種的懺悔方法，即一、[[懺悔]]，發露自己已往之罪而誡將來；二、[[勸請]]，勸請十方諸佛以轉法輪；三、[[隨喜]]，對於自他一切之善根隨喜讚嘆；四、[[迴向]]，以所修之功德趣向於眾生及佛道；五、[[發願]]，發[[四弘誓願]]以導引前面之四行。`,

'五通|五神通', `五種的神通。見五神通條。`,

'五欲', `１．[[色]]、[[聲]]、[[香]]、[[味]]、[[觸]]。色是指美麗的色相；聲是指宛轉的聲音；香是指芬芳的香氣；味是指可口的味覺；觸是指適意的觸樂。以上五者因能使人生起貪欲之心，故名五欲。<br>２．[[財欲]]、[[色欲]]、[[飲食欲]]、[[名欲]]、[[睡眠欲]]。`,

'五眼', `[[肉眼]]、[[天眼]]、[[慧眼]]、[[法眼]]、[[佛眼]]。肉眼是肉身凡夫的眼，遇昏暗，遇阻礙，就不能見；天眼是天人的眼，遠近晝夜，都能得見；慧眼是聲聞的眼，能看破假相，識得真空；法眼是菩薩的眼，能澈了世間和出世間的一切法門；佛眼是如來的眼，有了佛眼便兼有前面的四種眼，能無事不知，無事不見，一切法中，佛眼常照。`,

'五眾', `１．舊譯[[五蘊]]為五眾，眾是和集的意思。<br>２．指出家五眾，即[[比丘]]（受具足戒的男子）、[[比丘尼]]（受具足戒的女子）、[[式叉摩那]]（華譯為[[學法女]]，就是將受具足戒而先學六法的女子）、[[沙彌]]（出家受十戒的男子）、[[沙彌尼]]（出家受十戒的女子）。`,

'五結', `[[貪結]]、[[恚結]]、[[慢結]]、[[嫉結]]、[[慳結]]。結是煩惱的別名，因煩惱能結縛眾生，使流轉於三界。`,

'五惑|五鈍使', `與[[五鈍使]]同。`,

'五衍|五乘', `[[五乘]]。梵語衍，華譯就是乘。`,

'五過', `１．指破戒五過，即[[害自身]]、[[為智者所呵]]、[[惡名流布]]、[[臨終後悔]]、[[死墮惡道]]。<br>２．指依語五過，即[[不正信]]、[[退勇猛]]、[[誑人]]、[[謗法]]、[[輕聖法]]。`,

'五根', `１．指眼等之五根，眼根能生眼識，耳根能生耳識，鼻根能生鼻識，舌根能生舌識，身根能生身識。<br>２．[[信根]]、[[進根]]、[[念根]]、[[定根]]、[[慧根]]，因此五法是生聖道的根本，故名五根。`,

'五篇', `[[波羅夷]]、[[僧殘]]、[[單墮]]、[[提舍尼]]、[[突吉羅]]。見八段五篇條。`,

'五葬', `[[土葬]]、[[火葬]]、[[水葬]]、[[野葬]]、[[林葬]]。`,

'五葷|五辛', `又名五辛。見五辛條。`,

'五業', `１．[[順現法受業]]、[[順次生受業]]、[[順後次受業]]、[[時分不定異熟定業]]、[[時分不定異熟不定業]]。<br>２．[[取受業]]、[[作用業]]、[[加行業]]、[[轉變業]]、[[證得業]]。<br>３．[[救濟災橫之業]]、[[救濟惡道之業]]、[[救濟行非方便之業]]、[[救濟行身見之業]]、[[救濟乘之業]]。<br>４．[[身業]]、[[口業]]、[[意業]]、[[智業]]、[[方便智業]]。`,

'五障', `１．指女人身體所有的五種障礙，[[法華經|妙法蓮華]]提婆品說：「<verse>又女人身，猶有五障，一者不得作梵天王，二者帝釋，三者魔王，四者轉輪聖王，五者佛身。</verse>」<br>２．[[法華經|妙法蓮華]]中說：欺為信障，怠為進障，瞋為念障，恨為定障，怨為慧障。<br>３．指修道之五障，即[[煩惱障、[[業障]]、[[生障]]、[[法障]]、[[所知障]]。`,

'五塵', `[[色]]、[[聲]]、[[香]]、[[味]]、[[觸]]。因此五境能污染真理，故名塵。`,

'五明', `古印度的五種學術，即語文學的[[聲明]]、工藝學的[[工巧明]]、醫藥學的[[醫方明]]、論理學的[[因明]]、宗教學的[[內明]]。`,

'五苦', `[[生老病死苦]]（人生必經的四大過程）、[[愛別離苦]]（與所愛者離別之苦）、[[怨憎會苦]]（常與憎惡者會合之苦）、[[求不得苦]]（不得所求之苦）、[[五陰盛苦]]（吾人五陰合成的身體受熾盛的痛苦）。`,

'五慳', `[[住處慳]]、[[家慳]]、[[施慳]]、[[餘讚慳]]、[[法慳]]。住處慳是只許我自己在此處住，別人不得在此處住；家慳是只許我獨入此家，別人不得進入；施慳是只許我接受別人的布施，他人不得也接受；餘讚慳是只許我獨自接受稱讚，他人不得共享；法慳是只許我自己知道此經的深義，他人不得共同知道。`,

'五蓋', `五種的煩惱。蓋就是煩惱的別名，因煩惱能蓋覆人們的心性，使不生善法。[[合貪欲]]、[[瞋恚]]、[[睡眠]]、[[掉悔]]、[[疑法]]，叫做五蓋。`,

'五祖', `中國[[禪宗]]第五代祖師，湖北蘄州黃梅縣人，俗姓周，法名[[弘忍]]，十三歲拜謁四祖[[道信]]，隨從三十年而得法，主化於東山的東禪寺，傳法於[[六祖]][[惠能]]，七十四歲圓寂，諡號[[大滿禪師]]。`,

'五樂', `[[出家樂]]、[[遠離樂]]、[[寂靜樂]]、[[菩提樂]]、[[涅槃樂]]，出家樂是世人有許多的惑業煩惱，如果出家修道證果，便能永斷這種痛苦；遠離樂是色界初禪天的樂，初禪能遠離欲界的愛染煩惱，而生禪定的喜樂；寂靜樂是二禪天的樂，二禪離初禪尋伺之散動，澄心寂靜而發深妙的喜樂；菩提樂就是成就無上妙道，於法界得自在的法樂；涅槃樂即離生死的痛苦，而入於無餘涅槃，獲得究竟寂滅之樂。`,

'五境', `色聲香味觸五法，是眼耳鼻舌身五根所緣之境，所以叫做五境。`,

'五翳', `[[煙]]、[[雲]]、[[塵]]、[[霧]]、[[阿修羅之手]]。因此五者能障蔽日月之光，故名五翳。`,

'五識', `[[眼識]]、[[耳識]]、[[鼻識]]、[[舌識]]、[[身識]]。因是六識中之前五識，故名五識。在三界中，欲界的有情有六識，色界的初禪天無鼻舌二識，二禪天以上則五識全無，唯有一意識而已。`,

'五覺', `[[本覺]]、[[始覺]]、[[相似覺]]、[[隨分覺]]、[[究竟覺]]。本覺是本有常住之覺；始覺是依修行之功而顯出本覺；相似覺是菩薩於十信位時所得類似始覺的覺；隨分覺是菩薩於十往十行十迴向等位時所分分得真正的始覺；究竟覺是菩薩於妙覺位時，成就究竟至極的始覺，這時已經和本覺相一致了。`,

'五觀', `一、[[真觀]]，即觀察真諦的道理以斷見思之惑的空觀；二、[[清淨觀]]，即既已斷見思之惑，再斷塵沙之惑的假觀；三、[[廣大智慧觀]]，即斷了無明之惑之後，而得廣大智慧的中觀；四、[[悲觀]]，以上面三種觀觀眾生，而願拔眾生之苦；五、[[慈觀]]，即以上面三種觀觀眾生，而願給眾生快樂。`,

'五教', `見五教十宗條。`,

'五教十宗', `[[華嚴宗]]將釋尊一生所說的教法，判為五教十宗，五教是由法分出，十宗是由理分出。<br>五教者：一、[[小乘教]]，是教鈍根小機之法，但說生空，而未說法空，故又稱為愚法聲聞教。二、[[大乘始教]]，是出小乘，初入大乘的教法，雖說大乘，而未及究竟微妙的理性，故名始教，有相始教與空始教之分。三、[[大乘終教]]，是對大乘純熟的根機，所說盡理之教。四、[[大乘頓教]]，是說大乘頓悟的教門者。五、[[一乘圓教]]，是圓滿最上的教法，明性海圓融，緣起無盡，極諸法的體性者。<br>十宗者：一、如小乘[[犢子]]、[[法上]]、[[腎胃]]、[[正量]]、[[密林山]]等部，說我法俱實有者，名我法俱有宗。二、如小乘[[雪山]]、[[多聞]]、[[化地]]等部，說一切無我，而法體恆有者，名法有我無宗。三、如小乘[[雞胤]]、[[法藏]]、[[飲光]]、[[制多山]]、[[西山住]]、[[北山住]]等部，說現在法有，過未法無者，名法無去來宗。四、如小乘[[說假部]]，說現在法為假有，亦為實有者，名現通假實宗。五、如小乘[[說出世部]]，說世間虛妄，出世真實者，名俗妄真實宗。六、如小乘[[一說部]]，說諸法但有假名，無有實體者，名諸法但名宗。七、如大乘始教的[[般若經]]中觀論等，說示諸法皆空者，名一切皆空宗。八、如大乘終教的[[楞伽]][[經起信論]]等，說示真如體性的教義者，名真實不空宗。九、如大乘頓教的[[禪宗]]，絕諸言慮，直證真理者，名相想俱絕宗。十、[[一乘圓教]]，說示圓滿具足萬德法界的教義，名圓明具德宗。`,

'五趣', `又名[[五惡道]]，或[[五道]]，即[[地獄]]、[[餓鬼]]、[[畜生]]、[[人]]、[[天]]。`,

'五趣地|五趣雜居地', `見五趣雜居地條。`,

'五趣雜居地', `[[九地]]之一，即地獄、餓鬼、畜生、人、天等五趣雜居之地，因其皆有欲，故合為一地。`,

'五逆|五逆罪', `見五逆罪條。`,

'五逆罪', `五種極逆於理的罪惡，即[[殺父]]、[[殺母]]、[[殺阿羅漢]]、[[出佛身之血]]、[[破和合之僧]]。因此五種是極端罪惡的行為，任犯一種，即墮無間地獄，故又名無間業。`,

'五大', `[[地大]]、[[水大]]、[[火大]]、[[風大]]、[[空大]]。`,

'五大使者', `又名五天使者，即[[生]]、[[老]]、[[病]]、[[死]]、[[王法牢獄]]。`,

'五大龍王', `又名[[五類龍王]]，即[[善住龍王]]、[[難陀婆難陀龍王]]、[[阿耨達龍王]]、[[婆樓那龍王]]、[[摩那蘇婆帝龍王]]。`,

'五戒', `[[不殺生]]、[[不偷盜]]、[[不邪淫]]、[[不妄語]]、[[不飲酒]]。不殺生是不殺傷生命；不偷盜是不盜取別人的財物；不邪淫是不作夫婦以外的淫事；不妄語是不說欺誑騙人的話；不飲酒是不吸食含有麻醉人性的酒類及毒品。`,

'五戒法', `佛昔為在家弟子受三皈依後，即授予五戒，使之成為優婆塞及優婆夷，如果在家弟子破了五戒，就不是清淨的士女。`,

'五戒二十五神', `五戒——各有五神，保護受持五戒的人。`,

'五味', `[[乳味]]、[[酪味]]、[[生酥味，熟酥味]]、[[醍醐味]]。佛在涅槃經中提到乳等五味時，曾以醍醐味來形容涅槃經，後來天台[[智者大師|智顗]]便因之判定佛的一代聖教為五時教。`,

'五味禪', `[[外道禪]]、[[凡夫禪]]、[[小乘禪]]、[[大乘禪]]、[[最上乘禪]]。`,

'五乘', `[[人乘]]、[[天乘]]、[[聲聞乘]]、[[緣覺乘]]、[[菩薩乘]]。人乘就是乘著五戒的教法而生到人間來；天乘就是乘著十善的教法而生到天上去；聲聞乘就是乘著四諦的教法而證得阿羅漢果；緣覺乘就是乘著十二因緣的教法而證得辟支佛果；菩薩乘就是乘著六度的教法而證得至高無上之佛果。`,

'五乘齊入', `謂人、天、聲聞、緣覺、菩薩等行人，皆可乘阿彌陀佛的願力而一齊進入佛真實的報土。`,

'五陰', `[[五蘊]]的舊譯，陰是障蔽的意思，能陰覆真如法性，起諸煩惱。見五蘊條。`,

'五陰魔', `五陰是色、受、想、行、識，因此五者與煩惱，都是迷惑人的，所以叫做魔。`,

'五陰盛苦', `五陰是色、受、想、行、識，為構成人身的五種要素，人生的種種痛苦，都是由這五種要素組成的人身而來，所以說是五陰盛苦，為[[八苦]]之一。`,

'五陰世間', `見三世間條。`,

'五惡', `[[殺生]]、[[偷盜]]、[[邪淫]]、[[妄語]]、[[飲酒]]。`,

'五惡趣', `又名[[五趣]]，或[[五道]]，即[[地獄]]、[[餓鬼]]、[[畜生]]、[[人]]、[[天]]等五種境界。`,

'五輪', `１．五體的別名，人的兩肘兩膝和頭部等五處都作圓形，所以叫做輪，這五輪著地作禮，叫做五體投地，是表示最尊敬的意思。<br>２．世界是建立在五輪之上，依俱舍論等的說法，世界之最下層為虛空輪，其上為風輪、水輪、金輪、地輪，再上便是九山八海。<br>３．密教通稱地水火風空五大為五輪。`,

'五輪際', `指五輪最下層之虛空輪。`,

'五濁', `[[命濁]]、[[眾生濁]]、[[煩惱濁]]、[[見濁]]、[[劫濁]]。命濁是眾生因煩惱叢集，心身交瘁，壽命短促；眾生濁是世人每多弊惡，心身不淨，不達義理；煩惱濁是世人貪於愛欲，瞋怒諍鬥，虛誑不已；見濁是世人知見不正，不奉正道，異說紛紜，莫衷一是；劫濁是生當末世，飢饉疾疫刀兵等相繼而起，生靈塗炭，永無寧日。`,

'五濁增時', `[[五濁]]逐漸增長的時期。在[[住劫]]中人壽由二萬歲的時候開始，世界便漸漸渾濁而不淨起來，隨著時代的變化而越來越渾濁不淨，尤其是在末法時代的今日，更是渾濁不堪，所以叫做五濁增時。`,

'五位', `１．[[心法]]、[[心所法]]、[[色法]]、[[不相應行法]]、[[無為法]]。<br>２．[[唯識宗]]所立之修行五位，即[[資糧位]]、[[加行位]]、[[通達位]]、[[修習位]]、[[究竟位]]。`,

'五位百法', `[[唯識宗]]立五位百法，以總括宇宙萬有。五位者：[[心法]]、[[心所法]]、[[色法]]、[[不相應行法]]、[[無為法]]。百法者：心法八，是識的自性，心所法五十一，是識的所屬，色法十一，是心法心所法之所變，不相應行法二十四，是心法心所法，和色法的分位，也是與心色皆不相應的法，無為法六，即前四法的實性，合之為一百法。茲列表說明如下：
{{五位百法}}
（對比：[[七十五法]]）`,

'五法藏|五法', `見五法條。`,

'五蘊', `蘊是積集的意思，五蘊就是[[色蘊]]、[[受蘊]]、[[想蘊]]、[[行蘊]]、[[識蘊]]。色就是一般所說的物質，變礙為義，是地、水、火、風四大種所造；受就是感受，領納為義，其中包括苦、樂、捨三受；想就是想像，於善惡憎愛等境界中，取種種相，作種種想；行就是行為或造作，由意念而行動去造作種種的善惡業；識就是了別的意思，由識去辨別所緣所對的境界。在此五蘊中，前一種屬於物質，後四種屬於精神，乃是構成人身的五種要素。`,

'五蘊非有', `謂色受想行識五蘊所構成的人身是虛妄不實的，因為當五蘊分散時，人身也就沒有了，所以說五蘊非有。`,

'五蘊皆空', `五蘊是色受想行識，色從四大假合而有，從想行識由妄念而生，故此五蘊諸法，如幻如化，從因緣生，本無實性，當體即空，故謂五蘊皆空。`,

'五部', `１．指小乘五部，即[[曇無德部]]、[[薩婆多部]]、[[彌沙塞部]]、[[迦葉遺部]]、[[婆麤富羅部。見五部律條]]。<br>２．指金剛界五部，即[[蓮華部]]、[[金剛部]]、[[佛部]]、[[寶部]]、[[羯磨部]]。見金剛界五部條。`,

'五部律', `佛滅後百年間，付法藏第五祖優婆𤙥多之下有五弟子，於戒律上各抱異見，一大律藏便生五部之派別，即[[曇無德部]]、[[薩婆多部]]、[[彌沙塞部]]、[[迦葉遺部]]、[[婆麤富羅部]]。`,

'五部大論', `無著菩薩承彌勒菩薩之旨，著五部之大論，即[[瑜伽師地論]]、[[分別瑜伽論]]、[[大乘莊嚴經論]]、[[辨中邊論頌]]、[[金剛般若論]]。`,

'五部秘經', `密宗所依之五部經典，即[[大日經]]、[[金剛頂經]]、[[蘇悉地經]]、[[瑜祇經]]等加[[要略念誦經]]或[[菩提場經]]。`,

'五部禪經', `[[禪法要解經]]、[[達磨多羅禪經]]、[[坐禪三昧法門經]]、[[五門禪經要用法]]、[[禪要經]]。`,

'五部灌頂', `指金剛界的灌頂。`,

'五部大乘經', `[[天台]]大師選定下列五部為大乘經，即[[華嚴經]]、[[大集經]]、[[大品般若經]]、[[法華經|妙法蓮華]]、[[涅槃經]]。`,

'五百戒', `比丘尼的具足戒。本來只有三百四十八戒（參見[[八段五篇]]），以大數而稱為五百。`,

'五正行', `[[淨土宗]]所立，謂凡兼修他法者，名為雜行，若專修下列五法者，名為正行，即一、專讀誦淨土三經，名[[讀誦正行]]；二，專觀想極樂國莊嚴，名[[觀察正行]]；三、專禮拜阿彌陀佛，名[[禮拜正行]]；四、專稱念彌陀名號，名[[稱名正行]]；五、專讚歎供養阿彌陀佛，名[[讚歎供養正行]]。`,

'五念門', `[[淨土宗]]所立，即一，身業禮拜阿彌陀佛，屬[[禮拜門]]；二、口業執持彼佛名號，讚歎彼佛相好功德，屬[[讚歎門]]；三、一心發願，願生彼國，屬[[作願門]]；四、觀察彼佛菩薩，及依正莊嚴，屬[[觀察門]]；五、把功德迴向一切苦惱眾生，令得畢竟解脫，屬[[迴向門]]。`,

'五淨肉', `五種的淨肉，即[[不見殺]]、[[不聞殺聲]]、[[不為我殺]]、[[自死]]、[[鳥殘]]。`,

'五八識', `[[五識]]與[[八識]]。五識是眼、耳、鼻、舌、身；八識即第八阿賴耶識。`,

'五比丘', `指佛最初所度的五比丘，即[[憍陳如]]、[[額鞞]]、[[跋提]]、[[十力迦葉]]、[[摩訶俱男]]。`,

'五堅固|五五百年', `見五五百年條。`,

'五利使', `五種急性的煩惱，即[[身見]]、[[邊見]]、[[邪見]]、[[見取見]]、[[戒禁取見]]、[[見十使條]]。`,

'五鈍使', `五種慢性的煩惱，即[[貪]]、[[瞋]]、[[癡]]、[[慢]]、[[疑]]。見十使條。`,

'五無間', `[[五無間業]]的簡稱，又名[[五逆罪]]，即[[殺父]]、[[殺母]]、[[殺阿羅漢]]、[[出佛身血]]、[[破和合之僧]]，誰要是犯了其中的一項，死後即墮入無間地獄，故名五無間業。`,

'五具足', `五種供佛的器具，即花瓶一雙，蠟蠋台一對，香爐一個。`,

'五神通', `又名五通，或五神變，即[[天眼通]]、[[天耳通]]、[[他心通]]、[[宿命通]]、[[如意通]]。天眼通是指修得與色界天人同等的眼根，有了天眼通的人，不論遠近內外晝夜，都能得見；天耳通是指修得與色界天人同等的耳根，有了天耳通的人，一切聲音都可以聽得到；他心通是能夠知道他人一切心想的神通，有了他心通的人，便不愁遭受他人的暗算；宿命通就是能夠知道自己在六道之中的過去生死，並知道六道眾生在六道之中的過去生死，有了宿命通的人，過去生中的事，都能回憶，瞭如指掌；如意通又名[[神境通]]，或[[神足通]]，有了如意通的人，凡事都能隨心所欲，諸如鑽天入地，移山倒海，撒豆成兵，呼風喚雨，騰雲駕霧，都不成問題。`,

'五台山', `又名[[清涼山]]，是中國佛教四大名山之一，在山西五台縣，相傳為[[文殊菩薩|文殊]]的道場。`,

'五根本', `五根本煩惱，即[[貪]]、[[瞋]]、[[癡]]、[[慢]]、[[疑]]。`,

'五類天', `一、[[上界天]]，即色界及無色界之諸天；二、[[虛空天]]，即欲界六天中夜摩天以上之四天，也就是居於虛空之天；三、[[地居天]]，即欲界六天中之四王天與忉利天，也就是依須彌山之地而居之天；四、[[遊虛空天]]，即日月星宿等；五、[[地下天]]，即龍阿修羅及閻魔王等所居之處。凡是能放光明有自在之力的，都叫做天。`,

'五十一位', `指菩薩[[五十二位]]中之[[等覺位]]。`,

'五十二位', `菩薩由凡夫到成佛，一共要經過五十二個階位，即[[十信]]、[[十住]]、[[十行]]、[[十迴向]]、[[十地]]、[[等覺]]、[[妙覺]]。十信是由十住中的第一[[發心住]]內，分開另立的，若將其縮入發心住內，則只有四十二位。詳見大乘條。`,

'五十八戒', `[[梵網經]]上所說的十重與四十八輕戒，合稱為五十八戒。`,

'五五百年', `謂佛滅後之五個五百年，在每一個五百年中，各有一堅固，以示佛法的興廢。一、[[解脫堅固]]，謂在佛滅後之第一個五百年間，因為正法興盛，得到解脫的人很多。二、[[禪定堅固]]，謂在佛滅後之第二個五百年間，雖然無人獲得解脫，但是修學禪定的人很多。三、[[多聞堅固]]，謂在佛滅後之第三個五百年間，真正修行佛法的人雖然稀少，但是喜歡聽聞佛法的人很多。四、[[塔寺堅固]]，謂在佛滅後之第四個五百年間，世人很喜歡建立佛塔和寺院。五、[[鬥諍堅固]]，謂在佛滅後之第五個五百年間，戒定慧三學已被世人遺忘，唯以鬥諍為能事，是增長邪見的時期。`,

'五分法身', `以五種的功德法，成就[[佛身]]，叫做五分法身。一、[[戒法身]]，謂如來三業，離一切的過失。二、[[定法身]]，謂如來真心寂滅，離一切的妄念。三、[[慧法身]]，謂如來真智圓明，通達諸法的性相。四、[[解脫法身]]，謂如來的身心，解脫一切的繫縛。五、[[解脫知見法身]]，謂如來具有了知自己實已解脫的智慧。`,

'五分法身香', `一、[[戒香]]，謂自心中無過失，無罪惡，無嫉賢妒能的心理，無慳貪瞋忿的念頭，無劫掠殺害的意圖。二、[[定香]]，謂看到一切善惡境相之時，自心不會散亂。三、[[慧香]]，謂自心無障無礙，常以智慧觀照自己的真如自性，不造作一切罪惡之事，雖是修行種種善事，但心中不執著所作的善行，尊敬上輩，體念下人，憐憫孤苦，救濟貧窮。四、[[解脫香]]，謂自心在外境上無所攀緣，不想善，不想惡，安然自在，沒有罣礙。五、[[解脫知見香]]，謂自心既於善惡都無所攀緣，但也不可以沉落斷空頑守枯寂，應當廣泛參學多多聞法，認識自己的本心，通達諸佛的道法，從初發心一直到圓滿菩提時，真如自性毫不變易。香的意義，是以智慧火燒那抽象無價真香，這是真實的莊嚴佛身，這是真實供養如來。這五分香，皆從自性上說，皆從功德上修，也就是從自證自性法身來成如如佛。`,

'五那含天|五淨居天', `與[[五淨居天]]同，在色界之第四禪天，是阿那含（不還果）聖者的生處。`,

'五所依土', `[[法性土]]、[[實報土]]、[[色相土]]、[[他受用土]]、[[變化土]]。法性土是如來清淨法身所依之土；實報土是如來圓滿報身所依之土；色相土是如來微塵相海身所依之土；他受用土是如來他受用身所依之土；變化土是如來變化身所依之土。`,

'五相成身', `五相具備而成就佛身的觀法。[[菩提心論]]說：「一是[[通達心]]，二是[[菩提心]]，三是[[金剛心]]，四是[[金剛身]]，五是[[證得無上菩提獲金剛堅固身]]也。」`,

'五俱意識', `謂當前五識現起時，意識一定隨同俱起。`,

'五重唯識', `[[法相宗]]所修的觀行，從淺至深，共有五重，名五重唯識觀。第一重是[[遣虛存實]]，即遣除遍計所執的虛妄計度，而存依他起性及圓成實性的實體。第二重是[[捨濫留純]]，即捨除雜濫的外境，而存留純粹的內識。第三重是[[攝末歸本]]，即從見相二分的枝末作用上，攝歸自證分的本體。第四重是[[隱劣顯勝]]，即隱心所的劣，而顯心王的勝。第五重是[[遣相證性]]，即遣差別的事相，而證無差別的理性，也可以說，遣去一切法相，證入一切法性，名遣相證性。又此五重唯識觀，即為五種相對：第一重遣虛存實，為空有相對，要遣空而存有。第二重捨濫留純，為心境相對，要捨境而留心。第三重攝末歸本，為體用相對，要攝用而歸體。第四重隱劣顯勝，為王所相對，要隱所而顯王。第五重遣相證性，為事理相對，要遣事而證理。前四屬唯識相，後一屬唯識性。茲列表說明如下：
{{!五重唯識}}`,

'五時說法', `佛成道後，於最初三七日，說華嚴經，度大菩薩，是為[[華嚴時]]。繼在鹿野苑等處，於十二年中，說小乘阿含經，度聲聞緣覺乘人，是為[[阿含時]]。繼阿含時後，於八年中，說維摩勝鬘金光明等諸大乘經，廣談四教，均被眾機，是為[[方等時]]。乃後，二十二年間，說諸部般若經，強調諸法皆空之義，是為[[般若時]]。再後八年，說妙法蓮華經，會三乘於一佛乘。法華之後，佛將入滅，乃在拘尸那拉城娑羅雙樹間，於一日一夜，說大般涅槃經，顯常樂我淨義，昭示一切眾生，皆有佛性，乃至一闡提人，亦當成佛，是為[[法華涅槃時]]。`,

'五時八教', `[[天台]][[智者大師|智顗]]，判釋尊所說之法，為五時八教。五時是就時間的先後分出，即[[華嚴時]]、[[阿含時]]、[[方等時]]、[[般若時]]、[[法華涅槃時]]。八教是就法的性質分出，八教中又分為[[化法四教]]與[[化儀四教]]，化法是教化眾生的法門，即[[三藏教]]、[[通教，別教]]、[[圓教]]；化儀是教化眾生的儀式，即[[頓教]]、[[漸教]]、[[秘密教]]、[[不定教]]。`,

'五類法身', `[[真言宗]]所說，謂此五類法身，皆含攝在大日如來一大法身內，所有十方三世諸佛菩薩，天龍鬼神，有情無情，皆是毘盧遮那法身所攝，包無不盡。一、[[自性法身]]，諸佛真身，法性理智，自然具足，三世常恆，流出三密之法，以教菩薩，有理法身與智法身之別，皆名自性法身。二、[[受用法身]]，諸佛的受用法身有二種，一種是自受用身，是自受法樂之身，與理相應，一種是他受用身，是為十地菩薩所現的身，與智相應，皆名受用身法。三、[[變化法身]]，諸佛為地前菩薩，及二乘凡夫，所現的丈六應身，說內證法，屬於變化所作，亦是法爾而有，名變化法身。四、[[等流法身]]，此身係為九界平等流出，故名等流，乃至為六道含靈，示現同類的身形，隨機化變，名等流法身。五、[[法界身]]，如來法身，具六大體性，周遍法界，名法界身。`,

'五淨居天', `[[色界]]之[[第四禪天]]，為證得[[阿那含]]（不還果）的聖者所生之處，其處共有五天，[[即無煩天]]（無一切的煩雜）、[[無熱天]]（無一切的熱惱）、[[善現天]]（能現一切的勝法）、[[善見天]]（能見一切的勝法）、[[色究竟天]]（色天最勝之處）。`,

'五停心觀', `能使五種過失停止於心的觀法，亦即聲聞乘人在最初入道時所修的五種觀法。一、[[不淨觀]]，是觀察一切根身器界皆屬不淨，以停止貪欲。二、[[慈悲觀]]，是觀察一切眾生痛苦可憐之相，以停止瞋恚。三、[[因緣觀]]，是觀察一切法皆從因緣生，前因後果，歷歷分明，以停止愚痴。四、[[念佛觀]]，是觀察佛身相好，功德莊嚴，以停止業障。五、[[數息觀]]，是觀察呼吸出入之相，每一出入，皆暗數自一至十，以停止散亂。`,

'五部灌頂', `此有三種，第一種：一、[[阿闍黎灌頂]]，即傳法灌頂。二、[[受明灌頂]]，又云成就灌頂。三、[[息災灌頂]]，又云滅罪灌頂。四、[[增一灌頂]]，又云求果灌頂。五、[[降伏灌頂]]，又云除難灌頂。第二種：一、[[光明灌頂]]，即以光明加被行者之身。二、[[甘露灌頂]]，即以香水灌頂。三、[[種子灌頂]]，即觀種子而布於身心。四、[[智印灌頂]]，即以印契加持於五處。五、[[句義灌頂]]，即觀真言之義，布於心胸，使之起悟解。第三種：五種的三昧耶，稱為五種灌頂。`,

'五處供養', `人們應對父、母、親教師、軌範師、病人等常作供養。`,

'五種禪', `[[四念處]]、[[八背捨]]、[[九次第定]]、[[師子奮迅三昧]]、[[超越三昧]]。`,

'五種供養', `塗香、華、燒香、飲食、燈明。`,

'五種不退', `就[[淨土門]]所立四不退中第四之處不退，而立五種之不退，即[[大悲攝持不退]]、[[佛光照觸不退]]、[[常聞法音不退]]、[[善友同居不退]]、[[壽命無量不退]]。`,

'五種比量', `五種的推理法，即一、[[相比量]]，即依照所見的去推理其他；二、[[體比量]]，如由甲之體性而推乙，由一部之體而推理全部；三、[[業比量]]，即由所造之業而推理其造作者；四、[[法比量]]，即由一部份的事而推理其他的真理；五、[[因果比量]]，即見因而推理其果，見果而推度其因。`,

'五種淨食', `一切食物要依照五種方法清淨之後，才適宜比丘進食，叫做淨食。淨是離過的意思。一、[[火淨]]，即是食物如宜用火燒煮的，就應如法用火燒煮之後才食。二、[[刀淨]]，即果物如須用刀去其皮核的，就應如法用刀去其皮核之後才食。三、[[爪淨]]，謂果物如須用爪去其皮殼的，就應如法用爪去其皮殼之後才食。四、[[薦乾淨]]，謂果物已經薦乾失掉生氣，不堪再拿來作種的，方可取食。五、[[鳥啄淨]]，謂取鳥啄食殘餘的東西來食。`,

'五種念誦', `１．一、[[蓮華念誦]]，即誦聲自聞於耳；二、[[金剛念誦]]，即聲在唇齒之間；三、[[三摩地念誦]]，即定心一境而觀真言之文字；四、[[聲生念誦]]，即發聲念誦；五、[[光明念誦]]。<br>２．一、[[聲念誦]]，即出聲念誦；二、[[金剛念誦]]，即聲在唇齒之間；三、[[三摩地念誦]]，即定心一境而觀真言之文字；四、[[真實念誦]]，又叫實相念誦，即定心一境而觀文字的實相；五、[[忿怒念誦]]，即內住慈悲，外現忿怒的一種高聲念誦。`,

'五種法身', `１．[[菩薩瓔珞經]]所說的五種法身是：一、[[如如智法身]]，即證如如之理的實智；二、[[功德法身]]，即十力四無畏等一切之功德；三、[[自法身]]，即地上菩薩所應現的應身，天台謂之為勝應身，法相謂為報身中之他受用身；四、[[變化法身]]，即天台所說的劣應身，法相所說的變化身；五、[[虛空法身]]，即如虛空離相之如如理。<br>２．[[密教]]所說的五種法身是：一、[[自性法身]]，即諸佛的真身，法性理智，自然具足，三世常恆，流出三密之法，以教菩薩，有理法身與智法身之別；二、[[受用法身]]，諸佛的受用身有二種，一種是自受用身，是自受法樂之身，與理相應，一種是他受用身，是為十地菩薩所現的身，與智相應；三、[[變化法身]]，諸佛為地前菩薩，及二乘凡夫，所現的丈六應身，說內證法，屬於變化所作，亦是法爾而有；四、[[等流法身]]，此身係為九界平等流出，故名等流，乃至為六道含靈，示現同類的身形，隨機化變；五、[[法界身]]，如來法身，具六大體性，周遍法界，故名法界身。<br>３．[[華嚴宗]]所說的五種法身是：一、[[法性生身]]，其言生者，如來之身，由法性出生，故名法性身；二、[[功德法身]]，即如來萬德所成之身；三、[[變化法身]]，即諸佛應機而示現之身；四、[[實相法身]]，即諸佛無相無為之身；五、[[虛空法身]]，即諸佛廣大瀰滿虛空包括萬有之身。<br>４．[[小乘]]所立之五分法身。見五分法身條。`,

'五種法師', `受持法師、讀經法師、誦經法師、解說法師、書寫法師。`,

'五種衲衣', `五種的僧衣，即有施主衣、無施主衣、往還衣、死人衣、糞掃衣。`,

'五種布施', `施遠來者、施遠去者、施病瘦者、施飢餓者、施智法人。`,

'五種散亂', `眾生的心有五種的散亂，即一、[[自然散亂]]，謂眾生的五識不守自性，隨逐外境，念念變遷；二、[[外散亂]]，是意根馳動，隨逐外塵，起種種的分別；三、[[內散亂]]，是心生高下，念念遷流而不定；四、[[麤重散亂]]，是計我我所麤重之法，而不得解脫；五、[[思惟散亂]]，是棄捨大乘，憶念小乘而不得寂靜。`,

'五種說人', `五種能宣說佛法的人，即佛自口說、佛弟子說、仙人說、諸天說、化人說。`,

'五種邪命', `一、詐現異相，博取信仰，如辟穀、得道、神通等事。二、自說功德學問。三、占相吉相。四、高聲現威，大言壯語。五、說所得供養之多，以動人心。此五種行為的目的都是為了取利活命，故名為五邪命。`,

'五種問難', `五種問難的原因，即[[不解故問]]、[[疑惑故問]]、[[試驗故問]]、[[輕觸故問]]、[[利樂有情故問]]。`,

'五種甚深', `[[義甚深]]、[[實體甚深]]、[[內證甚深]]、[[依止甚深]]、[[無上甚深]]。`,

'五種不應施', `五種不應布施給人家的東西，即非理之財物、酒及毒藥、置羅機網、刀杖弓箭、音樂女色。`,

'五種增上緣', `又名[[五增上緣]]，或[[五緣]]，是念佛人現在與未來二世所得到的五種增上緣。一、[[滅罪增上緣]]，又名現生滅罪增上緣，即由佛為增上以消除一切的業障；二、[[念獲得長命增上緣]]，又名護念增上緣，或現生護念增上緣，即彌陀觀音勢至等隨時都護念著他；三、[[見佛增上緣]]，又名見佛三昧增上緣，即獲得彌陀之三念願力加被於外而見佛；四、[[攝生增上緣]]，就是靠彌陀之願力能攝眾生使得往生；五、[[證生增上緣]]，就是保證命終之後的凡夫，乘佛願力，都能往生淨土。`,

'元明', `真如的覺體，本來明照，故稱元明。`,

'元妙', `涅槃的覺體，本來不可思議，故稱元妙。`,

'元品無明', `又名[[根本無明]]，或[[無始無明]]，此無明與[[真如]]，皆屬無始，為一切眾生，生死的根源，若斷之，即入佛位。`,

'內凡', `指將要進入聖位的人。小乘以煖、頂、忍、世第一法等四善根位為內凡，大乘則以十住以上之三賢位為內凡。`,

'內我', `執著身體之內有一個我。`,

'內典', `佛教的經典。`,

'內明', `五明之一，即明白佛所說的五乘因果妙理。佛法主張萬法唯心，心屬於內，故叫內明，亦名內學。`,

'內界', `１．眾生的身心，分內外二界，身體是外界，心意是內界。<br>２．六界中，地水火風空五界叫做外界，第六之識界叫做內界。`,

'內秘', `內秘菩薩行外現羅漢相，如羅侯羅是。`,

'內眾', `僧眾。`,

'內煮', `在比丘房內所煮的食物，為不淨食之一，比丘不得取食。`,

'內塵', `色聲香味觸法六塵分為內外二種，眼耳鼻舌身等五識所緣之色聲香味觸為外塵，意識所緣之法為內塵。`,

'內緣', `眼耳鼻舌身等五識緣色聲香味觸等外境為外緣，意識於心內分別諸法為內緣。`,

'內學', `又名內明，即佛學。`,

'內薰', `眾生心中，皆有本覺之真如，此本覺之真如薰習無明，使妄心厭惡生死的痛苦，而祈求涅槃之快樂，此情形謂之內薰。至於佛菩薩的一切教法，以及行者自身的修行，都叫做外薰。`,

'內證', `內心所證悟的真理。`,

'內宿食', `與比丘同在一處和經過一宿的食物，為不淨食之一，比丘不得取食。`,

'內外道', `內道與外道。內道即佛學，外道即外學。`,

'內外兼明', `五明中之前四明為外明，第五明為內明，五明兼備，謂之兼明。`,

'內外不二門', `十不二門之一。`,

'六入', `眼入色、耳入聲、鼻入香、舌入味、身入觸、意入法。六入是六根的別名，入是涉入之義，謂根境互相涉入。`,

'六凡', `[[天]]、[[人]]、[[修羅]]、[[畜生]]、[[餓鬼]]、[[地獄]]，因此六者都是凡夫位，所以叫做六凡。`,

'六天', `[[欲界]]共有六天，即[[四王天]]、[[忉利天]]、[[夜摩天]]、[[兜率天]]、[[樂變化天]]、[[他化自在天]]。`,

'六行', `１．指佛之六行，即[[十信行]]、[[十住行]]、[[十行行]]、[[十迴向行]]、[[十地行]]、[[等覺行]]。<br>２．外道之六行是：[[自餓外道]]、[[投淵外道]]、[[赴火外道]]、[[自坐外道]]、[[寂默外道]]、[[牛狗外道]]。`,

'六因', `１．指十信、十住、十行、十迴向、十地、等覺等之因地六位。<br>２．凡有為法的生起，必依因與緣的和合，論因體，有六種，即能作因、俱有因、同類因、相應因、遍行因、異熟因。`,

'六舟', `（喻）六波羅蜜，因波羅蜜是到彼岸之義。`,

'六妄', `即眼耳鼻舌身意六塵，因此六塵是凡夫們所迷妄的境界。`,

'六夷', `六[[波羅夷]]，都是重戒。`,

'六身', `[[心地觀經]]說，法報應三身，各有二身，合之便是六身。`,

'六處|六根', `[[六根]]的別名，處是出生之義，謂出生六識之處，指六根緣六塵，生起六識故。`,

'六位', `[[十信位]]、[[十住位]]、[[十迴向位]]、[[十地位]]、[[等覺位]]、[[佛地位]]。`,

'六垢', `[[惱]]、[[害]]、[[恨]]、[[諂]]、[[誑]]、[[憍]]等六法，能污穢淨心，故名為垢。`,

'六門', `[[眼]]、[[耳]]、[[鼻]]、[[舌]]、[[身]]、[[意]]六根也叫六門。`,

'六相', `一、[[總相]]，謂一塵含藏萬法，如綜合瓦磚木石等，而成一屋。二、[[別相]]，謂萬法有色心理事等差別，如一屋中的瓦磚木石等，體性各別。以上總別二相，是就體言。三、[[同相]]，謂萬法雖別，然能融即成為一體，如瓦磚木石等，能互相和合，成為一屋。四、[[異相]]，謂諸法雖能融即為一，但亦不失諸法差別的本質，如磚瓦木石，其形類功用，皆各不同。以上同異二相，是就相言。五、[[成相]]，謂諸法雖差別，因融即故，互相而成為一體，如瓦磚木石，有互相成就之性，才能建立為體。六、[[壞相]]，謂諸法雖可融即，成為一體，然若各住各位，則仍現諸法之相，而不成一屋，如瓦磚木石，各住本位而不合作，則房屋相壞。以上成壞二相，是就用言。凡夫所見事相各各差別，聖人則六相圓融，因諸法體性平等，沒有差別。茲列表說明如下：
{{!六相}}`,

'六物', `佛制定比丘所必須蓄存的六種器物，即[[僧伽梨]]（九條乃至二十五條之大衣）、[[鬱多羅僧]]（七條之中衣）、[[安陀會]]（五條之下衣）、[[鐵多羅]]（鐵缽）、[[尼師壇]]（坐具）、[[漉水囊]]（保護水中蟲命之具）。`,

'六時', `[[晝三時]]與[[夜三時]]，合稱為六時。晝三時是晨朝日中日沒；夜三時是初夜中夜後夜。`,

'六忍', `一、[[信忍]]，別教之菩薩於十住位中信一切心皆悉空寂，能於空法忍可信證，故名為信忍；二、[[法忍]]，於十行位中修習假觀，知一切法空無所有，而能假立一切法，以化諸眾生，於假法中忍可信證，故名為法忍；三、[[修忍]]，於十迴向位中修習中觀，知一切法事理和融，於中道忍可信證，故名為修忍；四、[[正忍]]，於十地位中次第正破十品無明之惑，於中道之理忍可信證，故名為正忍；五、[[無垢忍]]，於等覺位中更斷除一品之無明，於無垢之自性清淨心忍可信證，故名為無垢忍；六、[[一切智忍]]，於妙覺更斷一品之無明，得一切智，遍知一切中道之法，於此法忍可信證，故名為一切智忍。`,

'六衰', `色聲香味觸法等六塵能衰耗人們的真性，所以叫做六衰。`,

'六祖', `１．[[禪宗]]衣缽相傳共有六世，即初祖[[達磨]]，二祖[[慧可]]，三祖[[僧璨]]，四祖[[道信]]，五祖[[弘忍]]，六祖[[慧能]]。<br>２．指[[慧能]]大師，因慧能是禪宗之第六祖。`,

'六通', `三乘聖者所得到的神通一共有六種，即[[天眼通]]、[[天耳通]]、[[他心通]]、[[宿命通]]、[[神足通]]、[[漏盡通]]。`,

'六業', `[[地獄業]]、[[畜生業]]、[[餓鬼業]]、[[人業]]、[[天業]]、[[不定業]]。`,

'六即', `又名[[六即佛]]，[[天台]][[智者大師|智顗]]，立六即佛義，以示由凡夫修行，乃至佛果的位次，即一、[[理即佛]]，一切眾生，雖輪迴六道，日處塵勞煩惱中，與覺體相背，然而佛性功德，仍然具足，故名理即佛。二、[[名字即佛]]，或從知識處，或由經典中，得聞即心本具不生不滅的佛性，於名字中，通達了解，知一切法，皆為佛法，一切眾生，皆可成佛，點頭會意，豁爾有悟，故名名字即佛。三、[[觀行即佛]]，這是圓教五品外凡位，不但解知名字，更進一步依教修觀，知一切法皆是佛法，心觀明了，理慧相應，故名觀行即佛。四、[[相似即佛]]，這是圓教十信內凡位，初信斷見惑，七信斷思惑，八九十信斷塵沙惑，在此位上的行者，於觀行即中，愈觀愈明，愈止愈寂，雖未真悟實證，而於理彷彿，有如真證，故名相似即佛。五、[[分證即佛]]，這是於十信後心，破一分無明，證一分三德，即入初住，而證法身，從此成法身大士，其間從初住起，各各破無明，證三德，至等覺共歷四十一位，破四十一分，故名分證即佛。六、[[究竟即佛]]，這是從等覺，再破最後一分無明，則惑盡真純，徹證即身本具的真如佛性，入妙覺位而成佛，故名究竟即佛。茲將十種位階，及六種即佛，列表說明如下：
{{!六即}}`,

'六蔽', `蔽是覆蔽之義，能蔽淨心者，有六種，名為六蔽。一、[[慳貪]]能蔽布施，使之不生。二、[[破戒]]能蔽戒行，使之不生。三、[[瞋恚]]能蔽忍辱，使之不生。四、[[懈怠]]能蔽精進，使之不生。五、[[散亂]]能蔽禪定，使之不生。六、[[愚痴]]能蔽智慧，使之不生。觀此可知六蔽乃是六度的反面。`,

'六識', `[[眼識]]、[[耳識]]、[[鼻識]]、[[舌識]]、[[身識]]、[[意識]]。言六根對色聲香味觸法之六塵而生的見聞嗅味覺思的了別作用。因為是[[八識]]中的前六識，故常被稱為前六識。`,

'六賊', `色聲香味觸法六塵，以眼耳鼻舌身意六根為媒，自劫家寶，故喻之為賊。有道之士，眼不視色，耳不聽聲，鼻不嗅香，舌不味味，身離細滑，意不妄念，以避六賊。`,

'六瑞', `佛要說[[法華經|妙法蓮華]]時，先現出六種的祥瑞，以作為開經的由序緣起，謂之法華六瑞序，即[[說法瑞]]、[[入定瑞]]、[[雨華瑞]]、[[地動瑞]]、[[心喜瑞]]、[[放光瑞]]。此六瑞是三世十方諸佛欲說[[法華經|妙法蓮華]]時所必定示現的教化儀式。`,

'六塵', `[[色塵]]、[[聲塵]]、[[香塵]]、[[味塵]]、[[觸塵]]、[[法塵]]。塵者染污之義，謂能染污人們清淨的心靈，使真性不能顯發。又名六境，即六根所緣之外境。`,

'六境', `又名六塵，即[[色]]、[[聲]]、[[香]]、[[味]]、[[觸]]、[[法]]。因此六法是眼耳鼻舌身意六根所對之境，故名六境。`,

'六慧', `[[聞慧]]、[[思慧]]、[[修慧]]、[[無相慧]]、[[照寂慧]]、[[寂照慧]]。`,

'六難', `[[遇佛世難]]、[[聞正法難]]、[[生善心難]]、[[生中國難]]、[[得人身難]]、[[具諸根難]]。`,

'六如', `又名[[六喻]]，[[金剛經]]說：「<verse>一切有為法，如夢幻泡影，如露亦如電，應作如是觀。</verse>」以夢、幻、泡、影、露、電等來比喻世間的一切法皆是無常。`,

'六界', `又名[[六大]]，即地水火風空識六法。此六法各有分界，故名為界。`,

'六趣', `[[地獄趣]]、[[餓鬼趣]]、[[畜生趣]]、[[阿修羅趣]]、[[人趣]]、[[天趣]]。趣是趣向之義，眾生受報，皆由因趣果，故六道又名六趣。`,

'六趣輪轉', `在六道之中輪迴的意思。`,

'六大', `又名[[六界]]，即[[地]]、[[水]]、[[火]]、[[風]]、[[空]]、[[識]]。此六法周遍於一切法界，以造作有情與非情，故名為大。[[非情]]是五大所造，[[有情]]是六大所成。`,

'六大觀', `觀察六大的行法，在顯教是觀察六大之空與不淨，在密教是觀察六大之圓融無礙。`,

'六念', `[[念佛]]、[[念法]]、[[念僧]]、[[念戒]]、[[念施]]、[[念天]]。`,

'六念處', `即[[六念]]。所念之境界，叫做處。`,

'六根', `[[眼]]、[[耳]]、[[鼻]]、[[舌]]、[[身]]、[[意]]。眼是視根，耳是聽根，鼻是嗅根，舌是味根，身是觸根，意是念慮之根。根者能生之義，如草木有根，能生枝幹，識依根而生，有六根則能生六識，亦復如是。其中何根生何識，各有其界限，不相混，例如眼根只能生眼識，並不能生耳鼻等識，餘可類推。`,

'六根本煩惱', `[[貪]]、[[瞋]]、[[痴]]、[[慢]]、[[疑]]、[[不正見]]。貪是貪愛五欲；瞋是瞋恚無忍；痴是愚痴無明；慢是驕慢自大；疑是狐疑猜忌；不正見是不正的見解，包括身見]]、[[邊見]]、[[邪見]]、[[見取見]]、[[戒禁取見等。貪瞋痴慢疑加上五不正見，成為十根本煩惱，又名十惑，或十使。茲列表說明如下：
{{!六根本煩惱}}`,

'六欲', `[[色欲]]、[[形貌欲]]、[[威儀姿態欲]]、[[語言音聲欲]]、[[細滑欲]]、[[人相欲]]。`,

'六欲天', `[[欲界]]有六種的天，故名六欲天，即[[四天王天]]、[[忉利天]]、[[夜摩天]]、[[兜率天]]、[[樂變化天]]、[[他化自在天]]。此中四天王天在須彌山之半腰，忉利天在須彌山之頂，因依山而住，故名地居天，夜摩天以上，因依雲而住，故名空居天。`,

'六欲四禪', `欲界的六欲天與色界的四禪天。`,

'六道', `[[天]]、[[人]]、[[阿修羅]]、[[畜生]]、[[餓鬼]]、[[地獄]]。因此六者是一切眾生乘業而趣向之處，故又名六趣。`,

'六道輪迴', `六道是天、人、阿修羅、畜生、餓鬼、地獄。這六道的眾生都是屬於迷的境界，不能脫離生死，這一世生在這一道，下一世又生在那一道，總之在六道裡頭轉來轉去，像車輪一樣的轉，永遠轉不出去，所以叫做六道輪迴。`,

'六道四生', `在六道之中有[[胎]]、[[卵]]、[[濕]]、[[化]]的四類眾生。`,

'六和|六和敬', `見六和敬條。`,

'六和敬', `僧是和合的意義，而和合復具有二義，即理和與事和，[[理和]]是證擇滅，就是大家一同修證此共同選擇的寂滅的道理，[[事和]]共有六項，即所謂六和敬。一、身和同住，是身體的和平共處；二、口和無諍，是言語的不起爭論；三、意和同悅，是心意的共同欣悅；四、戒和同修，是戒律的共同遵守；五、見和同解，是見解的完全一致；六、利和同均，是利益的一體均霑。茲列表說明如下：
{{!六和敬}}`,

'六和合眾', `即僧伽。`,

'六種因', `[[當有因]]、[[相續因]]、[[相因]]、[[作因]]、[[顯示因]]、[[傳因]]。`,

'六種印', `六種波羅密是證明菩薩的印契。`,

'六種供養', `[[閼迦]]、[[塗香]]、[[華]]、[[燒香]]、[[飲食]]、[[燈明]]。以上六種依其次第表[[布施]]、[[持戒]]、[[忍辱]]、[[精進]]、[[禪定]]、[[智慧]]之六度。`,

'六種決定', `[[菩薩]]修[[六度]]，能得六種的決定，即一、[[財成決定]]，謂由布施之力菩薩一定常得大財之成就。二、[[生勝決定]]，謂由持戒之力菩薩一定常生於富貴之家。三、[[不退決定]]，謂由忍辱之力菩薩所修之善法一定常不退失。四、[[修習決定]]，謂由精進之力菩薩修習善法一定無有間斷。五、[[定業決定]]，謂由禪定之力菩薩一定成就定業而永不退失。六、[[無功用決定]]，謂由智慧之力菩薩不加功行也一定安住於道理。`,

'六種羅漢', `一、[[退法羅漢]]，即一旦得羅漢果，遇些惡緣，便退失所得的人；二、[[思法羅漢]]，即懼怕會退失所得之證果，便常想方法欲入於無餘涅槃的人；三、[[護法羅漢]]，即對所得之證果，能自己防護的人；四、[[安住法羅漢]]，即不退不進，安住於當位的人；五、[[堪達法羅漢]]，即能修練而達於不動羅漢之性的人；六、[[不動羅漢]]，即根性很殊勝，無論遇到什麼逆緣，都不動轉所得之法的人。`,

'六種震動', `大地震動，有三種的六種，即一、為[[動之六時]]，即佛入胎、出胎、出家、成道、轉法輪、入涅槃。二、為[[動之六方]]，即東湧西沒、西湧東沒、南湧北沒、北湧南沒、邊湧中沒，中湧邊沒。三、為[[動之六相]]，即動、湧、震、擊、吼、爆。當地動時，吾人如小兒臥搖籃中，不覺籃動，惟覺舒服，故地動是表示祥瑞，而且此六種震動，只有天眼通的人才能知見，凡夫則毫不知情。`,

'六種調伏', `六種菩薩調伏惡法的障礙的方法，即一、[[性調伏]]，謂菩薩有善根種性，故修習善法以調伏身心之煩惱障。二、[[眾生調伏]]，謂菩薩要調伏眾生，須先知道其根性，然後說法使之得道。三、[[行調伏]]，謂菩薩修六度萬行以調伏諸煩惱，為眾生修苦行而不後悔。四、[[方便調伏]]，謂菩薩以種種方便去調伏一切眾生，對初發心的人勸他持戒以離生死，對已發心的人則勸他多親近善友以及受持經法。五、[[熟調伏]]，謂對於無善根的眾生說人天的快樂，以使他發菩提心，對於有善根的眾生則說出世間法，以使他善根增長，早日成熟善果。六、[[熟調伏印]]，謂菩薩自身修行之善法成熟而印於自己之心。`,

'六種巧方便', `菩薩的六種善巧方便，即一、[[隨順巧方便]]，即菩薩順次教誡眾生，令生信樂。二、[[立要巧方便]]，即菩薩先滿足眾生之所求，然後才次第教化他，使他多行善事。三、[[異相巧方便]]，即菩薩教導眾生應供養父母及受持禁戒等事而不順利時，便乖異瞋責，使他畏懼。四、[[逼迫巧方便]]，即菩薩遇到有人犯戒等事，便斷絕供給，或加以指摘和責罰，以使他捨離惡法。五、[[報恩巧方便]]，即菩薩將財物布施給眾生，以令他生起報恩的心。六、[[清淨巧方便]]，即菩薩自天降生人家出家學道，成就無上菩提，使一切眾生皆信樂正法，並使所有惑染悉皆清淨。`,

'六種俱生惑', `六種與生俱來的惑，即[[貪]]、[[瞋]]、[[慢]]、[[疑]]、[[無明]]、[[不正見]]。惑是煩惱的別名。`,

'六齋日', `六個宜行八關齋戒的日子，即每月的八日、十四日、十五日、二十三日、二十九日、三十日。按此六齋日，為四天王視察人間善惡之日，古來皆以農曆為準，若月小，只有二十九日，則最後二齋日，當改為二十八日、二十九日。`,

'六度', `六種行之可以從生死苦惱此岸得度到涅槃安樂彼岸的法門，即[[布施]]、[[持戒]]、[[忍辱]]、[[精進]]、[[禪定]]、[[般若]]。布施能度慳貪，持戒能度毀犯，忍辱能度瞋恚，精進能度懈怠，禪定能度散亂，般若能度愚癡。茲列表說明如下：
{{六度}}`,

'六度萬行', `略則六度，廣則萬行，而六度是包括了菩薩所修的一切行門。`,

'六法戒', `學法女所應受持的戒法，即[[不淫]]、[[不盜]]、[[不殺]]、[[不虛誑語]]、[[不非時食]]。`,

'六著心', `六種執著的心，即[[貪著心]]、[[愛著心]]、[[瞋著心]]、[[疑著心]]、[[欲著心]]、[[慢著心]]。`,

'六垢法', `六種污垢真心的法，即[[誑]]、[[諂]]、[[憍]]、[[惱]]、[[恨]]、[[害]]等六惑。`,

'六隨眠', `俱舍論所說，即[[貪]]、[[瞋]]、[[慢]]、[[無明]]、[[見]]、[[疑]]。[[唯識]]稱之為六[[根本煩惱]]。`,

'六妙門', `一、[[數息門]]，即善調身息，數息一至十，以攝亂心。二、[[隨門]]，即不加勉強，隨呼吸之長短，入時知入，出時知出，長短冷暖，皆悉知之。三、[[止門]]，即息心靜慮，心安明淨，毫無波動。四、[[觀門]]，即要觀心分明，知五陰之虛妄，破四顛倒及我等之十六知見。五、[[還門]]，即轉心返照能觀的心，知能觀的心是虛妄無實。六、[[淨門]]，即心無所依，妄念不起，不住不著，洞然清淨。此六者因其次第相通，能到達真妙之涅槃，故名六妙門。`,

'六觀音', `１．顯教的六觀音是[[大悲]]觀音、[[大慈]]觀音、[[獅子無畏]]觀音、[[大光普照]]觀音、[[天人丈夫]]觀音、[[大梵深遠]]觀音。<br>２．密教的六觀音是[[千手]]觀音、[[聖]]觀音、[[馬頭]]觀音、[[十一面]]觀音、[[准提]]觀音、[[如意輪]]觀音。<br>３．以六觀音分配於六道。茲列表說明如下：
{{!六觀音}}`,

'六觀法', `[[本業經]]所說，即[[住觀]]、[[行觀]]、[[向觀]]、[[地觀]]、[[無相觀]]、[[一切種智]]。`,

'六波羅密', `華譯[[六度]]，即[[檀那]]（布施）、[[尸羅]]（持戒）、[[羼提]]（忍辱）、[[毗離耶]]（精進）、[[禪那]]（禪定）、[[般若]]（智慧）。見六度條。`,

'六八弘誓', `指[[阿彌陀佛]]的[[四十八大願]]。`,

'六喻般若', `[[金剛般若波羅蜜經]]說夢幻泡影露電等六喻，故謂之六喻般若。`,

'六群比丘', `佛在世時，有惡比丘六人，結黨從事非威儀的事，叫做六群比丘，佛制[[戒律]]多是因為他們而起。`,

'六十二見', `是[[外道]]的[[邪見]]，以五蘊為起見的對象，依色法和心法為根本。此六十二見是以色、受、想、行、識等五蘊法為對象，起常、無常、亦常亦無常、非常非無常等見，如是五四共成二十見；以色、受、想、行、識等五蘊為對象，起有邊際、無邊際、亦有邊際亦無邊際、非有邊際非無邊際等見，如是二十見，連上面共成四十見；以色、受、想、行、識等五蘊為對象，起有去來、無去來、亦有去來亦無去來、非有去來非無去來等見，如是二十見，連上面共成六十見；此六十見又加上根本的色心二見，共成六十二見。`,

'六十四梵音', `如來的聲音，有六十四種殊勝美妙的相，即[[流澤聲]]、[[柔軟聲]]、[[悅意聲]]、[[可樂聲]]、[[清淨聲]]、[[離垢聲]]、[[明亮聲]]、[[甘美聲]]、[[樂聞聲]]、[[無劣聲]]、[[圓具聲]]、[[調順聲]]、[[無澀聲]]、[[無惡聲]]、[[善柔聲]]、[[悅耳聲]]、[[適身聲]]、[[心生勇銳聲]]、[[心喜聲]]、[[悅樂聲]]、[[無熱惱聲]]、[[如教令聲]]、[[善了知聲]]、[[分明聲]]、[[善愛聲]]、[[令生歡喜聲]]、[[使他如教令聲]]、[[令他善了知聲]]、[[如理聲]]、[[利益聲]]、[[離重複過失聲]]、[[如師子音聲]]、[[如龍音聲]]、[[如雲雷吼聲]]、[[如龍王聲]]、[[如緊那羅妙歌聲]]、[[如迦陵頻伽聲]]、[[如梵王聲]]、[[如共命鳥聲]]、[[如帝釋美妙聲]]、[[如振鼓聲]]、[[不高聲]]、[[不下聲]]、[[隨入一切音聲]]、[[無缺減聲]]、[[無破壞聲]]、[[無染污聲]]、[[無希取聲]]、[[具足聲]]、[[莊嚴聲]]、[[顯示聲]]、[[圓滿一切音聲]]、[[諸根適悅聲]]、[[無譏毀聲]]、[[無輕轉聲]]、[[無動搖聲]]、[[隨入一切眾會聲]]、[[諸相具足聲]]、[[令眾生心意惟喜聲]]、[[說眾生心行聲]]、[[入眾生心喜聲]]、[[隨眾生信解聲]]、[[聞者無分量聲]]、[[眾生不能思惟稱量聲]]。`,

'分位', `時分與地位。`,

'分教', `指大乘始教。見五教條。`,

'分證', `又名隨分覺，即隨著一分之斷惑而多得一分之證悟。`,

'分證佛', `菩薩沒有完全把無明破盡，就沒有完全證得佛，只有一部份證到了佛，所以叫做分證佛。`,

'分別', `思量識別一切事理。`,

'分別識', `即[[第六意識]]，因第六意識常隨著六塵的種種境界而起分別。`,

'分別智', `分別有為事相的智，在佛為後得之權智，在凡夫則是虛妄之計度，凡夫若能離此虛妄之計度，而與真理冥合，則名為無分別智，亦即佛之根本實智。`,

'分別起', `一切惑障有分別起與俱生起二種，分別起是由邪師邪教邪思惟等後天環境所養成的障惑，俱生起則是與前六識或七識俱起，而為先天所本有的障惑。分別起就是見惑，易斷，俱生起就是思惑，難斷。`,

'分段生死', `一切眾生，在三界六道中，由於善惡業所感，其壽命皆有分限，其身形皆有段別，故其生死，名分段生死，為[[二種生死]]之一。`,

'分段變易', `[[分段生死]]與[[變易生死]]。分段生死是三界內凡夫的生死輪迴流轉，有身分形段可見的；變易生死是三界外聖者的生死，已無生死輪迴的身分形段，祇是在心念的生生滅滅不停，是精神上的生死。菩薩斷除根本無明，才無變易生死。`,

'分段三道', `即惑業苦三道。`,

'化土', `佛變化身所住的國土，此中有淨土與穢土的分別，如娑婆是穢土的化土，兜率是淨土的化土。`,

'化主', `教化之主，即是佛。`,

'化生', `１．四生之一，即變化而生，如諸天，地獄，及劫初的人類都是化生的。<br>２．指人死後的中陰身，又名中有，它是化生的。`,

'化佛', `以神通力變化而出現的佛身。`,

'化跡', `佛陀教化眾生的遺跡。`,

'化現', `佛菩薩為了濟度眾生而變化出種種的佛身。`,

'化理', `事物變化的道理。`,

'化道', `教化人的道法。`,

'化境', `如來教化的境土，為二種佛境之一。`,

'化緣', `１．化度眾生的因緣。佛菩薩來此世間教化眾生，是因為有教化的因緣，當因緣盡了，便離去。<br>２．向人募化以結佛緣。`,

'化轉', `教人轉惡向善。`,

'化儀', `化導的儀式，亦即釋尊在一生中教化眾生的儀式方法。`,

'化儀四教', `[[頓教]]、[[漸教]]、[[秘密教]]、[[不定教]]。為上根頓說別教圓教的大法者，名頓教；對中下根漸次開示，自淺至深，次第而漸進者，名漸教；以不思議智慧神通之力量，使聽眾各自領會，而互不相知者，名秘密教；以不思議智慧神通之力量，使聽眾聞解各異，證果不同，或聞小法得大果，或聞大法得小果者，名不定教。以上四教因是佛教化眾生的儀式，故名化儀。`,

'化身', `佛三身之一，又名[[應化身]]，或[[變化身]]，即佛為了濟度眾生而變化出來的身。`,

'化身八相', `化身佛由降生以至涅槃共有八種的相示現，叫做八相成道。見八相成道條。`,

'化法', `化導的方法。`,

'化法四教', `[[三藏教]]、[[通教]]、[[別教]]、[[圓教]]。三藏教即是經律論三藏，部類判然，說因緣生滅之四諦，正教聲聞緣覺，旁化菩薩；通教是說即空無生之四真諦，使三乘通學，但以菩薩為正機，二乘為旁機；別教是特別對菩薩說大乘無量之法，不通於二乘；圓教是對最上利根的菩薩說事理圓融之中道實相。以上藏通別圓四教，因是佛教化眾生的法門，故名化法。`,

'化樂天', `自變化五塵，而自娛樂，故名化樂，為[[欲界]][[六天]]中之天名。`,

'化相三寶', `釋尊於菩提樹下成道後，到鹿野苑去說四諦法度五比丘，彼時釋尊是佛寶，四諦是法寶，五比丘是僧寶，此名化相三寶，謂佛教化眾生的相狀。又名[[別體三寶]]，或[[真實三寶]]。`,

'引果', `眾生所得的身體果報，可分為總別二種，其引生果報的主要成分為引果，引生果報的局部成分為[[滿果]]，例如第八識的總報是引果，五根五境美醜等是別報的滿果。`,

'引業', `又名[[引因]]、[[牽引業]]、[[總報業]]，即牽引眾生到五趣四生中去的業因。`,

'天', `光明之義，自然之義，清淨之義，自在之義，最勝之義，是享受人間以上勝妙果報的所在，總名為天趣。六趣之一。`,

'天乘', `[[五乘]]之一，是乘十善以生天上的意思。`,

'天堂', `天上的宮殿。凡所處的地方，能有隨心享樂的環境，皆可比喻為天堂。`,

'天竺', `國名，即今之印度。`,

'天尊', `佛的別名。`,

'天道', `又名[[天趣]]，為六道之一。天是指欲界色界無色界等諸天，因其依處在諸趣之上，故名為天，身有光明，故名為天，果報最勝，故名為天。`,

'天趣', `六趣之一。與[[天道]]同。`,

'天眼', `天上人的眼，能夠看得很遠，為五眼之一。天眼有兩種，一種是從福報得來，如天人；一種則是從苦修得來，如阿那律所得的天眼是。`,

'天眼力', `[[佛]]所得十力之一，也就是佛所得的天眼，因佛的天眼無能壞和無能勝，所以叫做力。`,

'天眼明', `[[阿羅漢]]所得三明之一，比天眼通更加厲害，天眼通凡人聖人都能得到，但天眼明非聖者不能得。`,

'天眼通', `[[六通]]之一，指修得與色界天人同等的眼根，有了天眼通的人，不論遠近內外晝夜，都能得見。`,

'天魔', `[[天子魔]]的簡稱，即欲界第六天魔王[[波旬]]，他有無數眷屬，時常障礙佛道。`,

'天魔外道', `[[天魔]]與[[外道]]，二者皆喜歡為害佛道。[[梵網經]]說：「<verse>天魔外道，相視如父母。</verse>」`,

'天人', `１．天上的人。２．天道與人道。`,

'天人師', `如來十號之一，六趣中的天與人無不以佛為教師，故稱天人師。`,

'天龍', `諸天與龍，為八部眾中之二眾。`,

'天龍八部', `[[天]]、[[龍]]、[[夜叉]]、[[乾闥婆]]、[[阿修羅，迦樓羅]]、[[緊那羅]]、[[摩侯羅伽]]。`,

'天台', `中國浙江省的山名，隋[[智者大師|智顗]]居於此山開一宗，後世因名其宗為[[天台宗]]，簡稱[[天台]]或[[台宗]]。`,

'天台宗', `隋[[智者大師|智顗]]所立，因居天台上，故即以山名其宗，此宗以[[法華經|妙法蓮華]]、[[涅槃經]]、[[大品般若經]]、[[大智度論]]等為主，明[[一心三觀]]的妙理。`,

'天台八教', `[[天台宗]]所立的化儀四教與化法四教，合稱為八教。`,

'天台三教', `１．[[頓教]]、[[漸教]]、[[不定教]]。２．[[漸教]]、[[頓教]]、[[圓教]]。３．[[三藏教]]、[[通教]]、[[別教]]。`,

'天台大師', `隋[[智顗大師]]，因居於天台上與後入寂於天台山，故稱為天台大師。`,

'少光天', `[[色界]][[第二禪天]]之第一天名。`,

'少林寺', `在嵩山的少室，梁時[[禪宗]]的祖師[[達摩]]，曾在此面壁九年。`,

'少淨天', `[[色界]][[第三禪天]]之第一天名，因意識享受淨妙之樂，故名淨，因這種淨妙之樂在第三禪天中，此天所得最少，故名少淨。`,

'幻有', `虛幻的有，亦即假有的意思。`,

'幻身', `虛幻的身體，亦即人身無實的意思。`,

'幻垢', `有情的身心，無實體叫做幻，有煩惱叫做垢。`,

'幻相', `虛幻無實的相狀。`,

'反忍', `遇到人家侮辱我時，先反躬自問，責備自己定有不是之處，而應得如此報應，心中毫無怨尤。`,

'仁者', `你的尊稱。`,

'水懺法', `神僧傳說：唐悟達禪師，膝上生人面瘡，依神僧之告而修懺悔，以三昧之水洗之，瘡乃癒。因著慈悲水懺法三卷，名水懺法。`,

'丹霞燒佛', `鄧州丹霞山天然禪師，曾到洛東慧林寺，因天寒，遂取殿中木佛，燒之取暖，院主見之呵曰：為何燒我木佛？師以仗撥灰說：吾燒取舍利。院主說：木佛那有舍利？師說：既無舍利，再取兩尊燒之。院主遂悟自性。這是破除世人執外間土木偶像為佛，不見自性佛之弊。`
);


addTerms(5,

'去執', `去掉對一切事物、理論、思想以及意見等的固執。`,

'平等', `沒有高下貴賤深淺等的差別。`,

'平等心', `對一切眾生愛念相同毫無怨親的分別。`,

'平等法', `眾生平等成佛之法。`,

'平等王', `閻魔王的別名，因他公平司理罪福之業。`,

'平等覺', `如來的正覺，因如來的正覺無高下淺深的分別。`,

'平等觀', `[[天台宗]]三觀中假觀的別名。止觀說：「從空入假名平等觀。」`,

'平等性智', `如來[[四智]]之一，即轉末那識的我見，證自他平等之理所得的智慧。`,

'世', `１．世界的簡稱。２．時的別名，如過去現在未來都叫做世。`,

'世界', `又名[[世間]]，即有情眾生所住的國土。佛經以過去現在未來為世，東西南北上下為界，由此可見有情眾生所居住的國土，不但有東西南北上下的分界，而且是有生滅的，不是永恆存在的東西。`,

'世依', `佛的尊稱，因佛是世人所依怙的大聖人。`,

'世法', `世間之法，亦即因緣所生之法，可毀之法。`,

'世相', `世間的事相。`,

'世尊', `佛的尊稱，因佛是世人所共尊的人。`,

'世親', `菩薩名，或譯天[[親]]，為[[無著]]菩薩之弟，生於佛滅後九百年間的印度阿踰陀國，造[[俱舍]]、[[唯識]]等大小乘論五百部，被號為[[千部論主]]。`,

'世諦', `又名[[俗諦]]，或[[世俗諦]]，是世間的真理的意思。`,

'世眼', `佛的別名，因佛能開世人之眼，令見真理。`,

'世間', `時間和空間之謂，說明過去、現在、未來等三世的時間叫做世；指出東、西、南、北、上、下等十方的空間叫做間。所謂世間，也就是宇宙的意思。在佛教裡，不光是指森羅萬象的大地為世間，宇宙和人生，統名之為世間，眾生所依靠的宇宙國土，叫做器世間，眾生由惑造業所感的有生死存亡的色身叫做有情世間。`,

'世間法', `指凡夫眾生一切生滅[[有漏]]之法。`,

'世間解', `佛十號之一，因佛了解世出世間的一切情狀，故號為世間解。`,

'世間禪', `三種[[禪定]]之一，即色界無色界的禪定。`,

'世間相常住', `[[法華經|妙法蓮華]]說：「是法住法位，世間相常住」。意謂從法性本位來看，則世間一切法相皆不離法性，諸法相相，無非是常住之相。`,

'世俗諦', `又名世諦，或俗諦，是世俗的道理的意思。`,

'世出世間', `世間和出世間。世間是眾生的世界；出世間是佛菩薩的世界。`,

'世智辨聰', `世智是世上凡夫的小聰明，辨聰是用凡夫的小聰明去辨論是非。`,

'世智辨聰難', `[[八難]]之一。`,

'主宰', `我的意思。唯識論說：「我謂主宰」。`,

'乏道', `沙門自謙的話，義與貧道同。`,

'他力', `佛菩薩的願力加被於人。`,

'他心智', `[[十智]]之一，即能知他人心想的智，在六通中，叫做他心通。`,

'他心通', `[[六通]]之一，即能知他人心想的神通。`,

'他受用土', `[[法相宗]]說佛的報土有自受用土和他受用土兩種。見報土條。`,

'他受用身', `[[法相宗]]所立佛三身之一，受用身有自受用和他受用之別，他受用即由平等智所示現的微妙淨功德身，係為住十地菩薩所現之身。`,

'他化自在天', `簡稱[[他化天]]，此天不用自己變現樂具，假下天化作，自在遊戲，故名他化自在，居[[欲界]]人天之頂，為欲界之主，與[[色界]][[摩醯首羅天]]，同為防害正法之魔王，即[[四魔]]中之[[天魔]]。`,

'出期', `出離生死苦惱的日期。`,

'出離', `出離生死而證涅槃。`,

'出慧', `出離生死的智慧。`,

'出要', `出離生死的要道。`,

'出息', `呼出的氣息。`,

'出世', `１．諸佛為救濟眾生而出現於世。２．跳出世間不再受生死。`,

'出世法', `出離世間之法，亦即斷惑證真或帶業往生。`,

'出世心', `出離世間的心，亦即無煩惱的無漏心。`,

'出世果', `出離世間的果報，亦即不生不滅的涅槃。`,

'出世間', `一切生死之法為世間，不生不滅之[[涅槃]]為出世間，如苦集二諦是世間，滅道二諦是出世間。`,

'出世間法', `又名[[出世間道]]，即是出離有為迷界的道法。`,

'出世間道|出世間法', `與出世間法同。`,

'出世間禪', `修次第三觀，先從假入空，次從空入假，後乃雙離空假，入中道第一義觀，是名出世間禪。`,

'出世間上上禪', `於一法中，圓觀空假中三諦，即空即假即中，非一非異，是名出世間上上禪。`,

'出世大事', `佛出現於世的大事因緣。`,

'出世本懷', `釋迦如來出現於世的本意。`,

'出家', `出離煩惱之家，亦即出離在家的生活，去修沙門的淨行。`,

'出家二戒', `出家人所應受持的二種戒，即十戒與具足戒。`,

'出家四願', `[[釋迦佛|釋迦牟尼]]初欲出家時發了四個誓願，即[[願濟眾生困厄]]、[[願除眾生惑障]]、[[願斷眾生邪見]]、[[願度眾生苦輪]]。`,

'出纏真如', `二真如之一。見二真如條。`,

'加力', `佛菩薩的加被力。`,

'加被', `保佑的意思。`,

'加行', `修行人準備入修道正位時，須加一段之力而修行，名為加行。`,

'加行位', `[[唯識宗]]所立[[五位]]之第二，即於十迴向之後，修四尋思觀，得[[暖]]、[[頂]]、[[忍]]、[[世第一]]之四善根位。`,

'加行果', `[[四果]]之一。[[大毘婆娑論]]說：「<verse>加行果者謂不淨觀，或持息念，為加行故，漸次引起盡無生智。餘加行果類此可知。</verse>」`,

'加行善', `指加行方便所得的善心，與方便善及修得善同義。`,

'加行道', `[[暖]]、[[頂]]、[[忍]]、[[世界一]]為[[小乘]]之四加行位，[[大乘]]行則在十回向後，由加行位進入見道位。`,

'加持', `指加工持誦，工夫增上。`,

'加持身', `依加持而顯現的佛身，即應身。`,

'功德', `功是指善行，德是指善心。又世人拜佛誦經布施供養等，都叫功德。`,

'功德田', `[[三福田]]之一，謂人若能恭敬供養佛法僧三寶，就可以成就無量的福報。`,

'功德香', `共有五種，即[[戒香]]、[[定香]]、[[慧香]]、[[解脫香]]、[[解脫知見香]]，因此五香能顯出法身來，所以又叫做五分法身香。見五分法身香條。`,

'北俱盧洲', `佛經所說[[四大洲]]之一，在[[須彌山]]之北方，人民平等安樂，壽足千年，洲形正方。`,

'北拘盧洲', `見北俱盧洲條。`,

'半齋', `半日的齋戒。`,

'古佛', `古時的佛。`,

'古德', `古時的大德。`,

'台宗', `[[天台宗]]。`,

'台教', `[[天台宗]]的教門。`,

'四一', `[[天台宗]]開顯[[法華經|妙法蓮華]]有四種的獨一無二，叫做四一之開顯。一、教，[[法華經|妙法蓮華]]所說的教法，只說一佛乘，叫做[[教一]]；二、行，[[法華經|妙法蓮華]]所說的修行方法，都是菩薩的大行，叫做[[行一]]；三、人，修行[[法華經|妙法蓮華]]所說行法的人，都是開其佛知見的菩薩，叫做[[人一]]；四、理，依行而開佛知見的人，所證都是諸法實相，叫做[[理一]]。`,

'四土', `又名[[四佛土]，即[[凡聖同居土]]、[[方便有餘土]]、[[實報莊嚴土]]、[[常寂光土]]。凡聖同居土是凡夫與為了化度眾生而現身說法的聖人共同居住的國土；方便有餘土是二乘與沒有證得法身的菩薩所住的國土；實報莊嚴土是佛的報身與地上菩薩所住的國土；常寂光土是從佛的清淨法身所示寂的國土。`,

'四力', `[[自力]]、[[他力]]、[[因力]]、[[方便力]]。`,

'四心', `即[[慈]]、[[悲]]、[[喜]]、[[捨]]四無量心。見四無量心條。`,

'四忍', `[[伏忍]]、[[柔順忍]]、[[無生忍]]、[[寂滅忍]]。伏忍是初心行者，欲忍順逆境，先須調伏其心；柔順忍是調伏其心既久，遇境遇緣，不須勉強抑制自然能忍，此時之心，柔和善順，同塵和光；無生忍是聖位中的人，達一切法本自不生，情與非情，皆是緣生無性，當體即空，因此於無性法中，忍心不動，親證無生；寂滅忍是果位聖人，徹證涅槃寂滅境界，動靜二相，皆契如如。`,

'四身', `１．[[化佛]]、[[功德佛]]、[[智慧佛]]、[[如如佛]]。其中化佛即化身，功德佛與智慧佛即報身，如如佛即法身。<br>２．[[自性身]]、[[他受用身]]、[[自受用身]]、[[變化身]]。自性身即法身，他受用身與自受用身即報身，變化身即化身。<br>３．[[法身]]、[[報身]]、[[應身]]、[[化身]]。本來應身即是化身，化身即是應身，這裡把它們分開來，是因為應身是指八相成道的佛身，而化身是指一時化現的佛身。`,

'四劫', `１．[[成劫]]、[[住劫]]、[[壞劫]]、[[空劫]]。<br>２．[[壞劫]]、[[成劫]]、[[中劫]]、[[大劫]]。`,

'四有', `[[生有]]、[[本有]]、[[死有]]、[[中有]]。生有是指於諸趣中投生的一剎那；本有是在一生的過程中，除去生時一剎那，死時一剎那之外，中間的壽命；死有是指死時的一剎那，其時間僅限於中有未生之前；中有是指在今世已死，後世未生中間的中陰身。以上四有，是欲界色界的眾生，在一度生死中，所有的四種有。`,

'四事', `１．[[衣服]]、[[飲食]]、[[臥具]]、[[湯藥]]。２．[[房舍]]、[[衣服]]、[[飲食]]、[[湯藥]]。`,

'四果', `１．指聲聞乘的四種果位，即[[須陀洹果]]、[[斯陀含果]]、[[阿那含果]]、[[阿羅漢果]]。初果須陀洹，華譯為入流，意即初入聖人之流；二果斯陀含，華譯為一來，意即修到此果位者，死後生到天上去做一世天人，再生到我們此世界一次，便不再來欲界受生死了；三果阿那含，華譯為無還，意即修到此果位者，不再生於欲界；四果阿羅漢，華譯為無生，意即修到此果位者，解脫生死，不受後有，為聲聞乘的最高果位。<br>２．指[[阿羅漢]]。`,

'四門', `[[有門]]、[[空門]]、[[亦有亦空門]]、[[非有非空門]]。`,

'四苦', `[[生]]、[[老]]、[[病]]、[[死]]。`,

'四恩', `[[父母恩]]（家庭）、[[眾生恩]]（社會）、[[國土恩]]（國家）、[[三寶恩]]（宗教）。`,

'四位', `[[律宗]]對菩薩經三大阿僧祇劫，歷五十二位，另判為四位，以統攝之，即[[願樂位]]、[[見位]]、[[修位]]、[[究竟位]]。茲列表說明如下：
{{!四位}}
（比較：[[大乘]]，唯識宗所立。）`,

'四等', `四平等心，亦即慈悲喜捨之[[四無量心]]。`,

'四相', `１．[[生相]]、[[住相]]、[[異相]]、[[滅相]]。生相即由無而有；住相即成長之形；異相即衰老變壞；滅相即最終滅亡。此生住異滅四相，遷流不息，此滅彼生，此生彼滅。<br>２．[[我相]]、[[人相]]、[[眾生相]]、[[壽者相]]。見我人四相條。`,

'四倒', `見四顛倒條。`,

'四塵', `[[色]]、[[香]]、[[味]]、[[觸]]。`,

'四修', `[[淨土宗]]所立。一、[[恭敬修]]，又名尊重修，即至心恭敬禮念彼佛和聖像，無有懈退；二、[[無餘修]]，即福德和智慧二種資糧，具修而無缺少；三、[[無間修]]，即勇猛精進，無有間斷；四、[[長時修]]，即數十年如一日，到死方休。`,

'四智', `１．[[法相宗]]所立四種如來的智慧，即[[成所作智]]、[[妙觀察智]]、[[平等性智]]、[[大圓鏡智]]。成所作智是轉有漏的前五識所成，為佛成功所作一切普利眾生的智慧；妙觀察智是轉有漏的第六識所成，為佛觀察諸法及一切眾生根器而應病予藥與轉凡成聖的智慧；平等性智是轉有漏的第七識所成，為佛通達無我平等的道理，而對一切眾生起無緣大悲的智慧；大圓鏡智是轉有漏的第八識所成，為佛觀照一切事相理性無不明白的智慧，此智慧清淨圓明，洞徹內外，如大圓鏡，洞照萬物。<br>２．指羅漢的四智，即悟四諦之智，證羅漢的人，我生已盡，梵行已立，所作已辦，不受後有。我生已盡是苦諦之智，梵行已立是滅諦之智，所作已辦是道諦之智，不受後有是集諦之智。`,

'四依', `１．指行四依，即[[冀掃衣]]、[[常乞食]]、[[樹下坐]]、[[腐爛藥]]。此四種法，是入道之緣，是上根利器之所依止，故名行四依。<br>２．指法四依，即[[依法不依人]]、[[依了義經不依不了義經]]、[[依義不依語]]、[[依智不依識]]。`,

'四取', `[[欲取]]、[[見取]]、[[戒取]]、[[我語取]]。欲取是貪欲取著色聲香味觸等五塵之境；見取是妄計取著五蘊之法為我見邊見等；戒取是取著執行非理之禁戒；我語取是取著發自我見我慢等之說法。`,

'四洲', `[[東勝身洲]]、[[南贍部洲]]、[[西牛貨洲]]、[[北俱盧洲]]。東勝身洲其狀如半月形，其人身形勝故，名勝身洲；南贍部洲其狀上大下小，略如吾人之面，亦稱南閻浮提，閻俘即贍部樹，此洲有此樹故名，吾人的世界，即在此洲；西牛貨洲其狀周圓，其地多牛，以牛為貨易，故名牛貨；北俱盧洲其狀方正，此洲人壽皆千歲，衣食自然，惟無佛法，故列為八難之一。`,

'四界', `即地水火風[[四大]]。`,

'四衍', `[[四乘]]。衍就是乘的意思。`,

'四欲', `[[情欲]]、[[色欲]]、[[食欲]]、[[淫欲]]。`,

'四道', `四條通向涅槃的道路，即一、[[加行道]]，謂先於三賢四善根位加力而行三學之位。二、[[無間道]]，謂加行功德成就而發正智，為正斷煩惱之位，因不為惑而間隔，故名無間道。三、[[解脫道]]，無間道後而生一念之正智，為真正證悟真理之位，因是解脫煩惱之正智，故名解脫道。四、[[勝進道]]，解脫道之後更進一步，為定慧增長之位。`,

'四眾', `１．指佛說法時聽者共有四眾，即一、[[發起眾]]，發起講經的人；二、[[當機眾]]，常時跟著佛的人，如千二百五十人是；三、[[影響眾]]，如他方來助佛宣揚佛法的菩薩；四、[[結緣眾]]，如一般下根的薄福眾生。<br>２．指出家之四眾，即[[比丘]]、[[比丘尼]]、[[沙彌]]、[[沙彌尼]]。<br>３．指僧俗四眾，即[[比丘]]、[[比丘尼]]、[[優婆塞]]、[[優婆夷]]。`,

'四教', `１．指化法四教，即[[三藏教]]、[[通教]]、[[別教]]、[[圓教]]。以上藏通別圓四教，是化益眾生的法門，故名為化法。見化法四教條。<br>２．指化儀四教，即[[頓教]]、[[漸教]]、[[祕密教]]、[[不定教]]。以上四教，是教化眾生的儀式，故名為化儀。見化儀四教條。`,

'四障', `[[惑障]]、[[業障]]、[[報障]]、[[見障]]。惑障就是貪瞋痴慢疑等之思惑；業障就是身口意三業所造成之惡業；報障就是三惡趣所受之苦報；見障就是各種顛倒執著與邪見。`,

'四漏', `[[欲漏]]、[[有漏]]、[[無明漏]]、[[見漏]]。漏是煩惱的別名。`,

'四曼', `四種[[曼荼羅]]。一、[[大曼荼羅]]，指佛菩薩之莊嚴色身而言，如雕刻塑繪之像皆是，若廣義言之，則十界有情之身乃至萬法色相，都是大曼荼羅。二、[[三昧耶曼荼羅]]，指佛菩薩所持之標幟而言，若廣義言之，則攝一切器世間。三、[[法曼荼羅]]，指佛菩薩之種子及真言等而言，又佛菩薩之名號，經典之文義，推而至於一切言語、文字、名稱、記號，都是法曼荼羅。四、[[羯磨曼荼羅]]，指佛菩薩之一切威儀動作而言，若廣義言之，則吾人乃至萬物之業用動作皆是。`,

'四論', `[[中觀論]]、[[百論]]、[[十二門論]]、[[大智度論]]。`,

'四緣', `[[因緣]]、[[等無間緣]]、[[所緣緣]]、[[增上緣]]。因緣是種子與現行，相薰習義，為生果的原因；等無間緣是前念與後念，必須次第相續而起，體用齊等，而無間斷；所緣緣之上緣字是攀緣之義，心識為能緣，境界為所緣，心心所法，仗境方生，即見相二分，俱起為緣；增上緣是謂於此法，增強其力用，使其得生。在這四緣中，色法的生起但須因緣及增上緣，心法的生起，則須四緣具足。`,

'四魔', `[[煩惱魔]]、[[五陰魔]]、[[死魔]]、[[天魔]]。煩惱魔指貪瞋痴等習氣能惱害身心；五陰魔指色受想行識等五蘊能生一切之苦；死魔指死亡能斷人之生存命根；天魔指能壞人善事的天魔外道，如欲界自在天的魔王是。`,

'四墮', `即殺盜淫妄等四[[波羅夷]]罪。`,

'四機', `[[人天機]]、[[二乘機]]、[[菩薩機]]、[[佛機]]。諸惡莫作眾善奉行是人天機；厭惡生死欣求涅槃是二乘機；先人後己慈悲仁愛是菩薩機；於一切諸法觀中道實相，以頓斷諸惑而出生死是佛機。`,

'四難', `[[值佛難]]、[[說法難]]、[[聞法難]]、[[信受難]]。`,

'四覺', `[[本覺]]、[[相似覺]]、[[隨分覺]]、[[究竟覺]]。本覺是眾生本來具足的覺悟；相似覺是始覺之初發類似真覺的覺悟，在別教是三賢位，在圓教是十信位；隨分覺是隨斷一分無明而隨得一分的覺悟，在別教是十地，在圓教是十住以上；究竟覺是至極究竟的真覺，也就是如來至高無上的覺悟。`,

'四微', `色香味觸四種極微分子。此四微是色法（物質）的元素，依此四微而成地水火風四大。`,

'四諦|四聖諦', `又稱四聖諦。見四聖諦條。`,

'四諦十六行相', `小乘行者修三賢至四善根的煖位，已徹見四諦真理，更進而達頂位，須觀四諦十六行相，每一諦皆有四種行相，要一一觀之分明方可。茲將四諦十六行相列表說明如下：
{{四諦十六行相}}`,

'四生', `[[胎生]]、[[卵生]]、[[濕生]]、[[化生]]。胎生是在母胎內成體之後才出生的生命，如人類是；卵生是在卵殼內成體之後才出生的生命，如鳥類是；濕生是依靠濕氣而受形的生命；如蟲類是，化生是無所依托，只憑業力而忽然而生的生命，如諸天和地獄及劫初的人類是。`,

'四生百劫', `謂[[聲聞乘]]行人，快則四生的加行才能獲得道果，慢則要一百劫的加行才能獲得道果。`,

'四向', `[[須陀洹向]]、[[斯陀含向]]、[[阿那含向]]、[[阿羅漢向]]。向是正向其果位邁進的意思。見四向四果條。`,

'四向四果', `一、[[須陀洹向]]及[[須陀洹果]]，須陀洹華譯為入流，即入聖人之流，此位須斷盡三界八十八使見惑方能證得。當未斷盡時皆為向，已斷盡為果。二、[[斯陀含向]]及[[斯陀含果]]，斯陀含華譯為一來，謂其當於欲界的天上人間，各來受生一次，此位斷盡三界見惑外，須更斷欲界思惑前六品，方能證得，當斷一至五品時皆為向，已斷盡第六品為果。三、[[阿那含向]]及[[阿那含果]]，阿那含華譯為不來，謂不再來欲界受生死，此位須斷盡三界見惑，及欲界九品思惑，方能證得，當斷盡七八品時皆為向，已斷盡第九品為果。四、[[阿羅漢向]]及[[阿羅漢果]]，阿羅漢華譯為殺賊，應供，不生等義，謂永入涅槃，不再受分段生死，此位須斷盡三界見惑，及欲界九品思惑，並色無色界八地七十二品思惑，方能證得，未斷盡上二界七十二品時皆為向，已斷盡則為果。`,

'四大', `[[地大]]、[[水大]]、[[火大]]、[[風大]]。地以堅硬為性，水以潮濕為性，火以溫暖為性，風以流動為性。世間的一切有形物質，都是由四大所造，如人體的毛髮爪牙，皮骨筋肉等是堅硬性的地大；唾涕膿血，痰淚便利等是潮濕性的水大；溫度暖氣是溫暖性的火大；一呼一吸是流動性的風大。`,

'四大種', `四大是地水火風，因它們周遍於一切色法，所以叫做大，又能生出一切的色法，所以叫做種。`,

'四大分散', `地、水、火、風能造作一切的色法（物質），所以叫做四大，人們的肉身，就是由地、水、火、風之堅、濕、煖、動等性所構成的。此四大種性如果不調和，肉身就會散壞分散。`,

'四大本空', `四大是地水火風，為一切萬法的原素，一切萬法均由此四大合成，四大分散，萬法即歸於壞滅，四大所成的一切法，沒有真實的自體，所以說四大本空。`,

'四大名山', `[[普陀山]]、[[五台山]]、[[峨眉山]]、[[九華山]]。此四大山都在中國，為中國佛教四大名山，普陀山為[[觀音菩薩|觀世音]]的道場，五台山為[[文殊菩薩|文殊]]的道場，峨眉山為[[普賢菩薩|普賢]]的道場，九華山為[[地藏菩薩|地藏]]的道場。`,

'四大不調', `謂身體上地水火風不調和，係生病的別名。`,

'四大部洲', `在須彌山四周有四個大洲，東邊的叫[[東勝身洲]]，南邊的叫[[南贍部洲]]（就是我們現在所住的地方），西邊的叫[[西牛貨洲]]，北邊的叫[[北俱盧洲]]。見四洲條。`,

'四大部經', `禪林以[[華嚴]]、[[涅槃]]、[[寶積]]、[[般若四經]]為四大部經。`,

'四大弟子', `佛弟子中以[[舍利弗]]、[[目犍連]]、[[須菩提]]、[[摩訶迦葉]]等為四大弟子。`,

'四大菩薩', `[[文殊]]、[[普賢]]、[[觀音]]、[[地藏]]。`,

'四分', `[[唯識宗]]對於心境的關係，認為由主觀的識，用以了別客觀的現象，可以分作四分來解釋，即[[相分]]、[[見分]]、[[自證分]]、[[證自證分]]。相分就是由識所變現的外境；見分就是能緣境的見照作用，自緣其所變的相分；自證分就是證知見分者；證自證分就是自證分的內向作用，由返照的結果，證知其自證分者。`,

'四分宗', `南山之[[四分律宗]]。`,

'四分律', `即[[小乘]]的[[律藏]]，初分所明的是比丘戒法，第二分是比丘尼戒法，第三分是安居自恣等法，第四分是房舍等法。第三分及第四分內，又分為二十犍度。茲列表說明如下：
{{!四分律}}`,

'四王', `指四天王。須彌山腰，住著四天王，各護一洲，因稱護世四天王天，其天即名四王天，是六欲天的第一重，東為[[持國天]]，南為[[增長天]]，西為[[廣目天]]，北為[[多聞天]]。`,

'四王忉利', `四王天與忉利天。`,

'四行', `[[菩提]]、[[福德]]、[[智慧]]、[[羯磨]]。`,

'四行相', `觀苦諦之苦、空、無常、無我等之四種行相。`,

'四佛土', `見四土條。`,

'四佛知見', `[[開佛知見]]、[[示佛知見]]、[[悟佛知見]]、[[入佛知見]]。`,

'四住', `四住地的簡稱。見四住地條。`,

'四住地', `簡稱[[四住]]，即三界內的見思煩惱。一、[[見一切住地]]，是將三界的見惑，彙集為一地，故名見一切。二、[[欲愛住地]]，是欲界的思惑。三、[[色愛住地]]，是色界的思惑。四、[[有愛住地]]，是無色界的思惑。`,

'四法', `１．指法寶中的四法，即[[教法]]、[[理法]]、[[行法]]、[[果法]]。教是佛所說的言教；理是教中所詮的義理；行是依理而起修的行持；果是由行而證的覺果。<br>２．指菩薩修行的四法，即[[不捨菩提心]]、[[不捨善知識]]、[[不捨堪忍愛樂]]、[[不捨阿練若]]。<br>３．指[[信]]、[[解]]、[[行]]、[[證]]。`,

'四法界', `[[華嚴宗]]所立，即[[事法界]]、[[理法界]]、[[理事無礙法界]]、[[事事無礙法界]]。世間萬法差別之相，各有其不同，不能混淆，名事法界；真如平等的理體，為萬法所依，名理法界；真如能生萬法，故萬法即是真如，理體事相，互融互具，無礙通達，理即是事，事即是理，名理事無礙法界；諸法互攝，重重無盡，不相妨礙，一多相即，大小互容，舉一全收，具足相應，名事事無礙法界。`,

'四法界觀', `觀四法界的行法。`,

'四法印', `小乘的[[諸行無常]]、[[諸法無我]]、[[涅槃寂靜]]三法印，加上大乘的[[諸法實相]]印，合稱為四法印。`,

'四法不壞', `[[正受心|正受]]、[[金剛]]、[[佛舍利]]、[[光音天宮殿]]。因此四法不會毀壞，故謂四法不壞。`,

'四事', `１．[[衣服]]、[[飲食]]、[[臥具]]、[[湯藥]]。２．[[房舍]]、[[衣服]]、[[飲食]]、[[湯藥]]。`,

'四事法門', `[[入禪思門]]、[[入智慧門]]、[[入總持門]]、[[入辯才門]]。入禪思門是菩薩將要說法時，先入於禪定以觀察眾生的根機；入智慧門是菩薩將要說法時，先以智慧照了義理，以令聽者生起法喜的心；入總持門是菩薩將要說法時，對諸善法持之不使忘失，對諸惡法持之不使產生，以此心生眾生之善及遮止眾生之惡；入辯才門是菩薩將要說法時，對一切佛法的義理，辯說無礙，以便開發一切眾生的心，共入正道。`,

'四空', `又名四無色，即無色界的四空處。見四空處條。`,

'四空天', `又名空處天，即[[空無邊]]、[[識無邊]]、[[無所有]]、[[非想非非想]]等四天。此四天但有定果色，無業果色，故無身質，又正報無有色蘊，依報亦無國土宮殿，故曰無色界。`,

'四空定', `又名[[四無色定]]，即[[空無邊處定]]、[[識無邊處定]]、[[無所有處定]]、[[非想非非想處定]]。空無邊處定是修行人心想出離患難重重的色（色蘊物質）的牢籠，於是捨色想而緣無邊的虛空，做到心與空無邊相應；識無邊處定是行人又厭棄外在的虛空，於是捨虛空而緣內在的識，做到心與識無邊相應；無所有處定是行人又厭棄其識，而觀心識無所有，做到心與無所有相應；非想非非想處定是無麤想（非想）又非無細想（非非想），做到無所愛樂與清淨無為的境界。`,

'四空處', `又名[[四無色]]，或[[無色界]]，即[[空無邊處]]、[[識無邊處]]、[[無所有處]]、[[非想非非想處]]，乃修四空處定的人所得的正報，因此四處的眾生於五蘊中無色蘊，只有受想行識的四蘊，亦即無物質的色身，而只有微妙的精神存在，亦無依報的國土宮殿，故名無色界，或四空處。`,

'四德', `指大乘大般涅槃所具有的四種德，即[[常]]、[[樂]]、[[我]]、[[淨]]。常者，涅槃之體，恆常不變，沒有生滅；樂者，涅槃之體，永遠寂滅、安閒、受用、無絲毫的煩惱；我者，涅槃之體，得大自在，沒有絲毫的束縛；淨者，涅槃之體，解脫一切的垢染，非常清淨。`,

'四德處', `[[慧德處]]、[[實德處]]、[[捨德處]]、[[寂滅德處]]。慧德處是謂由於聽聞正法而生出大智慧；實德處是謂有了大智慧才能見到真諦的空理；捨德處是謂見了空理便能捨掉煩惱；寂滅德處是謂捨掉了煩惱心才能得到寂滅的境界。`,

'四德樂邦', `具有四種德的安樂世界，即涅槃的境界，因涅槃的境界具有常樂我淨的四德。`,

'四禪', `見四禪天條。`,

'四禪天', `色界諸天分為四禪，即[[初禪]]、[[二禪]]、[[三禪]]、[[四禪]]。一、清淨心中，諸漏不動，名為初禪，即梵眾、梵輔、大梵等三天，此三天已不須段食，故無鼻舌二識，惟有樂受，與眼耳身三受相應，喜受與意識相應。二、清淨心中，粗漏已伏，名為二禪，即少光、無量光、光音等三天，此三天無前五識，僅有意識，因之惟有喜捨二受，與意識相應。三、安穩心中，歡喜畢具，名為三禪，即少淨、無量淨、遍淨等三天，此三天識受皆與二禪略同，但意識怡悅之相，較為淨妙。四、前五識俱無，亦無喜受，僅有捨受，與意識相應，名為四禪，即無雲、福生、廣果、無想、無煩、無熱、善見、善現、色究竟等九天。根据大涅槃經說，初禪天人，因他們心中有粗細的思想，所以外面有火災；二禪天人，他們對於禪定，生喜樂心，所以外面有水災；三禪天人，他們呼吸粗重，所以外面有風災；惟獨第四禪，所有內外過患，一切均無，所以諸災不能到達那裡。`,

'四禪定', `四種修之可以生到色界四禪天的禪定。見四禪天條。`,

'四禪八定', `四禪是色界的四種禪定；八定是色界的四禪與無色界的四無色定。`,

'四聖', `[[佛]]、[[菩薩]]、[[緣覺]]、[[聲聞]]。因此四者都是聖人，故稱四聖。`,

'四聖諦', `又名四真諦，或四諦法，即[[苦諦]]、[[集諦]]、[[滅諦]]、[[道諦]]。苦諦是說明人生多苦的真理，人生有[[三苦]]，[[八苦]]，無量諸苦，苦是現實宇宙人生的真相；集諦的集是集起的意思，是說明人生的痛苦是怎樣來的真理，人生的痛苦是由於凡夫自身的愚痴無明，和貪欲瞋恚等煩惱的掀動，而去造作種種的不善業，結果才會招集種種的痛苦；滅諦是說明[[涅槃]]境界才是多苦的人生最理想最究竟的歸宿的真理，因涅槃是常住、安樂、寂靜的境界；道諦是說明人要修道才能證得涅槃的真理，道有多種，主要是指修習八正道。此四聖諦括盡了世出世間的兩重因果，集是因，苦是果，是迷界的因果；道是因，滅是果，是悟界的因果。茲列表說明如下：
{{!四聖諦}}`,

'四重|四重禁', `見四重禁條。`,

'四重禁', `又名[[四重罪]]、[[四棄]]、[[四波羅夷罪]]等，即[[犯淫戒]]、[[犯盜戒]]、[[犯殺人戒]]、[[犯大妄語戒]]。`,

'四重罪|四重禁', `見四重禁條。`,

'四重八重', `[[比丘戒]]的四波羅夷罪與[[比丘尼戒|尼戒]]的八波羅夷罪。`,

'四重五逆', `[[四重罪]]與[[五逆罪]]。`,

'四食', `四種長養支持身命的東西。一、[[段食]]，即普通物質的食糧；二、[[觸食]]，即感官與外境的接觸；三、[[識食]]，即知覺；四、[[思食]]，即思想或意志。`,

'四食時', `一、[[天食時]]，即清晨，清晨是諸天的食時；二、[[佛食時]]，即午時，午時是三世諸佛如法的食時，過午則非時食；三、[[畜生食時]]，即日暮，日暮是畜生的食時；四、[[鬼神食時]]，即昏夜，昏夜是鬼神的食時。`,

'四增盛', `在增劫時期有四種的增盛，即[[壽量增盛]]（人壽由千歲增至八萬歲）、[[有情增盛]]（人口由萬人增至無數量）、[[資具增盛]]（穀物果實等非常富饒）、[[善品增盛]]（人人皆修十善及諸道品）。`,

'四加行', `四善根的別名。見四善根條。`,

'四不生', `[[不自生]]、[[不他生]]、[[不共生]]、[[不無因生]]。不自生是法不由自因生；不他生是法不由他因生；不共生是法不由自他之共因生；不無因生是法不由無因而生。`,

'四不退', `１．淨土門所立。一、[[位不退]]，既修得的位次不退失；二、[[行不退]]，於所修的行法不退失；三、[[念不退]]，於正念不退轉；四、[[處不退]]，生西方淨土的人不更退墮穢土。<br>２．[[法相宗]]所立。一、[[信不退]]，是十信位之第六信，從此不生邪見；二、[[位不退]]，是十住位之第七住，從此不入二乘；三、[[證不退]]，是初地以上，所證得之法不退失；四、[[行不退]]，是八地以上，有為和無為之行皆能修持。`,

'四不可得', `[[常少不可得]]、[[無病不可得]]、[[長壽不可得]]、[[不死不可得]]。`,

'四不可輕', `一、[[太子]]雖小，當為國王，故不可輕。二、[[蛇子]]雖小，毒能殺人，故不可輕。三、[[小火]]雖微，能燒山野，故不可輕。四、[[沙彌]]雖小，能得聖而有神通，是最不可輕。`,

'四不可說', `一、[[生生不可說]]，藏教說能生之因緣，所生之諸法，俱為實有，故云生生；二、[[生不生不可說]]，通教說能生所生之當體即空，故云生不生；三、[[不生生不可說]]，別教說真如不生之理，生十界差別之事，故云不生生；四、[[不生不生不可說]]，圓教說真如之理與十界之事無二，故云不生不生。上述四者之所以說不可說，那是因為此四教之理，只可以智證，不可以言說，其理本來是無說的。`,

'四不可思議', `[[世界不可思議]]、[[眾生不可思議]]、[[龍不可思議、[[佛土境界不可思議]]。`,

'四天下', `[[須彌山]]東南西北之四大洲，又名[[四天下]]。`,

'四天王', `[[東方持國天王]]、[[南方增長天王]]、[[西方廣目天王]]、[[北方多聞天王]]。`,

'四天王天', `四天王所居住的天界，在須彌山腰，六欲天之第一重。`,

'四依法', `[[依法不依人]]、[[依義不依語]]、[[依智不依識]]、[[依了義經不依不了義經]]。`,

'四念住', `又名四念處。見四念處條。`,

'四念處', `又名四念住，即[[身念處]]、[[受念處]]、[[心念處]]、[[法念處]]。身念處是觀身不淨；受念處是觀受是苦；心念處是觀心無常；法念處是觀法無我。此四念處的四種觀法都是以智慧為體，以慧觀的力量，把心安住在道法上，使之正而不邪。`,

'四正勤|四正勤', `[[已生惡令斷滅]]、[[未生惡令不生]]、[[未生善令生起]]、[[已生善令增長]]。此四正勤就是精進，精進勤勞修習四種道法，以策勵身口意，斷惡生善。`,

'四正勝', `與[[四正勤]]同。`,

'四神足', `又名[[四如意足]]，是[[三十七道品]]中[[四正勤]]所修的行品，也就是用四種定力攝心，使定慧均等，神力充沛，所願皆得，故名如意足。[[欲神足]]是欲望成就，[[勤神足]]是精進無間，[[心神足]]是一心正念，[[觀神足]]是心不馳散。`,

'四無明', `一、[[纏無明]]，纏即纏縛，謂由於此無明之惑的纏縛，使人不能出離生死；二、[[隨眠無明]]，謂無明煩惱長時隨逐眠伏於第八阿賴耶識中；三、[[相應無明]]，謂意識緣於六塵之境，識與境相應，而起無明煩惱；四、[[獨頭無明]]，又名不共無明，謂未有六塵之境相對，而意識獨緣想六塵之境，因識與境不相應，無明獨起，所以叫做獨頭無明。`,

'四惡趣', `又名四惡道，即[[地獄]]、[[餓鬼]]、[[畜生]]、[[阿修羅]]。`,

'四邪命', `四種[[邪命食]]。比丘不乞食，亦不弘法，但作不如法之事，以維持其生命，叫做邪命。一、種值田園，和合湯藥，名[[下食]]。二、仰觀星宿，推測盈虛，名[[仰口食]]。三、諂媚豪貴，遊說四方，名[[方口食]]。四、以咒術呼召鬼神，以及卜卦、算命、看相為業者，名[[維口食]]。`,

'四梵行', `又名四梵住，即慈悲喜捨四無量心，因此四心為生於梵天的資糧，故名四梵行。`,

'四吠陀', `[[梨俱吠陀]]、[[沙磨吠陀]]、[[夜柔吠陀]]、[[阿闍婆吠陀]]。梨俱吠陀是宗教的讚歌，沙磨吠陀是祭祀儀式的頌文，夜柔吠陀是祭祀儀式的歌詞，阿闍婆吠陀是俗世相傳的咒術。吠陀是明智的意思。`,

'四阿含', `四部阿含經，即[[長阿含]]、[[中阿含]]、[[雜阿含]]、[[增一阿含]]。`,

'四善根', `１．指[[小乘]]之[[暖]]、[[頂]]、[[忍]]、[[世第一法]]。聲聞乘行人修五停心觀及四念處觀之後，接著須修四諦觀。當無漏智火將生，心中光明啟發之時，名為暖位；進而智慧增長，達於頂點，名為頂位；再進而明四諦之理，其心堅住，決定不移，名為忍位；更進而到達有漏智的最終點，在世間有情之中，最為殊勝，名為世第一法。<br>３．指[[大乘]]之[[暖]]、[[頂]]、[[忍]]、[[世第一法]]。以佛覺為己心，如火欲燃，名為暖；以自心成佛，如登高山，身入虛空，下有微礙，名為頂；印持無所取之境，順忍所無取之心識，名為忍（暖位以佛覺為己心，頂位以自心為佛境，忍位則覺於中道）；由此更進，則迷覺兩忘，中邊不立，雖未至初地見道之出世間，然已到世間的最後邊際，縱屬有漏，但在世間已是第一，名世第一。在此大乘暖、頂、忍、世第一四位之中，前二位修四尋思觀，觀所取空，後二位修四如實智，觀能所二取皆空。`,

'四熏習', `[[無明熏習]]、[[妄心熏習]]、[[妄境界熏習]]、[[淨法熏習]]。`,

'四煩惱', `與末那識時常相應的四種根本煩惱，即[[我痴]]、[[我見]]、[[我慢]]、[[我愛]]。`,

'四威儀', `[[行]]、[[住]]、[[坐]]、[[臥]]。`,

'四歸法', `[[歸佛]]、[[歸法]]、[[歸僧]]、[[歸戒]]。`,

'四識住', `[[色識住]]、[[受識住]]、[[想識住]]、[[行識住]]。因上述四蘊為識所依所住，故名為識住。`,

'四顛倒', `１．指凡夫的四倒，即一、[[常顛倒]]，無常認為有常；二、[[樂顛倒]]，以苦當作樂；三、[[淨顛倒]]，以不淨為淨；四、[[我顛倒]]，無我認為有我。<br>２．指二乘的四倒，即一、[[無常顛倒]]，於涅槃之常而計無常；二、[[無樂顛倒]]，於涅槃之樂而計無樂；三、[[無我顛倒]]，於涅槃之我而計無我；四、[[無淨顛倒]]，於涅槃之淨而計無淨。`,

'四攝法', `[[布施攝]]、[[愛語攝]]、[[利行攝]]、[[同事攝]]。布施攝是對於錢財心重的人，用財施，對於求知心重的人，用法施，使雙方情誼逐漸深厚，而達到我度化對方的目的；愛語攝是隨著眾生的根性，以溫和慈愛的言語相對，令他生歡喜心，感到我和藹可親而與我接近，以達到我度化對方的目的；利行攝是修菩薩道者，以身口意諸行皆有利於人，以損己利人的行為，感化眾生共修佛道，以達到我度人的目的；同事攝是修菩薩道者，要深入社會各階層中，與各行各業的人相接近，做其朋友，與其同事，在契機契緣的情況下，而度化之。菩薩濟度眾生，必須先行此四攝法，使眾生愛我敬我信我，然後方能聽我勸導，修行佛道。`,

'四尋思', `一、[[名尋思]]，即推求諸法的一切名字，皆悉不實。二、[[事尋思]]，即推求五陰等事，皆係心識上變似的相分，因緣所成，離識非有，無有自性。三、[[自性假立尋思]]，即不管是名的自性，或事的自性，其獨立性，皆不可得。四、[[差別假立尋思]]，即推求諸法名或事的差別相，亦惟假立，悉皆不實。行者對此四法，尋求思察，皆假有實無，名四尋思觀，修此四尋思觀，能得四如實智。`,

'四尋思觀', `在大乘三賢和十聖的中間，尚須經過四加行，作為進入初地的準備，所謂四加行者，即修四尋思觀，修之能得四如實智。見四尋思條。`,

'四無畏', `又名四無所畏，無畏是教化他人的心沒有懼怕。有佛四無畏與菩薩四無畏二種。見[[佛四無畏]]或[[菩薩四無畏]]條。`,

'四悉檀', `悉檀，梵文Siddhānta，sid者普遍義，檀者dhānta之略，施之義。古譯為成。佛以此四法普施眾生，成就眾生佛道。後為成就之義。一、世界悉檀，佛先順凡情用人我等假名隨順眾生所樂而說世界之法，令聞者歡喜適悅。二、各各為人悉檀，佛說法鑑眾生之機，隨機宜之大小，宿種之淺深，說各人所應之法，令彼發起正信，增長善根。三、對治悉檀，貪欲多者教以慈心，愚痴多者教以因緣觀，如是施種種之法藥，除遣眾生之惡病。四、第一義悉檀，佛見眾生之機緣既熟，說諸法實相，令彼入於真證。要之佛始說淺近之事理，令聞者適悅者，世界也；令眾生生善根者，為人也；除遣眾生之惡病者，對治也；遂使悟入聖道者，第一義也。`,

'四無量心', `[[慈無量心]]、[[悲無量心]]、[[喜無量心]]、[[捨無量心]]。與一切眾生樂，名慈無量心；拔一切眾生苦，名悲無量心；見人行善或離苦得樂，深生歡喜，名喜無量心；如上三心，捨之而不執著，或怨親平等，不起愛憎，名捨無量心。因此四心普緣無量眾生，引生無量之福，故名無量心。又此四心若依禪定而修，則生色界梵天，故又名四梵行。`,

'四無礙智', `又名[[四無礙解]]，或[[四無礙辯]]，即[[法無礙智]]、[[義無礙智]]、[[詞無礙智]]、[[樂說無礙]]。法無礙智是通達諸法的名字，分別無滯；義無礙智是了知一切法之理，通達無礙；詞無礙智是通曉各種言語，能隨意演說；樂說無礙是辯說法義，圓融無滯，為眾生樂說自在。`,

'四無礙解|四無礙智', `見四無礙智條。`,

'四無礙辯|四無礙智', `見四無礙智條。`,

'四無閡智|四無礙智', `與[[四無礙智]]同。`,

'四種人', `[[順流者]]、[[逆流者]]、[[中住者]]、[[得度者]]。順流者是順著生死而流轉的人；逆流者是發奮去除煩惱以截斷生死之流轉的人；中住者是大乘行者為度有情而出生入死，住於其中；得度者是精修涅槃之法而得度到彼岸的人。`,

'四種死', `人死亡的四種因由，即[[壽盡財不盡死]]（壽命盡而死），[[財盡壽不盡死]]（因貧困而飢死凍死），[[壽盡財盡死]]（因貧困與壽命盡而死），[[壽不盡財不盡死]]（即各種的橫死）。`,

'四種我', `[[凡夫妄計之我]]、[[外道之神我]]、[[三乘之假我]]、[[法身之大我]]。`,

'四種往生', `[[正念往生]]、[[狂亂往生]]、[[無記往生]]、[[意念往生]]。正念往生是人臨命終時，心不顛倒而得往生；狂亂往生是人在生時作惡多端，臨終時見到地獄之猛火一時俱來苦逼，於狂亂中，忽然遇到善知識教他作一聲或十聲之念佛，即得往生；無記往生是人於平日發心皈命於佛，到臨終時，雖然心神衰弱而成為無記（非善非惡），不能念佛，但是乘著他以前念佛的功德而得往生；意念往生是人臨命終時，雖然不能出聲唸佛，但中意念阿彌陀佛，一樣可以往生。`,

'四種念誦', `１．一、[[音聲念誦]]，即發聲念誦；二、[[金剛念誦]]，即聲在唇齒之間；三、[[三摩地念誦]]，即定心一境而觀真言之文字；四、[[真實念誦]]，也是定心一境而觀文字的實相。<br>２．一、[[音聲念誦]]；二、[[三摩地念誦]]；三、[[金剛念誦]]；四、[[降魔念誦]]。以上三者與上述相同，而降魔念誦是內住悲心，外現瞋怒的一種高聲念誦。`,

'四種涅槃', `[[法相宗]]所立。一、[[本來自性清淨涅槃]]，即雖有種種的煩惱，但其自性清淨，湛如虛空，離諸一切分別之相，言語道斷，心行處滅，唯聖者能親證，其性原是寂靜。二、[[有餘依涅槃]]，即生死之因與惑業雖盡，但猶餘有漏依身之苦果。三、[[無餘依涅槃]]，即不但生死之因與惑業已盡，同時連依身之苦果亦滅，使之畢竟不生。四、[[無住處涅槃]]，是斷所知障所顯的真如，所知障為智之障，二乘人因有所知障，不明白生死涅槃無差別的道理，所以固執生死為可厭，涅槃為可欣，佛斷所知障得菩提之真智時，對生死與涅槃無厭欣之情，因有大智，故住於生死，因有大悲，故不住於涅槃，以利樂盡未來際之有情，故謂之為無住處，利樂之用雖常起，而亦常寂，故稱為涅槃。`,

'四種資糧', `[[福德資糧]]、[[智德資糧]]、[[先世資糧]]、[[現法資糧]]。福德資糧即布施持戒等之善根功德，亦即六度中之前五度；智德資糧即由修習正觀而得之妙智，亦即六度中之第六度；先世資糧即由宿世積集之善根，在今生自然而有之福智資糧；現法資糧即在今生所修習之福智資糧。`,

'四種輪王', `[[金輪王]]、[[銀輪王]]、[[銅輪王]]、[[鐵輪王]]。在增劫人壽由十歲增至二萬歲時，鐵輪王出現，統轄南贍部洲；人壽增至四萬歲時，銅輪王出現，統轄南贍部洲及東勝身洲二大洲；人壽增至六萬歲時，銀輪王出現，統轄南贍部洲及東勝身洲與西牛貨洲三大洲；人壽增至八萬四千歲時，金輪王出現，統轄四天下了。`,

'四種平等', `[[相非相平等]]、[[因果平等]]、[[我無我平等]]、[[人與所修法平等]]。`,

'四種布施', `[[筆施]]、[[墨施]]、[[經施]]、[[說法施]]。筆施是見人發心書寫經文，以筆施之，助成善緣；墨施是見人書寫經文，以墨施之，助成善緣；經施是刊印佛經，送人讀誦；說法施是說法使人聽了修因證果。`,

'四種成佛', `又名四滿成佛。見四滿成佛條。`,

'四種觀行', `[[觀因緣]]、[[觀果報]]、[[觀自身]]、[[觀如來身]]。這是修行懺悔的人，為了滅除自己的罪業，方便而修的四種觀行。`,

'四種行人', `即十住十行十迴向十地。`,

'四種總持', `[[法總持]]、[[義總持]]、[[咒總持]]、[[忍總持]]。法總持又名聞總持，即對佛的教法聞持不忘；義總持是對諸法的義理總持不失；咒總持是菩薩依定起咒，持咒神驗，袪除眾生的災患；忍總持是菩薩憑著實智，忍持法的實相而不忘失。`,

'四種緣起', `萬法緣起，有四種不同的見解：[[小乘教]]主張[[業感緣起]]，說一切萬法都是由於業力的感應而生起。[[大乘始教]]主張[[阿賴耶緣起]]，說阿賴耶識含藏萬法的種子，一切根身器界，皆由其生起。[[大乘終教]]主張[[真如緣起]]，說由於真如隨緣，才會生出萬法來。[[一乘圓教]]則主張[[法界緣起]]，說遍法界的一切事物，有為無為，色心依正，過現未來，都盡成一大緣起。`,

'四種佛土', `１．[[唯識論]]立[[自性身]]、[[自受用身]]、[[他受用身]]、[[變化身]]等[[四佛身]]，而佛土亦有四，即[[法性土]]、[[自受用土]]、[[他受用土]]、[[變化土]]。此中法性土是無色無相的理土，自受用土是實佛自託的報土，他受用土是為初地以上的菩薩所示現的淨土，變化土是為地前菩薩及二乘凡夫所示現的佛土。<br>２．指[[天台宗]]所說的四種佛土。見四土條。`,

'四種莊嚴|四種瓔珞莊嚴', `見四種瓔珞莊嚴條。`,

'四種三昧', `一、[[常坐三昧]]，又名[[一行三昧]]，即以九十日為一期，獨居靜室，結跏趺坐，捨諸雜念，專繫念法界，若遇疲倦疾病睡蓋等障，當專稱一佛名，以求加被，而念念不離此三昧。二、[[常行三昧]]，又名[[般舟三昧]]，亦以三月為期，繞行念阿彌陀佛，無休息時，由佛威力，三昧力，及行者本功德力，能於定中見佛。三、[[半行半坐三昧]]，即以七日為期，持咒旋繞，思惟實相，或依[[法華經|妙法蓮華]]，於三七日間，或行讀此經，或坐讀此經皆可。四、[[非行非坐三昧]]，亦名[[隨自意三昧]]，其法於一切時中，一切事上，隨意作觀，不拘期限，但觀自心，念起則加覺照，而除滅之。`,

'四種三昧耶', `即殺盜淫妄之四波羅夷，因是諸佛所不可越的戒法，所以叫做[[三昧耶]]。`,

'四種阿含經', `[[長阿含]]、[[中阿含]]、[[雜阿含]]、[[增一阿含]]。`,

'四種瓔珞莊嚴', `一、[[戒瓔珞莊嚴]]，即以戒律莊嚴法身；二、[[三昧瓔珞莊嚴]]，即以禪定莊嚴法身；三、[[智慧瓔珞莊嚴]]，即以智慧莊嚴法身；四、[[陀羅尼瓔珞莊嚴]]，陀羅尼是總持的意思，即能總持善法以莊嚴法身。菩薩將以上四法莊嚴法身，好像世間的瓔珞莊嚴人身，故名瓔珞莊嚴。`,

'四十八願', `[[阿彌陀佛]]在因地做法藏比丘時，於世自在王佛所建立的誓願。第一無三惡趣願，第二不更惡趣願，第三悉皆金色願，第四無有好醜願，第五宿命智通願，第六天眼智通願，第七天耳智通願，第八他心智通願，第九神境智通願，第十速得漏盡願，第十一住正定聚願，第十二光明無量願，第十三壽命無量願，第十四聲聞無數願，第十五眷屬長壽願，第十六無諸不善願，第十七諸佛稱揚願，第十八念佛往生願，第十九來迎引接願，第二十係念定生願，第二十一三十二相願，第二十二必至補處願，第二十三供養諸佛願，第二十四供具如願願，第二十五說一切智願，第二十六那羅延身願，第二十七所須嚴淨願，第二十八見道場樹願，第二十九得辯才智願，第三十智辯無窮願，第三十一國土清淨願，第三十二國土嚴飾願，第三十三觸光柔軟願，第三十四聞名得忍願，第三十五女人往生願，第三十六常修梵行願，第三十七人天致敬願，第三十八衣服隨願願，第三十九受樂無染願，第四十見諸佛土願，第四十一諸根具足願，第四十二住定供佛願，第四十三生尊貴家願，第四十四具足德本願，第四十五住定見佛願，第四十六隨意聞法願，第四十七得不退轉願，第四十八得三法忍願。`,

'四姓階級', `[[婆羅門]]、[[剎帝利]]、[[吠舍]]、[[首陀羅]]。婆羅門是古印度的宗教徒，具有最高的權威；剎帝利是和婆羅門同樣被人尊敬的王族；吠舍是指一般工農商階級；首陀羅是被人使役的奴隸。`,

'四滿成佛', `[[信滿成佛]]、[[解滿成佛]]、[[行滿成佛]]、[[證滿成佛]。於十信之滿位，決定信諸法之不生不滅，清淨平等，無可願求，名為信滿成佛；於十住之滿位，深解法性，不起生死之想，不起涅槃之想，心無所怖，亦無所欣，是名解滿成佛；於十地之滿心，能除一切無明諸惑，菩提之願行皆具足，是名行滿成佛；於妙覺之佛地得無分別寂靜法智及不可思議之勝妙功德，是名證滿成佛。`,

'四類出家', `一、[[身出家心不出家]]，即身雖為僧伽，但心猶有顧惜愛戀。二、[[身在家心出家]]，即雖在家受用妻子，但卻不耽染欲樂。三、[[身心俱出家]]，即在任何欲境中心都無顧惜愛戀。四、[[身心俱不出家]]，即不但受用妻子，而且深生耽染。`,

'四事供佛', `[[飲食]]、[[衣服]]、[[臥具]]、[[湯藥]]。`,

'四弘誓願', `[[眾生無邊誓願度]]，[[煩惱無盡誓願斷]]，[[法門無量誓願學]]，[[佛道無上誓願成]]。此四弘誓願是菩薩所立，凡是大乘行者皆宜牢記和實踐。`,

'四如意足', `又名[[四神足]]，原係四種禪定，謂修此四者，則能如意開發神通。一、[[欲如意足]]，謂修道趣果的欲望增進。二、[[念如意足]]，謂念念一心，住於正理。三、[[進如意足]]，謂精進直前，功無間斷。四、[[慧如意足]]，謂真照離妄，心不散亂。`,

'四如實智|四如實觀', `見四如實觀條。`,

'四如實觀', `大乘行人在[[三賢]]和[[十聖]]之間，尚須經過[[四加行]]，作為進入初地的準備，所謂四加行，即修[[四尋思觀]]，能得[[四如實智]]。行者對四尋思尋求思察，以此推求之觀為因，而生即可決定之智，不惟了知所取所緣之四尋思中的名等四法，是自心所變，假有實無，且也了知能取能緣的名等四法，亦為假有實無，謂之四如實觀，或四如實智。如實者，謂恰如真如實性，畢竟不可得。`,

'布薩', `華譯[[淨住]]，或[[長養]]。出家之法，每半月（十五日與廿九日或三十日）集僧說戒經，使比丘住於淨戒中，能長養善法；在家之法，於六齋日持八戒以增長善法。`,

'布薩日', `每月十五日與廿九日或三十日之兩日，是行布薩法之日。`,

'布施', `以自己的財物，分施給別人。布施有三種，即一、財施，即以財物去救濟疾病貧苦的人；二、法施，即以正法去勸人修善斷惡；三、無畏施，即不顧慮自己的安危去解除別人的怖畏。`,

'布施偈', `又名三輪清淨偈，三輪是能施、所施、施物，清淨是對於三輪無念無所得。心地觀經所說的布施偈是：「能施所施及施物，於三世中無所得；我今安住最勝心，供養一切十方佛。」`,

'布施攝', `四攝之一，即以布施的方法去攝受他人。`,

'布施波羅蜜', `即六波羅蜜中之檀波羅蜜。見波羅蜜條。`,

'布袋和尚', `五代梁時浙江奉化縣布袋和尚，常露腹歡喜，手執布袋，禪機幽默，所以被稱為布袋和尚，相傳他是彌勒菩薩的化身。`,

'外凡', `二凡之一。見二凡條。`,

'外典', `佛教以外的典籍。`,

'外空', `謂身外的一切事物都是空假不實，為十八空之一。`,

'外教', `佛法以外的宗教或教法。`,

'外道', `於佛教以外立道，或道外之道，稱為外道，亦即真理以外的邪教。`,

'外緣', `外在的助緣，亦即四緣中之增上緣。`,

'外護', `指供給我衣服飲食的親屬檀越，為二護之一。`,

'外護善知識', `指供給我衣食所須以使我安心修道的善友，為三善知識之一。`,

'外無為', `謂眼不見色，耳不聞聲，鼻不嗅香，口不取味，身不觸細滑，意不妄念，也就是不為外境所動心的意思。`,

'尼戒', `比丘尼所受持的戒律。本來只有三百四十一戒，後來南山律師加上七滅諍，便成為三百四十八戒，普通都說尼戒為五百，那是指大數而言，實際上只有三百四十八。`,

'弘忍', `中國[[禪宗]]第五代祖師，湖北蘄州黃梅縣人，俗姓周，傳法於六祖惠能，七十四歲圓寂，諡號大滿禪師。`,

'弘誓', `弘大的誓願。`,

'弘願', `弘大的誓願，如阿彌陀佛的四十八願是。`,

'永生', `即[[涅槃]]，因涅槃為不生之法，由於不生，所以不滅，而不滅就是永生。`,

'永劫', `極長的時期。劫是梵語劫波的簡稱，是計算世界成壞相的名詞。`,

'永不現行位', `在十地中由第八地至佛果之間，無漏心任運，諸煩惱不生，故有此名，又功德剎那增進，所以又叫做剎那增進位。`,

'末法', `佛法分三個時期，即[[正法時期]]、[[像法時期]]、[[末法時期]]。正法時期一千年，像法時期一千年，末法時期一萬年。現在正是末法時期，即佛法進入了微末的時期。見正像末條。`,

'末那識', `[[八識]]中之第七識；華譯思量，又譯作意，它恆常在審察，恆常在思量，在審察思量中，念念不忘第八阿賴耶識為我，因為有四個根本煩惱（我癡、我見、我愛、我慢）跟著它，故我執的成見很深，許多煩惱便是這末那識的執著而生起的。`,

'本心', `自己本來的心。`,

'本位', `本來的位子，也就是本來的身。`,

'本地', `本來的地位。`,

'本師', `根本的教師。佛教以釋迦牟尼佛為根本的教師，其餘為受業之師。`,

'本教', `根本的教法，如一乘教是，為二教之一。`,

'本惑', `又名[[根本惑]]，或[[根本煩惱]]，即[[貪]]、[[瞋]]、[[痴]]、[[慢]]、[[疑]]、[[惡見]]等六大煩惱，為[[二惑]]之一。`,

'本誓', `諸佛菩薩在因地時所建立的根本誓約。`,

'本體', `諸法的根本自體，在應身叫真身為本體。`,

'本願', `根本的誓願。`,

'本識', `[[阿賴耶識]]的別名，因阿賴耶識是有為無為諸法的根本。`,

'本覺', `一切眾生本來就有的覺性。`,

'本覺智', `一切眾生本來就有的覺性智慧。`,

'本覺真如', `本覺是眾生心的相狀，真如是眾生心的心體。又本覺是能證的智，真如是所證的理，此智與理，就是法身如來的全體。`,

'本地風光', `又名本來面目，是形容自己心性本份的禪語。`,

'本來面目', `即自己的自性，離開了一切的煩惱和染污，就是自己的本來面目。`,

'本來無一物', `世間的一切事物，都是空假不實緣生如幻，所以說本來無一物。[[六祖壇經]]說：「<verse>菩提本無樹，明鏡亦非台，本來無一物，何處惹塵埃。</verse>」`,

'正士', `修行正法之士，即菩薩。`,

'正行', `做主要的功夫叫做正行，若做幫助的功夫則叫做助行。`,

'正因', `主要的原因叫做正因，若是次要的助力則叫做緣因。`,

'正果', `學佛人精修有得，叫做證果，因與外道的證果有別，所以叫做正果。果是形容好像果子一樣的成熟。`,

'正受', `想心都息，緣慮並亡，與三昧相應的禪定，叫做正受。`,

'正報', `指眾生的身體，因眾生的身體是依過去的業因而召感得來的果報正體，為[[二報]]之一。`,

'正見', `正確的見解，亦即離諸邪痴顛倒的如實知見，是[[八正道]]之一。`,

'正欲', `又名正思惟。見正思惟條。`,

'正語', `正確的言語，亦即對人常說真誠和善的話，是[[八正道]]之一。`,

'正業', `正當的行業，以正當的行業來維持生命，不做不道德的事業，是[[八正道]]之一。`,

'正勤', `即正精進。`,

'正念', `正確的念頭，亦即時常憶念正道，不使思想行為有錯誤，是[[八正道]]之一。`,

'正定', `正確的禪定，亦即把心安住於一境，不亂不動，是[[八正道]]之一。`,

'正覺', `１．真正的覺悟。<br>２．成佛叫做正覺。`,

'正覺華', `指[[極樂世界]]的蓮華，因依阿彌陀佛的正覺而成，所以叫做正覺華。`,

'正法', `１．真理的道法。<br>２．正法時期。見正像末條。`,

'正法依', `佛的尊號，因佛能以正法向眾生宣說，為正法之所依。`,

'正法壽', `正法的壽命。`,

'正法輪', `指真理的教法，亦即如來所說的教法。`,

'正法眼藏', `佛的心眼徹見正法，名正法眼，深廣而萬德含藏，叫做藏。正法眼藏，是禪宗用來稱其教外別傳的心印。`,

'正法明如來', `[[觀世音菩薩|觀世音]]過去成佛時的名字。`,

'正思惟', `正確的思考，亦即思考四諦的道理，以引發正當的欲念，明瞭世出世間的因果，斷集證滅，離苦得樂，是[[八正道]]之一。`,

'正精進', `正確的努力，亦即努力修善斷惡，為[[八正道]]之一。`,

'正像末', `佛法共分為三個時期，即正法時期、像法時期、末法時期。釋尊法運期限，各經所載不同，古德多依用正法五百年，像法一千年，末法一萬年之說。正法時期，正者証也，佛雖滅度，法儀未改，有教，有行，有証果者，是名正法時期；像法時期，像者似也，此時期，有教，有行，但証果的人已經很少；末法時期，末者微也，此時期轉為微末，只有教而無行，更無證果者。`,

'正遍智', `又名[[正遍知]]，即真正普遍知道一切之法，是佛十號之一。`,

'正遍覺|正遍智', `真正普遍的覺悟，與[[正遍智]]同義。`,

'正等覺', `真正普遍平等的覺悟，亦即佛的覺悟。`,

'正等正覺', `梵語[[三藐三菩提]]，華譯為正等正覺，即真正平等的覺悟的意思。`,

'玄奘', `唐朝的高僧，於唐太宗時曾到印度研究佛學十七年，回國後翻譯佛經很多，人稱三藏大師，或慈恩大師，為[[法相宗]]的開祖。`,

'玄義', `玄妙的義理。`,

'玄門', `玄妙的法門，指佛法。`,

'玄門無礙十因', `諸法事事無礙的十種原因，即[[唯心所現故]]、[[法無定性故]]、[[緣起相由故]]、[[法性融通故]]、[[如幻夢故]]、[[如影像故]]、[[因無限故]]、[[佛證窮故]]、[[深定用故]]、[[神通解脫故]]。`,

'犯戒', `觸犯佛所制的戒律。`,

'犯戒五過', `觸犯佛所制的戒律者有五種的罪過，即[[害自身]]、[[為智者所呵]]、[[惡名流布]]、[[臨終生悔]]、[[死墮惡道]]。`,

'犯戒五衰', `觸犯佛所制戒的人會有五種的衰耗，即[[求財不遂]]、[[設得即耗]]、[[眾不愛敬]]、[[惡名流布]]、[[死入地獄]]。`,

'甘露王', `[[阿彌陀佛]]的別名。`,

'甘露法', `（喻）如來所訓示的真理教法，因其教法能令眾生解脫涅槃。`,

'甘露水', `（喻）如來所說的真理教法，因其教法如人在熱天喝了清涼的水，熱惱消除，心意快樂。`,

'甘露滅', `甘露是形容佛教所說的涅槃境界，得涅槃而滅生死，叫做甘露滅。`,

'甘露門', `通達甘露涅槃的門戶，即佛的真理言教。`,

'甘露界', `[[涅槃]]的境界。`,

'生因', `生果的因種，如草木的種子是生長草木之因是。`,

'生死', `謂一切眾生因惑業所招，生了又死，死了又生。有分段生死與變易生死的分別。見二種生死條。`,

'生死岸', `佛經說[[生死海]]是此岸，而[[涅槃]]是生死海的彼岸。`,

'生死流', `（喻）生死之苦海能令人漂流和湮沒。`,

'生死海', `（喻）生死無邊際，好像汪洋大海一樣。`,

'生死輪', `（喻）眾生在六道之中生死輪迴不息，好像車輪不停的旋轉。`,

'生死縛', `（喻）生死好像一條繩子繫縛著眾生。`,

'生死長夜', `生死如夢，故以長夜作比喻。`,

'生死即涅槃', `生死即涅槃和煩惱即菩提二語，是大乘家常說的話，從世間有為的相對法說，生死是染污的，涅槃是清淨的，兩者截然不同，不可相即；若從出世無為的絕對法說，煩惱性空即是菩提，生死性空即是涅槃，非從煩惱生死之外另求菩提涅槃。這是從諸法理性平等說，不是從事相差別說的。`,

'生死肉身菩薩', `指在三賢位，未登法性，為惑業故，受三界分段生死身的菩薩。`,

'生相', `生的形相。[[四相]]之一。`,

'生報', `這一生造業要到來生才受果報，為[[三報]]之一。`,

'生佛', `眾生與佛。`,

'生佛一如', `又名[[生佛一體]]，或[[生佛不二]]，意謂眾生與佛的體性平等毫無差別。`,

'生身', `諸佛菩薩的身體，有法身與生身兩種，他們所證得的理體叫做法身，為了濟度眾生而托於父母胎生的肉身叫做生身。又佛菩薩以神通力一時變現的肉身，也叫做生身，或意生身，即隨意變化而現的身體。`,

'生身供', `供養釋尊舍利的法會。`,

'生空', `又名[[我空]]，或[[人空]]，謂眾生為五蘊假和合，無有實體，是因緣所生法，當下即空。`,

'生空智', `觀察一切眾生都無實在的我體的智慧。`,

'生空三昧', `觀察一切眾生皆緣生性空的禪定。`,

'生法二身', `生身和法身。見二身條。`,

'生法二空觀', `[[生空觀]]與[[法空觀]]。這二種觀都是大乘菩薩的觀法，大乘菩薩不但觀人為空，就是觀法亦空，以去除我執與法執，而證得我空真如和法空真如；小乘人卻不然，他們只修生空觀，所以只能斷我執而不能斷法執。`,

'生滅', `依因緣和合而有，叫做[[生]]；依因緣分散而無，叫做[[滅]]。有生有滅，是有為法，不生不滅，是無為法。根据佛教的中道思想來說，一切有為法的生滅，都是假生假滅，不是實生實滅，若是實生實滅，便是無生無滅。`,

'生滅去來', `有生有滅有去有來。視一切法有生滅去來，是小乘的妄見，若依中道的正見來說，則生滅去來本是如來藏，因為一切法本是不生不滅不去不來。`,

'生滅去來一異斷常', `即三論宗所說的八迷，如果破除了這八迷，即證得中道。`,

'生酥', `五味之一。見五味條。`,

'生酥經', `指[[天台宗]]所立五時教中方等時的經典。`,

'生化二身', `生身和化身。見二身條。`,

'生即無生', `生即無生，無生即生，是諸部般若經所說的道理。俗諦叫做生，真諦卻叫做無生，因為俗諦所說的生本來是無生，所謂生者只不過是因緣一時和合之假生而已，這種生就是依於無生的生，因為依於無生的生，所以說生即無生。`,

'用', `是與體相對的用。人是性體所表現出來的，都叫做用。就其能力上說，叫做力用；就其功業上說，叫做功用；就其活動上說，叫做作用。`,

'用大', `三大之一。見三大條。`,

'用滅', `諸法於毀滅時，它的理體並不亦滅，因為理體是永恆常住的，所謂滅者，只不過是它的作用滅而已。`,

'目連', `摩訶目犍連的簡稱。`,

'目犍連', `見摩訶目犍連條。`,

'示現', `佛菩薩應眾生的機緣而化現種種的身相。`,

'示寂', `寂是圓寂，涅槃的意思，示寂就是示現涅槃。`,

'由旬', `印度計里程的數目，每由旬有三十里、四十里、五十里、六十里的四種說法，但說四十里為一由旬者居多。`,

'白衣', `指在家人。`,

'忉利天', `華譯[[三十三天]]，為[[欲界]][[六天]]中之第二重天，其宮殿在[[須彌山]]頂，天主名[[釋提桓因]]，居中央，他有三十二個天臣，分居忉利天的四方，連他自己的宮殿，共成了三十三個天宮，所以叫做三十三天。此天一晝夜，人間已經一百年。`,

'以指標月', `指喻語言文字，月喻正法，以語言文字說正法，就如以指標月，學者當因指而見月，不當以指為月，見指不見月，也就是說，當因語言文字，而見正法，不應該把語言文字，當做正法，以致只見語言文字，不見正法。`,

'叫喚|叫喚地獄', `又名[[啼哭號叫]]，為[[八熱地獄]]之第四，因在那裡受苦的眾生，不能忍受其處種種激烈的痛苦，於是發為號泣叫喚，故名。`,

'叫喚地獄', `見叫喚條。`);

addTerms(6,

'色', `指一切有形象和佔有空間的物質。色可分為[[內色]]、[[外色]]、[[顯色]]、[[表色]]、[[形色]]五種。內色是指眼耳鼻舌身之五根，因屬於內身，故名內色；外色是指色聲香味觸之五境，因屬於外境，故名外色；顯色是指我們常見的各種顏色，如青黃赤白等等；表色是指有情眾生色身的各種動作，如取捨伸屈等等之表相；形色是指物體的形狀，如長短方圓等等。`,

'色入', `[[十二入]]之一。`,

'色心', `[[色]]與[[心]]。色是指有形的物質；心是指無形的精神。`,

'色有', `[[三有]]之一。見三有條。`,

'色身', `由[[四大]]等色法所組成的肉身。`,

'色法', `指一切有形的物質。`,

'色處', `[[十二處]]之一。`,

'色具', `[[色]]與[[心]]本來是不二的，若說心具有三千諸法，則色亦具有三千諸法，所謂一色一香，無非中道，這裡所說的色具，是[[天台宗]]至極的法門。`,

'色相', `一切物質顯現於外可以眼見的形相。`,

'色諦', `[[天台宗]]空假中三諦中[[假諦]]的別名。`,

'色境', `五境之一。見五境條。`,

'色塵', `六塵之一。見六塵條。`,

'色蘊', `五蘊之一。見五蘊條。`,

'色界', `[[三界]]之一，在[[欲界]]之上，因此界的眾生，但有色相，而無男女諸欲，故名色界，色界的範圍包括初禪至四禪等一共十八層天。`,

'色界十八天', `在[[色界]]中一共有十八層天。`,

'色即是空', `色是指一切有形的物質，這些物質都是因緣和合而生的，其當體即空，故說色即是空。`,

'色無邊處定', `簡稱[[識處定]]，即無色界第二天[[識無邊處]]的禪定，為[[四空處]]定之一。`,

'此岸', `[[涅槃]]叫做彼岸，生死即是此岸。`,

'伏忍', `初心行者，欲忍順逆境，先須調伏其心，叫做伏忍。`,

'伏斷', `伏是制伏，斷是斷除，制伏煩惱使它一時不生，叫做伏，斷除煩惱的種子使它永遠不生，叫做斷。`,

'光毫', `佛眉間的[[白毫]]有光明，故稱光毫，為佛[[三十二相]]之一。`,

'光明土', `[[無量光明土]]的簡稱，是西方[[極樂世界]]的尊稱。`,

'光音天', `[[色界]][[二禪]]的最高天，此天絕音聲，眾生要講話，便自口中發出淨光來作識別，故名[[光音]]。佛經說劫初的人類，就是由光音天來的。`,

'光音三天', `[[二禪天]]共有三天，即[[少光天]]、[[無量光天]]、[[光音天]]。`,

'共業', `共同的業因，為[[二業]]之一。`,

'共報', `共同的果報。`,

'共相', `諸法有[[自相]]與共相二種，各別不同的相叫做自相，與他共通的相叫做共相。`,

'共法', `又名共功德，即佛與其他聖者以及一切凡夫所共有的功德。`,

'共十地', `聲聞緣覺菩薩等三乘所共有的十地，即[[乾慧地]]、[[性地]]、[[八人地]]、[[見地]]、[[薄地]]、[[離欲地]]、[[已辦地]]、[[辟支佛地]]、[[菩薩地]]、[[佛地]]。`,

'共不共', `[[共法]]與[[不共法]]。共法是[[五乘法]]，不共法是[[大乘菩薩法]]，獨一微妙，不與人天聲聞緣覺四乘相共。`,

'共般若', `共通的般若。般若華譯為智慧。`,

'劣智', `下等惡劣的智慧。`,

'劣應身', `下等惡劣的應化身，如佛應地前凡夫及二乘人所應現的丈六佛身是。`,

'印', `１．又作印契、印相、契印等，就是用手指結成各種的形相，以作為法德的標誌。<br>２．印定之義，佛法的真理，可以依三法印或一實相印來作衡量，凡是合於此等印的，便可以判定是佛法。`,

'印契', `印是印相，標誌之義，契是契約，不改之義。`,

'印相', `印的形象。`,

'印明', `即是印相，明是陀羅尼。`,

'印可', `證明弟子之所得，而加以讚美許可。`,

'印咒', `１．與印相應的咒語。２．印與咒。`,

'合十', `見合掌條。`,

'合掌', `又名合十，即對合左右雙掌及十指，以表示自心專一不敢散亂的一種敬禮。`,

'合蓮華', `密教稱凡夫的心臟為合蓮華。`,

'同行', `共同修行佛道的人，為三善知識之一。`,

'同居', `凡聖同居土的簡稱。`,

'同相', `六相之一。見六相條。`,

'同參', `１．同事一師的意思。２．一同研究的意思。`,

'同分妄見', `眾生迷失了真性之後，便在一切虛妄不實的境界上同受苦樂。`,

'名色', `１．[[五蘊]]的總名，五蘊之受想行識四蘊為名，色蘊為色，因受想行識四蘊是心識的作用，只有名而無實體，所以叫做名，色蘊則是由一些極微物質所構成，有質礙的物體，所以叫做色。<br>２．在[[十二因緣]]中，人在母胎中漸漸生長，五蘊完具的時候，叫做名色支。`,

'名相', `１．耳可以聽到的，叫做名，眼可以看到的，叫做相。一切事物都有名相，但一切的名相都虛妄不實。[[楞伽經]]說：「<verse>愚痴凡夫，隨名相流。</verse>」<br>２．佛教的名詞術語，叫做名相。`,

'名數', `名目的數字，與法數同義。`,

'名德', `有名氣和有德行的比丘的尊稱。`,

'回向', `回是回轉，向是趣向，回轉自己所修的功德以趣向於其他方面，叫做回向。回向約可分為三類，即回因向果，回事向理，回自向他。`,

'回心戒', `圓頓戒的別名，即回轉從前的小乘心以趣向於大乘道的人所受的戒律。`,

'回心向大', `又名回小向大，即把本來的小乘心回轉過來以趣向於大乘的佛道。`,

'回小向大', `見回心向大條。`,

'回光返照', `１．反省的意思。２．指病人垂死突然稍微好轉的現象。`,

'回頭是岸', `（喻）能改過便有良好的結果。`,

'因人', `因位的人，是尚未達到佛果的修行人的總稱。`,

'因地', `菩薩尚未證得佛果，在因中修行時的地位。`,

'因位', `與因地同義。`,

'因明', `[[五明]]之一，即論理學。`,

'因修', `１．在因地時的修持。２．修成佛之因。`,

'因論', `[[因明論]]。`,

'因果', `因是種因，果是結果，由此因而得此果，是因果義。又因是所作者，果是所受者，種善因必得善果，種惡因必得惡果。`,

'因果不二門', `十[[不二門]]之一。`,

'因緣', `凡一事一物之生，本身的因素叫做[[因]]，旁助的因緣叫做[[緣]]。例如稻穀，種子為因，泥土、雨露、空氣、陽光、肥料、農作等為緣，由此種種因緣的和合而生長穀子。`,

'因緣觀', `觀[[十二因緣]]的道理而了悟生死流轉的真相。由此觀而開悟者，名[[緣覺]]。`,

'因緣和合', `由因與緣的和合而成。天地間一切萬物，都是由自因（親因）與緣（助緣）和合而成的。`,

'因能變', `對果能變而言，八識種子在阿賴耶識中，種子生種子，念念相續之前因後果轉變，名因能變。又從八識種子各生八識的現行之轉變，亦名因能變。`,

'因陀羅', `[[釋迦提婆因陀羅]]的簡稱，華譯[[天帝]]。`,

'因陀羅網', `忉利天王的宮殿裡，有一種用寶珠結成的網，一顆顆寶珠的光，互相輝映，一重一重，無有窮盡，這種由寶珠所結成的網，就叫做因陀羅網，也叫做[[帝網]]。`,

'因圓果滿', `謂修行的因具足時，則佛果的功德亦圓滿。`,

'地大', `地以堅為性，以能持為用，而且周遍於一切物質，所以叫做大。四大之一。`,

'地種', `凡具有堅性的物質都屬於地，因這種堅性周遍於一切物質，而且能造作一切的物質，所以叫做大種。四大種之一。`,

'地輪', `[[五輪]]之一，依[[俱舍論]]說，地輪之下有金輪，金輪是指世界初凝結時一些固體的物質，亦名金剛輪，金剛義即堅固。到金剛輪的邊際，就是廣大的地輪了。`,

'地藏', `菩薩名，因他安忍不動如大地，靜慮深密如秘藏，故名地藏。此菩薩在釋尊滅度以後，彌勒未生以前，擔負救度眾生的重任。而且常住地獄拔苦，因有「地獄未空，誓不成佛」之願，故以大願著稱。`,

'地上', `菩薩由凡夫修行成佛要經過歡喜地等十地才能達到佛果，初地以上叫做地上，初地以前叫做地前，地前是屬於凡夫菩薩，地上是屬於法身菩薩。`,

'地上菩薩', `十地位上的菩薩。`,

'地獄', `１．[[六道]]中最苦的地方，因其位置在地下，故名地獄。分為三類：一名[[根本地獄]]，有[[八熱]]及[[八寒]]之別，是為[[十六大地獄]]。二名[[近邊地獄]]，即八熱四門的[[十六遊增地獄]]。三名[[孤獨地獄]]，在山間、曠野、樹下、水濱，場所無定，為各人別業所惑，因此苦報及壽命，亦各不同，若論受苦，根本最甚，近邊次之，孤獨又次之。<br>２．凡所處的地方，只有苦受而沒有喜樂的環境，皆可比喻為地獄。`,

'地獄道', `[[六道]]之一，為罪惡眾生死後墮落的地方。`,

'地獄趣', `[[六趣]]之一，為罪惡眾生死後所趣向之處。與地獄道同義。`,

'地居天', `依地面而居的天。在三界二十八天中，只有欲界的[[四王天]]與[[忉利天]]是依著須彌山的地界而居，稱為地居天，[[夜摩天]]以上，都是凌空而處，故名[[空居天]]。`,

'地前', `初地以前。地前是凡夫菩薩，要到地上才是法身菩薩。`,

'地前三賢', `[[十住]][[十行]][[十迴向]]諸位菩薩，因只斷見思惑尚有塵沙無明惑在，未入十地聖位，故稱三賢，或地前菩薩。`,

'地前菩薩|地前三賢', `見地前三賢條。`,

'地水火風|四大', `見四大條。`,

'地水火風空|五大', `見五大條。`,

'地水火風空識|六大', `見六大條。`,

'地水火風空識見|七大', `見七大條。`,

'地行羅剎', `在地面上行動的羅剎鬼。`,

'地波羅蜜', `菩薩在[[十地]]時所修的[[十種波羅蜜]]。`,

'地動三因', `大地震動的三種原因。[[般泥洹經]]謂：「<verse>一者地依水，水依風，風依空，大風起時，水擾地動；二者得道之沙門，反神妙之天現感應，故動；三佛成道時動。</verse>」`,

'地動七因', `佛欲說法時地動的七種原因，即[[為使諸魔怖]]、[[為使眾生心不散亂]]、[[為使放逸者生覺知]]、[[為使眾生覺悟微妙法相]]、[[為使眾生觀佛之說法遍一切智]]、[[為使根熟之眾生得解脫]]、[[為使隨順而問正義]]。`,

'地動八緣', `大地震動的八種因緣，即[[風水輪動時]]、[[菩薩處母胎時]]、[[菩薩成道時]]、[[佛涅槃時]]、[[比丘現神通時]]、[[諸天來佛所現梵王或帝釋形時]]、[[飢饉刀兵之災將起時]]。`,

'在纏', `在纏真如的簡稱，即真如法性之理隱藏於煩惱纏縛之中。`,

'在家二戒', `在家人所應受持的二種戒，即五戒與八戒。五戒是盡形壽之戒，八戒只是一日一夜之戒。`,

'在家菩薩', `指在家學佛受持菩薩戒的人。`,

'多生', `眾多的生死。眾生輪迴於六道之中不能出離，所以有眾多的生死。`,

'多財鬼', `三種餓鬼之一，即多得飲食的餓鬼。`,

'多聞天', `[[四王天]]中[[北方天]]的名字。`,

'多聞第一', `[[阿難尊者]]在佛十大弟子中，以多聞第一著稱。`,

'多聞堅固', `佛滅後的第三個五百年為多聞堅固時期。`,

'多寶如來', `東方寶淨世界的佛名。`,

'如', `不變易的意思。諸法的法性，極難用語言文字來形容，故借如字來作代表。法性即實相，實相即如，因其不二、不異、不變、不動，萬法的真面目，都同一相，故名為如。`,

'如去', `如來的別名，即乘真如之道去成正覺的意思。`,

'如法', `契合於法理的意思。`,

'如語', `契合於法理的言語。`,

'如如', `如於真如，是不動、寂默、平等不二、不起顛倒分別的自性境界。因是如理智所證得的真如，故說如如。`,

'如如智', `契合如如之理的智慧，即根本智。`,

'如如佛', `１．覺悟如如之理的佛。２．佛體即是如如之理。`,

'如來', `佛十號之一，因佛乘真如之道，來成正覺，來三界垂化。`,

'如來藏', `真如在煩惱中，攝藏如來一切果地上的功德，名如來藏，若出了煩惱，即名法身。`,

'如來藏心', `真如心的別名，即人人本來具足的真實心。`,

'如來藏緣起', `與真如緣起同義。`,

'如來地', `佛的地位。`,

'如來使', `如來的使者，即佛滅後努力弘揚佛法的人。`,

'如來家', `如來的住家，即真如法界。`,

'如來識', `又名[[佛識]]，即第九[[菴摩羅識]]。菴摩羅華譯為清淨，即脫離一切無明煩惱的意思。`,

'如來禪', `經教裡的禪法，因它是如來所說，後人因名之為如來禪。至於禪宗中的禪法，因它是祖師所倡，後人因名之為祖師禪。其實祖師禪也是如來所傳，並非祖師所發明，釋尊在靈山會上，把正法眼藏，涅槃妙心，咐囑摩訶迦葉，便是祖師禪的來源。`,

'如來慧', `如來的智慧，即一切種智。`,

'如是', `如此的意思。`,

'如是力', `見十如是條。`,

'如是因', `見十如是條。`,

'如是作', `見十如是條。`,

'如是性', `見十如是條。`,

'如是相', `見十如是條。`,

'如是果', `見十如是條。`,

'如是報', `見十如是條。`,

'如是緣', `見十如是條。`,

'如是體', `見十如是條。`,

'如是我聞', `我親自聽到佛這樣說，為佛經五種証信之一。`,

'如理', `契合真理。`,

'如理智', `契合真理的智，亦即[[根本智]]。[[二智]]之一。`,

'如量智', `為佛能知世出世間一切諸法的智，如其分量，不多亦不少，故曰如量，又稱[[後得智]]，為[[二智]]之一。`,

'如實', `真如實相的簡稱。見真如實相條。`,

'如實道', `真如實相的道理。`,

'如實知', `如實是真如實相之義，如實知是指所知極符合真如實相。`,

'如實空', `如實是真如實相之義，因真如實相離一切妄染和離一切法差別之相，有如虛空，不受一塵，故謂之如實空。`,

'如實智', `真如實相的智慧。`,

'如實知見', `符合真理的知見。`,

'如實知者', `佛的德號，因佛是一位了知真如實相的聖者。`,

'如實不空', `如實是真如實相之義，真如實相雖然無有妄染，不受一塵，但是它是永恒不變的，而且體備恒沙功德妙用，一切淨法，無不具足，故謂之如實不空。`,

'如實修行', `按照真理之法而修行。初地以上的菩薩，依所證的真理而起修，謂之如實修行。`,

'如意寶', `如意珠。`,

'如意珠', `一種有求必如意的寶珠，出自龍王或摩竭魚的腦中，或是佛的舍利所變成。`,

'如意足|四如意足', `見四如意足條。`,

'如意佛', `如來有自在的神力，故云如意佛。`,

'如意通', `又名[[神足通]]，或[[神境通]]，五種[[神通]]之一。變現自在，故名如意；飛行自在，故名神足；能在六塵境界中轉變自在，故名神境。`,

'如意輪', `[[如意輪觀音]]的簡稱。`,

'如意輪觀音', `又名[[如意輪菩薩]]，為六觀音之一。此觀音手持如意寶珠，以表滿足眾生的祈求，持輪寶，以表轉法輪，故名如意輪。`,

'如意輪蓮華心如來', `[[如意輪觀音]]的德號。觀音為蓮部的中堅，故云蓮華心，本是久已成道的古佛，故稱如來。`,

'妄見', `虛妄的見解，如我見邊見等是。`,

'妄念', `虛妄的意念，亦即凡夫貪戀六塵境界的心。`,

'妄緣', `１．一切之緣，體虛不實，故曰妄緣。２．虛妄的緣由。`,

'妄染', `妄是虛妄，染是染污，指一切生死之法。`,

'妄執', `１．虛妄的執著。２．執著虛妄的法。`,

'妄想', `虛妄的思想。`,

'妄業', `虛妄造惡的業因。[[圓覺經]]說：「<verse>有妄業故有流轉。</verse>」`,

'妄心', `１．胡思亂想的心。２．不清淨和不真實的心。`,

'妄心熏習', `[[四熏習]]之一。`,

'妄語', `說虛假不真實的話。妄語有[[大妄語]]和[[小妄語]]的分別，大妄語是未得聖道而說我已得聖道，或者說我有工夫受天龍鬼神的供養等等；小妄語就是一切不真實的說話。`,

'妄語戒', `[[五戒]]或[[十戒]]之一，即禁止說一切虛假不真實的話。`,

'妄語十罪', `說騙話有十種的罪報，即[[口氣臭]]、[[善神遠之非人得便]]、[[雖有實語人不信受]]、[[智人謀議常不參預]]、[[常被誹謗醜惡之聲周聞天下]]、[[人所不敬雖有教敕人不承用]]、[[常多憂愁]]、[[種誹謗業因緣]]、[[身壞命終常墮地獄]]、[[若出為人常被誹謗]]。`,

'妄分別', `虛妄的分別。凡夫不知真如平等之理，於是分別一切事物，因而生起善惡美醜等種種差別的妄見。`,

'妄境界', `虛妄不實的境界。世間的一切事物都是妄境界，因皆虛假不實。`,

'字印', `種子與印契。`,

'字門觀', `一種觀察諸尊種子的觀法。`,

'安忍', `安心忍耐。`,

'安心', `安然不動的心。`,

'安心超行', `心行具足或是願行具足的意思。`,

'安居', `又名坐夏，或坐臘，即在夏季的三個月中，僧徒們不得隨便外出，以便致力於坐禪和修習佛法。`,

'安居竟', `結夏安居的日子完畢了，即七月十五日。`,

'安世高', `人名，本是安息國的王太子，名安清，號世高，父王逝，嗣王位，因厭世，讓位於其叔，出家學道，博通三乘教，由是遊歷諸國，弘揚佛法，至洛陽，先習漢文，繼翻譯佛經，共譯經論二十九部之多。`,

'安樂國|極樂世界', `西方[[極樂世界]]的別名。`,

'安樂淨土|極樂世界', `指西方[[極樂世界]]。`,

'安受苦忍', `[[二忍]]或[[三忍]]之一。`,

'寺', `[[僧伽]]所居住的地方。`,

'寺十種異名', `寺有十種的別名，即[[寺]]、[[淨住]]、[[法同舍]]、[[出世舍]]、[[精舍]]、[[清淨園]]、[[金剛剎]]、[[寂滅道場]]、[[遠離處]]、[[親近處]]等。含義尚有六種，即[[窟]]、[[院]]、[[林]]、[[廟]]、[[蘭若]]、[[普通]]等。`,

'年戒', `受持具足戒之後的年數。`,

'年滿受具', `年滿二十歲之後才能受持比丘的具足戒。`,

'式叉', `華譯為學。`,

'式叉尼|式叉摩那尼', `[[式叉摩那尼]]的簡稱。`,

'式叉摩那尼', `華譯為[[學法女]]，或[[正學女]]，為[[出家五眾]]之一。凡沙彌尼，欲受具足戒為比丘尼，應於二年間，先學六法，即不殺、不盜、不淫、不虛誑語、不飲酒、不非時食等，過了此二年，若是情形良好，才能正式受具足戒。`,

'羊車', `三車之一。見三車條。`,

'羊鹿牛車', `羊車、鹿車、牛車。羊車是喻[[聲聞乘]]，鹿車是喻[[緣覺乘]]，牛車是喻[[菩薩乘]]。這種譬喻是以羊鹿牛車所能運載數量的多寡來比喻聲聞、緣覺、菩薩三乘的利世成果。`,

'血途', `[[畜生道]]的別名，為三途之一。`,

'托胎', `托於母胎而生。`,

'托缽', `比丘乞食。`,

'托缽天王', `四天王之一，即北方[[多聞天王]]，梵名[[毘沙門]]，管領羅剎夜叉，佛令掌擎古佛的舍利塔，故俗稱為[[托塔天王]]。`,

'有', `[[苦果]]的別名，依因而有果，故果名為有，如稱三界為三有、九有等是，是有生死煩惱的意思。`,

'有支', `[[十二支]]之一。見十二因緣條。`,

'有見', `執著實有的邪見。`,

'有作', `有作者的意思，與有為同義，指因緣和合而生的一切事物。`,

'有法', `有作為之法，如體用俱全的一切事物是，若龜毛兔角等體性全無者，則叫做無法。`,

'有門', `四門之一。見四門條。`,

'有界', `[[有世界]]的簡稱，欲界色界無色界之三界，名為有世界。`,

'有流', `有是指三界的果報，流是指四種之惑。三界的果報實有，故云有，四種之惑使人漂流於三界之生死海，故云流。四流者，即[[見流]]、[[欲流]]、[[有流]]、[[無明流]]。`,

'有頂', `天名，色界之第四重，本名色究竟天，因處於有形世界的最高頂，故稱有頂。`,

'有間', `有間斷。`,

'有結', `有是說有生死的果報，結是煩惱的別名。`,

'有輪', `有是有生死的果報，輪是輪迴，意謂眾生於六道之中輪迴不止。`,

'有學', `在小乘四果中，前三果為有學，即有所修學的意思，[[第四果]]為[[無學]]，即無可修學的意思。`,

'有邊', `偏於有的一邊。`,

'有色', `指欲界與色界中具有色身的眾生。`,

'有色天', `色界的諸天。`,

'有相', `有形態可見的意思。`,

'有相教', `佛於成道後十二年間，說[[阿含經]]，世稱為有相教，因阿含經是以諸法實有之理為本。`,

'有相無相', `一切事物有形態可見，謂之有相；因緣所成，自性即空，謂之無相。`,

'有情', `又名[[眾生]]，即一切有情識的動物。`,

'有情世間', `二世間之一。見二世間條。`,

'有情緣慈', `見有情受苦即生起慈悲。`,

'有教', `說有的道理的教法，如小乘的[[俱舍宗]]及大乘的[[法相宗]]是。`,

'有教無人', `謂只有教法而無真正修行和證悟的人。`,

'有為', `有因緣造作之法。`,

'有為法', `指因緣和合而生的一切理法。`,

'有為空', `[[十八空]]之一，謂一切有為的事物，其本性皆空。`,

'有為果', `有為法所結成的果。`,

'有為生死', `凡夫的分段生死，叫做有為生死，若是菩薩的變易生死，則叫做無為生死。`,

'有為無漏', `雖然有為但是通於無漏之法。`,

'有為解脫', `對於無為解脫而言，又名無學支，即無學的勝解，勝解是大地法的心所，故是有為，有為法的勝解起於無學之果體，故云有為解脫。`,

'有無', `１．[[有法]]與[[無法]]。如小乘的[[七十五法]]及大乘的[[百法|五位百法]]為有法；如龜毛兔角等絕對無者是無法。<br>２．有是指常見，即固執身心為實有的邪見；無是指斷見，即固執身心為斷滅的邪見。`,

'有無二見', `固執有與無的二種邪見。有是指常見，無是指斷見。一切邪見都歸納於此二見之中，因由此二見而後生出一切的邪見。`,

'有無二邊', `執著有的一邊和執著無的一邊，因為都是一邊之見，所以叫做邊見。`,

'有漏', `[[漏]]是[[煩惱]]的別名，有漏就是有煩惱。漏含有[[漏泄]]和[[漏落]]二義：貪瞋等煩惱，日夜由六根門頭漏泄流注而不止，叫做漏；又煩惱能使人漏落於三惡道，也叫做漏，所以有煩惱之法就叫做有漏法，而世間的一切有為法，都是有煩惱的有漏法。`,

'有漏因', `指招感三界果報的業因，包括五逆十惡五戒十善等是。`,

'有漏果', `有漏業因所招感的果報，如人間天上乃至於地獄等是。`,

'有漏禪', `有漏的禪定，也就是不究竟的禪定，如四禪、四無色定、四梵行等是。`,

'有漏斷', `以有漏的道法去斷除煩惱，如凡夫修行有漏的六行觀以斷除七十二品之修惑是。`,

'有漏智', `又名[[世俗智]]，即帶有煩惱的智慧。`,

'有漏善法', `帶有煩惱的善法，如五戒十善是。`,

'有漏淨土', `依有漏心而變現的國土。`,

'有餘土', `[[方便有餘土]]的簡稱，[[四土]]之一，為無明未盡的人所生的國土，亦即斷除了世界之煩惱的聖者（阿羅漢）死後所生的地方，在三界之外。依小乘的說法，阿羅漢得了無餘涅槃之後，即畢竟不生，不會再有生處，但是大乘卻認為阿羅漢不是畢竟不生，當他們把三界的生死斷盡了，便生到界外的有餘土去，因此小乘所說的無餘涅槃，其實還是有餘涅槃。`,

'有餘涅槃', `１．依[[小乘]]的說法，阿羅漢惑業已盡，生死已了，而身體尚在，名有餘涅槃，或有餘依涅槃，言其生死之因雖盡，但還餘有漏的依身在，待到依身亦亡，則名無餘涅槃，或無餘依涅槃。<br>２．依[[大乘]]的說法，菩薩變易生死之因盡，叫做有餘涅槃，要到變易生死之果盡，獲得佛之常身後，才叫做無餘涅槃。<br>３．就大小相對說，小乘的無餘涅槃，因尚有惑業苦之殘餘，故叫做有餘；至於大乘的無餘涅槃，因究竟而無殘餘，故叫做無餘。`,

'有餘依涅槃|有餘涅槃', `簡稱有餘涅槃。見有餘涅槃條。`,

'有想天', `在一切的天中，除了[[無想天]]與[[非想非非想天]]之外，其他都是有想天。`,

'有想無想', `有想與無想的眾生。`,

'有所得', `有法可得的意思。`,

'有覆無記', `非善非惡，謂之無記，第八識是無覆無記，第七識是有覆無記，有覆即有染污之義，因為它有四煩惱相應而起，所以有染污。`,

'有體施設假', `[[二假]]之一，即在無名的事物上施設一個假名的意思。`,

'有覺有觀三昧', `三三昧之一。見三三昧條。`,

'次第緣', `又名等無間緣。見四緣條。`,

'次第三觀', `修天台空假中三觀，先從假入空，次從空入假，後乃雙離空假，入中道第一義觀，名次第三觀。`,

'死有', `四有之一。見四有條。`,

'死相', `人死亡時的相狀。由死亡時的相狀可以驗知其人將來投生之處。[[瑜伽論]]立死相有[[六驗]]，即一、若作善之人將死時，先自足冷至臍，臍上猶溫，而後氣盡者，即[[生人中]]；二、若作善之人，頭頂皆溫，而後氣盡者，即[[生天上]]；三、若自頂冷至臍，腰下猶溫，而後氣盡者，即[[生餓鬼中]]；四、若自頂冷至膝，膝下猶溫，而後氣盡者，即[[生畜趣中]]；五、若自頂冷至足，足底猶溫，而後氣盡者，即[[生地獄中]]；六、若羅漢聖人要[[入涅槃]]，或心或頂數日皆溫。`,

'死魔', `死亡使人在這一生中無法再繼續修行佛法，故謂死為魔。[[四魔]]之一。`,

'污染', `為污垢所染。`,

'污家', `比丘拿東西送給在家人，希望得到的人生起報恩的心，可是不得到的人便很不高興，這樣有傷平等施心，這情形叫做污家，是比丘所應當心的行為。`,

'灰河地獄', `十六[[遊增地獄]]之一。`,

'灰身滅智', `二乘人斷了三界的煩惱之後，便入於火光三昧中，燒身滅心，而歸於空寂無為的涅槃境界，這也是二乘行者的最終目的。`,

'牟尼', `華譯為[[寂]]，或[[寂默]]，或[[寂靜]]等。`,

'牟尼王', `寂靜之王，為佛的尊號。`,

'牟尼仙', `修寂靜行的仙人的通稱。`,

'牟尼業', `一切聖者寂靜的勝業。`,

'百劫', `一百個大劫。`,

'百苦', `三界[[二十五有]]，各有生住異滅四相，合之便是百苦。生住異滅就是無常，無常就是苦。`,

'百丈', `指唐時洪州百丈山懷海禪師，他始創禪門的規式，即百丈清規是。`,

'百丈野狐', `有一老人，在百丈禪師處聽法，對百丈說：昔我住此山，有人問：「大修行人，還落因果否」？我答他：「不落因果」，以此錯誤，五百世墮野狐身，請和尚為我下一轉語，師說：你問吧，老人便問，師答：「不昧因果」，老人大悟說：今我已脫野狐身，明日在山後，乞依亡僧之例焚化我身。`,

'百界', `[[地獄]]、[[餓鬼]]、[[畜生]]、[[修羅]]、[[人間]]、[[天上]]、[[聲聞]]、[[緣覺]]、[[菩薩]]、[[佛]]等十界，每界各具十界，乘之便是百界。`,

'百界千如', `[[天台宗]]認為一切法，都是[[真如實相]]，或名為[[如]]，或稱[[如是]]。十法界中，一、外顯的形相，名[[如是相]]；二、內具的理性，名[[如是性]]；三、所具的體質，名[[如是體]]；四、由體所生的力用，名[[如是力]]；五、所造的作業，名[[如是作]]；六、由作所種的因，名[[如是因]]；七、助因生果的助緣，名[[如是緣]]；八、由緣發生的結果，名[[如是果]]；九、所招的報應，名[[如是報]]；十、以上相為本，報為末，最後的歸趣即究竟，名[[如是本末究竟]]。十界中的每一界，情與無情，色心萬法，皆具此十如是。但此十法界的每一界，又皆具有十界，所以纔能昨日地獄，今日人間，他日畜生，再他日聲聞緣覺等。十界各具十界，則成百界，百界中的每一界，又名具有上述的[[十如|十如是]]，則成千如，此百界千如，是天台對於萬法的觀感。`,

'百衲衣', `很多補綴的衣，亦即僧衣。`,

'百八鐘', `晨昏各打大鐘一百○八下，以驚醒一百○八煩惱。`,

'百一供身', `又名[[百一物]]，或[[百一眾具]]，百是指比丘於三衣六物之外的種種雜具。在許多的雜具中，比丘只能蓄留一種，謂之百一供身，一種以外的，叫做長物。比丘的根性有三品，上品只蓄三衣，中品加蓄百一，下品加蓄長物。`,

'百一眾具|百一供身', `與[[百一供身]]同。`,

'百八煩惱|百八結業', `一百○八種煩惱。與[[百八結業]]同。`,

'百八結業', `又名[[百八煩惱]]，即一百○八種煩惱，結是煩惱的別名，由煩惱而生的種種惡業，叫做結業。百八者，三界之[[見惑]]有八十八使，[[修惑]]有十使，合稱為九十八隨眠，再加上[[無慚]]、[[無愧]]、[[嫉]]、[[慳]]、[[悔]]、[[睡眠]]、[[掉舉]]、[[昏沈]]、[[瞋忿]]、[[覆]]等十纏，便成為一百○八。`,

'百光遍照王', `[[大日如來]]。`,

'竹園', `竹林精舍。`,

'竹林精舍', `又名竹園，為頻婆娑羅王建築以供佛說法的道場，在王舍城，也是佛教史上的第一座寺廟。`,

'老苦', `四苦之一。見四苦條。`,

'老婆', `親切叮嚀之義。`,

'老婆禪', `親切叮嚀之禪。`,

'耳根', `六根之一。見六根條。`,

'耳識', `六識之一。見六識條。`,

'肉山', `比丘虛受信眾的布施，死後成為一座大肉山，以償還其債。`,

'肉心', `肉團心，即心臟。`,

'肉眼', `人間肉身之眼，為五眼之一。`,

'肉燈', `割肉燃燈以供養佛。`,

'肉身菩薩', `又名生身菩薩，即此父母所生之身已是菩薩。`,

'自力', `眾生自己修行的力量。`,

'自在', `１．進退無礙的意思。２．指吾人的心完全脫離了煩惱的繫縛而通達無礙。`,

'自在天', `見大自在天條。`,

'自在王', `[[大日如來]]的尊稱。`,

'自性', `諸法各自有其不改變不生滅的自性，故一切現象的本體或一切心相的性體，叫做自性。`,

'自性行', `四種性行之一。`,

'自性戒', `又名[[本性戒]]，即不待佛制，自性便可受持的戒，如十善戒是。`,

'自性身', `四身之一。見四身條。`,

'自性三寶', `自性本具的三寶，如眾生具有靈明覺照的佛性為佛寶，其性常寂圓淨為法寶，有融妙和樂義為僧寶。`,

'自性彌陀', `自性就是彌陀。依心性的道理說，自他本來是不二的，念佛人不生不滅的心性與彌陀佛不生不滅的心性毫無差異，故念彌陀即是念自性之佛。`,

'自性清淨心', `又名[[如來藏心]]，吾人本具的心，自性清淨，離一切的妄染，故云自性清淨心。`,

'自性五分法身香', `見五分法身香條。`,

'自相', `一切事物，皆有自共二相。見共相條。`,

'自相空', `[[十八空]]之一。`,

'自恣', `僧眾於七月十五日，結夏安居已畢，便在大會中，任由眾人恣舉自己所犯之罪，並對著其他比丘作懺悔，叫做自恣，又名隨意，即可以任由他人隨意檢舉自己的罪過。`,

'自恣日', `指結夏[[安居]]的最後一日。`,

'自恣犍度', `[[二十犍度]]之一。`,

'自調', `聲聞緣覺的修行方法，其方法是自調自淨自度。智度論說：「求福德皆為自調自淨自度。持戒是自調，修禪是自淨，智慧是自度。復次，自調者正語正業正命，自淨者正念正定，自度者正見正思惟正方便。」`,

'自調自淨自度', `見自調條。`,

'自證', `親自證悟和體驗。`,

'自證身', `五種法身中之法界身及四種法身中之自性身。`,

'自證分', `見四分條。`,

'自心佛', `自己心裡的佛。因自己的本性，原是與佛一樣的。`,

'自體分', `與自證分同。`,

'自乘果', `三乘各自的聖果。`,

'自比量', `因明三量之一。見三量條。`,

'自行化他', `又叫做[[自利利他]]，即一方面自己修行一方面又教化他人。`,

'自受自用', `見報身條。`,

'至教量', `又名[[聖教量]]、[[正教量]]、[[聲量]]等，為三量之一。見三量條。`,

'至德具足益', `謂信仰阿彌陀佛而念佛的人，現世就能具足無上的功德。`,

'舌舌', `諷誦經偈時，因為念得很快，所以將文字的聲音省略，如念南無阿彌陀佛，只唸做南無佛是。`,

'舌相', `佛[[三十二相]]之一。佛有廣長舌相，此相乃是表示多生多世都不妄語。`,

'舌根', `六根之一。見六根條。`,

'舌識', `六識之一。見六識條。`,

'行', `指身口意的造作。`,

'行人', `修行的人。`,

'行法', `修行的方法。`,

'行果', `修行與果報。`,

'行者', `１．修行佛法的人。２．居住佛寺但留著頭髮修行的人。`,

'行苦', `三苦之一。見三苦條。`,

'行相', `行事的相狀。行相有粗有細，如前六識的行相粗而易知，第八識的行相細而難明。`,

'行腳', `禪僧為了尋師訪友及求證佛法而到處旅行。`,

'行捨', `行是修行，捨是捨棄，即修行人應捨棄我相和法相，亦即行一步捨一步的修善。`,

'行陰', `[[五蘊]]中之行蘊。`,

'行教', `偏重於修行的教法。`,

'行業', `１．身口意所造作的業。２．可以召感苦果的善惡行為。`,

'行解', `修行和知解。`,

'行樹', `成列的樹林。`,

'行願', `１．實行和心願。２．實踐自己的願望。`,

'行證', `修行和證悟。`,

'行蘊', `五蘊之一。見五蘊條。`,

'行供養', `修行善法以供養諸佛。`,

'行不退', `永不退失菩薩的大行。`,

'行滿成佛', `見四滿成佛條。`,

'行境十佛', `修行圓滿而證得無上境界的十種佛，即[[願佛]]、[[業報佛]]、[[住持佛]]（又名[[正覺佛]]）、[[法界佛]]、[[心佛]]、[[三昧佛]]、[[性佛]]（又名[[本性佛]]）、[[如意佛]]（又名[[隨樂佛]]）。`,

'衣', `指出家人所穿的袈裟。`,

'衣法', `衣指出家人的袈裟，法指正法，內傳法以印證宗門的佛心宗旨，外傳衣以表示師承的信實無虛。`,

'衣缽', `衣指袈裟，缽是出家人用來盛施主供養食物的應器，二者都是出家人重要的法物，並可作師承的信證，衣缽的授受即代表著心法的接受。`,

'西天', `指印度，因印度在中國的西方。`,

'西牛貨洲', `位在須彌山西方的大洲名，因其地多牛，以牛為貨易，故名為牛貨。`,

'西方淨土', `西方阿彌陀佛的[[極樂世界]]。`,

'西方同居土', `指西方阿彌陀佛的極樂淨土，因其土凡夫與佛菩薩共同居住。`,

'伎樂', `音樂。`,

'任運', `任法之自然運動，不加人工的造作。`,

'吉祥天|吉祥天女', `[[吉祥天女]]。`,

'吉祥坐', `[[坐相]]之一，即先以左足置於右腿上，再以右足置於左腿上的一種坐法。`,

'吉祥懺法|金光明懺法', `[[金光明懺法]]的別名，因金光明懺法是以吉祥天為道場之主。`,

'同體大悲', `謂佛的法身，與眾生的法身是共同的，自己和他人，沒有分別，視他人的痛苦就是自己的痛苦。`
);


addTerms(7,

'弟子', `徒眾對老師的自稱。`,

'伽藍', `１．[[僧伽藍摩]]的簡稱，華譯為[[眾園]]，即僧眾所居住的園庭，亦即寺院的通稱。２．指佛教的護法神。`,

'伽藍神', `保護[[伽藍]]（寺廟）的神。佛說有十八神保護伽藍，即[[美音]]、[[梵音]]、[[天鼓]]、[[歎妙]]、[[歎美]]、[[摩妙]]、[[雷音]]、[[師子]]、[[妙歎]]、[[梵響]]、[[人音]]、[[佛奴]]、[[頌德]]、[[廣目]]、[[妙眼]]、[[徹聽]]、[[徹視]]、[[遍視]]。`,

'伽耶山', `華譯[[象頭山]]，有二處，一在靈鷲山附近，一在菩提道場附近。`,

'但中', `離開空有二邊，但取中道，叫做但中，為天台別教的中觀。`,

'但空', `小乘人分析諸法時，但見空而不見不空，叫做但空。大乘菩薩卻說諸法如幻如化，當體即空，但在空中自有不空之理，叫做不但空。`,

'但三衣', `十二[[頭陀]]行之一，即比丘但持[[僧伽梨]]、[[鬱多羅]]和[[安陀會]]的三衣，不再蓄存其他的衣。`,

'位妙', `[[十妙]]之一。`,

'位不退', `[[三不退]]或[[四不退]]之一，菩薩修到十住位以上，便不再墮落退失其地位。`,

'住心', `安住於道的心。見十住心條。`,

'住劫', `四[[中劫]]之一。`,

'住果', `安住於所證得的[[果位]]。`,

'住相', `四相之一。見四相條。`,

'住持', `１．安住於世界以保持佛法。２．主持寺院的和尚。`,

'住持三寶', `佛滅後安住於世界上保持佛法的三寶，木雕泥塑紙畫的佛像，即[[住持佛寶]]，三藏經典，即[[住持法寶]]，剃髮染衣的比丘，即住[[持僧寶]]。`,

'佛', `梵語[[佛陀]]的簡稱，華譯為[[覺者]]，也就是[[正覺]]和[[遍知]]的大覺大悟者。遍知是說對於宇宙事理無所不知覺，正覺是說所知正確真實而無外道那樣邪見妄執的錯誤，所以佛的另一尊號叫做正遍知或正等覺。覺有三義，即[[自覺]]、[[覺他]]、[[覺行圓滿]]。自覺是自己遍知正覺以超越三界凡夫；覺他是先覺覺後覺，以修菩薩行而超越二乘，使眾生皆得如自己一樣的大覺大悟；覺行圓滿是自他兩覺兩利功德圓滿，以超越菩薩而完成究竟的佛果。`,

'佛土', `指一佛所住的國土，或一佛所教化的領土，有[[淨土]]、[[穢土]]、[[報土]]和[[法性土]]等的分別。`,

'佛七', `設立道場以做佛事七天。若是念阿彌陀佛的都叫佛七，念觀世音菩薩的叫觀音七，念往生咒的叫往生七，但也可以都叫做佛七。`,

'佛日', `１．（喻）佛能破除眾生的痴闇，如紅日能破除一切的黑暗一樣。２．（喻）佛法慈悲廣大，普渡無私，如日之遍照大地。`,

'佛化', `佛的教化。`,

'佛母', `１．佛從法生，故[[法]]即是佛母。２．[[般若波羅蜜]]為生諸佛之母，故稱佛母。３．釋尊之母，即[[摩耶夫人]]，或稱佛的姨母[[大愛道]]為佛母。`,

'佛地', `達到成佛的地位。`,

'佛印', `１．諸佛的印契，諸法實相就是諸佛決定不變的印契。２．佛心印的簡稱。３．指宋金山寺僧，名了元，有辯才，蘇東坡常向他請教。`,

'佛因', `成佛之因，即一切善根功德是。`,

'佛位', `佛的地位。`,

'佛戒', `又名[[佛性戒]]，或[[佛乘戒]]，就是成佛的戒，也就是[[梵網經]]所說的[[大乘戒]]。`,

'佛身', `佛的身體，有[[法身]]、[[報身]]、[[化身]]等的分別。`,

'佛具', `莊嚴佛壇的法器道具，如花瓶香爐等是。`,

'佛事', `唸經拜懺。`,

'佛會', `禮佛誦經的法會。`,

'佛教', `１．佛對世人的訓示。教即訓示之義。<br>２．世界三大宗教之一，以釋迦牟尼佛為教主，主張慈悲平等，在後漢明帝時，由西域傳入中國，今盛行於世界各地。`,

'佛海', `（喻）佛法廣大如海。`,

'佛果', `佛的果位。`,

'佛經', `佛教的經典。`,

'佛界', `十界之一，即諸佛的境界。`,

'佛祖', `１．佛與祖師。２．佛教之祖，即釋迦牟尼佛。`,

'佛記', `將來必定成佛的記別。`,

'佛智', `佛陀的智慧。[[智度論]]說：「<verse>佛智慧有二種：一者無上正智，名阿耨多羅三藐三菩提，二者一切種智，名薩般若。</verse>」`,

'佛道', `佛所證悟的道法，即[[無上菩提]]。梵語菩提，新譯為覺，舊譯為道。`,

'佛說', `佛金口所說。`,

'佛慧', `諸佛的智慧，即[[一切種智]]。`,

'佛寶', `[[三寶]]之一。佛是覺者的意思，能自覺，又使他覺，自他之覺行圓滿者，叫做佛，佛是世界上的真寶，故稱佛寶。`,

'佛陀', `簡稱[[佛]]，是覺者的意思。見佛條。`,

'佛眼', `[[五眼]]之一，即佛陀之眼，能夠見到一切法非空非有不可思議的道理。`,

'佛乘', `又名[[一乘]]，即唯一能令人成佛的教法。`,

'佛號', `佛名。`,

'佛境', `佛的境界。`,

'佛法', `１．佛所說之法，即八萬四千法門是。２．佛所得之法，即無上之真理是。３．佛所知之法，即一切諸法是。`,

'佛法藏', `即[[如來藏]]，亦即真如之[[理體]]。`,

'佛法壽命', `佛說戒律是佛法的壽命，因為戒律若行於世，則佛法不滅。`,

'佛性', `佛者覺悟之義，性者不改之義，佛性即是一切眾生永不變異的覺悟之性。涅槃經說：「一切眾生悉有佛性，如來常住無有變異。」`,

'佛性常住', `謂如來常住無有變易的意思。`,

'佛性真如', `佛性與真如。能覺悟成佛之性，叫做佛性；不生不滅之實體，叫做真如。佛性與真如，同體異名。`,

'佛滅', `佛入涅槃。`,

'佛滅度|佛滅', `與佛滅同義。滅度是滅煩惱和度苦海的意思。`,

'佛種', `能生佛果的種子，如菩薩發菩提心修六度萬行是。`,

'佛種性', `能生佛果的種子體性。`,

'佛生日', `佛的生日，舊說是陰曆四月初八日，新說是陽曆的五月月圓日。`,

'佛言量', `又叫做[[聖教量]]，即以佛神聖的言語作標準而決定是非。`,

'佛知見', `佛的真如灼見。`,

'佛臘日', `七月十五日。臘者歲末之義，佛家以一夏九旬[[安居]]之最後一日為歲末。`,

'佛立三昧', `又名[[般舟三昧]]，因此三昧於成就時可以見到十方諸佛站立於其前，故名。`,

'佛四無畏', `佛對眾生說法時有四種的泰然無畏。一、[[一切智無所畏]]，佛於大眾中明言我為一切智人而無畏心；二、[[漏盡無所畏]]，佛於大眾中明言，我斷盡一切煩惱而無畏心；三、[[說障道無所畏]]，佛於大眾中說惑業等諸障法而無畏心；四、[[說盡苦道無所畏]]，佛於大眾中說戒定慧等諸盡苦之正道而無畏心。`,

'佛成道日', `佛成道的日子。佛降生、成道、涅槃等，都在陽曆的五月月圓日。`,

'佛具十身', `[[菩提身]]、[[願身]]、[[化身]]、[[住持身]]、[[相好莊嚴身]]、[[勢力身]]、[[如意身]]、[[福德身]]、[[智身]]、[[法身]]。`,

'佛足頂禮', `禮拜佛陀的足，這是佛教最隆重的敬禮法。`,

'佛後普賢', `在成佛之後，再修像普賢菩薩一樣利益眾生的行法。`,

'佛歡喜日', `即七月十五日，因此日比丘結夏[[安居]]完畢，眾僧證道者多，十方諸佛歡喜。`,

'佛前佛後難', `八難之一。見八難條。`,

'杜順', `陳隋間終南山人，為[[華嚴宗]]的始祖。`,

'作犯', `作殺生偷盜等惡事而毀犯所受的戒律。`,

'作意', `集中注意，令心警覺。`,

'作觀', `閉起眼睛，默想一種相。`,

'作業', `身口意所作的善惡業。`,

'作法懺', `三種懺悔之一。見三種懺悔條。`,

'作持戒', `戒有[[止持戒]]和作持戒二種，止是制止，制止身口意不作諸惡，如五戒乃至具足戒等是；作是造作，策勵三業以造作眾善。以上二戒又名[[止持門]]和[[作持門]]，諸惡莫作是止持門，眾善奉行是作持門。`,

'作願門', `五念門之一。見五念門條。`,

'初心', `初發心學佛。`,

'初地', `菩薩乘五十二位中十地的第一地名。見十地條。`,

'初住', `菩薩乘五十二位中十住的第一住。見十住條。`,

'初位', `最初的階位。`,

'初果', `指聲聞乘四果中的第一預流果。見四果條。`,

'初果向', `即預流向。見四向條。`,

'初禪', `１．初禪定。２．初禪天。[[楞嚴經]]說：「<verse>清淨心中，諸漏不動，名為初禪。</verse>」`,

'初禪天', `[[四禪天]]中之第一天名。`,

'初禪定', `[[四禪定]]中之第一禪名。`,

'初禪梵天', `[[色界]]之諸[[天]]，悉離淫欲而得清淨，故名梵天。梵即清淨的意思。`,

'初發心', `初發求取菩提的心。`,

'初時教', `[[法相宗]]所立三教之一。見三時教條。`,

'初能變', `[[唯識宗]]說萬法唯識所變，其能變識有三種，以第八阿賴耶識為初能變，末那識為第二能變，前六識為第三能變。`,

'初剎那識', `一切有情在最初的一剎那，只有[[第八識]]。`,

'初頓華嚴', `[[華嚴教]]是佛最初成道時所說的頓教。`,

'初歡喜地|歡喜地', `菩薩[[十地]]之第一地。與[[歡喜地]]同。`,

'判教', `判別教相。佛教傳入中國後，經中國學者，各据己見，將其分為若干時，或若干類，使發心研究佛教者，較易探討了解，名為判教。`,

'判釋', `１．判斷經論的旨趣和解釋它的義理。２．判斷如來一代所說教義的大小深淺，叫做教相判釋。`,

'別報', `各別不同的果報。`,

'別圓', `指[[天台]]四教中的[[別教]]與[[圓教]]。`,

'別業', `各別不同的業因。`,

'別戒', `即[[僧尼戒]]，又名[[具足戒]]。`,

'別請', `在眾比丘中特別邀請一人來供養。若是如法的比丘，是絕對不會接受這種別請的。`,

'別願', `各別的誓願。如四弘誓願是諸佛菩薩的通願，叫做總願，如阿彌陀佛的四十八願和藥師佛的十二願，即是別願。`,

'別境', `各別不同的境界，也就是[[別境心所]]。別境心所有五種，即[[欲]]、[[勝解]]、[[念]]、[[定]]、[[慧]]，此五種皆與五識心王之次念相應。`,

'別教', `指與[[二乘]]別異的[[一乘]]教法。`,

'別教一乘', `如[[華嚴經]]對頓根的行人，不談三乘，直顯一乘者是。`,

'別相', `六相之一。見六相條。`,

'別相三觀', `[[別教]]所說的三觀，即把空假中分開來作觀。`,

'別相三寶', `佛法僧三寶分開來各別現相。`,

'別相念處', `指[[小乘]]行人修四念處觀時，將其各別分開來作觀。`,

'別眾食', `四位比丘以上別聚一處乞食食，稱為別眾食，為佛制所不許。`,

'別解脫', `[[戒律]]的別名，因受戒能使身口意惡業，別別解脫，故名。`,

'別解脫戒', `又名[[別解脫律儀]]，[[別解脫]]是[[戒法]]的別名，因受戒能使身口意的惡業，別別解脫，故名別解脫，因合於律儀，故又名別解脫律儀。`,

'別解脫律儀|別解脫戒', `與[[別解脫戒]]同。`,

'別時念佛', `特別規定一個時間來念佛。`,

'劫', `梵語[[劫簸]]的簡稱，譯為時分或大時，即通常年月日所不能計算的極長時問。`,

'劫火', `[[大三災]]之一，即壞劫時所發生的大火災，燒到初禪天，一切都變成灰燼。`,

'劫水', `[[大三災]]之一，即壞劫時所發生的大水災，由地下水輪湧出，大雨如車軸，二禪天以下，盡為大水所淹沒。`,

'劫初', `成劫之初，亦即完成此世界的初期。`,

'劫災', `指壞劫末期所起的火水風[[三災]]，此三災蕩盡整個世界。`,

'劫海', `（喻）劫數之多好像大海的水量。`,

'劫燒', `指壞劫時的[[大火災]]。`,

'劫濁', `[[五濁]]之一。人壽本為八萬四千歲，後因德薄，而壽命亦每百年遞減一歲，減至二萬歲時，即步入劫濁。可知人壽自二萬歲至十歲之間，再由十歲至二萬歲之間，都是劫濁時代。`,

'劫簸|劫', `見劫條。`,

'利他', `利益他人，為[[二利]]之一。`,

'利生', `利益眾生。`,

'利物', `利益眾生。物即指一切眾生。`,

'利使', `性質很銳利的煩惱。見五利使條。`,

'利根', `很銳利的根器。`,

'利養', `以利益保養身體。`,

'利樂', `利益和安樂。`,

'利樂有情', `使眾生獲得利益和安樂。`,

'利行攝', `四攝法之一。見四攝條。`,

'卵生', `四生之一。見四生條。`,

'忘忍', `對別人所加的侮辱，如同未曾受辱似的，絲毫不在意。`,

'吠舍', `印度[[四姓]]之一，即商人的族姓。`,

'吠盧遮那', `又作[[吠路者那]]，舊作[[毗盧舍那]]，為法身佛的梵名，亦即[[大日如來]]。`,

'含生', `含有生命的動物。`,

'含類', `含識的眾類，即一切眾生。`,

'含靈', `含有靈性的動物。`,

'含中教', `密含中道之理的教法，如[[天台]][[四教]]中的[[通教]]是。`,

'坐', `[[四威儀]]之一，即端身正坐的儀相。`,

'坐具', `坐臥的器具。`,

'坐夏|安居', `[[安居]]的別名，即在夏季裡靜坐以修行佛法。`,

'坐禪', `靜坐修禪。禪者，梵語[[禪那]]的簡稱，華譯為靜慮，即止息妄念以便明心見性的行法。`,

'坐禪十種行', `坐禪的十種行法，即一、[[命觀處明淨]]；二、[[遍起看諸根]]；三、[[曉了於相]]；四、[[制令心調]]；五、[[折伏懈怠]]；六、[[心無味著]]；七、[[心歡喜]]；八、[[心定成捨]]；九、[[近學定人]]；十、[[樂著安定]]。`,

'妙', `不可思議、絕待、無比等的意思。`,

'妙土', `美妙的國土，即諸佛的報土。`,

'妙心', `美妙的心體，即如來的真心。`,

'妙色', `美妙的色相。佛的報身與報土都有不可思議的美妙色相。`,

'妙有', `表面像是有，實際卻是空，也就是非有之有。`,

'妙戒', `指菩薩所受的大戒，對於小乘的麤戒而言。`,

'妙理', `微妙的道理。`,

'妙果', `微妙的果實，即菩提涅槃。`,

'妙典', `說妙法的經典。`,

'妙明', `妙明的真心，即無漏的真智。`,

'妙門', `微妙的法門。`,

'妙祥', `[[文殊師利]]菩薩的譯名。`,

'妙慧', `微妙的智慧。`,

'妙德', `[[文殊師利]]菩薩的譯名。`,

'妙樂', `美妙的歡樂。`,

'妙觀', `[[天台宗]]謂圓教圓融的三觀為妙觀。`,

'妙觀察智', `[[法相宗]]所立如來四智之一，即轉第六意識，妙觀諸法之相，眾生之機，而施展說法斷疑之用。`,

'妙法', `微妙之法。`,

'妙法宮', `如來以妙法為宮殿，時常住在其中。`,

'妙法輪', `謂佛所轉的法輪，殊勝而不可思議。`,

'妙法藏', `貯放妙法的庫藏。`,

'妙法蓮華', `經名，簡稱[[法華經]]，以蓮華的明淨來形容大法的微妙。`,

'妙幢', `菩薩名。`,

'妙幢相三昧', `[[法華經|妙法蓮華]]所說十六三昧之一。`,

'妙覺', `自覺覺他，覺行圓滿，智德不可思議，稱為妙覺，為佛果的無上正覺，證得此覺的人，被稱為佛。`,

'妙覺地', `證得妙覺的地位，即佛的地位。`,

'妙音天', `妙音樂天的簡稱。`,

'妙音樂天', `辯才天的別名。`,

'妙音大士', `妙音菩薩。`,

'妙音菩薩', `[[法華經|妙法蓮華]]妙音菩薩品所說的菩薩名。`,

'妙吉祥', `[[文殊師利]]菩薩。`,

'妙高山|須彌山', `[[須彌山]]的譯名，此山由金、銀、琉璃、水晶四寶所成，而且是諸山中之最高者，故名妙高山。`,

'妙蓮華', `（喻）佛的真知灼見，在染亦不污，猶如蓮花出污泥而不染。`,

'妙喜世界', `[[維摩居士|維摩]]的國土。`,

'妙喜足天', `[[兜率天]]的譯名。`,

'妙有真空', `妙有者，不有之有；真空者，非空之空。`,

'希法', `[[十二部經]]之一，梵名[[阿浮達磨]]，即說希奇不思議事的經典，亦名未曾有。`,

'形色', `有形的物質。色即物質的意思。`,

'忌日', `又名諱日，即人死亡的日子。因追懷其人，而忌作逸樂之事，故名忌日。`,

'忌月', `指正月、五月、九月等三個月。見三長齋月條。`,

'忍', `１．忍耐的意思，忍耐不如意的環境而不生瞋恚的心。２．安忍的意思，即心安住於理而不動搖。`,

'忍土', `[[娑婆世界]]。娑婆華譯為忍，又名堪忍世界。`,

'忍行', `忍辱之行。`,

'忍地', `覺悟無生法忍的地位。`,

'忍位', `１．七善根中忍法之位。２．總稱證悟真理之位。忍即安忍，心安住於道理而不動搖的意思。`,

'忍法', `１．[[七賢位]]之一。２．[[四善根]]之一。`,

'忍界', `[[娑婆世界]]。娑婆華譯為忍，或堪忍。`,

'忍智', `慧心安住於法，叫做[[忍]]，於境決斷，叫做[[智]]。`,

'忍調', `以忍辱調伏瞋恚。`,

'忍辱', `忍受各種侮辱而不起瞋恚惱恨，為六[[波羅蜜]]之一。`,

'忍辱衣', `[[袈裟]]的總稱。`,

'忍辱波羅蜜', `六波羅蜜之一。見波羅蜜條。`,

'成佛', `成就佛道。菩薩修六度萬行究竟圓滿而成辦阿耨多羅三藐三菩提，叫做成佛。`,

'成實宗', `印度[[小乘]]中最後成立的宗派，亦即小乘的[[空宗]]，酷似大乘，因以[[訶梨跋摩]]所造的[[成實論]]為依据，故名成實宗。`,

'成住壞空', `見四劫條。`,

'成所作智', `[[法相宗]]所立如來四智之一，即轉眼等五識，成就利益一切眾生的作為。`,

'我', `主宰的意思。佛教說我們通常所執著的我是[[假我]]，因為這個我是由五蘊假和合而成，離開了五蘊，根本就沒有我存在。`,

'我見', `又名[[我執]]，一切眾生的肉體和精神，都是因緣所生法，本無我的實體存在，但吾人都在此非我法上，妄執為我，叫做我見。`,

'我所', `[[我所有]]的簡稱。有我見的人，對於身外之物都認為我所有，叫做我所。`,

'我相', `實我之相。[[四相]]之一。`,

'我愛', `愛著自己所妄執的我。`,

'我論', `[[法我見]]和[[人我見]]的二種邪論。`,

'我癡', `癡是愚癡，愚癡的不明白我之真相，叫做我癡。`,

'我人', `我與他人。`,

'我人四相', `一、[[我相]]，即在五蘊法中執著有一個實在的我，有我之所有；二、[[人相]]，因為執著有實在的我，站在我的立場，就稱他人為人；三、[[眾生相]]，與我對待的眾生不止一個，所有人及非人的差別相，是為眾生相；四、[[壽者相]]，即在一期的生命中，執著壽命的長短。`,

'我空', `又名[[生空]]，或[[人空]]，眾生雖然都有一個心身，但那是五蘊假合而成的，沒有實在常一的我體，叫做我空。`,

'我空真如', `無我的真理。[[真如]]即真理的意思。`,

'我執', `又名[[人執]]，即妄執人有一實在的我體。`,

'我執習氣', `隨著我執而熏成的種子。`,

'我慢', `自高自大，侮慢他人。`,

'我慢定', `又名[[慳執定]]，即取著禪定中所現的種種異境以為特殊微妙。`,

'我語取', `執著種種我見的言語。`,

'戒', `防非止惡的意思，不但惡事不可做，就是惡的念頭也不許有。又名[[清涼]]，因人能止惡行善，則必心安理得，俯仰無愧，故心無熱惱而得清涼。`,

'戒力', `１．[[戒律]]的力量。２．[[持戒]]的力量。`,

'戒刀', `比丘所佩的小刀，此刀乃割切三衣之用。`,

'戒行', `恪守[[戒律]]的操行。`,

'戒名', `在受[[沙彌戒]]時，師父所賜給的法名。`,

'戒法', `佛所制定的戒法。`,

'戒香', `戒行莊嚴，以德為香。`,

'戒品', `戒的品類。`,

'戒相', `戒的相狀差別，如比丘的戒相是二百五十戒，比丘尼的戒相是三百四十八戒是。`,

'戒師', `又名[[戒和尚]]，即授戒的師父。`,

'戒珠', `（喻）戒律潔白，可以莊嚴人身，好像晶瑩可愛的寶珠。`,

'戒場', `授受[[戒律]]的道場。`,

'戒善', `持戒的善根，如前生受持五戒者，今生得生人間，前生受持十善者，今生得生天上，此皆持戒的功德所致。`,

'戒單', `受持[[比丘戒]]的證明書。`,

'戒經', `說戒律的經典，如[[梵網經]]、[[優婆塞戒經]]等是。`,

'戒牒', `又名[[度牒]]，即受戒的證明書。`,

'戒學', `戒律的修學。[[三學]]之一。`,

'戒壇', `修戒法的壇場。`,

'戒臘', `受戒的年數。`,

'戒蠟|戒臘', `與[[戒臘]]同。`,

'戒擖|戒臘', `與[[戒臘]]同。`,

'戒器', `堪能受戒的人。`,

'戒體', `授受戒法之後，受者體中，得到一種防非止惡的功能，謂之戒體，此戒體雖屬色法，但外表無相，故又名無表色。`,

'戒取|戒禁取見', `與[[戒禁取見]]同。`,

'戒取見|戒禁取見', `與[[戒禁取見]]同。`,

'戒定', `[[持戒]]與[[禪定]]。`,

'戒定慧', `又名[[三學]]，或[[三無漏學]]。戒是戒止惡行，定是定心一處，慧是破妄證真。持戒清淨心則安，心安則可得定，得定則可觀照分明而生智慧。持此戒定慧三法，能對治三毒，成就佛果，所以又叫做三無漏學。`,

'戒定慧解脫解脫知見', `[[戒]]、[[定]]、[[慧]]、[[解脫]]、[[解脫知見]]。以上五者叫做[[五分法身]]，戒者防身之惡，定者使心不亂，慧者破妄證真，解脫者離諸繫縛而證涅槃，解脫知見者即涅槃所起之智慧。前三為修因，後二為結果。`,

'戒律', `防止佛教徒邪惡的法律，如[[五戒]]、[[十善]]乃至[[二百五十戒]]是。`,

'戒律藏', `說明戒律的經典，為[[三藏]]之一。`,

'戒禁取見', `執行邪戒卻以為是正戒。`,

'戒波羅蜜', `六[[波羅蜜]]之一。`,

'扶習潤生', `[[天台宗]]說通教的菩薩，以誓願力，扶餘殘的習氣，受生於三界以利益眾生。`,

'扶惑潤生', `由煩惱的扶助而受生。菩薩為濟度眾生而不斷煩惱，因此常在三界之中受生，此即[[大悲闡提]]的行為。`,

'折伏攝受', `折伏惡人，攝受善人，此二門乃是佛道大綱，折伏是[[配智慧門]]，攝受是[[配慈悲門]]。`,

'求寂', `受十戒志求涅槃圓寂的人，即[[沙彌]]。`,

'求化精進', `努力上求佛果下化眾生。`,

'決定信', `決定的信心。`,

'決定住', `六種住之一，即菩薩自[[八地]]以上，得不還不退之位。`,

'決定業', `簡稱[[定業]]，即必定受報的業。`,

'沈冥', `沈於生死和冥於無明。`,

'沈檀', `[[沈香]]與[[旃檀香]]。`,

'沙劫', `恒河沙數的劫數。`,

'沙門', `華譯[[勤息]]，即勤修佛道和息諸煩惱的意思，為出家修道者的通稱。`,

'沙界', `恒河沙數的世界。恒河沙數是形容數目很多。`,

'沙彌', `華譯[[息慈]]，即息惡和行慈的意思，又譯作[[勤策]]，即為大僧勤加策勵的對象。沙彌有三類：七至十三歲，名[[驅烏沙彌]]，謂其只能驅逐烏鳥。十四至十九歲，名[[應法沙彌]]，謂正合沙彌的地位。二十至七十歲，名[[名字沙彌]]，謂在此年齡內，本來應居比丘位，但以緣未及，故尚稱沙彌的名字。沙彌與[[沙彌尼]]，皆應受持[[十戒]]。`,

'沙彌尼', `未受比丘尼戒的出家女童。尼即女。`,

'見地', `三乘共[[十地]]的第四位，相當於聲聞乘的預流果。`,

'見思', `[[見惑]]和[[思惑]]。依小乘俱舍宗來說，是以迷理和迷事來分別見思二惑，迷於理而起之惑如身見邊見等五不正見，叫做見惑，迷於事而起之惑如貪瞋痴等五煩惱，叫做思惑。依大乘唯識宗來說，則以分別俱生之二起來分別，分別起的煩惱障和所知障是見惑，俱生起的煩惱障和所知障是思惑。此二惑是正受三界生死的因，斷此二惑才能免三界的生死。斷的次第，須先斷見惑，次斷思惑。斷見惑之位，叫做見道，斷思惑之位，叫做修道，二惑皆斷之位，叫做無學道。`,

'見思惑', `[[見惑]]和[[思惑]]。見[[見思]]條。`,

'見惑', `[[二惑]]之一，即見解上的迷惑錯誤，如身見邊見等五不正見是。見惑品數，小乘俱舍立八十八，大乘唯識立百十二。`,

'見行', `見愛二行之一。見[[二行]]條。`,

'見流', `謂見惑能使眾生流轉於三界六道之中而不能出離，為[[四流]]之一。`,

'見結', `邪見的煩惱，為[[九結]]之一。`,

'見愛', `見是見惑，愛是思惑。見二惑條。`,

'見網', `謂種種的邪見纏縛身心，好像網兒羅身不得出離。`,

'見論', `二種戲論之一，即[[我見]][[邊見]]等之戲論。戲論是無意義與無利益的言論。`,

'見障', `[[四障]]之一，即邪見能障礙菩提。`,

'見諦', `見到真理。聲聞乘要在預流果以上才能見諦，菩薩則要在初地以上才能見諦。`,

'見縛', `謂見惑能纏縛人們使不得自在。`,

'見濁', `[[五濁]]之一，即末世的時候，眾生的邪見紛紜，因而濁亂世間。`,

'見道', `[[小乘]]以八忍八智之十六心為見道，因十六心是初生無漏智照見真諦理之位。[[大乘]]的菩薩，則於初僧祇之終，終四善根之加行，而頓斷分別起之煩惱所知二障，叫做見道。`,

'見道位', `菩薩完成第一阿僧祇劫之修行，始登初地，在初地入心中（每一地皆有入、住、出三心），通達少許二無我理，體會真如，乍見中道，故名見道位，又名通達位。`,

'見性', `見到自己的真性。`,

'見性成佛', `見性是見到一切眾生普具的佛性，此性即佛，名為佛性，見自佛性者，當下與諸佛無異，禪家名之為見性成佛。`,

'見取', `[[四取]]之一，即取著身見邊見等非理之見。`,

'見取見', `執著自己的見解，安住不捨，而且強非為是，即近於普通人的成見。`,

'見取使', `[[十使]]或[[五利使]]之一。`,

'見所斷', `[[三所斷]]之一，即於見道時所斷的八十八[[使見惑|使]]。`,

'見犍度', `[[八犍度]]之一。`,

'言教', `佛以言語垂示的教法。`,

'言詮', `以言語來詮釋義理。`,

'言詮中道', `中道之理，本離言說，但為了要說，就非用言語不可，這種言語所顯的中道，叫做言詮中道，與離言說的中道不同。`,

'言語道斷心行處滅', `又叫做心行處滅言語道斷，意謂究竟的真理，不是言語所能言說，也不是心思所能思念。`,

'貝', `螺貝，在招集大眾時吹之。`,

'貝葉', `[[貝多羅葉]]的簡稱，此葉經冬不凋，印度人多拿來書寫經文，叫做[[貝葉經]]，或[[貝文]]。`,

'身入', `[[六入]]或[[十二入]]之一。`,

'身子', `[[舍利弗]]的譯名。梵語舍利，華譯為身，弗多羅華譯為子。舍利弗是佛[[十大弟子]]之一。`,

'身土', `身與土，乃凡聖的依正二報，身為正報，土為依報。`,

'身光', `從佛菩薩身上所發出來的光。`,

'身見', `執著身體為實有的邪見，為[[五見]]之一。`,

'身戒', `身體所應受持的戒行。`,

'身受', `二受之一。見二受條。`,

'身苦', `由地水火風四大所構成的身體，有老病飢渴寒熱等的痛苦。`,

'身相', `眾生四大假合的色身幻相。`,

'身笑', `身體作笑。[[智度論]]說：「<verse>經曰：爾時世尊，從三昧安祥而起，以天眼觀視世界，舉身微笑。</verse>」論問曰：笑從口出，或時言笑，今云何言一切身笑？答曰：「<verse>佛世界中尊，得自在，能使一切身如口如眼，故皆能笑。</verse>」`,

'身根', `五根之一。見五根條。`,

'身密', `三密之一。見三密條。`,

'身業', `三業之一。見三業條。`,

'身輪', `三輪之一。見三輪條。`,

'身燈', `藥王菩薩燒身為燈，以供養佛。`,

'身識', `[[五識]]之一。`,

'身心', `身與心，為有情的正報，在五蘊之中，色蘊是身，受想行識四蘊是心。`,

'身心受業', `身受業與心受業。身受業是欲界的惡業，由眼耳鼻等五根產生感覺相應的異熟苦果；心受業是色界中間定至有頂天的善業，能產生與意根相應的異熟果。`,

'身忍行', `三種[[忍行]]之一。`,

'身清淨', `三種[[清淨]]之一。`,

'身惡作', `身體所造作的惡業。`,

'身安樂行', `[[四安樂行]]之第一，即身離十過而安樂的修行法華之法。`,

'身如意通', `六通之一。見六通條。`,

'身語心輪', `（喻）世尊的身語意三業，好像車輪能夠摧破眾生的一切妄見。`,

'身器十二', `指人身的皮、膚、血、肉、筋、脈、骨、髓、肪、膏、腦、膜等十二種身器。`,

'那含|阿那含', `[[阿那含]]的簡稱，為小乘的第三果名，華譯為不還，即不再還來欲界的意思。`,

'那律|阿那律', `[[阿那律]]的簡稱，是佛[[十大弟子]]之一。`,

'那伽', `華譯為[[龍]]、[[象]]、[[無罪]]、[[不來]]等，稱呼佛或阿羅漢作摩訶那伽，以喻他們都具有大力以及不再來受生死。`,

'那吒', `[[毘沙門]]天王的太子，亦即三面八臂的大力鬼王。`,

'那由他', `數目字，相等於今天的億數。`,

'那落迦', `地獄名，華譯為[[惡者]]，即造惡的人所投生的地方。`,

'邪外', `[[邪魔]]與[[外道]]。`,

'邪宗', `凡不以見性為正法的宗派，叫做邪宗。`,

'邪淫', `指夫婦以外的淫事。`,

'邪扇', `（喻）　以邪道去煽動人。`,

'邪執', `固執不正當的見解。`,

'邪觀', `不正當的觀法。`,

'邪見', `１．[[五見使]]中，撥無因果之見叫做邪見。２．凡是不合正法的外道之見都可叫做邪見。`,

'邪見網', `（喻）邪見好像羅網，入則不能解脫。`,

'邪見使', `五利使之一。見五利使條。`,

'邪命', `從事不正當的事業來維持生活。`,

'邪命說法', `指為求衣食而說法。`,

'邪性定聚', `簡稱[[邪性定]]、[[邪定]]、[[邪定聚]]、[[邪聚]]等，為三聚之一。`,

'邪魔外道', `邪是指左道，就是不明佛法的人；魔是指魔道，就是妨害佛法的人。凡是不明佛法，妨害佛法，以及向心外求法的人，都稱為邪魔外道。`,

'妓樂', `又作[[伎樂]]，或[[技樂]]，即是音樂。`,

'技樂|妓樂', `見[[妓樂]]條。`
);


addTerms(8,

'法', `指一切的事物。一切的事物，不論大的小的，有形的或是無形的，都叫做法，不過有形的是叫做[[色法]]，無形的是叫做[[心法]]。`,

'法入', `[[十二入]]之一，即意識所緣的境界。`,

'法力', `佛法的力量。`,

'法化', `正法的教化。`,

'法名', `出家僧或是皈依佛教時，師父所賜給的名字。`,

'法舟', `（喻）佛法好像舟子一樣能度人出離生死的苦海。`,

'法衣', `[[三衣]]的通稱。`,

'法臣', `佛稱法王，則菩薩便是法臣。`,

'法眼', `[[菩薩]]之眼，能夠清楚的見到一切法妙有的道理，為五眼之一。`,

'法忍', `１．對佛所說的法信受不疑；２．見三法忍條。`,

'法佛', `法身佛。`,

'法位', `真如的別名，因真如是諸法安住之位。`,

'法見', `執著一法而是此非他。`,

'法命', `１．法身的慧命。２．指僧人的壽命。`,

'法味', `妙法的滋味，即咀嚼妙法而心生快樂。`,

'法典', `說正法的經典。`,

'法要', `佛法的要義，亦即簡約而樞要的法義。`,

'法嗣', `繼承法系的人。`,

'法乳', `（喻）佛法如乳，能夠長養人們的慧命。`,

'法服|法衣', `又名[[法衣]]，為三衣的總稱。`,

'法音', `說法的聲音。`,

'法侶', `僧侶。`,

'法施', `[[三施]]之一，即以自己所聞知的佛法去向別人演說。`,

'法師', `精通三藏佛法，以法自師，復以法師人的出家人。`,

'法恩', `指四恩中的[[三寶恩]]。`,

'法悅', `由聽聞佛法或是由思惟佛法而產生的喜悅。`,

'法座', `法師坐了說法的位子。`,

'法財', `（喻）佛法能利潤眾生好像財寶一樣。`,

'法夏|法臘', `與法臘同義。`,

'法流', `正法相續不斷，如水長流。`,

'法處', `[[十二處]]之一，即意根所對的境界。`,

'法堂', `演說大法的廳堂。`,

'法執', `執著一切法為實有，為[[二執]]之一。`,

'法船', `（喻）佛法能使人了脫生死，好像船能渡人，過生死海而到涅槃的彼岸。`,

'法智', `[[智度論]]所說[[十一智]]之一，即觀見欲界苦集滅道四諦法的無漏智。`,

'法會', `演講佛法或是供佛施僧的集會。`,

'法愛', `指菩薩愛樂善法，為[[二愛]]之一。`,

'法想', `思想佛法。`,

'法爾', `天然的、自然的、不待造作的意思。`,

'法塵', `[[六塵]]之一，法塵是意根所緣的境界，意根對前五根所緣的境界，分別好醜，而起善惡諸法，是名法塵。吾人日常動作，雖已過去，而前塵影事，憶念不忘，即是法塵的作用。`,

'法樂', `１．以法味為樂。２．行善積德以自娛。`,

'法幛', `１．（喻）妙法高聳，如幛之上出。２．（喻）佛菩薩說法，能降伏魔軍而得勝。`,

'法數', `法門的數目，如[[三界]]、[[五蘊]]、[[五位]]、[[七十五法]]、[[四諦]]、[[六度]]、[[十二因緣]]等是。`,

'法顯', `中國晉朝時的高僧，隆安中，自長安西度流沙，歷三十餘國，持經南歸，至京師，譯出百餘萬言。平陽武陽人，俗姓龔。公元五七六年生，六五二年圓寂。`,

'法燈', `（喻）正法如明燈能照破世間的黑暗。`,

'法輪', `１．（喻）佛所說之法，能夠輾碎眾生的一切煩惱，好像巨輪能夠輾碎一切的巖石和沙礫一樣。<br>２．佛所說之法，輾轉傳人，好像車輪的旋轉，無遠弗屆。`,

'法器', `１．具有修證佛法的根器。２．法會誦經時所用的器具。`,

'法樹', `（喻）佛法能生涅槃的果實，好像果樹能生果子一樣。`,

'法縛', `思想被所知所見所束縛，也就是執著於法，與法執同義。`,

'法藥', `（喻）佛法如藥，能醫治一切眾生的病痛。`,

'法蘊', `１．與法藏同。２．五蘊之一。見五蘊條。`,

'法臘|夏臘', `又名[[夏臘]]，或[[戒臘]]，即比丘受戒的年歲。比丘每年夏行三月安居，安居完畢，就是比丘的歲末，叫做法臘。`,

'法印', `佛法的印契。有三法印與四法印，這些法即是佛法的準則，不合於法印者，即非佛法。`,

'法住', `諸法住於其位，如如不動。`,

'法體', `有為無為諸法的本體。`,

'法滅', `佛法滅時，亦即在末法過後的時期。`,

'法王子', `大菩薩的尊稱，因大菩薩是出生於法王之家，而且能夠傳承佛法。`,

'法王子住', `菩薩[[十住]]位之第九。`,

'法身', `佛[[三身]]之一，又名[[自性身]]，或[[法性身]]，即諸佛所證的真如法性之身。`,

'法身佛', `佛[[三身]]之一。`,

'法身塔', `安置法身[[舍利]]的塔。`,

'法身觀', `觀佛法身的觀法。`,

'法身如來', `法身佛。`,

'法身菩薩', `又名[[法身大士]]，為二種菩薩之一。見二種菩薩條。`,

'法身無相', `諸佛的法身毫無虛妄之相。`,

'法身有相', `依諸經一般的說法，法身是無相的，但依天台圓教的極意，則說法身決非無相，而是法性的理體具有依正色心，相相宛然。一個人若三惑究竟清淨了，則本性常住之色心便會顯現，而依正之二法亦會究竟清淨。[[法華經|妙法蓮華]]方便品說：「<verse>是法住法位世間相常住。</verse>」同提婆品說：「<verse>微妙淨法身，具相三十二。</verse>」`,

'法身流轉', `法身流轉於五道，此法身係指隨緣真如而言。經說：「法身流轉五道，名曰眾生。」`,

'法身大士|法身菩薩', `見法身菩薩條。`,

'法身本有', `法身本來就在一切眾生的心中的意思。`,

'法身舍利', `１．指佛所說的妙法。２．指佛所說的經典。３．指佛所說的實相中道之理。`,

'法我', `二我之一，即法執。`,

'法我見', `二種我見之一，如執五蘊，十二處，十八界等，稱為法我見。`,

'法性', `諸法的本性。這種諸法的本性，在有情方面，叫做佛性，在無情方面，即叫做法性。法性也就是實相、真如、法界、涅槃的別名。`,

'法性土', `三土之一，即法性身所住的國土。`,

'法性身|法身', `簡稱[[法身]]，佛[[三身]]之一。`,

'法性空', `諸法的自性本空。`,

'法性海', `法性深廣不可測量如海。`,

'法性生身', `１．二種菩薩身之一。２．五種法身之一。`,

'法性法身', `二法身之一。見二法身條。`,

'法性常樂', `法性是涅槃的別名，涅槃有常樂我淨的四德，所以叫做法性常樂。`,

'法性真如', `法性與真如。法性與真如，是同體異名。`,

'法性隨緣', `又名真如隨緣，法性有不變與隨緣二種，法性之體，隨染緣而生流轉的因果，隨淨緣而生還滅的因果，這種情形叫做法性隨緣。`,

'法性生身菩薩', `指在十聖位已證無生法性，捨三界生死，受不思議變易生死身的菩薩。`,

'法門', `佛所說的法，因是眾生超凡入聖的門戶，故稱法門。`,

'法門身', `[[天台]]就佛身立[[色身]]、[[法門身]]、[[實相身]]等三種身。見三身條。`,

'法空', `諸法緣起性空，為二空或三空之一。緣起性空是說宇宙間一切萬法都是緣起的，緣起的諸法，其性本空，無真實的自體可得。菩薩得此法空智慧，就能破除法執。`,

'法空觀', `[[二空觀]]之一，即觀[[色]]（物質）[[心]]（精神）等諸法都是因緣和合而生，自性本空，無作者，無受者，這是大乘菩薩的觀慧。`,

'法空智', `觀一切法都是緣起性空的智慧。`,

'法食', `１．以法為食，長養慧命。２．如法的食物，佛法對於食物有法制，依著法制的食，叫做法食。`,

'法食時', `[[四食時]]之一，三世諸佛，都是以午時為食，過了午時即非時食。`,

'法界', `１．法者諸法，界者分界，諸法各有自體，而分界不同，故稱法界。<br>２．法者諸法，界者邊際之義，窮極諸法的邊際，故稱法界。<br>３．法者諸法，界者性之義，諸法在外相上雖千差萬別，但皆同一性，故稱法界。<br>４．一一之法，法爾圓融，具足一切諸法，故稱法界。`,

'法界身', `周遍於法界的身體，亦即佛[[三身]]中之法身。`,

'法界佛', `[[華嚴經]]所說[[十種佛]]之一。佛證悟了一真法界的大智慧後，其大光明遍照於一切法界，故稱法界佛。`,

'法界性', `簡稱[[法界]]或[[法性]]。法界亦即[[法性]]。`,

'法界觀', `證入[[華嚴經]]所說的法界的觀法，即[[一真法界觀]]、[[理事無礙觀]]、[[周遍含容觀]]。`,

'法界三昧', `謂修法界觀，得法界定，透徹一真法界的玄理。`,

'法界三觀', `[[華嚴宗]]所立，即[[真空絕相觀]]、[[理事無礙觀]]、[[周遍含容觀]]。見三觀條。`,

'法界圓融', `法界的一切法都是互相融通的意思。`,

'法界緣起', `四種緣起之一。見四種緣起條。`,

'法界實相', `[[法界]]與[[實相]]。法界與實相，是同體異名。`,

'法界無礙智', `[[華嚴經]]所說十種智之一，即證入法界無礙理的智慧。`,

'法華|妙法蓮華', `大乘[[妙法蓮華]]經的簡稱。`,

'法華會', `頌讚[[法華經|妙法蓮華]]的法會。`,

'法華宗', `即[[天台宗]]，因天台宗是以[[法華經|妙法蓮華]]為本經。`,

'法華一實', `[[法華經|妙法蓮華]]所說的都是一乘真實的教法。`,

'法華二妙', `[[相對妙]]與[[絕對妙]]。`,

'法華三昧', `三諦圓融的妙理現前，障中道的無明止息，攝一切法使歸實相，名法華三昧。`,

'法華三部', `三部[[法華宗]]的經典，即[[佛說無量義經]]、[[妙法蓮華經]]、[[佛說觀普賢菩薩行法經]]。`,

'法華八年', `佛說[[法華經|妙法蓮華]]的時間一共是八年。`,

'法華懺法', `[[天台]]大師依[[法華經|妙法蓮華]]普賢觀經及諸大乘經之意，而定六根懺悔之儀式方法，著法華三昧行法（又名法華三昧懺儀）一卷，由此中抄出流行於世者，即法華懺法。`,

'法華涅槃時', `[[五時]]之一，[[法華|妙法蓮華]]與[[涅槃]]二經同屬醍醐昧，故合為一時。`,

'法喜', `聞法之後心生歡喜。`,

'法喜食', `[[二食]]之一。見二食條。`,

'法無我', `見二無我條。`,

'法無礙智', `又名法無礙解。見四無礙解條。`,

'法無礙解', `見四無礙解條。`,

'法報', `法身與報身。見三身條。`,

'法報應', `[[法身]]、[[報身]]、[[應身]]。見三身條。`,

'法報應化', `[[法身]]、[[報身]]、[[應化身]]。見三身條。`,

'法鼓', `宣揚佛法，普度眾生，好像擊鼓使聲音普遍聽。[[法華經|妙法蓮華]]有擊大法鼓和法鼓常鳴的話。`,

'法螺', `宣揚佛法好像吹螺，聲音遠揚，廣被大眾。`,

'法藏', `１．又名佛法藏，或如來藏，即法性的道理，因法性含藏無量的性德，故名。<br>２．人名，本康居國人，武后賜號賢首，是華嚴宗的第三祖。`,

'法藏比丘', `[[阿彌陀佛]]在因位於世自在王佛所，出家修行菩薩道時的名字。`,

'法雲', `（喻）佛說法如雲，普蔭一切眾生，使得清涼自在。`,

'法雲地', `菩薩[[十地]]中之第十地名。`,

'法雲等覺', `菩薩十地之第十位名法雲地，過了法雲地就是等覺，過了等覺就是佛的妙覺了。`,

'法緣', `１．說法普結善緣。２．說法人的機緣很殊勝。`,

'法緣慈悲', `謂破除我之相，而對眾生隨力隨意拔苦與樂，生起慈悲的心。`,

'法相', `諸法顯現於外各別不同的相。`,

'法相宗', `大乘[[八宗]]之一，因是窮明萬法性相之宗，故名法相宗，又因依唯識論，明萬法唯識之理，故又名[[唯識宗]]。`,

'法處所攝色', `在[[十二處]]中，為法處所攝屬的色法，名法處所攝色。有五種：一、[[極略色]]，即分析五根五塵等有質的實色，令之至極徵者；二、[[極迴色]]，分析虛空、青、黃等無質的顯色，令之至極少者，因至難見，故名極迴；三、[[受所引色]]，即無表色，是依受戒儀式，而引發於身中之色，故名受所引色，又因外表上看不見，故亦名無表色；四、[[遍計所起色]]，遍計一切法的意識前，所顯現之五根五境等影像是，乃至空花水月等，皆為此所攝；五、[[定所生自在色]]，指由禪定力所變起的色聲香味等境。`,

'乳味', `見五味條。`,

'乳經', `指[[華嚴經]]。`,

'事', `凡是因緣所生之法都叫做事，離因緣造作之法則叫做[[理]]。`,

'事相', `有實事的，或是有形相可以看得到的，都叫做事相；至於講道理的，沒有形相可以看得到的，則叫做理性。`,

'事造', `見理具條。`,

'事度', `指[[五戒]][[十善]]等世善。因五戒十善是有為的事相，故曰事，能度三途之苦厄，故曰度。`,

'事證', `事理二證之一。見二證條。`,

'事障', `[[二障]]之一，即貪、瞋、痴等，能使生死相續，障大涅槃。`,

'事觀', `[[二觀]]之一，即觀因緣所生的事相。`,

'事忍', `指世間法的[[忍]]，共有三種，即[[力忍]]、[[反忍]]、[[忘忍]]。`,

'事修', `執著事相的修，如將所做善事念念於心是。`,

'事理', `１．因緣生之有為法叫做[[事]]，不生不滅之無為法叫做[[理]]。２．世間森羅萬象之相叫做[[事]]，真如的理體叫做[[理]]。`,

'事理二懺', `[[事懺]]和[[理懺]]。在三種懺悔中，[[作法懺]]和[[取相懺]]是事懺，[[無生懺是理懺]]。`,

'事理三千', `事造三千與理具三千。見理具條。`,

'事理無礙法界', `[[四法界]]之一。見四法界條。`,

'使', `[[煩惱]]的別名，因煩惱能使眾生流落於生死。見十使條。`,

'直了', `直下了悟，也就是當下頓悟的意思。`,

'來迎', `佛菩薩從極樂世界前來迎接念佛的人。`,

'來果', `來世的果報。`,

'供具', `又叫做供物，即吾人時常拿來供養佛菩薩的物品，共有六種，即[[花]]、[[塗香]]、[[水]]、[[燒香]]、[[飯食]]、[[燈明]]等，如是次第，乃是表示布施持戒忍辱精進禪定智慧等之[[六度]]。`,

'供養', `奉養的意思，對上含有親近、奉事、尊敬的意思，對下含有同情、憐措、愛護的意思。`,

'供養法', `種種供養的方法。`,

'依果', `又名依報，即身體依之而住的果報，如國土山河大地房屋器具等是。`,

'依通', `依靠藥力或是咒術而顯現的神通。`,

'依報', `又名依果。見依果條。`,

'依圓', `依他起性與圓成實性。見三性條。`,

'依止', `依賴止住。`,

'依止甚深', `五甚深之一。見五甚深條。`,

'依止阿闍梨', `五種阿闍梨之一。`,

'依正', `[[依報]]與[[正報]]。世間國土房屋器具等，為身所依，叫做依報；眾生五蘊假合之身，乃過去造業所感，叫做正報。`,

'依正不二門', `十[[不二門]]之一。`,

'依他', `依他起性的簡稱，為[[三性]]之一。萬法無自性，不能單獨的生起，須依靠眾緣的具備，才能生長，名依他起性。`,

'依他自性', `又名[[依他起性]]，三自性之一。見三自性條。`,

'依他十喻', `依他之法，無有實體，故有幻事、陽焰、夢境、鏡像、光影、谷響、水月、空花、變化事、尋香城等十種的譬喻。`,

'依他起性', `見三性條。`,

'依法不依人', `法四依之一。見四依條。`,

'依義不依語', `法四依之一。見四依條。`,

'到彼岸', `梵語[[波羅蜜多]]的義譯，謂越過生死的大海而到達[[涅槃]]的彼岸。`,

'制戒', `佛對弟子們所制訂的[[戒律]]。`,

'制門', `制止罪惡之門。如來悲德所垂，五逆十惡一律攝受，是為化門；如來智德所發，制止諸惡，毫無容赦，是為制門。以上二門也就是化制二教。`,

'制教', `制止罪惡的教法，亦即戒律。`,

'制聽二教', `佛所制定必當受持的法，叫做[[制]]；聽其方便隨意執行的法，叫做[[聽]]。故制法若不實行必有罪，聽法不實行也不為罪。`,

'剎那', `華譯[[一念]]，指極短的時間。經上說，一彈指之間，即已含有六十個剎那了。`,

'剎那生滅', `一剎那之間就有生滅的意思。`,

'剎那三世', `一剎那之間就已含有三世，即現在的一剎那叫做現在，前剎那叫做過去，後剎那叫做未來。`,

'剎那無常', `謂在一剎那之短促時間中，就已具有生住異滅的四相，變化無常。`,

'剎帝利', `印度[[四姓]]階級之第二，華譯[[田主]]，或[[王種]]。`,

'兩舌', `[[十惡業]]之一，即搬弄是非，離間他人。`,

'兩河', `[[尼連禪河]]與[[跋提河]]。佛在尼連禪河邊成道，在跋提河邊涅槃。前為有餘涅槃之處，後為無餘涅槃之處。`,

'兩界', `[[金剛界]]與[[胎藏界]]。`,

'兩垢', `[[有垢真如]]與[[無垢真如]]。有垢真如即自性清淨的理體為煩惱所垢染，亦即在纏真如；無垢真如即佛果所顯的清淨理體，不為垢染所覆，亦即[[出纏真如]]。`,

'兩鼠', `黑白二鼠，以喻白天和晚上。`,

'兩足尊', `佛的尊號，因佛在兩足的有情中是最尊貴者，又兩足是指佛福慧兩足。`,

'具壽', `[[比丘]]的通稱，因比丘不但具有世間的壽命，而且具有法身的慧命。`,

'具戒', `[[具足戒]]的簡稱。`,

'具戒地', `菩薩[[十地]]中之第二地名，因第二地三聚戒具足。`,

'具戒方便', `在受持具足戒之前，應先方便的受持五戒或八戒。`,

'具足戒', `具足圓滿之戒，如比丘的[[二百五十戒]]，及比丘尼的[[三百四十八戒]]是。`,

'具知根', `三無漏根之一。見三無漏根條。`,

'取', `對所愛的境界執取追求。`,

'取支', `[[十二支]]之一。`,

'取著', `對所愛的境界，執取貪著，不能捨離。`,

'取結', `取與結，都是[[煩惱]]的別名。`,

'受', `人類的感官與外界接觸時所產生的感受。受有三種，即[[苦受]]、[[樂受]]、[[不苦不樂受]]。`,

'受決', `與受記同義。`,

'受空', `三輪體空之一。見三輪體空條。`,

'受具', `受持具足戒。`,

'受持', `領受憶持。`,

'受記', `從佛處接受將來必當作佛的記別。`,

'受隨', `受是受持具足戒；隨是隨著戒體而去如法修行。`,

'受蘊', `五蘊之一。見五蘊條。`,

'受用土', `三佛土之一。`,

'受用身', `[[法相宗]]所立佛三身之一。見三身條。`,

'受戒', `領受佛戒。`,

'受戒入位', `受持佛戒，便等於進入了佛菩薩的法位。`,

'受戒犍度', `二十犍度之一。`,

'受想行識', `五蘊中之後四蘊，此四蘊屬於心法，故又名非色的四蘊。`,

'周遍法界', `謂法身的功德充滿於無邊的法界。`,

'周遍含容觀', `[[華嚴宗]]法界三觀之一。見三觀條。`,

'咒', `梵語[[陀羅尼]]，華譯為咒，即佛菩薩從禪定中所發出來的秘密語。`,

'咒心', `咒語的精要。心就是精要的意思。`,

'咒願', `唱法語以願求施主或是先亡福利。`,

'表相', `表顯出來的相貌。`,

'泥洹|涅槃', `即[[涅槃]]，又名[[滅度]]，是滅盡煩惱和度脫生死的意思。`,

'招提', `[[四方]]的意思，如四方之僧為招提僧，四方僧之施物為招提僧物，四方僧的住處為招提住處。魏太武造寺，以招提名之，由是招提便成為寺院的別名。`,

'味塵', `[[六塵]]之一。`,

'呵羅羅', `[[八寒地獄]]之一。[[智度論]]說：「[[呵婆婆]]，呵羅羅，[[侯侯]]，此三地獄，寒風噤顫，口不能開，因其呼聲，而以名獄。」`,

'呵佛罵祖', `唐朗州德山院宣鑑禪師，一日上堂說：「我這裹，佛也無，法也無，達摩是個老臊胡，十地菩薩是擔糞漢，等妙二覺是破戒凡夫，菩提涅槃是繫驢橛，十二分教是點鬼簿，拭瘡紙，佛是老胡屎橛。」又有一僧問韶州雲門山文偃禪師：如何是佛？雲答：「乾屎橛」。他也曾說過：「釋迦初生，一手指天，一手指地，周行七步，目顧四方云；天上天下，惟我獨尊。老僧當時若見，一棒打殺與狗子吃，貴圖天下太平。」這都是提醒世人：凡有相者，皆是虛妄，縱是經典佛像，或聖或賢，既落形跡，皆屬生滅，並不是正常如實之道。`,

'命者', `十六神我之一。`,

'命濁', `五濁之一。見五濁條。`,

'命命鳥', `又名[[生生鳥]]、[[共命鳥]]，即共命之鳥，是一種一身兩頭的鳥類。`,

'和尚', `吾師的意思，僧徒對其親教師的尊稱。`,

'和南', `[[稽首]]、[[敬化]]、[[度我]]等意思。`,

'和眾', `和合的僧眾。`,

'和敬|六和敬', `[[六和敬]]。`,

'和僧', `和合的僧眾。`,

'和香丸', `（喻）和種種之香末為一丸，以喻一法之中具有無量的佛法。`,

'和合海', `（喻）僧眾和合為一，好像海水普遍一味。`,

'和合性', `在因果中，緣眾和合，名為和合性。`,

'和合眾', `見和合僧條。`,

'和合僧', `比丘三人以上集在一處，持同戒，行同道，名和合僧。若有人以手段使他們分離，便叫做破和合僧，為[[五逆罪]]之一。`,

'和合二聖', `清朝雍正帝封[[天台]][[寒山]]大士為和聖，[[拾得]]大士為合聖。`,

'和光接物', `和光即和其光同其塵的意思，指與塵俗人共處時要有謙和明智的態度，接物即待人接物的意思，亦即人與人之間的交際。`,

'夜叉', `華譯[[捷疾鬼]]，這種鬼能夠在天空中飛行。`,

'夜叉羅剎', `[[夜叉]]與[[羅剎]]。夜叉華譯為[[捷疾鬼]]，羅剎華譯為[[暴惡鬼]]，都是惡鬼之名。`,

'夜摩', `夜摩天，華譯[[時分]]，為[[欲界]][[六天]]中之第三天名。`,

'夜摩盧迦', `[[閻摩王]]的世界。`,

'始士', `菩薩的義譯。`,

'始覺', `三覺之一。見三覺條。`,

'孤起偈', `[[十二分教]]之一。`,

'孤獨園', `給孤獨園的簡稱。見給孤獨園條。`,

'孤獨地獄', `又名[[孤地獄]]，此種地獄不同於八寒八熱等地獄都有固定的地方，而是隨著各人的別業，孤獨的處在虛空或是山野之中。`,

'宗風', `一宗的風化。`,

'宗派', `宗教的支派。`,

'宗趣', `宗旨和趣向。`,

'宗乘', `各宗所弘揚的宗義和教典。`,

'宗密', `人名，又稱圭峰法師，為華嚴宗之第五祖。`,

'宗門', `專講[[禪宗]]的法門。其他法門，像[[天台宗]]，[[淨土宗]]，[[法相宗]]，都叫教門。`,

'宗門禪', `[[禪宗]]所傳的禪法。`,

'宗因喻', `因明之三支。見三支條。`,

'定', `心住於一境而不散亂。`,

'定力', `禪定的力量，能破除一切的亂想，為五力之一。`,

'定水', `（喻）定心湛然，猶如止水。`,

'定門', `定慧二門之一。見二門條。`,

'定相', `１．常住不變的形相。２．入定的相狀。`,

'定根', `禪定能生一切的功德，故名根，為五根之一。`,

'定散', `定者禪定，心常住於一境；散者散亂，心常攀緣於六塵之境。`,

'定智', `禪定與智慧。`,

'定異', `在差別的因果中，互為差別，而不相混亂，叫做定異。`,

'定答', `非常肯定的答案，為四種問答之一。`,

'定業', `一定受報的業。定業有善惡兩種，善的定業，定受樂果，惡的定業，定受苦果。`,

'定聚', `[[三聚]]之一。`,

'定學', `禪定之學，為[[三學]]之一。`,

'定光|定光佛', `佛名。見定光佛條。`,

'定光佛|燃燈佛', `[[燃燈佛]]。[[釋迦佛|釋迦牟尼]]在因位時曾買五朵花奉獻給此佛，因而獲得未來成佛的記別。`,

'定性', `指只有聲聞或緣覺或菩薩之一種種子的眾生，如果兼具二種或三種之種子的眾生則叫做不定性，如果完全沒有三乘之無漏種子，而只有人天之有漏種子的眾生又叫做無種性。`,

'定性二乘', `定性聲聞與定性緣覺。`,

'定性緣覺', `[[法相宗]]所立五種性之一。見五種性條。`,

'定性聲聞', `[[法相宗]]所立五種性之一。見五種性條。`,

'定性喜樂地', `三界[[九地]]之一，即[[色界]]之第二禪天，因此地的天人，住於殊勝美妙的禪定之中，因而生起心識的喜樂，故名。`,

'定慧', `禪定與智慧，亦即[[三學]]中之二學。收攝散亂的心意為定；觀察照了一切的事理為慧。`,

'定慧二乘', `以定慧二種法來配於吾人的左右手，左手為定手，右手為慧手。`,

'定共戒', `二戒之一。見二戒條。`,

'居士', `居家學佛之士。`,

'彼岸', `梵語[[波羅]]，華譯為彼岸，此岸指生滅，彼岸指不生不滅的涅槃。`,

'往生', `生到西方極樂世界去。`,

'往相', `二迴向之一。見二迴向條。`,

'往還衣', `五種[[衲衣]]之一。`,

'往還二回向', `往相回向與還相回向。見二迴向條。`,

'往來八千返', `[[梵網經]]說，[[釋迦佛|釋迦牟尼]]來我們此世界度化眾生，已經來去八千次了。`,

'念', `１．思念。２．諷誦。`,

'念力', `[[五力]]之一。`,

'念天', `[[六念]]之一。`,

'念死', `[[八念]]之一。`,

'念戒', `[[六念]]之一。`,

'念定', `[[正念]]與[[正定]]。`,

'念法', `[[六念]]之一。`,

'念持', `憶念和受持。`,

'念施', `[[六念]]之一。`,

'念珠', `念佛時所使用的記數珠。`,

'念根', `五根之一。`,

'念處', `所觀念之處，亦即以智慧去觀察的境界。`,

'念誦', `意念口誦佛的洪名或是經咒。`,

'念僧', `[[六念]]之一。`,

'念佛', `有三種，即[[稱名念佛]]、[[觀想念佛]]、[[實相念佛]]。稱名念佛是口中稱念佛的名號；觀想念佛是在靜坐之中觀念佛的相好功德；實相念佛是觀佛的法身非有非空中道實相的道理。`,

'念佛宗|淨土宗', `[[淨土宗]]的別名。`,

'念佛觀', `五停心觀之一。見五停心觀條。`,

'念佛三昧', `念佛時念到[[一心不亂]]的境界。`,

'念佛回向', `念佛完畢之後所唱的回向文，就是觀無量壽經所記載的「光明遍照十方世界，念佛眾生攝取不捨。」的十六個字。`,

'念佛迴向', `１．念佛的人，將所修的功德迴向於淨土，或是迴向給亡者。２．念佛之後所唱的迴向文。`,

'念佛往生', `一心一意的念佛，於命終時可以往生西方極樂世界。`,

'念佛往生願', `[[阿彌陀佛]]四十八願中的第十八願。見四十八願條。`,

'念念', `連續不斷的意念。`,

'念念無常', `二無常之一。見二無常條。`,

'念無失', `[[十八不共法]]之一。`,

'念無滅', `[[十八不共法]]之一。`,

'忿', `即忿怒，遇不順意時，輕則忿怒罵人，重則發生打人等不良行為，為二十隨煩惱之一。`,

'忿結', `忿恨的心打成了結，很難消解。`,

'忿怒', `忿恨瞋怒。`,

'性', `實體之義。`,

'性心', `又名心性。心性本來不二，不過有真妄、動靜、昏明的不同。性就是本性，也就是未動心前的心，它譬如水；心就是心念，也叫妄心、幻心，包括各種感受、印象、思維、認識等思想現象，它譬如波。水與波同是溼性，本來不異，但波是動相，水是靜相，波動則昏亂，水清則月現，這樣水與波又是不一。所以心與性是不一不異。`,

'性分', `諸法差別的自性。`,

'性地', `[[通教]]十地之一。見十地條。`,

'性宗', `[[法性宗]]的簡稱，即破萬法之相，而顯萬法空寂的真性的宗派，如[[華嚴五教]]中的頓圓，[[天台四教]]中的別圓，[[八宗]]中的[[三論宗]]等都是。`,

'性戒', `二戒之一。見二戒條。`,

'性佛', `法性佛，亦即三身中之法身。`,

'性我', `本性之大我。去除了凡夫的妄我，才能歸入於如來的性我。`,

'性具', `又名體具或理具，就是從本以來就有的意思。`,

'性海', `（喻）真如的理性深廣如海。`,

'性惡', `本性所具的惡。`,

'性罪', `二罪之一。見二罪條。`,

'性遮', `１．性罪與遮罪。２．性戒與遮戒。`,

'性德', `本性之德。`,

'性空', `謂眾緣合成的一切事物，其性本空，沒有真實的自體可得。`,

'性空教', `南山三教之一。見三教條。`,

'性空觀', `南山三觀之一，是小乘的觀法，觀察因緣生的一切法，其性本空。`,

'性相', `１．性就是諸法永恆不變的本性，相就是諸法顯現於外可資分別的形相。２．無為法為性，有為法為相。`,

'性相學', `性是諸法的本性，相是形相義理。俱舍與成實宗宣說小乘的性相，瑜伽唯識等宗宣說大乘的性相。學習上述諸論叫做性相學，也叫做法相學。`,

'性相一如', `謂理性和事相融通無礙，而體用不二。`,

'性相二宗', `[[法性宗]]與[[法相宗]]。見二宗條。`,

'所作', `身口意所動的造作。`,

'所藏', `阿賴耶三藏之一。見阿賴耶條。`,

'所緣', `緣是攀緣的意思，心識所攀緣的境界，叫做所緣。`,

'所緣緣', `四緣之一。見四緣條。`,

'所知依', `阿賴耶識的別名，因它是遍依圓三性所知法之所依，故名。`,

'所知障', `二障之一。見二障條。`,

'所遍計', `所普遍計度的法。`,

'披袒', `披是把袈娑蓋著兩肩，袒是露出右肩。`,

'披剃', `披起僧衣和剃髮，指初出家做僧尼。`,

'拔苦', `救拔眾生的痛苦。`,

'拔目鳥', `十王經所說的二種鳥之一。二鳥是無常鳥和拔目鳥。無常鳥是杜鵑，拔目鳥是烏鴉。`,

'拔舌地獄', `造作口業的人所墮落的地獄。`,

'拘盧|北拘盧洲', `[[北拘盧洲]]的簡稱。見四大洲條。`,

'拘尸那', `[[拘尸那拉城]]，是釋尊入滅的地方。`,

'拘那牟尼', `佛名。見拘那含牟尼條。`,

'拘那含牟尼', `簡稱[[拘那含]]，華譯[[金寂]]，是[[過去七佛]]中的第五尊佛名。`,

'拘留孫佛', `又作[[俱留孫佛]]、[[鳩樓孫佛]]、[[拘留秦]]等，華譯為所應斷已斷、滅累、成就美妙等，是[[過去七佛]]中的第四尊佛名。`,

'拘摩羅天', `又作[[鳩摩羅伽天]]，華譯為[[童子天]]，因此天主不但是初禪天的梵王，而且其顏面猶如童子，故名。`,

'放生', `釋放被羈禁的生物。`,

'放逸', `放縱心思，任性妄為。`,

'放光', `佛用神通力來發放光明。大凡佛的種種放光，都對眾生有利。放光也有各處的不同，如足底放光，是利益地獄道的眾生，膝蓋放光，是利益畜生道的眾生，小腹放光，是利益餓鬼道的眾生，肚臍放光，是利益修羅道的眾生，胸口放光，是利益人道的眾生，肩上放光，是利益天道的眾生，口裡放光，是利益小乘的眾生，眉間放光，是利益大乘的眾生，肉髻放光，是利益上乘的根機，或是召集大菩薩，或是灌十方諸佛之頂。`,

'放光動地', `佛要說深妙的經典時，通常先發放光明和震動大地。`,

'明', `１．智慧的別名。２．真言陀羅尼的別名。`,

'明王', `[[密宗]]諸尊的稱號，如不動明王是。明代表智慧。為化度惡神惡鬼，有的現忿怒身相，以智慧力催伏魔障。`,

'明地', `菩薩[[十地]]中第三發光地的別名。見十地條。`,

'明處', `學習而生智慧之處，即五明。見五明條。`,

'明脫', `脫離愚痴叫做[[明]]；離開貪愛叫做[[脫]]。`,

'明達', `明是指[[三明]]，達是指[[三達]]。在[[阿羅漢]]叫做三明，在佛則叫做[[三達]]。明是明了的意思，達是通達的意思。`,

'明慧', `[[三明]]與[[三慧]]。`,

'明心見性', `明心是發現自己的真心；見性是見到自己本來的真性。`,

'明行足', `佛十號之一。見十號條。`,

'明月摩尼', `其光芒如明月般皎潔的摩尼寶珠。`,

'明得薩埵', `指四善根位中暖位的聖人，因此位的聖人得明得定，故名。`,

'易行道', `二道之一。見二道條。`,

'東山法門', `指[[五祖]]的法門，因五祖[[弘忍]]禪師住在蘄州黃梅縣之黃梅山，其山在縣之東部，因而叫做東山。`,

'東土九祖', `指[[天台宗]]在中國的相承，即龍樹、慧文、慧思、智顗、灌頂、智威、惠威、玄朗、湛然。`,

'東台二密', `[[東密]]與[[台密]]，為日本密教的二大派別，此二密不同的地方，是東密以大日如來為本位，台密以釋迦如來為本位。`,

'東勝身洲', `四大洲之一。見四大洲條。`,

'東方淨琉璃醫王', `[[藥師如來]]。醫王即藥師，其國名叫淨琉璃，在東方。`,

'果', `１．由前因而生的後果。２．由道力而證悟的果位。`,

'果人', `果上的人。有三種，即[[佛]]、[[辟支佛]]、[[阿羅漢]]。`,

'果分', `對因分而言，因分是尚在修因之位，果分是已達到果德不可思議的境界。`,

'果地', `所證之果的地位。[[三乘]]的果地各有不同，聲聞乘就有四果的分別。`,

'果果', `果中之至果，即無上大般涅槃。`,

'果號', `成正覺之後的佛名。`,

'果滿', `果上的功德圓滿。心地觀經說：「因圓果滿成正覺。」`,

'果德', `果上的功德，如涅槃之常樂我淨四德是。`,

'果斷', `修行人只把煩惱斷除叫做子斷，若連果報的身體也斷即叫做果斷。`,

'果位', `所證之果的地位。`,

'果位人', `已經證得果位的人，如[[阿羅漢]]、[[菩薩]]、[[佛]]等是。`,

'果報', `由於過去的業因造成現在的結果，叫做果，又因為這果是過去的業因所召感的酬報，所以又叫做報。如種瓜得瓜，種豆得豆，就是果報的意義。`,

'果報土', `[[天台]]四土之一。見四土條。`,

'果縛', `被生死苦果所縛而不能解脫的意思。阿羅漢雖斷煩惱但未入滅，名子縛已斷，果縛猶存，若已滅度，入無餘涅槃，便是連果縛也斷了。`,

'果縛斷', `把生死的苦果斷除，也就是進入涅槃的意思。`,

'果能變', `唯識宗的術語，對因能變而言。八識種子，各生八識之現行，名因能變；這由種子而生的八識，於現行時，又必從自識的自體分，變現見相二分，名果能變。`,

'果極法身', `與法性身同義。`,

'枝末法輪', `[[三轉法輪]]之一。`,

'枝末無明', `從根本無明所生的隨煩惱。`,

'波旬', `[[六欲天]]魔王的名字。`,

'波斯匿', `古印度[[舍衛國]]國王的名字。`,

'波羅夷', `戒律中的極重罪，華譯斷頭，喻如斷頭，不能再生。又譯作棄，謂棄之於外。又譯不共住，謂不能入僧數。又譯退沒，謂其退失道果。又譯墮落，謂墮落於阿鼻地獄。犯此罪者，不名比丘，不名沙門，非釋迦子。比丘犯殺、盜、淫、大妄語四戒，叫做四波羅夷。`,

'波羅密', `華譯[[到彼岸]]。行者乘大行之船，由生死苦惱的此岸，度到涅槃安樂的彼岸，叫做到彼岸。`,

'波羅蜜', `同[[波羅密]]。`,

'波羅木叉', `華譯為[[別解脫]]，是[[戒律]]的別名，因受戒能使身口意惡業，別別解脫。`,

'炎經', `[[涅槃經]]的別名。`,

'炎熱地獄', `[[八大地獄]]之第六，此地獄火隨身起，熱苦不堪。`,

'盂蘭盆', `華譯為[[倒懸]]，是極苦的意思。`,

'直心', `正直而無諂曲的心。`,

'知見', `１．知識與見解。２．真知灼見。`,

'知法', `在顯教是指能了知各種經典意義的人，在密教是指能了知秘密之事相的人。`,

'知論', `[[大智度論]]的別名。`,

'知足天', `[[兜率天]]的別名，亦即彌勒的淨土。`,

'知息出', `[[十六特勝]]之一。`,

'知息長短', `[[十六特勝]]之一。`,

'知息遍身', `[[十六特勝]]之一。`,

'知苦斷集', `苦是指[[四聖諦]]中的[[苦諦]]，即生死的果報，集是指四聖諦中的[[集諦]]，即煩惱的惡業，知苦斷集是說知道了生死的痛苦之後，就應該把招集煩惱的惡業斷除。`,

'知根無所畏', `菩薩[[四無所畏]]之一，即菩薩知道眾生的根基，能夠對機說法而無所怖畏。`,

'空', `因緣和合而生的一切事物，究竟而無實體，叫做空，也是假和不實的意思。`,

'空大', `[[五大]]之一，因虛空的體性廣大，周遍於一切處。`,

'空見', `１．撥無因果的邪見。２．執著於空的見解。`,

'空色', `無形叫做[[空]]，有形叫做[[色]]。[[般若心經]]說：「<verse>色即是空，空即是色。</verse>」`,

'空劫', `[[四劫]]之一，即此世界壞滅之後，二十中劫間，只有虛空的時期。`,

'空宗', `以空理為宗的派別，如[[小乘]]的[[成實宗]]和[[大乘]]的[[三論宗]]是。`,

'空門', `１．佛教的總名，因佛教闡揚空的道理，並以空法作為進入涅槃之門。２．四門之一。見四門條。`,

'空法', `觀我空法空有為空無為空等空理之法。`,

'空性', `依空而顯的實性，即[[真如]]的別名。`,

'空定', `觀察空相的禪定。`,

'空相', `諸法皆空的相狀。因緣生的一切法，無有自性，此即是空的相狀。`,

'空海', `虛空與大海。`,

'空教', `說明諸法皆空的道理的教法，指[[般若經]]。`,

'空經', `指[[般若部]]的經典。`,

'空輪', `１．指此世界最底層的[[虛空輪]]。２．[[空大]]亦叫做空輪。`,

'空慧', `觀察空理的智慧。`,

'空諦', `[[天台宗]]所立三諦之一。見三諦條。`,

'空觀', `觀察諸法皆空的道理。`,

'空王', `佛的別名，因佛空無一切邪執。`,

'空王佛', `佛名。据[[法華經|妙法蓮華]]說，釋尊與阿難曾經一起在空王佛所發心學道。`,

'空有', `空與有。一切法緣生無有實體，叫做空；雖然性空但有假相，叫做有。`,

'空有二執', `又名有無二見，即執著空和執著有的二種見解。`,

'空有二觀', `空觀與有觀。觀無實我實法，叫做空觀，此觀能破我執；觀有因果及涅槃，叫做有觀，此觀能破空執。`,

'空有二宗', `在中國佛教的八宗中，[[俱舍宗]]是[[小乘]]的有宗，[[成實宗]]是小乘的[[空宗]]，[[法相宗]]是[[大乘]]的有宗，[[三論宗]]是大乘的空宗。`,

'空無', `謂一切事物都沒有自性。`,

'空無我', `１．一切法緣起性空，無我我所。２．無我所叫做空，無我見叫做無我。３．空與無我。`,

'空無邊處', `[[無色界]]之第一天名。`,

'空無邊處定', `修[[空無邊處]]的禪定。在人間修得這種禪定的人，死後便生到無色界的空無邊處去。`,

'空無邊處地', `三界[[九地]]之一。`,

'空處', `[[無色界]]的一切都沒有形色，叫做空處，因共有四處的分別，所以又叫做[[四空處]]，或[[四無色處]]。`,

'空處定', `[[四無色定]]之一，厭色緣空而入定，此定與無邊的虛空相應，所以叫做空處定。`,

'空假中', `[[天台宗]]所立的三諦與三觀。見[[三諦]]或[[三觀]]條。`,

'空三昧', `[[三三昧]]之一。`,

'空居天', `凌空而處的天，如[[欲界]]的[[夜摩]]、[[兜率]]、[[化樂]]、[[他化自在]]等四天，及[[色界]]的諸天是。`,

'空一切處', `又名[[空遍處]]，禪定的名字。`,

'空一顯色', `[[四大洲]]的天色不同，北洲金色，東洲銀色，南洲碧色，西洲赤色，因為這些顏色是[[須彌山]]四方天空所顯的顏色，所以叫做空一顯色。`,

'空即是色', `空性固空，色性亦空，若悟空性平等，則色空不二，故[[般若心經]]說：「<verse>色即是空，空即是色。</verse>」`,

'空華外道', `印度的[[小乘]]學者誹謗[[大乘]]是空華外道，非佛所說。`,

'空解脫門', `三解脫門之一。見三解脫門條。`,

'舍利', `１．鳥名。２．舍利弗母親的名字。３．佛的身骨。佛、菩薩、羅漢、高僧等，寂後火化，每凝結有舍利，或如珠，或如花，白色為骨舍利，赤色為血肉舍利，黑色為髮舍利，也有雜色的，那是綜合而成，此是生前依戒定慧薰修而得，無量功德所成，若是佛舍利，世間無物能損壞，菩薩以下，其堅度便相應減少。`,

'舍利子', `１．華譯靈骨，或堅固子，是由修戒定慧之功德結晶而成的。２．人名。見舍利弗條。`,

'舍利弗', `舍利華譯為鶖鷺，弗華譯為子，因其母之眼似鶖鷺，故被號為舍利弗，或舍利子，亦稱身子，為佛[[十大弟子]]之一，以智慧第一著稱。`,

'舍利塔', `安置佛舍利的寶塔。`,

'舍衛', `地名，為古印度[[憍薩羅國]]的都城，華譯為[[好名聞]]，因其國中政教善良，風俗敦厚，且充滿許多有德有智的學者，嘉譽風聞各國，故名。`,

'舍衛國', `本名[[憍薩羅]]，舍衛是都城，今以首都代國名。`,

'舍那大戒', `[[梵網經]]所說的大乘[[菩薩戒]]，因是[[廬舍那佛]]所說的戒法，故名。`,

'花', `六種供物之一，是表示萬行成就以莊嚴佛果。`,

'近圓', `[[具足戒]]的別名。`,

'近緣', `[[三緣]]之一。`,

'近住', `受持[[八關齋戒]]或是住在寺院裡不享男女同居生活的人，男的叫做近住男，女的叫做近住女。`,

'近住律儀', `指在家男女所受的[[八戒]]。`,

'近事', `親近奉事三寶之義。梵語[[優婆塞]]即近事男，[[優婆夷]]即近事女。`,

'近事男', `梵語叫做[[優婆塞]]，即在家親近奉事三寶的男子的通稱。`,

'近事女', `梵語叫做[[優婆夷]]，即在家親近奉事三寶的女子的通稱。`,

'近事律儀', `指[[優婆塞]]和[[優婆夷]]所應受持的[[五戒]]。`,

'金山', `１．（喻）佛的身體。[[法華經|妙法蓮華]]說：「身色如金山，端嚴甚微妙」２．指須彌山周圍的七重金山。`,

'金口', `１．如來的身相是黃金色，故其口叫做金口。２．如來的口舌如金剛一般堅固不壞，故名金口。`,

'金界', `[[金剛界]]的簡稱。`,

'金胎', `[[金剛界]]與[[胎藏界]]。金剛界者，表金剛不壞之義，以明智慧堅固不壞，能摧破煩惱，猶如金剛。胎藏界者，表如胎藏子之義，以明理體廣大，能攝萬德，猶如胎藏。以上金胎兩部是標幟大日如來理智二德的一對大法門，配之於事理因果，則金剛界是事是果，胎藏界是理是因。`,

'金流', `[[尼連河]]的別名。`,

'金華', `[[金波羅華]]的簡稱，即是金色的蓮花。`,

'金骨', `佛舍利。`,

'金蓮', `[[金剛部]]與[[蓮花部]]，亦即[[胎藏界三部]]中的二部。`,

'金剛', `金剛石，其性堅利，堅故不為他物所壞，利故能損壞他物，故佛經常以之比喻堅利。`,

'金剛定', `又名金剛三昧，即菩薩於最後位時，斷除最後一切最細微之煩惱而得的禪定。`,

'金剛山', `１．環繞世界的鐵圍山。２．須彌山。`,

'金剛杵', `兵器的名稱，就是現在寺院裡韋㻧菩薩手裡所拿的東西。`,

'金剛身', `（喻）佛身堅固，好像金剛不可壞。`,

'金剛頂', `金剛界諸經諸會的通名。`,

'金剛手', `手執金剛杖或金剛杵的菩薩。`,

'金剛界', `開顯大日如來智德的部門。如來的智慧，能破諸惑障，而證實相之理，堅固銳利，有如金剛，故稱為金剛界。`,

'金剛界五部', `[[金剛界為]]始覺上轉之法門，轉在迷之九識，成五種之果智，故分類為五部。一、[[蓮華部]]，眾生心中有本有淨菩提心清淨之理，在六道生死之泥中，不染不垢，猶如蓮華由泥中出生，不染不垢，故名蓮華部；二、[[金剛部]]，眾生自心之理所，又有本有之智，在生死之泥中，經無數劫，不朽不坯，能破煩惱，如金剛之久埋泥中，不朽不坯，故名金剛部；三、[[佛部]]，此理智在凡位未顯，入果位則理智顯現，覺道圓滿，故名佛部；四、[[寶部]]，佛之萬德圓滿中，福德無邊，故名寶部；五、[[羯磨部]]，羯磨華譯作業，佛為眾生而垂愍，成辦一切之事業，名羯磨部。`,

'金剛輪', `１．金剛的法輪，指[[密教]]。２．五輪之一，即金輪。`,

'金剛剎', `[[寺]]的別名。`,

'金剛座', `佛成等正覺時的座位，在[[摩羯陀國]][[菩提伽耶菩提樹]]下。`,

'金剛神', `執金剛神的簡稱，又名金剛手，或金剛力士等，即手執金剛杵以保護佛法的神祇。`,

'金剛眾', `手執金剛杵的神祇眾類，亦即金剛神的眷屬。`,

'金剛乘', `真言教的別名。`,

'金剛慧', `通達事相的道理而破除諸相的智慧。`,

'金剛體', `好像金剛一般堅固的身體，即佛的身體。`,

'金剛智', `１．（喻）好像金剛一般堅固的智慧，亦即佛的智慧。２．人名，為南印度光明國人，幼年出家，後受具戒，於中印那爛陀寺，廣學大小乘，三藏兼通，三十一歲，禮龍智為師，經七年，於密法無所不通，嘗於作法中，感見觀自在菩薩現身，證明其學成就，令往東土弘密乘，乃航海來華傳法。`,

'金剛心', `菩薩的大心，因菩薩的大心堅固不能壞好像金剛。`,

'金剛心菩薩', `大乘五十二個階位中，第五十一位的菩薩，叫做等覺，意思是此覺已經與佛差不多相等了，此時若回顧第十法雲地，已經可以叫做佛，若瞻望佛地，則還差一點，所以只叫做金剛心菩薩，或無垢地菩薩。`,

'金剛語言', `不出聲的默誦經文。`,

'金剛三昧', `又名金剛定。見金剛定條。`,

'金剛後心', `菩薩於最後位，斷最極微細煩惱之定，智用堅利，譬如金剛，叫做金剛定。有入住出三心，入時尚居眾生位，出時則成佛，當住位完滿，將屆出定時，名金剛後心。`,

'金剛滅定|金剛三昧', `與金剛三昧同義。`,

'金剛薩埵', `菩薩名，因執持金剛杵，故又名金剛手菩薩，密宗以大日如來為初祖，此金剛薩埵為第二祖。`,

'金色頭陀', `[[摩訶迦葉]]的別名，因他的身體呈現出金色而且有光，在釋尊諸弟子中，以修頭陀第一著稱，故被稱為金色頭陀或飲光。`,

'金光明懺法', `又名[[吉祥懺法]]，[[天台]]大師依[[金光明經]]而創之，宋遵式完成之，撰金光明懺法補助儀一卷。`,

'長衣', `比丘[[三衣]]或[[百一資具]]以外的衣。長是長物的意思。`,

'長行', `行數很長的經文，即[[十二分教]]中的[[修多羅]]。`,

'長老', `年高德邵的比丘。`,

'長者', `１．年長或分尊的人。２．尊稱有道德的人。`,

'長物', `多餘的東西，如比丘多餘的衣缽金銀米穀等是。`,

'長缽', `比丘多餘的鐵缽。`,

'長養', `生長養育功德善根。`,

'長明燈', `又名續明燈，或無盡燈，即佛前日夜常明的燈。`,

'長時修', `四修之一。見四修條。`,

'長齋月', `適宜持續一個月齋食的月份，即正月、五月、九月。`,

'阿', `華譯為[[無]]，又云[[真空]]，為眾音之母，一切字的種子。`,

'阿含', `[[小乘經]]的總名，華譯為[[法歸]]，是萬法歸趣於此而無漏的意思。又譯作無比法，即無可相比之法。共分為四部，即增一阿含、長阿含、中阿含、雜阿含。`,

'阿含時', `[[五教]]之一，即佛成道之後十二年間在鹿野苑宣講阿含經的時期。`,

'阿含部', `屬於阿含的部門。`,

'阿那律', `佛[[十大弟子]]之一，以天眼第一著稱。`,

'阿那含', `[[聲聞乘]][[四果]]中的第三果名，華譯為[[不還]]，或是[[不來]]，是斷盡欲界的煩惱的聖人的通稱。凡是修到此果位的聖人，未來當生於色界無色界，不再來欲界受生死，所以叫做不還。`,

'阿那含果', `見阿那含條。`,

'阿那含向', `[[小乘]][[四向]]中的第三向。見四向條。`,

'阿利耶|阿賴耶識', `[[阿賴耶識]]。`,

'阿伽陀', `藥名，華譯[[普去]]、[[無價]]、[[無病]]、[[不死藥]]。`,

'阿育王', `古印度[[摩竭陀國]]的國王，華譯為[[無憂王]]，於公元前二七○年間，統一全印度，初奉[[婆羅門教]]，肆其暴行，殺戮兄弟、大臣、及無數人民，後來改信佛教，成為大護法，興慈悲，施仁政，於國內建八萬四千大寺，及八萬四千寶塔，派遣宣教師，到四方傳法，使佛教發揚於國外。`,

'阿羅漢', `[[聲聞乘]]中的最高果位名，含有殺賊、無生、應供等義。殺賊是殺盡煩惱之賊，無生是解脫生死不受後有，應供是應受天上人間的供養。`,

'阿字觀', `[[真言宗]]的觀法，亦即觀念阿字的方法。`,

'阿字七義', `[[菩提心]]、[[法門]]、[[無二]]、[[法界]]、[[法性]]、[[自在]]、[[法身]]。`,

'阿字布心', `一切真言之阿字，布於行者之心，叫做[[心作心]]，又叫做[[心布心]]，簡稱[[心心]]。`,

'阿字數息觀', `於出入息中觀阿字的觀法。`,

'阿蘭若', `華譯為[[寂靜處]]，是比丘所居住的寺院的總稱。`,

'阿蘭若行', `[[十二頭陀行]]之一。`,

'阿蘭若處', `華譯為[[遠離處]]，或[[空閑處]]，即遠離熱鬧的空閑處。`,

'阿修羅', `[[六道]]之一，華譯為[[非天]]，因其有天之福而無天之德，似天而非天。又譯作無端，因其容貌很醜陋。又譯作無酒，言其國釀酒不成。性好鬥，常與帝釋戰，國中男醜女美，宮殿在須彌山北，大海之下。`,

'阿修羅王', `[[法華經|妙法蓮華]]序品列有四個阿修羅王，即[[婆稚阿修羅王]]、[[佉羅騫㻧阿修羅王]]、[[毘摩質多阿修羅王]]、[[羅侯阿修羅王]]。`,

'阿修羅界', `阿修羅的世界。`,

'阿修羅道', `[[六道]]之一，多由瞋、慢、疑三個原因而投生。`,

'阿修羅戰', `阿修羅王與帝釋的戰鬥。修羅有美女，無好食，諸天有好食，無美女，於是互相憎嫉，時常戰鬥。`,

'阿僧祇', `華譯為[[無央數]]，是多到沒有數目可以計算的意思。`,

'阿僧祇劫', `華譯為[[無央數劫]]。劫是計算時代的名詞。`,

'阿鼻', `華譯為[[無間]]，即[[無間地獄]]。`,

'阿鼻地獄', `[[八大地獄]]之一，又名[[無間地獄]]，即是受苦無間斷的地獄，也是造極重罪的人死後所墮落的地方。`,

'阿闍世', `國王名，是佛住世時[[摩竭陀國]]的統治者，為太子時，聽惡友[[提婆達多]]的話，幽困父王[[頻毗娑婆]]。即位後，併吞小國，威震四鄰。但因害父罪，遍體生瘡，至佛所懺悔，痊癒後，即皈依釋尊，為佛門有力的護法。`,

'阿闍梨', `華譯為[[教授]]，或[[軌範正行]]，或[[悅眾]]，即是矯正弟子們行為的比丘。四分律五種的阿闍梨，即出家、受戒、教授、受經、依止等。`,

'阿難|阿難陀', `即[[阿難陀]]。`,

'阿難陀', `華譯[[慶喜]]，是[[白飯王]]的兒子，[[提婆達多]]的弟弟，佛的從弟，生於佛成道之夜，後來隨佛出家，侍奉佛二十五年，為佛執事弟子，以多聞第一著稱。`,

'阿賴耶', `[[心識]]名，八識中的[[第八識]]，華譯為[[藏識]]，藏字有三義，即[[能藏]]、[[所藏]]、[[執藏]]。能藏謂阿賴耶識能含藏一切法的善惡種子；所藏謂阿賴耶識為前七識熏習的雜染法所覆藏；執藏謂阿賴耶識為第七識所執為自內我。又譯作無沒，即含藏諸法種子而不沒失。又雖在生死而不沒失，故名無沒。`,

'阿賴耶識', `[[八識]]中之[[第八識]]，由如來藏與無明和合而生。參考阿賴耶條。`,

'阿梨耶識|阿賴耶識', `即[[阿賴耶識]]。`,

'阿陀那識|阿賴耶識', `[[阿賴耶識]]的別名，義為執持，言此識之力，能執取維持善惡業因，及有情身體，使不破壞。`,

'阿摩羅識', `又作[[阿末羅]]，或[[菴摩羅]]，華譯為[[無垢]]，即清淨無垢之識，也是九識中的[[第九識]]。`,

'阿鞞跋致', `華譯為不退轉，是菩薩的階位名，要經過一大阿僧祇劫的修行，才能到達此位。`,

'阿彌陀佛', `譯義為無量光，或無量壽，故亦稱為無量壽佛，是西方極樂世界的教主。`,

'阿彌陀三尊', `中尊為阿彌陀佛，左為觀音菩薩，右為勢至菩薩。`,

'阿彌陀懺法', `又叫做無量壽懺法，即懺悔罪障，神超淨域的勝法。`,

'阿彌陀佛三名', `[[阿彌陀佛]]有三種譯名，即[[無量壽]]、[[無量光]]、[[甘露]]。`,

'阿耨菩提|阿耨多羅三藐三菩提', `[[阿耨多羅三藐三菩提]]的簡稱。`,

'阿耨多羅三藐三菩提', `佛智名，華譯為[[無上正等正覺]]，即是真正平等覺知一切真理的無上智慧。`,

'阿字本不生', `阿字譯為無，又云真空，為眾音之母，一切字的種子，故即是般若實相的理體，無生無滅。`,

'陀羅尼', `華譯為[[總持]]，即總一切法，持無量義。原有四種，咒陀羅尼，不過是其中一種，但通常皆以咒為陀羅尼。`,

'陀羅尼三昧', `發無量陀羅尼的禪定名。`,

'雨華瑞', `[[法華六瑞]]之第三瑞，釋尊將要說[[法華經|妙法蓮華]]而入於三昧時，天空中如雨般落下四種的花，叫做雨花瑞。`,

'雨曼陀羅華', `由天降下曼陀羅華。`,

'青鬼', `青色的鬼，在地獄中呵責罪人。`,

'青蓮', `梵語[[優缽羅]]，即青色的蓮花，其葉修廣，青白分明，好像人的眼睛，所以拿來譬喻佛的眼睛。`,

'青蓮華|青蓮', `見青蓮條。`,

'非人', `指天龍八部中似人而非人的鬼神。`,

'非天', `[[阿修羅]]，因阿修羅的果報似天而非天。`,

'非情', `無情識的事物，如草木土石等是。`,

'非器', `不堪受持佛法的根器。`,

'非色', `由四大所造成的一切事物叫做色，非四大所造成的一切事物即叫做非色，如五蘊中除了色蘊之外的受想行識四蘊即是非色，故又稱為非色的四蘊。`,

'非色非心', `一切有為法分為色法、心法、非色非心法。非四大所造成的叫做非色，不與心相應的法叫做非心。`,

'非時', `晨朝至日中為時，日中至後夜為非時。`,

'非時食', `不應該食的時候食，即過午之食。`,

'非梵行', `又名不淨行，即不淨的行為，指淫事。`,

'非有非空', `也不是有也不是空，這是佛菩薩的境界，也是中道的道理。`,

'非有非空門', `四門之一。見四門條。`,

'非有想非無想定', `非有想非無想處的禪定。`,

'非有想非無想天|非想非非想天', `見非想非非想天條。`,

'非有想非無想處', `在[[無色界]]的第四處，也是三界的最高處，生於此處的人，沒有下地麤想的煩惱，故叫非有想，又叫非想，但不是沒有細想的煩惱，故叫非無想，又叫非非想。外道錯認此處為真的涅槃處。`,

'非非想天|非想非非想天', `非想非非想天的簡稱。`,

'非非想處', `非想非非想處的簡稱。`,

'非想非非想天', `[[無色界]]共有四天，此天即是無色界的第四層天，也是三界中的最高天，故又名[[有頂天]]。此天的禪定，無如下地的麤想，故曰非想，尚非無細想，故又曰非非想。`,

'非想非非想處定', `非想非非想天的禪定。`,

'非擇滅無為', `三無為之一。見三無為條。`,

'竺法蘭', `中印度人，與迦葉摩騰，同來中國，宏揚佛法。`,

'拈花示眾', `大梵天王問佛決疑經說，梵王至靈山，以金色波羅花獻佛，請佛說法，世尊拈花示眾，並不說法，一時百萬人天，皆不解其意，獨迦葉尊者，破顏微笑，佛因傳以涅槃妙心，為禪宗的起源。`,
);


addTerms(9,

'皈依', `[[皈向]]、[[依靠]]、[[救度]]之義。[[皈依佛]]、[[皈依法]]、[[皈依僧]]，叫做[[皈依三寶]]，也叫做[[三皈依]]。`,

'南無', `華譯歸命、敬禮、歸依、救我、度我等義，是眾生向佛至心皈依信順的話。`,

'南無佛', `歸命於佛。`,

'南無阿彌陀佛', `歸命於阿彌陀佛。`,

'南無喝囉怛那哆羅夜耶', `南無是歸命，喝囉怛那是寶，哆囉夜耶是三，即[[歸命三寶]]。`,

'南山', `南山道宣，是四分律宗的祖師，他住在終南山的紵麻蘭若，故號為南山大師。見道宣條。`,

'南山三教', `[[性空教]]、[[相空教]]、[[唯識圓教]]。`,

'南山三觀', `[[性空觀]]、[[相空觀]]、[[唯識觀]]。見三觀條。`,

'南宗', `[[達摩]]到中國來傳禪，到五祖[[弘忍]]的時候，有[[慧能]][[神秀]]二位弟子，慧能在江南布化，叫做南宗，神秀在北方布化，叫做北宗。`,

'南洲', `在[[須彌山]]南方鹹海上的大洲，即[[閻浮提]]，亦即吾人所住的世界。`,

'南能北秀', `南宗的[[慧能]]和北宗的[[神秀]]。`,

'南閻浮提|南洲', `與[[南洲]]同。`,

'南贍部洲', `又名[[南閻浮提]]，閻浮即贍部樹，此洲有此樹故名，我們所住的世界，就是在這個洲。`,

'俗人', `世俗的人。`,

'俗我', `又名假我，亦即凡夫所執著的妄我。`,

'俗戒', `１．指有漏的戒。２．指五戒和八戒等在家戒。`,

'俗智', `１．俗人的智慧。２．明白俗諦的智慧。３．有漏雜染的智慧。`,

'俗塵', `指一切世間的人事而言。`,

'俗諦', `世間的真理，為[[二諦]]之一。`,

'信力', `五力之一。見五力條。`,

'信士', `在家信仰佛教的男子。`,

'信女', `在家信仰佛教的女子。`,

'信心', `對所聞之法生起信仰的心。`,

'信向', `信仰三寶和歸向三寶。`,

'信樂', `確信和愛樂。`,

'信慧', `五根中的信根和慧根，信根能破邪見，慧根能斷無明。`,

'信解', `確信和了解。`,

'信解行證', `先信仰其法，次了解其法，再依其法而修行，最後必能證悟道果。`,

'信不退', `[[三不退]]之一。`,

'信成就', `[[六成就]]之一。`,

'信受奉行', `信受如來所說的法和切實奉行如來所說的法。`,

'信外輕毛', `（喻）信心動搖就好像輕毛一樣飄忽不定。`,

'信位菩薩', `證到十種[[信位]]的菩薩。`,

'剃髮', `剃掉鬚髮，是佛弟子出家之相，也是表明去除憍慢和跟外道的出家有別。`,

'枯定', `定多慧少的禪定。`,

'前念', `指過去的意念，未來的意念則叫做後念。`,

'前塵', `過去的事情。`,

'前佛後佛', `前佛是指[[釋迦佛|釋迦牟尼]]，後佛是指[[彌勒佛]]。`,

'即', `融和不二不離的意思，如煩惱即菩提，生死即涅槃是。`,

'即離', `即與離。事理不二叫做即，事理差別叫做離。`,

'即假', `圓教的假諦，乃空中二諦相即之假，故云即假，以別於別教之假諦。`,

'即中', `圓教的中諦，乃空假二諦相即之中，故云即中，以別於別教之中諦。`,

'即空', `一切法不是滅了之後才空，而是其自性本來就是空，叫做即空。心經說：「色即是空」。`,

'即空即假即中', `[[天台]]所立之三觀。見三觀條。`,

'即心即佛', `又作即心是佛，或即心成佛，是此心就是佛的意思。`,

'即心是佛|即心即佛', `與[[即心即佛]]同義。`,

'即心念佛', `念自己心中的佛的意思。人們的心性周遍法界，本來是清淨之佛體，但為無明所覆蓋，不能顯現，不顯現所以才與彌陀相隔十萬億佛土，若顯現即得己身之淨土，此心便是彌陀。`,

'即有即空', `謂一切有為法，其自性本來就是空，不是經過壞滅法之後才是空。`,

'即身成佛', `即身修行即身就可以成佛。密宗說三密加持相應，可以即身成佛。`,

'即事而真', `謂事理本來不二，在淺近的事相上，就已具有最深妙的真理。`,

'垢', `[[煩惱]]的別名。`,

'垢結', `垢與結，都是[[煩惱]]的別名。`,

'垢識', `為惑所垢的心識。`,

'契經', `契合眾生的根機而且契合真理的經文，即佛經。`,

'契機', `契合眾生的根機。`,

'契理', `契合真理。`,

'威儀', `行住坐臥應有的威德和儀則。`,

'威儀師', `傳授如何行住坐臥的教師。`,

'威德', `可畏為威，可愛為德。`,

'威德三昧', `發生威德力的禪定。`,

'威神力', `威嚴與神通的力量。`,

'帝釋', `[[忉利天]]的天主，俗稱為[[玉皇大帝]]。`,

'帝網', `懸於[[帝釋]]天宮的寶網。`,

'帝網天珠', `[[帝釋]]懸寶珠網以裝飾宮殿，這些寶珠的光明互相輝映，一珠現一切珠影，一切珠盡現一珠之中，各各如是，重重影現。`,

'幽冥', `地府之獄，幽暗無光。`,

'幽途', `幽冥的道途，亦即充滿罪惡的人死後所趣向的地獄餓鬼畜生等三惡道。`,

'幽靈', `幽界的精靈，亦即六道中眼睛所看不到的眾生。`,

'度', `１．與渡同義，如舟子渡人過海的意思。２．出或離的意思，出是出離世俗，離是脫離生死。`,

'度生', `濟度眾生。`,

'度牒', `出家受戒時所發給的戒牒，也就是受戒的證明書。`,

'度僧', `度人為僧。`,

'律', `制止作惡的法則。`,

'律行', `戒律的實行。`,

'律宗', `專門修持戒律的宗派，以唐時南山道宣為初祖。`,

'律相', `戒律的法相。`,

'律師', `專門研究佛教戒律的師父。`,

'律乘', `戒律的教法。`,

'律藏', `三藏之一。見三藏條。`,

'律懺', `[[戒律]]所說的[[懺悔法]]。`,

'律儀', `律是[[戒律]]，儀是[[儀則]]，謂佛所制定的戒律可以使人防非止惡，乃是吾人立身處世的儀則。`,

'律儀戒', `[[三聚淨戒]]之一，即規矩禮貌的戒律。`,

'後有', `１．未來的果報。２．後世的心身。`,

'後佛', `後來出世的佛，指[[彌勒佛]]。`,

'後念', `過去的念叫做前念，後來的念即叫做後念。`,

'後報', `這一世所造的善惡業要到二生以後才受報。`,

'後得智', `[[二智]]之一，境智無異，不起分別，名根本智，分別一切差別之相，慧照分明，即名後得智。`,

'後五百歲', `１．大集經所說五種五百年中，第五個五百年，亦即鬥諍堅固的時期。見五五百年條。２．佛滅度五百歲之後。`,

'思假', `既[[思惑]]，因思惑之體，虛假不實。`,

'思惑', `又名[[修惑]]，[[三惑]]之一，即思想上的迷惑錯誤，如貪瞋痴慢疑等之五煩惱是。思惑的品數有八十一，即欲界五趣一地，色界四禪天為四地，無色界四空天為四地，共九地，每地九品，合共即八十一品。`,

'思惟', `思考。`,

'思慧', `三慧之一。見三慧條。`,

'怨憎會苦', `八苦之一。見八苦條。`,

'怨親平等', `對怨敵和親人一視同仁，無有厚此薄彼的分別。`,

'恆沙', `１．恆河沙的簡稱。見恆河沙條。２．[[天台宗]]所立三惑中之塵沙惑也叫做恆沙。`,

'恆沙定', `多如恆河沙數的禪定，為地藏菩薩每日晨朝所入觀察眾機的禪定。`,

'恆河', `[[恆伽河]]的簡稱，恆河又名[[殑伽河]]，是印度三大河流之一。`,

'恆河沙', `恆河是印度大河，兩岸多細沙，佛說法時，每以恆河之細沙喻最多之數。`,

'拜佛', `禮拜諸佛。`,

'拜懺', `拜佛以求懺悔。`,

'持犯', `持戒與犯戒。持戒就是持戒律；犯戒就是犯了戒律。`,

'持名', `執持名號，即念誦佛的名字。`,

'持明', `１．即陀羅尼，亦即真言。２．受持真言的意思。`,

'持念', `受持和憶念正法，使不忘失。`,

'持律', `受持戒律。`,

'持素', `受持素食，亦即不食肉。`,

'持誦', `受持誦讀經典或是真言。`,

'持齋', `過了正午不食叫做齋，持齋就是受持齋法。`,

'持戒', `受持佛所制的戒律。`,

'持戒波羅蜜', `六度之一。見六度條。`,

'持息觀', `[[五停心觀]]中的[[數息觀]]。`,

'施', `把自己的東西送給人家。施有三種，即[[財施]]、[[法施]]、[[無畏施]]。`,

'施主', `實行布施的主人。`,

'施行', `布施的行法，亦即把自己的東西送給人家。`,

'施食', `１．布施食物給餓鬼。２．供養齋食給僧人。`,

'施食會', `布施食物給鬼神等的法會。`,

'施無畏', `１．又名[[施無畏者]]，或[[施無畏菩提薩埵]]，即[[觀世音菩薩|觀世音]]的別名。２．消除眾生的危難和恐怖。`,

'星宿劫', `在過去現在未來的三大劫中，未來的大劫叫做星宿劫，因為在這一個劫中，有千佛出世，其數多如天上之星宿，故名。`,

'是心是佛', `[[觀無量壽經]]說：「<verse>諸佛如來是法界身，入一切眾生心想中。是心即是三十二相，八十隨形好。是心作佛，是心是佛。</verse>」`,

'是處非處力', `佛[[十力]]之一，即分別是非的智力。`,

'染', `不潔淨的意思。`,

'染心', `１．愛著的心。２．淫欲的心。`,

'染衣', `用木蘭色等壞色來染成的衣，即僧衣。`,

'染著', `對一切境界生起分別執著的心。`,

'染污', `即[[煩惱]]，因煩惱能染污人們的真性。`,

'染污意', `[[第七識]]的別名，因第七識是迷染的根本。`,

'染污無知', `一切煩惱，以無明為體，執著一切事理，其性不淨，故名染污，其體昏闇，不知四諦的真理，故名無知，台學叫做見思惑，小乘阿羅漢，辟支佛，都能斷除。`,

'染法', `染污之法，即三界內所有的一切事物。`,

'染界', `娑婆世界。`,

'染緣', `招感生死之苦果的因緣。`,

'柔軟', `謂心柔順於道。`,

'柔軟語', `柔和而能適合他人胃口的言語。`,

'柔順忍', `四忍之一。見四忍條。`,

'毘盧', `[[毘盧舍那]]的簡稱，也是法身佛的通稱。`,

'毘盧舍那', `又作[[毘盧遮那]]，是佛真身的通稱。佛有三身，就有三個名號，毘盧舍那是釋迦牟尼佛法身的名號，盧舍那是釋迦牟尼佛報身的名號，釋迦牟尼是應身的名號。毘盧舍那華譯為遍一切處，是光明遍照一切的意思。盧舍那華譯為淨滿，是清淨圓滿的意思。`,

'毘盧性海', `梵語[[毘盧遮那]]華譯為[[遍一切處]]，法性遍一切處，好像無涯的大海。`,

'毘舍浮', `又作[[毘舍婆]]，華譯為[[遍勝]]，是[[七佛]]中的第三尊佛名。`,

'毘奈耶', `即[[律藏]]。[[三藏]]之一。`,

'毘沙門', `[[四天王天]]中[[北方天王]]的名字，華譯為多聞，即[[多聞天王]]。`,

'毘婆尸', `華譯為勝觀，是[[七佛]]中的第一尊佛名。`,

'毘梨耶', `華譯精進，為[[六度]]之一。`,

'毘缽舍那', `華譯為[[觀]]，即觀察或觀見事理的意思。`,

'流轉', `流落輾轉於生死。`,

'流轉門', `流轉於生死之門。在四聖諦中，苦集二諦是流轉門，滅道二諦是還滅門。`,

'流轉還滅', `[[流轉門]]與[[還滅門]]。流轉門屬於迷，還滅門屬於悟。`,

'界', `１．差別的意思，亦即事物彼此差別而無混雜。２．性的意思，亦即事物固有的本體。`,

'界分', `指[[欲界]][[色界]][[無色界]]之三界。`,

'界如', `[[十界]]與[[十如]]。[[天台宗]]觀一念之心中即具有三千諸法，此三千諸法，是由十界與十如及三世間所組成的，所以叫做界如三千。`,

'界地|三界九地', `三界九地的簡稱。見三界九地條。`,

'界趣', `謂[[三界]][[六趣]]是眾生生死輪迴的地方。`,

'界內', `[[三界]]之內。`,

'界內教', `對[[三界]]中的眾生說如何才能斷除見思惑以便將來出離三界的教法，如[[天台宗]]所立的藏教與通教是。`,

'界內感', `指見思二惑，因見思二惑能招感三界內之生死果報。`,

'界內事教', `[[天台宗]]說三藏教雖然精究五蘊十二處十八界等事相之法門，但其理只屬偏真之空理，究竟的道理還很淺薄，故貶之為界內事教。`,

'界內理教', `指[[天台宗]]所說的通教。通教談論事相雖然遜於藏教，但窮理較深，達於生即無生，空即不空，故褒之為界內理教。`,

'界外', `[[三界]]之外。`,

'界外教', `[[天台]]立[[四教]]，藏通二教是界內教，別圓二教是界外教。`,

'界外事教', `指[[天台宗]]所說的別教。別教的菩薩，迷中道之理重，故要分別一切事物以方便悟理，謂之界外事教。`,

'界外理教', `指[[天台宗]]所說的圓教。圓教的菩薩迷理較輕，故不假借分別事物的方便，而直談一切萬法為中道實相的妙理，謂之界外理教。`,

'相', `表現於外而能想像於心的各種事物的相狀。`,

'相大', `三大之一。見三大條。`,

'相分', `心法四分之一。見四分條。`,

'相好', `極好的相貌。一切菩薩修滿了三大阿僧祇劫之後，就要再修各種的相好，修了一百種福，才能成就一種相好，這是在佛前修的，要種得相好滿足了，才可以成佛。`,

'相宗', `[[法相宗]]的簡稱，在佛教的宗派中，以萬法之生起，歸於阿賴耶識，因而就其所生之法，廣為分別名相者，名為相宗。華嚴五教中的大乘始教，天台四教中的通教，八宗中的唯識宗皆是。`,

'相即', `謂事理相融，一入一切，一切入一，相即無礙。`,

'相縛', `心為假相所縛而感到不自在。`,

'相空', `一切法都有性和相的兩方面，性方面的空無叫做性空，相方面的空無即叫做相空。`,

'相空教', `[[南山]]所立三教之一。`,

'相空觀', `[[南山]]所立三觀之一。`,

'相待', `相對的意思，如有低就有高，有左就有右是。`,

'相待有', `三種有之一。見三種有條。`,

'相待假', `相待是相對的意思，如長對短而有長，短對長而有短是，這些相對而有之法，如長和短的本體，只有假相而無實體，叫做相待假。`,

'相應', `互相呼應。依瑜伽論之意，有三種相應，一者，一切所緣之境，與心相應，名境相應；二者，行與理相應，名行相應；三者，三乘聖者，所修諸功德法，因果相符，名果相應，此三種相應，攝盡一切法。`,

'相應心', `妄心與煩惱契合在一起。`,

'相應宗|真言宗', `[[真言宗]]的別名，因真言宗是以三密相應為旨趣。`,

'相應法', `心心所的別名。[[俱舍論]]說：「<verse>心心所五義平等，故說相應。所依、所緣、行相、時、事皆平等故。</verse>」`,

'相續心', `連續不斷的念頭。`,

'眉間光', `從眉間白毫相發出來的光。`,

'眉間白毫相', `佛[[三十二相]]之一，佛眉間有白毛，內外映徹如白琉璃，宛轉右旋。`,

'祇園|祇樹給孤獨園', `[[祇樹給孤獨園]]的簡稱。`,

'祇園精舍|祇陀園林須達精舍', `[[祇陀園林須達精舍]]的簡稱，是佛教史上的第二座佛寺，在舍衛城，乃須達多長者建築以供佛說法的道場。`,

'祇洹精舍', `祇園精舍。`,

'祇樹', `[[祇陀太子]]的樹林。`,

'祇樹給孤獨園', `[[祇陀太子]]的樹林，給[[孤獨長者]]的園地，此園在古印度[[舍衛國]]，佛陀常在那裡講經說法。`,

'耶輸陀羅', `[[悉達多太子]]的夫人，[[羅侯羅]]的母親，她後來跟隨[[摩訶波闍波提]]出家。`,

'耶輸多羅|耶輸陀羅', `即[[耶輸陀羅]]。`,

'背念', `厭背生死而安住於涅槃的心念。`,

'背捨', `即八背捨。見八背捨條。`,

'胎生', `[[四生]]之一，即由母胎而生，如人類在母胎之內完成身體之後才出生是。劫初的人類，男女未分，所以都是化生，後來因為發生淫情，生出男女二根，才變為胎生。`,

'胎金', `[[胎藏界]]與[[金剛界]]。`,

'胎藏界', `眾生本有的性德，攝持含藏一切如來的功德，如母胎攝藏嬰兒，故稱胎藏界。`,

'紅蓮花', `紅色的蓮花。`,

'紅蓮地獄', `[[八寒地獄]]之第七，因其處寒冷皮肉分裂如紅蓮花，故名。`,

'紅蓮大紅蓮', `[[八寒地獄]]之第八。`,

'苦本', `痛苦的根本，即貪欲。`,

'苦因', `痛苦的原因。`,

'苦果', `痛苦的果報。`,

'苦性', `痛苦的本性，俱舍論說有三種，即苦苦性、行苦性、壞苦性。`,

'苦苦', `三苦之一。見三苦條。`,

'苦行', `很艱苦的修行方法。`,

'苦輪', `（喻）生死的苦果好像車輪一樣旋轉。`,

'苦餘', `三餘之一。見三餘條。`,

'苦諦', `四諦之一。見四諦條。`,

'苦智', `明白苦諦的道理的智慧。`,

'苦海', `（喻）眾生在六道之中生死輪迴，備受種種的痛苦，好像沉溺於無邊無際的大海之中一樣。`,

'苦際', `苦報的終點，亦即最後一次受生死的身體。`,

'苦空', `苦與空。見苦空無常無我條。`,

'苦空無常', `苦、空、無我。見苦空無常無我條。`,

'苦空無常無我', `苦是說短暫的人生，有三苦八苦和無量諸苦；空即緣起性空，緣起是說世間諸法眾緣和合而生起，性空是說眾緣和合的諸法，其性本空，沒有真實的自體；無常即諸行無常，是說世間諸法都是變化不停，生滅不斷的，沒有常住不變的個體；無我即諸法無我，是明五蘊假合的人身，沒有真實不變的我體可得。`,

'苦聖諦', `簡稱苦諦。見四聖諦條。`,

'苦法智', `八智之一。見八智條。`,

'苦法智忍', `八忍之一。見八忍條。`,

'苦類智', `八智之一。見八智條。`,

'苦類智忍', `八忍之一。見八忍條。`,

'苦集滅道', `即四聖諦。見四聖諦條。`,

'苾芻', `華譯比丘，義為乞士，即出家受具足戒的人。苾芻原是一種香草，表明比丘之戒德芬芳。`,

'苾芻尼', `比丘尼。`,

'苾芻律儀', `比丘所應受持的戒律，即二百五十條之具足戒。`,

'表詮', `二詮之一。見二詮條。`,

'表業', `身口意之三表業。`,

'表戒', `受戒者登上戒壇，發表其身口意之三業，而真正受得戒法，謂之表戒。此時受戒者體內，發得而不表顯於三業之戒體，謂之無表戒。`,

'表相', `借一個有相的東西來表顯一個沒有形相的真理。`,

'表無表戒', `表戒與無表戒。見表戒條。`,

'衲', `比丘的[[糞掃衣]]，亦即[[頭陀]]比丘的法衣。`,

'衲子', `又叫做[[衲僧]]，是[[禪僧]]的別稱，因禪僧多穿一衲衣而遊方各處。`,

'段食', `[[四食]]之一，即以香味觸三塵為體，用鼻舌分分段段而食，我們的食，即屬此種。`,

'計度', `以意識的作用去思量分別種種的事物。`,

'軌持', `即法的意義。軌者軌範，使人生起領解心，持者維持，維持其體而不混亂其他的個體。`,

'迦迦', `又叫做[[迦迦羅]]，華譁為鳥。`,

'迦陵|迦陵頻伽', `[[迦陵頻伽]]的簡稱。`,

'迦陵頻迦', `鳥名，華譯[[好聲]]，或[[和雅]]。`,

'迦樓羅', `又作[[迦留羅]]，華譯為[[金翅鳥]]，牠取龍為食，為[[八部眾]]之一。`,

'迦旃延', `佛[[十大弟子]]之一，以論議第一著稱。`,

'迦葉', `亦稱[[摩訶迦葉]]，為佛[[十大弟子]]之一，以[[頭陀]]第一著稱。身有金光，映蔽餘光使不現，故亦名飲光。在靈山會上，受佛正法眼藏，傳佛心印，為禪宗初祖。生平修頭陀行，遵佛囑於雞足山入滅盡定，待彌勒佛出世時，傳佛僧伽梨衣。`,

'迦葉佛', `華譯為[[飲光]]，是[[七佛]]中的第六尊佛。`,

'迦葉尊者|迦葉', `見迦葉條。`,

'迦毗羅衛', `國名，即[[釋迦佛|釋迦牟尼]]所出生的國家，現在尼泊爾的西部。`,

'迦膩色加王', `原為大月氏人，征服印度北部，自立為王。他初不信佛教，到晚年信奉佛教，召集舉行[[第四次結集|第四結集]]，造寺造塔，保藏三藏經典，或刻於赤銅鍱中，其功績與阿育王並稱。`,

'重山', `（喻）煩惱厚重如山。`,

'重如', `即如如。至高無上的智叫做智智，至高無上的理叫做如如。見如如條。`,

'重頌', `十二分教之一。`,

'重障', `很厚重的障礙。眾生有三種很厚重的障礙以致不能成佛，那就是惑障、業障、報障。惑障即一切之無明煩惱，業障指五逆十惡等，報障指三途八難等。`,

'重誓', `又叫做重願，即很深重的誓願。`,

'重關', `悟道的難關。`,

'重空觀', `重空是空之又空，重空觀就是空之又空的觀法。`,

'重複衣', `[[僧伽梨]]的別名。`,

'重緣心', `我們的心若是忽然的生起而攀緣善惡的境界，叫做獨頭心，若是相續而且攀緣前有之念，即叫做重緣心。`,

'降誕', `佛降生於世。`,

'降伏', `以威力降伏他人。`,

'降伏法', `以威力降伏怨敵或是惡魔之法，如修五大明王之法是。`,

'降伏坐', `又名[[降魔坐]]，即先以右足置於左股上，再以左足置於右股上的種坐法，反之者則叫做吉祥坐。`,

'降魔', `降伏惡魔。`,

'降魔相', `[[八相成道]]之一。`,

'降魔坐|降伏坐', `見降伏坐條。`,

'音教', `以聲音宣說的教法。`,

'風刀', `（喻）人臨命終時，體中的風大動搖支解其體，好像刀割一樣的痛苦。`,

'風大', `四大之一。見四大條。`,

'風色', `（喻）物之空無猶如風之無色。`,

'風災', `[[大三災]]之一。見大三災條。`,

'風輪', `[[四輪]]之一。見四輪條。`,

'飛行皇帝', `[[轉輪聖王]]的別名，因轉輪聖王能在空中飛行自在。`,

'飛花落葉', `[[獨覺乘]]的行人，獨處山林，見飛花落葉，便能悟知世法無常，因而開悟獲證涅槃。`,

'食時', `正食的時候，也就是日出至午前之一段時間。`,

'食四分', `凡有飯食，即以四分分之，一供養本尊，二行者自分，三同學共食，四以濟飢貧。`,

'首陀', `又叫做[[首陀羅]]，是古印度四大姓之一，也是農人奴隸階級。`,

'首陀羅', `見首陀條。`,

'首楞嚴', `定名，華譯為[[一切事究竟堅固]]。`,

'香入', `十二入之一。見十二入條。`,

'香剎', `佛寺。`,

'香水海', `圍繞著[[須彌山]]的內海，海水具有[[八功德]]，因其味芳香，故名香水海。`
);

