addTerms(10,

'乘', `運載之義，是譬喻佛法如渡船，能把眾生從生死的此岸運載到涅槃的彼岸。乘有一乘、二乘、三乘、四乘、五乘之別。`,

'兼利', `自他兩利。`,

'冤親', `冤仇和親愛的人。`,

'息慈', `梵語[[沙彌]]，華譯息慈，即止息世情以實行慈濟。`,

'悔過', `向三寶懺悔罪過。`,

'悟入', `開悟實相的道理而入於實相的道理。`,

'旁生', `即[[畜生]]，因畜生不是人天正道。`,

'桓因|釋提桓因', `[[釋提桓因]]的簡稱，即[[帝釋]]天。`,

'退轉', `修持不堅，工夫退步。`,

'馬鳴', `菩薩名，中天竺人，是佛滅後六百年間出世的大乘論師，有馬鳴比丘、馬鳴大士、馬鳴菩薩等尊稱。`,

'骨塔', `舍利塔。`,

'能所', `自動之法叫做能，被動之法叫做所。譬如六根對六塵，六根是能緣，六塵為所緣。`,

'特尊', `特別尊貴的意思，是佛的尊號，因佛獨超九界，與眾不同。`,

'荼毘', `華譯焚燒。`,

'修生', `由修行而生，與修證同義。`,

'修因', `修成佛的因，修了成佛的因，才能結成佛的果。`,

'修行', `依佛法的路線去行持實踐。`,

'修惑', `又名[[思惑]]，即貪瞋痴慢疑等思想上的迷惑錯誤。`,

'修善', `１．斷惡行善。２．本有之善叫做性善，由修而成之善叫做修善。`,

'修慧', `三慧之一。見三慧條。`,

'修齋', `執行齋會。`,

'修德', `用功修來的德，為[[二德]]之一。`,

'修證', `修行證理。`,

'修懺', `修行懺悔的方法。`,

'修得', `由修而得。`,

'修道', `１．修行正道。２．菩薩於見道之後，再進一步，登入初地，漸進至十地，此時稱為修道。`,

'修道所斷', `三斷之一。見三斷條。`,

'修羅|阿修羅', `[[阿修羅]]的簡稱，是一種常與帝釋天戰鬥的鬼神。`,

'修羅酒', `梵語修羅，華譯無酒，相傳阿修羅能飲如海量之酒，飲至沒有酒飲，故名無酒。`,

'修羅道', `[[六道]]之一。`,

'修羅趣', `[[六趣]]之一。`,

'修羅妄執', `修羅性驕慢，很固執己見，雖然被教化，但其心不動，所以聽了至理名言，也不能開悟。`,

'修多羅', `華譯[[契經]]，契是上契諸佛妙理，下契眾生根機，經是線的意思，貫穿法義，使不散失。`,

'修因感果', `修怎麼樣的因就會招感怎麼樣的果。`,

'俱空', `我與法皆空，為[[三空]]之一。`,

'俱起', `同時生起。`,

'俱生', `與生俱來的，即先天性的。`,

'俱生法', `簡稱俱生，即與生俱來之法。`,

'俱生起', `與俱生同義。`,

'俱生惑', `與生俱來之惑，如俱生之我執，俱生之法執，俱生之煩惱障，俱生之所知障等是。`,

'俱生我執', `與生俱來的我執，這種我執是先天性的，不是後天學習來的，後天學習來的，叫做分別我執。`,

'俱生法執', `與生俱來的法執，這樣法執不是由於分別而起，而是先天性的。`,

'俱舍', `華譯為[[藏]]，是包含攝持的意思。`,

'俱舍宗', `又名[[有宗]]，為[[八宗]]之一，因此宗乃依世親菩薩所造之俱舍論而立宗，故名。`,

'俱盧洲', `佛教分世界為[[四大部洲]]，在北方的叫做俱盧洲，又叫做[[鬱單越]]，是勝處的意思，因為此洲在四大洲中是最勝處，洲形正方，人壽千歲，毫無夭折。`,

'倒見', `顛倒的見解，有四種，即無常為常、以苦為樂、無我為我、不淨為淨。`,

'倒我', `四顛倒之一。見四顛倒條。`,

'倒懸', `梵語盂蘭盆，華譯為倒懸，意思是人生前若作惡多端，死後魂魄便沉淪於闇道，有倒懸之苦。`,

'冥', `１．幽隱或幽暗之義。２．無知的別名。`,

'冥加', `佛菩薩暗中加被的意思。`,

'冥性', `諸法的實性。`,

'冥府', `閻魔王的廳堂。`,

'冥使', `冥官的使者，即閻魔卒。`,

'冥途', `幽冥的道途，即地獄餓鬼等地方。`,

'冥通', `冥者離諸妄相而冥寂，通者融通一切而無礙，是讚嘆真理的話。`,

'冥界', `閻魔王所住的世界。`,

'冥熏', `又名內熏，即在本覺之真如內，熏習妄心以使生菩提心。`,

'唐捐', `虛棄。`,

'唐三藏', `唐朝的玄奘三藏。見玄奘條。`,

'夏中', `在結夏[[安居]]的九十日中。`,

'夏末', `結夏[[安居]]的末期。`,

'夏坐', `又名坐夏，即結夏[[安居]]。`,

'夏竟', `結夏[[安居]]的日期完畢了。`,

'夏臘', `比丘的年歲。`,

'夏安居', `一夏九旬之安居。`,

'娑界|娑婆世界', `[[娑婆世界]]。`,

'娑婆', `[[娑婆世界]]的簡稱，娑婆華譯為[[堪忍]]，因此世界的眾生堪能忍受十惡三毒及諸煩惱而不肯出離，故名[[堪忍世界]]，或簡稱[[忍土[[。`,

'娑婆世界|娑婆', `見娑婆條。`,

'娑羅雙樹', `佛在[[拘尸那拉城]][[阿利羅跋提河]]邊的婆羅雙樹間入滅。`,

'害想', `害人的思想，為[[三想]]之一。`,

'害覺', `想加害於人的心。`,

'宴坐', `默然靜坐。`,

'宴寂', `安然入寂。`,

'剋果', `得果。`,

'剋證', `必能證果的意思。`,

'差別', `同類相殊叫做[[差]]，異類相殊叫做[[別]]。`,

'師姑', `尼姑。`,

'師子', `又作獅子，為獸中之王，經中常以之譬喻佛的勇猛。`,

'師子座', `師子就是獅子，佛是人中師子，所以佛所坐的地方，或床或地，都叫做師子座。`,

'師子吼', `（喻）佛在大眾中演說佛法，心中毫無怖畏，好像師子作吼。`,

'師子身中蟲', `師子身中蟲，自食師子肉，譬喻出家比丘自壞佛法。`,

'恚怒', `瞋恚忿怒。`,

'恚結', `九結之一。見九結條。`,

'恩田', `三福田之一。見三福田條。`,

'恩愛', `極親切的愛情。`,

'恩愛河', `（喻）恩愛得像河一樣深。`,

'恭敬修', `四修之一。見四修條。`,

'峨眉山', `中國佛教四大名山之一，在四川省峨眉縣西，兩山相對如峨眉，故名，相傳為[[普賢]]菩薩的道場。`,

'根', `１．能生的意思。２．增上的意思。`,

'根門', `眼等六根是漏出種種煩惱和入種種妄塵的門戶。`,

'根塵', `[[六根]]與[[六塵]]。六根是眼耳鼻舌身意；六塵是色聲香味觸法。`,

'根性', `根為能生之義，人性具有生善業或惡業之力，故稱為根性。`,

'根力', `[[五根]]與[[五力]]。`,

'根力覺分', `與根力覺道同。`,

'根力覺道', `[[五根]]與[[五力]]，[[七覺支]]與[[八正道]]。`,

'根身', `[[六根]]組合而成之身。六根是眼耳鼻舌身意。`,

'根身器界', `根身即六根身體，為眾生的正報；器界又名器世間，即國土器物等，為眾生的依報。`,

'根本印', `諸佛各有其根本之印與明。`,

'根本惑|根本煩惱', `與根本煩惱同。見根本煩惱條。`,

'根本智', `又名[[如理智]]、[[無分別智]]、[[正智]]、[[真智]]等，即符合真理無分別之真智，因它乃生一切法樂，出一切功德大悲之根本，所以叫做根本智。`,

'根本識', `[[阿賴耶識]]。`,

'根本煩惱', `即[[貪]]、[[瞋]]、[[痴]]、[[慢]]、[[疑]]、[[惡見]]等六大煩惱。`,

'根本無明|無始無明', `無始無明的別名。見無始無明條。`,

'根本法輪', `[[三論宗]]所立三法輪之一，指佛初成道華嚴經之說法。`,

'根境識', `又叫做根塵識，即六根六境六識，合之為[[十八界]]。`,

'海眾', `（喻）眾僧和合，好像海水一味。`,

'海會', `（喻）聖眾會合一處，其德之深，與數之多，猶如大海。`,

'海潮音', `佛講經說法或僧眾誦經的聲音，好像海潮之聲，響亮無盡。`,

'涅槃', `華譯[[滅度]]、[[寂滅]]、[[圓寂]]、[[大寂定]]等，是超越時空的真如境界，也是不生不滅的意思。`,

'涅槃那|涅槃', `簡稱涅槃。見涅槃條。`,

'涅槃印', `涅槃寂靜印的簡稱。見三法印條。`,

'涅槃門', `進入涅槃城的門戶。`,

'涅槃相', `化身佛八相之一，亦即世尊入滅的相狀。世尊住世八十年，其中說法四十五年，到處隨緣教化眾生，化緣盡了，便在中印度的拘尸那拉城跋提河岸沙羅雙樹間，說完大般涅槃經後，便頭北面西，右𪊴而臥，最後入滅。`,

'涅槃佛', `佛的應身度生機緣盡了，便示現滅度，叫做涅槃佛，為華嚴經所說十佛之一。`,

'涅槃界', `不生不滅的境界。`,

'涅槃會', `追悼佛入滅的法會。`,

'涅槃相', `佛於娑羅雙樹間頭北面西右𪊴而臥進入涅槃的相狀。`,

'涅槃城', `（喻）涅槃乃是聖者所居的都城。智度論說：「諸法實相是涅槃城。城有三門：空、無相、無作。」`,

'涅槃樂', `五樂之一。見五樂條。`,

'涅槃縛', `謂樂著涅槃而不想利益眾生，這是小乘的境界。`,

'涅槃八味', `涅槃所具有的八種法味，即[[常住]]、[[寂滅]]、[[不老]]、[[不死]]、[[清靜]]、[[虛通]]、[[不動]]、[[快樂]]。`,

'涅槃寂靜', `涅槃的境界，滅一切生死之苦，無為安樂，故涅槃是寂靜的。`,

'涅槃寂靜印', `三法印之一。見三法印條。`,

'畜生', `受人馴養的禽獸。`,

'畜生因', `投生於畜生道的原因，即犯戒私竊、負債不還、殺生、不喜聽受經法、常以因緣艱難齋會等。`,

'畜生有', `七有之一。見七有條。`,

'畜生界', `十界之一。見十界條。`,

'畜生道', `六道之一。見六道條。`,

'畜生趣', `六趣之一。見六趣條。`,

'畜生食時', `四食時之一。見四食時條。`,

'病苦', `四苦之一。見四苦條。`,

'病魔', `[[四魔]]或[[十魔]]之一。`,

'病起六緣', `生病的六種因緣，即[[四大不順]]、[[飲食不節]]、[[坐禪不調]]、[[鬼神得便]]、[[魔神作祟]]、[[業愆所起]]。`,

'迴向', `把自己所修的種種功德，全部貢獻出來，普遍到法界中去。`,

'迴向門', `[[五念門]]之一。`,

'真人', `已證得真理的人，指[[阿羅漢]]與[[佛]]。`,

'真土', `真佛土的簡稱，即佛真身所居住的法性土。`,

'真子', `如來的真子，即諸菩薩。`,

'真心', `真實的心。`,

'真佛', `指佛的報身與法身。`,

'真我', `真正的我。凡夫執著五蘊假合之身為我，其實那是妄我，要像佛那樣具有八大自在之我，才是真我。`,

'真性', `不假叫做[[真]]，不變叫做[[性]]，此真性即吾人本具的清淨心體。`,

'真堂', `禪家安置祖師真像的廳堂。`,

'真理', `永真實不變的道理。`,

'真諦', `[[二諦]]之一，又名[[勝義諦]]、[[第一義諦]]，即聖智所見的真實理性，亦即內證的離言法性。聖智所見的真實理性，離諸虛妄，故云真，其理永恒不變，故云諦。`,

'真常', `真實常在。`,

'真寂', `真正的涅槃，即佛的涅槃。`,

'真智', `又名[[聖智]]，即明白真如實相的智慧。`,

'真詮', `顯示真理的文句。`,

'真語', `１．真實的言語。２．符合真理的言語。`,

'真際', `真實的邊際，也就是至極的意思。`,

'真覺', `真正究竟的覺悟，亦即佛的覺悟。`,

'真識', `[[楞伽經]]所說三識之一。見三識條。`,

'真如', `[[真]]是真實不虛，[[如]]是如常不變，合真實不虛與如常不變二義，謂之真如。又真是真相，如是如此，真相如此，故名真如。真如是法界相性真實如此之本來面目，恆常如此不變不異，不生不滅，不增不減，不垢不淨，即無為法。亦即一切眾生的自性清淨心，亦稱[[佛性]]、[[法身]]、[[如來藏]]、[[實相]]、[[法界]]、[[法性]]、[[圓成實性]]等。[[起信論]]說：「<verse>一切諸法，從本已來，離言說相，離名字相，離心緣相，畢竟平等，無有變異，不可破壞，唯是一心，故名真如。</verse>」`,

'真如三昧', `觀察真如無相的道理而破除妄惑的禪定。`,

'真如無為', `謂真如法性，離於造作，本自無為。`,

'真如隨緣', `二真如之一。見二真如條。`,

'真如緣起', `言一切法皆依真如之體，因緣之用，而起生滅之相，若追溯其源，則真如不守自性，以一念無明，生起萬法，故名真如緣起。`,

'真如不變', `與不變真如同。見二真如條。`,

'真如內薰', `謂真如內薰無明，生起淨化的作用。`,

'真如法身', `謂法身的體性，真實不虛和如常不變。`,

'真如實相', `非假謂之真，不變謂之如，離虛謂之實。真如即一切眾生的自性清淨心，亦稱為法身、如來藏、法性、佛性等。此真如自性，並非虛妄，乃係真實之相，故名真如實相，簡稱為如實。`,

'真如寂滅相', `真如的本體清靜而無妄染，故云寂滅相。`,

'真妄', `１．真實和虛妄。不假叫做真，虛假叫做妄。２．真心和妄心。見真妄二心條。３．因緣生的一切法都是虛妄不實，叫做妄法，不生不滅之真如，叫做真法。`,

'真妄二心', `真心和妄心。真心是屬於本有的，無攀緣的，無分別的，無變動的，非善非惡的，超然於境界之外的，當吾人於無念而又非睡著時，便是這一種心現前；妄心是屬於後天生起的，有攀緣的，有分別的，常變動的，能善能惡的，牽拘於境界之內的，當吾人思慮了別時，便是這一種心現前。楞伽經以海水與波浪比喻此真妄二心，海水常住不變，如真心，波浪起伏無常，如妄心。`,

'真言', `真實的言語，又是神聖的言語的意思，為如來三密中之語密。`,

'真言心', `即[[阿]]字。[[大日經]]說：「<verse>所謂阿字者，一切真言心，從此遍流出無量諸真言。</verse>」`,

'真言宗', `依秘密真言而為宗，故名真言宗。又真言屬秘密藏，為如來三密中之語密，故又稱為[[密宗]]。`,

'真言乘', `又名[[神通乘]]。乘真言之教法而到達佛地，故名真言乘。因其教法很快就能令人成佛，故又名神通乘。`,

'真言教', `真言陀羅尼的教法。`,

'真言秘密', `真言是如來[[三密]]中之語密，故云真言秘密。秘密的意思不是秘密不肯示人，而是法身佛的三業幽微奧妙，不是等覺菩薩不能知曉。`,

'真言阿闍梨', `[[密宗]]傳授秘法或是為人灌頂的法師。`,

'真言陀羅尼', `真言與陀羅尼。真言與陀羅尼，是同體異名。`,

'真身', `法身。見二身條。`,

'真身觀', `[[觀經]]所說[[十六觀]]之一，即觀高六十萬億那由他恆河沙由旬之佛身。`,

'真法', `真如實相之法。`,

'真法界', `真實不虛的法界，與真如同義。`,

'真空', `１．超出一切色相意識的境界，亦即小乘的涅槃。２．非空之空，叫做真空，這是大乘至極的真空。`,

'真空觀', `[[華嚴宗]]所立三觀之一。見三觀條。`,

'真空妙有', `非空之空，空而不空，非如小乘偏執之但空，叫做真空；非有之有，有而不有，非如凡夫妄計之實有，叫做妙有。真空而能生萬法，妙有而一切皆如，是真空妙有的涵義。`,

'真俗', `１．事理的別名。因緣所生之事相叫做俗，不生不滅之理體叫做真。<br>２．在假空中三諦中，假是俗，空與中是真。<br>３．世間是俗，出世間是真。<br>４．在家是俗，出家是真。`,

'真俗不二', `真諦詮空，俗諦詮有，性空不乖相有，相有也不離性空，理事無礙，故不二。`,

'真解脫', `真正的解脫，即佛的涅槃。`,

'真無漏智', `真正無漏的智慧，即佛菩薩的智慧。二乘人雖然也有無漏智，但是他們未斷法執，不滅所知障，所以不是真正的無漏智。`,

'真化二身', `真身和化身。見二身條。`,

'真應二身', `真身和應身。見二身條。`,

'破有', `１．破除執有的見解。２．破除三界九有的惡法。`,

'破見', `以邪見來破斥如來的正見。`,

'破法', `以邪見來破斥如來的正法。`,

'破夏', `破壞結夏安居禁止外出的禁例。`,

'破執', `破除我執和法執的執著。`,

'破僧', `破和合之僧，為[[五逆罪]]之一。有二種的破僧法，一是破法輪僧，如提婆達多立了五種的邪法來和佛的法輪對立，以便分離聽聞佛之法輪的僧眾。二是破羯磨僧，即在同一界之內作別種的羯磨（法事），以破壞羯磨僧的和合。此中前者罪最重，後者罪較輕。`,

'破齋', `破壞八關齋戒。`,

'破顯', `破邪顯正。`,

'破戒', `破壞佛所制的戒律。`,

'破戒五過', `破壞佛所制的戒律的人有五種的罪過，即[[自害]]、[[為智所呵]]、[[惡名流布]]、[[臨終生悔]]、[[死墮惡趣]]。`,

'破和合僧', `[[五逆罪]]之一，即比丘們和合的在一處，以手段離間拆散他們，使他們不能和合的在一塊修行，或霸佔寺廟，逼令還俗等，都是破和合僧，因斷人慧命，與絕人解脫善緣，故其罪至重，報亦最慘。`,

'秘印', `密教所傳授的秘密印契。`,

'秘法', `秘教的修法，因秘教的修法很秘密，不隨便公開示人。`,

'秘要', `不隨便示人的切要法門。`,

'秘教', `秘密的教法，總稱大日如來的教法。`,

'秘經', `秘密的經典，總稱[[真言宗]]的經典。`,

'秘密', `秘是秘奧之義，是形容法門之深奧；密是隱密，言其法不隨便公開示人。`,

'秘密戒', `密教的戒律，即三昧耶戒。`,

'秘密咒', `真言陀羅尼的總稱，因真言陀羅尼就是秘密的咒語。`,

'秘密宗', `簡稱[[密宗]]，是中國佛教[[八大宗]]之一。`,

'秘密乘', `真言的教法。`,

'秘密教', `[[真言宗]]的總稱。`,

'秘密經', `[[真言宗]]的經典。`,

'秘密號|陀羅尼', `[[陀羅尼]]的別名。`,

'秘密藏', `秘密的法藏。`,

'神力', `神通力。`,

'神咒', `神秘的咒語，即[[陀羅尼]]。`,

'神秀', `俗姓李，洛陽尉氏人，少覽經史，博學多聞，後依[[五祖]]出家。唐高宗上元中，五祖入滅後，神秀出住荊州的江陵當陽山，緇徒響風，道譽甚盛，是為北禪之始。武后則天聞神秀的聲名，召赴長安，供養盡禮；又敕在當陽山建築度門寺，以表揚神秀的功德。於唐中宗神龍年中卒，諡號大通禪師。`,

'神道', `１．[[天道]]、[[阿修羅道]]、[[鬼道]]等三道的通稱。２．神妙之道，即佛道。`,

'神識', `指有情靈妙不可思議的心識，與現代所說的靈魂同義。`,

'神通', `變化莫測謂之神，無拘無礙謂之通，合起來說，就是既能使人莫測他之所以，又能為所欲為而了無障礙。`,

'神通乘', `指[[真言教]]。`,

'神通如意', `又名[[心如意通]]，即[[六神通]]中之神境通。`,

'神足|神足通', `神足通的簡稱。見神足通條。`,

'神足通', `[[五通]]之一，又名[[神境智證通]]，或[[心如意通]]，即身如其意，隨念即至，可在一想念間，十方無量國土都能同時一一到達，變化無窮。佛十大弟子中，目犍連就是得了這種圓滿的神通而號稱為神通第一。`,

'神境通|神境智證通', `[[神境智證通]]的簡稱。`,

'神境智證通', `[[五通]]或[[六通]]之一。`,

'納衣', `又名[[糞掃衣]]，即拾取人家棄之不用與糞掃一樣的賤物來縫納而成的法衣，為十二[[頭陀]]行之一。`,

'納戒', `受戒。`,

'納具', `受具足戒。`,

'素食', `不雜魚肉滋味的食物。`,

'素怛纜', `又作[[蘇多羅]]，或[[修多羅]]，華譯為[[經]]、[[契經]]、[[綖經]]等，是經典的通稱。`,

'脅士', `侍立在佛兩旁幫助佛教化眾生的菩薩。`,

'脅侍', `與𪊴士同。`,

'脅尊者', `人名，由於昔業的緣故，在母胎六十餘年，生時鬚髮已白，年八十出家，自誓願說：「我若不通三藏理，不斷三界欲，不得六神通，終不以𪊴貼席。」後歷三年，盡償所誓，時人尊之為𪊴比丘，或𪊴尊者。`,

'般若', `華譯為[[智慧]]，即通達真理的無上妙慧。`,

'般若時', `佛說[[般若經]]的時期，為[[天台]]所立[[五時]]之一。`,

'般若船', `（喻）智慧如船隻能渡人出生死之大海。`,

'般若經', `宣說[[般若波羅蜜]]深妙道理的經典的總稱。`,

'般若三昧', `得到智慧的正定功夫。`,

'般若波羅蜜', `般若譯義是智慧，波羅蜜譯義是到彼岸，般若波羅蜜是說般若如船，能將眾生從生死的此岸，渡到不生不滅的涅槃彼岸。`,

'般若波羅蜜多|般若波羅蜜', `與般若波羅蜜同。`,

'般涅槃|涅槃', `簡稱涅槃。見涅槃條。`,

'般涅槃那|涅槃', `簡稱涅槃。見涅槃條。`,

'般舟三昧', `又名[[佛立三昧]]，意謂修此三昧而得成就的人，能見十方諸佛，立於其前。修的時候，不坐不臥，從早到晚，又由晚到天亮，不是走，就是立，以九十日為一期，專念阿彌陀佛的名號。`,

'衰相', `天人將要死時所出現的五種小衰相或五種大衰相。見五衰條。`,

'記別', `又作記倴，即佛預記弟子成佛的事。`,

'財施', `[[三施]]之一，即以財物救濟他人，其中有內財與外財的分別，外財是金銀、財寶、衣服、飲食、田地、房屋、妻妾、兒女、奴婢、牲畜等身外之物；內財是頭目、皮骨、牙髮、唇舌、手足、腦髓等我們身體上的東西。`,

'財供養', `三供養之一，即以世間的財寶去供養諸佛菩薩。`,

'貢高', `自以為高人一等。`,

'貢高我慢', `自以為高人一等，踞傲自矜，侮慢他人。`,

'起單', `僧人犯了規，職事命令他拿去衣單，離開寺廟。`,

'起業相', `六麤相之一，即依惑而造作種種的業。`,

'迷妄', `迷與妄。不明事理叫做迷，虛而無實叫做妄。`,

'迷律', `迷的道路，亦即走向三界六道的道路。`,

'迷情', `迷惑顛倒的有情。`,

'迷執', `迷惑和固執。`,

'迷界', `迷的境界，亦即為煩惱所繫縛而海轉於三界六道之中的眾生界。`,

'迷悟一如', `１．迷與悟都無自性，無自性即是空，大家空的體性一樣，故謂一如，這是空宗所顯的意義。<br>２．迷如冰，悟如水，迷悟同屬一體，叫做一如，這是性宗所顯的意義。`,

'迷悟因果', `迷與悟的因果。以[[四諦]]來說，迷妄的因是集諦，共果是苦諦；證悟的因是道諦，果是滅諦。`,

'追福', `為死人做功德，追薦祈福。`,

'追薦', `與追福同義。`,

'鬼', `[[六道]]眾生之一，有種種的分別，福報差的叫[[無財鬼]]，時常沒有得吃，所以也叫[[餓鬼]]；有些雖有飲食，但是不夠，叫[[少財鬼]]；有些福報大，常得飲食，叫[[多財鬼]]。`,

'鬼界', `鬼類的世界，為[[十界]]之一。`,

'鬼道', `[[六道]]之一，又名[[鬼趣]]，即[[夜叉]][[羅剎]][[餓鬼]]等的境土。`,

'鬼趣|鬼道', `又名[[鬼道]]，即鬼神所趣向的境土。`,

'鬼神', `１．鬼是[[六道]]眾生之一，神是[[天龍八部]]的通稱。２．有威的叫做鬼，有能的叫做神。`,

'鬼神食時', `鬼神的食時，即昏夜，為[[四食時]]之一。`,

'展轉食', `吃了一次正餐，移位再吃，叫做展轉食，佛制不許。`,

'浮塵根', `在[[五根]]中有浮塵根和淨色根之別，五根之外形，眼睛可以看到的，叫做浮塵根，因為它是虛浮之法。`
);


addTerms(11,

'假', `１．借的意思，諸法無實體，借他而有，故名假，如借五蘊而有眾生是。２．虛妄不實之義，諸法因緣和合而有，幻生幻滅，虛妄而無實體。`,

'假色', `無表色的別名。在色法之中，有些東西雖屬色法，但是沒有形質，叫做假色。`,

'假有', `虛假的有，指因緣和合而有的一切事物，因這些由因緣假合而有的一切事物，雖然如鏡中之花和水中之月一樣的無有實體，但是不能說它是無，而是屬於假有。`,

'假我', `指五蘊假合而有之我。凡夫把這種假我誤認為實我，只有悟了道的聖者才能徹底的明白這個我乃是因緣所生的假我。`,

'假法', `指因緣假和合而有的一切事物。`,

'假諦', `天台三諦之一。見三諦條。`,

'假觀', `天台三觀之一。見三觀條。`,

'假名', `１．虛假的名字。諸法本來無名，是人給它假設了一個名字，這個名字既虛假不實，而且不合實體，好像一個貧賤的人取了一個富貴的名字一樣。２．假名而有的意思。見假名有條。`,

'假名有', `[[三有]]之一，即假立了名字之後才有的意思，如色受想行識五蘊因緣和合假名為我，這個我其實是色受想行識，沒有我的自體，而是假立了名字之後才有我。`,

'假名世間', `[[三世間]]之一，又名[[眾生世間]]，或[[有情世間]]，因有情這名稱是在五蘊法上假立的名字，沒有有情的實體。`,

'假合', `眾緣假和合。因為因緣和合而有的一切事物，有合的時候，就有散的時候，所以說它是假和合。`,

'假合之身', `眾緣假和合而有之身。`,

'假和合', `因緣假和合。世間一切事物的存在，都非實有，只是因緣假和合而已。`,

'偈', `[[偈他]]的簡稱，華譯為[[頌]]，即一種略似於詩的有韻文辭，通常以四句為一偈。`,

'偈他|偈', `見偈條。`,

'偏小', `佛成道之後的十二年間所說的[[阿含經]]，大乘貶之為偏小，因為所說的道理偏向於空，法門比較狹小。`,

'偏空', `偏重於空，指小乘所說的空理。`,

'偏真', `又名單空，即小乘偏向於空的真理。`,

'偏執', `偏重於一邊的執著。`,

'偏圓', `偏與圓。偏是偏向於一邊；圓是圓融而無礙。`,

'偏袒', `１．袒露一臂。２．出家人穿袈裟，通常偏露一邊，如金剛經所說的偏袒右肩是。`,

'停心', `即[[五停心觀]]。`,

'偷盜', `[[十惡業]]之一，即不與而取。`,

'兜率', `華譯[[上足]]、[[妙足]]、[[知足]]、[[喜足]]等，謂於五欲境，知止滿足，為欲界六天中之第四天名，分內外二院，內院為彌勒菩薩的淨土，外院為天人享樂的地方。`,

'兜率天', `[[欲界]]第四層天之名，此天一晝夜，人間四百年，天壽四千歲，合人間五億七千六百萬年。有內外二院，外院為天人所居，內院為補處菩薩的住處，補處菩薩常由此天下生而成佛，今為彌勒菩薩的淨土。`,

'參禪', `[[參話頭]]，如參念佛是誰是。`,

'唯神', `外教稱上帝為神，謂一切皆由神所主宰。`,

'唯物', `[[唯物論]]為[[哲學]]上本體論的一派，與[[唯心論]]相反，認自然的本質，屬於物質及其運用，精神現象不外物質的作用。`,

'唯心', `又名[[唯識]]，謂世界上的一切事物都是由心識變現出來的。`,

'唯心淨土', `一切淨土都是由清淨的心識變現出來的。`,

'唯心法界', `謂所有的一切法，都是由自己的心造成的。`,

'唯識', `又名[[唯心]]，謂世間諸法，唯心識所現，因一切法皆不離心識，故名唯識。`,

'唯識宗', `依[[唯識論]]，明萬法唯識之理，故名唯識宗，因此宗乃究明萬法性相之宗，故又名[[法相宗]]。`,

'唯識觀', `[[唯識]][[三性觀]]的簡稱，三性者，[[遍計所執性]]、[[依他起性]]、[[圓成實性]]。`,

'唯識所變', `宇宙一切萬有都是由[[阿賴耶]]識所變現。`,

'唯識無境', `謂唯有心識，心識之外無一切物質現象，即今所謂之唯心論。`,

'唯境無識', `謂唯有一切物質現象，物質現象之外無心識的作用，即今所謂之唯物論。`,

'唯願無行', `只有大願而沒有實行。有願有行，才能修得道果，若是只有願而無行，是不能證得道果的。`,

'國土', `一切有情的住處，有淨土和穢土的分別。`,

'國土身', `[[華嚴經]]所說[[十身]]之一。毘盧舍那如來應眾生之機緣而現草木國土，故草木國土即舍那之身。`,

'國土世間', `[[三世間]]之一。國土是眾生所依所住的境界，既然有能依的身，當然就有所依的國土，而十界之所依，各各差別，是名國土世間。`,

'國王恩', `四恩之一。見四恩條。`,

'執', `執著而不捨的意思。`,

'執持', `堅持不變。`,

'執見', `堅持自己荒謬的見解。`,

'執著', `堅持或固執的意思。`,

'婆羅門', `[[婆羅賀摩拏]]的簡稱，為印度四姓之一，華譯[[外意]]、[[淨行]]、[[淨志]]、[[靜志]]等，是奉事大梵天王而修淨行的種族。`,

'婆羅門教', `古印度[[婆羅門]]種人專奉的教法，以[[大梵天]]神為主，以[[四圍陀論]]為經。`,

'婆羅提木叉', `華譯[[別解脫戒]]。`,

'淫', `[[十惡]]之一，即男女的交合。在五戒裡有正淫和邪淫的分別，正淫是指夫婦之淫，邪淫是指夫婦以外之淫，但在八戒裡就無正邪的分別，一切淫事，都在嚴禁之列。`,

'淫欲', `色欲。`,

'淫戒', `[[十重戒]]之一。見十重戒條。`,

'宿世', `過去世。`,

'宿因', `過去世所種下的善惡業因。`,

'宿作', `過去世的作業。`,

'宿習', `過去世的善惡習氣。`,

'宿善', `過去世所種下的善根。`,

'宿植', `過去世所植下的善根。`,

'宿報', `依過去世的業因而感得的果報。`,

'宿債', `過去世所負下的債。`,

'宿福', `過去世所種下的福德善根。`,

'宿緣', `過去世的因緣。`,

'宿願', `過去世的誓願。`,

'宿願力', `宿願的力量作用。`,

'宿命', `宿世的生命。佛說世人在過去世都有生命，或為天，或為人，或為餓鬼與畜生，輾轉輪迴，能知宿命者，謂之宿命通。`,

'宿命力', `如來[[十力]]之一。`,

'宿命明', `三明之一。見三明條。`,

'宿命通', `能知過去世生命與做過什麼事情的神通，為六神通之一。`,

'宿命智通', `即[[六通]]中之宿命通。能知宿世的事為智，智力自在無礙為通。`,

'寂', `又叫做滅，涅槃的別名。`,

'寂念', `寂靜的念慮，即禪定。`,

'寂常', `無煩惱叫做寂，無生滅叫做常，寂常就是涅槃的道理。`,

'寂種', `歡喜涅槃寂滅的種性，如聲聞緣覺乘之行人是。`,

'寂靜', `脫離一切之煩惱叫做寂，杜絕一切之苦患叫做靜，寂靜即涅槃的道理。`,

'寂然', `寂靜無事的狀態。`,

'寂然界', `二乘人所證得的涅槃境界。`,

'寂滅', `涅槃。`,

'寂滅相', `涅槃的境界不著一切之相，故云寂滅相。智度論說：「涅槃即是寂滅相。」`,

'寂滅無二', `涅槃離一切差別之相，故謂之寂滅無二。`,

'寂滅為樂', `生死是苦，寂滅即是樂。`,

'寂滅道場', `化身佛證有餘涅槃的道場，如釋尊在摩竭陀國伽耶山附近菩提迦耶菩提樹下之金剛座是。`,

'密印', `秘密的印契。印者，諸佛菩薩各有他們的本願和弘誓，為了標誌他們的本誓，故以兩手十指作出種種的形相，作為他們本誓的印契；密者，其理趣非常秘密深奧之義。`,

'密行', `外現羅漢相，內密菩薩行。在佛[[十大弟子]]之中，[[羅侯羅]]即以密行第一著稱。`,

'密法', `真言秘密的教法。`,

'密宗', `又名[[真言宗]]，此宗主張三密相應，所謂三密，即身語意三密，就是手結印，口念咒，意作觀想，靠三密加持，可以即身成佛。`,

'密咒', `秘密的神咒，即陀羅尼。`,

'密經', `密教的經典。`,

'密語', `秘密的言語，即密教的陀羅尼。`,

'密藏', `真言的經典。`,

'密教', `法身佛[[大日如來]]所說的內證真言教法，因其文其義，秘密難曉，故稱密教。又因是對未灌頂的人不許顯示的教法，故稱密教。`,

'常坐', `十二[[頭陀]]行之一。`,

'常住', `１．沒有生滅變遷的意思。楞伽經說常住之法有七種，即菩提、涅槃、真如、佛性、菴摩羅識、空如來識、大圓境智。<br>２．指寺院，因寺院是僧人常住的道場。`,

'常見', `二見之一。`,

'常身', `[[二佛身]]之一。`,

'常寂', `沒有生滅叫做常，沒有煩惱叫做寂。`,

'常寂光土', `[[四土]]之一。常者法身，法身永無生滅；寂者解脫，一切煩惱永寂；光者般若，照見諸相的智慧。此法身解脫般若三德，是諸佛的居處，故謂常寂光土。`,

'常行三昧', `時常修行念佛三昧。`,

'常行乞食', `十二[[頭陀]]行之一。`,

'常光一丈', `化身佛的身體時常都放一丈的光明。智度論說：「問云：如來何故常光一丈？答曰：今眾生薄福鈍根，目不堪其光故，若放多光，則失眼根，若眾生利根福重，佛則放無量光明。」`,

'常樂我淨', `１．即涅槃之四德。見四德條。２．即凡夫之四顛倒。見四倒條。`,

'常隨佛學', `[[普賢十願]]之一。`,

'常無常二身', `常身和無常身。見二身條。`,

'得度', `１．超脫生死而得涅槃的意思。２．落髮作沙彌。`,

'得通', `獲得神通。`,

'得道', `獲得道果。`,

'從空入假觀', `[[天台宗]]的觀法，菩薩先修空觀，了知諸法皆空，不墮執障；次觀諸法雖空，幻相歷然不無，因果業報不失，故能從空出假，作諸佛事，廣度眾生，是為從空入假觀。`,

'從假入空觀', `[[天台宗]]的觀法，謂菩薩先修假觀，了知幻相假有不實，終歸於空，不落執情，雖廣度眾生，而實無有眾生得滅度。`,

'悉地', `三密相應而成就妙果，梵語叫做悉地，故悉地是成就的意思。`,

'悉達多', `華譯[[一切義成]]，是[[釋迦佛|釋迦牟尼]]作淨飯王太子時的名字。`,

'捨', `１．捨施之義，如財施法施是。２．捨棄之義，如捨棄三毒煩惱，或捨棄怨親之心而一視同仁是。`,

'捨心', `捨棄一切而無所執著的心，為[[四無量心]]之一。`,

'捨受', `捨棄報身，即死的別名。`,

'捨戒', `捨棄戒律，不再持戒。`,

'捨覺支', `七覺支之一。見七覺支條。`,

'捨無量心', `四無量心之一。見四無量心條。`,

'授決|授記', `與授記同。見授記條。`,

'授記', `１．十二部經之一。<br>２．記名之義，佛對發大心的眾生預先記名，過了多少年代，在某處某國之中，成什麼佛。`,

'掉', `[[掉舉]]，一種令心高舉而不得安寧的煩惱。`,

'掉悔', `掉舉與後悔。這兩種心理，都能使人的心不得安寧和煩惱。`,

'掉散', `身口意三業不清淨，喜歡喧鬧，為[[五蓋]]之一。`,

'掛單', `僧人在寺院投宿。`,

'掛褡|掛單', `與[[掛單]]同。`,

'掛錫|掛單', `與[[掛單]]同。`,

'接善戒', `與攝善法戒同。見三聚戒條。`,

'接足作禮', `仰掌承接尊者的兩足而作禮。`,

'教', `聖人對世人的訓誨。`,

'教一', `[[法華四一]]之一。[[法華經|妙法蓮華]]所說的教法，是屬於一乘的教法，也是唯一能令人成佛的教法，故名教一。`,

'教化', `教訓勸化。`,

'教內', `[[禪宗]]以心傳心，不立文字的教法，叫做[[教外]]，其他佛的聲教，有文字可循的，都叫做教內。`,

'教主', `創立宗教的人，佛教的教主是釋迦牟尼佛。`,

'教判', `教相判釋的簡稱。判決[[釋迦佛|釋迦牟尼]]一代的教義，如[[天台]]的[[五時八教]]，[[法相]]的[[三時教]]，[[華嚴]]的[[五教]]等是。`,

'教法', `指佛所說的十二部經典，為四法之一。`,

'教典', `佛教的經典。`,

'教徒', `信奉宗教的人。`,

'教禪', `教與禪。`,

'教體', `[[釋迦佛|釋迦牟尼]]一代教法的本體。關於教體諸師所說有點不同，有人是以聲音為體，有人是以名句為體，有人是以真如為體。`,

'教外', `見教內條。`,

'教外別傳', `[[禪宗]]不施設文字，不安立言句，直傳佛祖心印，稱為教外別傳，意思是在如來言教之外的別傳。`,

'教行', `１．教法與修行。２．隨教法而修行。`,

'教行證', `教是教法，行是修行，證是證果。依佛的教法而修行，依修行而證悟聖果。`,

'教相', `分別判斷[[釋迦佛|釋迦牟尼]]一代的教義，如天台的五時八教，法相的三時教是。`,

'教相判釋', `見教判條。`,

'教理', `佛教所說的道理。`,

'教理行果', `[[教]]是佛陀的言教，[[理]]是教中所說的道理，[[行]]是順著道理而修行，[[果]]是由於修行而獲證道果。`,

'教觀', `教相與觀心。教相是依所立的宗義去分別判斷[[釋迦佛|釋迦牟尼]]一代的教義；觀心是觀念自己宗派所立的真理。如[[天台宗]]以五時八教為教相，以一心三觀為觀心；[[真言宗]]以顯密二教十住心為教相，以阿字不生為觀心。`,

'教觀二門', `教門與觀門。見教觀條。`,

'教令輪', `謂大日如來的教令很堅固，能夠摧破一切的怨敵，好像轉輪聖王的輪寶一樣。`,

'教誡輪', `三輪之一。見三輪條。`,

'教授師|教授阿闍梨', `五種阿闍梨之一，是專門教授弟子威儀，作法的軌範師。`,

'教授阿闍梨', `五種阿闍梨之一，又名教授師，即教授弟子們威儀作法的比丘。`,

'教授善知識', `三善知識之一。見善知識條。`,

'救世輪', `諸佛是救世的聖人，故其法輪稱為救世輪。`,

'救世圓通', `[[觀世音]]菩薩的別名。`,

'救世闡提|大悲闡提', `[[闡提]]是無善根不能成佛的人，而救世闡提卻是指慈悲無限，專做濟度眾生的大事業與不為自身成佛著想的大菩薩，這種人菩薩又名[[大悲闡提]]。`,

'曼殊|文殊師利', `[[文殊師利]]菩薩。`,

'曼殊師利|文殊師利', `菩薩名，即文殊師利菩薩。`,

'曼陀羅', `花名，華譯為[[適意花]]、[[悅意花]]、[[白花]]等。`,

'曼怛羅', `華譯[[真言]]、[[神咒]]、[[秘密語]]。`,

'曼荼羅', `華譯為[[輪轉圓滿具足]]、[[壇]]、[[道場]]等。向例在印度修法時，必須築壇，壇中安置佛像以祭供，後來把修法時所築的壇及佛像，繪成圖案，也叫做曼荼羅。`,

'曼荼羅教', `[[真言教]]的別名。`,

'梵', `清淨的意思。`,

'梵心', `修梵行的心。`,

'梵行', `清淨的行為，也就是斷絕淫欲的行為。修梵行的人死後可生於梵天。`,

'梵志', `１．志求生於梵天的人。２．在家的婆羅門。３．指一切外道出家人。`,

'梵宇', `佛寺的別稱。`,

'梵典', `佛教的經典。`,

'梵服', `[[袈裟]]的別名。`,

'梵界', `[[梵天]]的世界，亦即[[色界]]之初禪天。`,

'梵福', `大梵天的福德，為[[二福]]之一。`,

'梵語', `印度語。古印度人認為自己所說的語言，乃是稟承[[大梵天王]]所說而來的，故稱梵語。`,

'梵輪', `法輪的別名。`,

'梵魔', `梵是指色界初禪天的天主，亦即梵王；魔是指欲界第六天的天主，亦即他化自在天。`,

'梵天', `[[色界]]之[[初禪天]]名。因此天無欲界的淫欲，寂靜清淨，故名梵天。此天共有三天，即梵眾天、梵輔天、大梵天，通常所說的梵天是指大梵天王，名叫尸棄，他深信正法，每逢有佛出世，必定前來請轉法輪，此梵天與外道所說的梵天不同。`,

'梵天王', `[[色界]]之[[初禪天]]，有梵眾、梵輔、大梵等三天，其中[[大梵天]]叫做梵天王，名字叫做[[尸棄]]。`,

'梵王|大梵天王', `[[大梵天王]]的簡稱。`,

'梵王宮', `[[大梵天王]]所住的宮殿。`,

'梵音', `１．指佛的聲音，佛的聲音有五種清淨相，即正直、和雅、清徹、清滿、周遍遠聞，為佛三十二相之一。<br>２．指讀經的聲音。`,

'梵音相', `[[三十二相]]中之梵音深遠相。`,

'梵眾', `修習梵行的大眾，即僧侶。`,

'梵眾天', `[[色界]]初禪天的天人，分為三等，下等的天人即叫做梵眾天。`,

'梵釋', `[[梵天]]與[[帝釋天]]。總稱色界諸天為梵天；欲界忉利天之天主叫做帝釋。`,

'梵釋四天', `[[梵天]]、[[帝釋天]]、[[四王天]]。`,

'梵世界', `又名[[梵世天]]，是[[色界]]諸天的總稱。`,

'梵迦夷', `華譯[[淨身]]，即[[色界]][[初禪天]]的通名。`,

'梵富樓', `[[色界]][[初禪]]的第二天名，亦即[[梵輔天]]。`,

'梵網戒', `[[梵網經]]所說的十重禁四十八輕戒。`,

'梵輔天', `[[色界]]初禪三天中之第二天名。`,

'欲', `能引起人們貪愛的心。`,

'欲有', `欲界的業因果報實有，為[[三有]]之一。`,

'欲取', `貪欲的心取著五塵的境界，為[[四取]]之一。`,

'欲染', `五欲能污染真性。`,

'欲流', `四流之一。見四流條。`,

'欲想', `[[三惡想]]之一，即貪愛五欲的意思。`,

'欲愛', `１．對五欲的貪愛。２．欲界眾生的貪愛。`,

'欲塵', `１．謂五欲能污染身心如塵埃。２．欲者六欲，塵者五塵。`,

'欲漏', `三漏之一。見三漏條。`,

'欲天', `[[欲界]]的諸天。欲界共有六天，即[[四天王天]]、[[忉利天]]、[[夜摩天|夜摩]]、[[睹史多天]]、[[樂變化天]]、[[他化自在天]]，因共有六重，故又名為[[六欲天]]。`,

'欲天五淫', `欲界諸天的男女的淫事共有五種，即[[四天王天]]與[[忉利天]]的眾生，其淫事與人間無異，[[夜摩天|夜摩]]則以勾抱成淫，[[睹史多天]]則以執手成淫，[[樂化天|樂變化天]]則以對笑成淫，[[他化天|他化自在天]]則以相視成淫。`,

'欲界', `[[三界]]之一，即有色欲與食欲的眾生所住的世界，上自六欲天，中至人界的四大部洲，下至八大地獄等，都屬於欲界的範圍。`,

'欲界三欲', `[[食欲]]、[[睡眠欲]]、[[淫欲]]。`,

'欲界散地', `在[[三界]]之中，色界和無色界的有情具有定心，只有欲界的有情沒有定心，所以[[色界]]和[[無色界]]叫做[[定地]]，欲界則叫做散地。`,

'欲界五趣地', `又名[[五趣雜居地]]，即[[地獄]]、[[餓鬼]]、[[畜生]]、[[人]]、[[天]]等五趣，因其皆有欲，故合為一地。`,

'欲無減', `[[十八不共佛法]]之一。`,

'欲色二界', `[[三界]]中的[[欲界]]和[[色界]]。`,

'欲如意足', `四如意足之一。見四如意足條。`,

'殺', `殺害生命。`,

'殺業', `殺害有情的惡業，為十惡業之一。`,

'殺生', `殺害人畜等一切有情的生命，為十惡業之一。`,

'殺生戒', `防止殺害生命的戒律。`,

'淨心', `自性清淨心。`,

'淨因', `修往生西方極樂世界的業叫淨業，淨因就是修這種淨業的因。`,

'淨妙', `清淨美妙。`,

'淨佛', `究竟的真佛。`,

'淨住', `寺的十種名稱之一。`,

'淨戒', `清淨的戒行。`,

'淨邦', `淨土。`,

'淨宗', `[[淨土宗]]的簡稱。`,

'淨剎', `清淨的佛剎。`,

'淨命', `１．清淨的生活，如比丘離四種的邪命而生活是，亦即八正道中之正命。<br>２．以清淨之心為生命。`,

'淨施', `二種布施之一。`,

'淨域', `諸佛的淨土。`,

'淨德', `四德之一。見四德條。`,

'淨髮', `僧人剃頭。僧人例必每半個月要淨髮一次。`,

'淨觀', `清淨的觀法，如淨土之十六觀是。`,

'淨業', `１．清淨的善業。２．修往生淨土的事業。`,

'淨業正因', `[[觀無量壽經]]說修淨業正主的因有三種，第一種是孝養父母、奉事師長、慈心不殺、修十善業；第二種是受持三歸、具足眾戒、不犯威儀；第三種是發菩提心、深信因果、讀誦大乘、勸進行者。`,

'淨土', `聖人所住的國土，因這種國土沒有五濁的垢染，所以叫做淨土。`,

'淨土宗', `又名[[蓮宗]]，或[[念佛宗]]，以普賢菩薩為初祖，主張念佛往生西方極樂世界。`,

'淨土七經', `[[淨土宗]]所依持的七部經典，即[[無量清淨平等覺經]]、[[大阿彌陀經]]、[[無量壽經]]、[[觀無量壽經]]、[[阿彌陀經]]、[[稱讚淨土佛攝受經]]、[[鼓音聲三陀羅尼經]]。`,

'淨土三部經', `見三部經條。`,

'淨名', `見淨名居士條。`,

'淨名居士', `[[維摩詰居士]]。維摩詰華譯即是[[淨名]]。`,

'淨眼', `清淨的法眼。`,

'淨眼三昧', `一心觀想梵釋諸天的清淨身體，叫做淨眼三昧。`,

'淨法界', `又名清淨法界，即真如的境界。`,

'淨居天', `在[[色界]][[四禪]]之最高處，有五重天，為證得不還果的聖者所生之處，因無外道雜居，故名淨居。這五重天是[[無煩天]]、[[無熱天]]、[[善現天]]、[[善見天]]、[[色究竟天]]。`,

'淨色根', `又叫做[[勝義根]]，乃五根的實體，依之則有發識取境的作用，為四大種所成，今所謂之神經，彷彿似之。`,

'淨飯王', `古印度迦毘羅衛國的國王，亦即釋尊的父親。`,

'淨琉璃淨土', `[[藥師琉璃光]]如來所住的國土，在東方。`,

'淨琉璃世界', `[[藥師如來]]的淨土。`,

'淨口業真言', `即「<verse>修唎修唎，摩訶修唎，修修唎，薩婆訶。</verse>」十四字。`,

'深心', `１．求法之心很深重。２．志求高深佛果的心。３．深信佛的本願，毫不懷疑。`,

'深妙', `甚深微妙。`,

'深經', `宣說諸法實相甚深妙理之大乘經典的通稱。`,

'深行', `深秘的行業，亦即初地以上的行業。`,

'深行阿闍梨', `稱初地以上證悟真理與大日如來同位的阿闍梨。`,

'深法', `甚深微妙之法。`,

'深法忍', `甚深的法忍。法忍有三忍五忍十忍等種種深淺的差別。`,

'深禪定', `深妙的禪定。`,

'深總持', `深妙的總持。總持即陀羅尼（咒）。`,

'清齋', `清淨的持齋。`,

'清淨', `１．離惡行的過失，斷煩惱的垢染，叫做清淨，這是障盡解脫的離垢清淨。<br>２．指超諸善惡無對待的清淨，這是性淨解脫的自性清淨。`,

'清淨土', `依淨業所感得的清淨國土。`,

'清淨心', `１．無疑的信心。２．無垢的淨心。３．不雜煩惱的心。`,

'清淨識', `第九[[菴摩羅識]]。`,

'清淨智', `無漏智。`,

'清淨施', `布施時心無分別，平等而施。`,

'清淨法界', `佛所證得的真如境界。`,

'清淨法眼', `清淨的法眼。法眼是五眼之一。`,

'清淨覺相', `正覺的真相。正覺的理體諸染污，故云清淨。`,

'清淨覺海', `（喻）清淨的本覺，深廣如海。`,

'清淨涅槃', `二涅槃或三涅槃之一。`,

'清淨業處', `憑著純善的業因所生之處，亦即淨妙的佛土。`,

'清信士', `受三歸五戒並具有清淨信心的男子，梵語叫做優婆塞。`,

'清信女', `受三歸五戒並具有清淨信心的女子，梵語叫做優婆夷。`,

'清涼地', `（喻）涅槃的境界，因涅槃的境界沒有熱惱。`,

'清涼三昧', `斷除一切憎恨與恩愛的念頭以使身心清涼的三昧。`,

'清涼國師', `[[華嚴宗]]第四祖澄觀，居五台山清涼寺，唐德宗誕辰，講經內殿，以妙法清涼帝心，賜號為清涼國師。`,

'牽引因', `[[十因]]之一。`,

'現世', `現在世。`,

'現生', `現在的生命。與現世同。`,

'現成', `[[禪宗]]的話，是自然已有與不假造作安排的意思，與[[天台宗]]所說的當體即是同義。`,

'現劫', `現在的劫，即[[賢劫]]。`,

'現量', `三量之一。見三量條。`,

'現當', `現在與當來。`,

'現識', `[[阿賴耶]]識的別名，因一切諸法皆依阿賴耶識而顯現，故名。`,

'現證', `現世證悟妙果。`,

'現行', `現行法的簡稱，阿賴耶識，有生一切法的功能，謂之種子，由此種子，生色心之法，現苦樂境界，謂之現行。`,

'現行法', `簡稱現行。見現行條。`,

'現前', `顯現於眼前。`,

'現前地', `菩薩[[十地]]之第六地名。真如本性顯現之位，亦是最勝般若顯現之位。`,

'現前授記', `四種授記之一。見四種授記條。`,

'現在世', `[[三世]]之一。`,

'現在五果', `[[十二因緣]]中，[[識]]、[[名色]]、[[六入]]、[[觸]]、[[受]]等為現在五果，因為它們是依著過去無明與業的因而顯現的五種現在果報。`,

'現身說法', `１．佛菩薩神通廣大，能現種種之身向人說法。２．借己身做例子來勸人。`,

'理', `理性，亦即萬有永恒不變的真體。見理事條。`,

'理入', `二入之一。見二入條。`,

'理性', `萬有永恆不變的真體。`,

'理和', `僧伽有理和和事和二義，生活在一起的僧伽，沒有身口意三業的乖角，叫做事和，大家共同破除見思二惑，同證無為的真理，叫做理和。`,

'理修', `依真理而修，如將所作善事，以三輪體空作觀，不著人、我、法相是。`,

'理教', `[[天台宗]]立四教，通教為界內之理教，圓教為界外之理教。`,

'理智', `１．理是指所觀察的道理，智是指能觀察的智慧，理與智合一，便叫做覺悟。２．有漏智叫做事智，無漏智叫做理智。`,

'理惑', `１．道理上的迷惑錯誤，如迷惑於四諦的道理是。２．根本無明之惑，能障礙和覆蔽中道的道理，而使中道的道理不能顯發，叫做理惑。`,

'理障', `邪見能礙正知見，障大菩提，名理障，為二障之一。`,

'理論', `以千差萬別之事相作討論，叫做事論，若以平等之理體作討論，即叫做理論。`,

'理禪', `事理二禪之一。有漏定是事禪，無漏定即理禪。`,

'理證', `１．事理二證之一，即思想道理而得證悟的意思。２．教理二證之一，即舉出佛陀的聖教來做憑證。`,

'理懺', `懺悔有事懺和理懺二種，事懺是身口意都依照法度，對著佛相披陳過錯，理懺則是觀一切法無有自性，消滅罪福之相。`,

'理觀', `１．對於道理的觀念。２．事理二觀之一。見二觀條。`,

'理佛', `１．法身的別名。佛三身中報化二佛為事佛，法身佛為理佛。２．指[[天台宗]]所立六即佛中之理即佛。一切眾生皆具佛性，與佛無異，是為理佛，又名素法身，即僅有法身之理體而無功德莊嚴之義。`,

'理體', `萬有之本體。與理性同義。`,

'理體三寶', `一切眾生，皆有佛性，即佛寶，佛性中，具足一切淨法，即法寶，無違諍義，即僧寶，此名理體三寶。`,

'理即', `見六即條。`,

'理即佛', `見六即條。`,

'理事', `理與事。理指真諦，事指俗諦，亦即無為的真體為理，有為的形相為事。`,

'理事無礙觀', `[[華嚴宗]]所立[[三觀]]之一。真如的理性能生萬法，故萬法就是真如，好像水就是波，波也就是水一樣，這樣作觀，叫做理事無礙觀。`,

'理事無礙法界', `四法界之一。與[[理事無礙觀]]同。`,

'理具', `[[天台宗]]有理具和事造的名稱，法性的理體，本來具足三千之諸法，為理具，依緣而生起，為事造。`,

'理具三千', `謂宇宙萬有一一悉具三千之諸法。`,

'理法身', `二法身之一。見二法身條。`,

'理法界', `四法界之一。見四法界條。`,

'畢竟空', `一切有為諸法的體性畢竟空寂。`,

'畢竟依', `佛的德號，因佛是一切眾生究竟的依處。`,

'畢竟無', `指理性與事相都畢竟空無的事物，如龜毛兔角，就是畢竟空無的事物。畢竟無與畢竟空不同，畢竟空的空是指性空，其外相宛然存在。`,

'畢竟覺', `佛的覺悟。與無上覺同義。`,

'眼入', `十二入之一。見十二入條。`,

'眼根', `六根之一。見六根條。`,

'眼識', `六識之一。見六識條。`,

'第一乘', `[[大乘]]的別名。`,

'第一義', `至高無上的真理。`,

'第一義空', `指大乘至極的涅槃，因大乘的涅槃與小乘的涅槃不同，小乘的涅槃偏真但空，大乘則連空亦空，為中道實相之空，故名第一義。`,

'第一義諦', `二諦之一，又名真諦、聖諦、勝義諦、涅槃、真如、實相、中道、法界、真空等，是深妙的真理的意思。`,

'第一義觀', `[[天台]][[三觀]]中中觀的別名。`,

'第一結集', `見結集條。`,

'第一時教', `三時教之第一。見三時教條。`,

'第二果', `小乘四果中之第二果，即一來果。`,

'第二禪', `色界四禪天中之第二禪天。劫末之大水災，到此為止。`,

'第二時教', `見三時教條。`,

'第二結集', `見結集條。`,

'第二能變', `末那識的別名。把八識分為三種，第八阿賴耶識為初能變，第七末那識為第二能變，其餘六識為第三能變。心識對於所變之境叫做能變。`,

'第三地', `把見諦以上的菩薩的階位分為十地，第三地就是發光地。`,

'第三果', `小乘四果中之第三果，即不還果。`,

'第三禪', `色界四禪天中之第三禪天，此中共有三天，即少淨天、無量淨天、遍淨天。`,

'第三時教', `見三時教條。`,

'第三結集', `見結集條。`,

'第三能變', `眼等六識的別名。`,

'第四禪', `色界四禪天中之第四天，也就是色界之最高處。`,

'第四結集', `見結集條。`,

'第五大', `一切色法只有地水火風四大，四大之外，無第五大，第五大者，有名無實的意思。`,

'第六天', `[[欲界]]天共有六重，[[他化自在天]]位於第六，故名第六天。`,

'第六陰', `五陰之外，無第六陰，第六陰者，有名無實的意思。`,

'第六識', `即[[意識]]。`,

'第六意識', `八識中意識居於第六，故名第六意識。`,

'第七識', `又名[[末那識]]，為我法二執的根本。`,

'第八識', `即[[阿賴耶識]]，華譯為[[藏識]]，因它能含藏諸法的種子。`,

'細色', `謂男女喜歡微妙的容色。`,

'細滑欲', `六欲之一。見六欲條。`,

'惛沉', `心思糊塗。`,

'終教', `賢首五教之一。見五教條。`,

'習性', `又名習種性，即以前研習所修成的性。`,

'習氣', `壞習慣。`,

'習種性', `從前研習所修成的性。`,

'莊嚴', `１．裝飾的意思。２．莊美威嚴。`,

'莊嚴劫', `在三世的三大劫中，過去的大劫叫做莊嚴劫。在任何一大劫中，都有成住壞空的八十增小劫，在住劫的二十小劫中有千佛出世，[[華光佛]]最先，[[毘舍浮佛|毘舍浮]]最後，因有千佛出世以莊嚴其劫，故名莊嚴劫。`,

'袈裟', `比丘的法衣，有不正色壞色染色等意義，因為出家比丘所穿的法衣，都要染成濁色，故袈裟是依染色而立名的。又因其形狀為許多長方形割截的小布塊縫合而成，有如田畔，故又名割截衣或田相衣，亦稱福田衣。有大中小三件，大者名僧伽梨又名九條大衣，中者名鬱多羅又名七條衣，小者名安陀會又名五條衣。`,

'袈裟五德', `[[悲華經]]中說，[[釋迦佛|釋迦牟尼]]以前在[[寶藏佛]]之前，誓已成佛時袈裟有五德，即一、或犯重邪見之四眾，以一念敬心尊重袈裟，必於三乘受記；二、天龍人鬼若敬袈裟少分即得三乘不退；三、若鬼神諸人得袈裟少分乃至四寸，則飲食充足；四、眾生共違反，念袈裟便生悲心；五、若在兵陳持此少分，恭敬尊重，常得勝他。`,

'袈裟十利', `一、覆身離羞恥而具慚愧；二、離寒熱蚊蟲；三、示沙門之相，見者歡喜，離邪心；四、是人天寶幢相，生梵天之福；五、著之時，生寶塔想，滅諸罪；六、壞色，生不貪欲；七、袈裟是佛淨衣，永斷煩惱而得良田；八、消罪而生十善；九、如良田，能增長菩提之芽；十、如甲胄，煩惱之毒箭不能害。`,

'袈裟十二名', `[[袈裟]]、[[道服]]（修道者的衣服）、[[出世服]]（出離世俗者的衣服）、[[法衣]]（如法的衣服）、[[離塵服]]（遠離六塵者的衣服）、[[消瘦服]]（此服有損消煩惱的功德）、[[蓮花服]]（離染著猶如蓮華）、[[間色服]]（用不正之間色縫製而避開五正色）、[[慈悲服]]（行慈悲者的衣服）、[[福田衣]]（袈裟的條相，等於世間的田疇，且其功德為世間之福田而應受供養）、[[臥具]]（與被褥相似）、[[敷具]]（臥具的意思）。`,

'貪', `多求無厭的意思。`,

'貪毒', `三毒之一。見三毒條。`,

'貪使', `十使之一。見十使條。`,

'貪結', `五結之一。見五結條。`,

'貪著', `多求而無厭叫做貪，貪心很堅固叫著著。`,

'貪愛', `對五欲貪著愛著。貪與愛同體異名。`,

'貪欲', `貪愛五欲。`,

'貪欲使', `十使之一。見十使條。`,

'貪欲蓋', `五蓋之一。見五蓋條。`,

'貪欲瞋恚愚痴', `即[[三毒]]。`,

'貪恚痴|貪瞋痴', `與[[貪瞋痴]]同。`,

'貪瞋痴', `又名[[三毒]]。貪是貪欲，瞋是瞋恚，痴是愚痴。`,

'通', `作用自在無礙的意思，指通力、神通。通有三種，即一、報得通力，三界諸天都有五種的神通，乃至鬼神也有小神通，這些神通都是依靠果報而自然感得；二、修得通力，三乘聖人修習三學而得六通，外道仙人修禪定也能得五通；三、變化通力，三乘聖人以神通的力量變現種種的境界事物。`,

'通力', `神通或業通的力量。佛菩薩與外道仙人所得的是神通，有五通六通之別，鬼神及狐狸所得的是業通，因鬼神與狐狸是靠他們自己的業力而得，有三通力。`,

'通受', `大乘的受戒有二種方法，通受三聚淨戒為通受，別受別解脫戒為別受。通受在佛前自誓便可，別受則須三師七證，行羯磨之法始得戒。`,

'通戒', `１．又名略戒，如「諸惡莫作，眾善奉行，自淨其意，是諸佛教」等偈頌是，因它不但是過去七佛之所通說，而且也是通於一切大小乘的戒經。２．即三聚淨戒。見三聚淨戒條。`,

'通序', `諸經開頭有通別二序，如是我聞等是共通於諸經的序說，叫做通序，通序之後是序說這一部經講說的緣起，叫做[[別序]]。`,

'通途', `通常的途徑或方法。`,

'通惑', `[[天台]]所立[[五惑]]中，見思二惑叫做通惑，塵沙無明二惑叫做別惑。`,

'通慧', `１．神通與智慧。２．一切的神通皆以智慧為體，故名通慧，意即通就是慧。`,

'通教', `共通的教法，為[[天台]]所立[[化法四教]]之第二。三乘人的根器雖然人人不同，但是卻有許多共通的特性，諸如通觀無生，同證無學，同出分段生死，同入涅槃的化城等等，故稱通教。`,

'通教十地', `見十地條。`,

'通念佛', `稱念通三世諸佛之名號。`,

'通明禪', `能發六通三明之禪法。`,

'通明慧', `[[六通]][[三明]]及[[三慧]]。`,

'通別二序', `通序與別序，見二序條。`,

'琉璃', `一種青色的寶物。`,

'曹溪', `[[禪宗]]六祖惠能，在廣東韶州府曹溪，說法渡生，後人遂把曹溪代表六祖。`,

'閉關', `閉門修養道業。`,

'陰', `１．蔭覆之義，指色聲等之有為法蔭覆真理。２．積聚之義，謂色聲等之有為法積聚生死之苦果。`,

'陰界', `[[五陰]]與[[十八界]]。`,

'陰藏', `佛的陰莖藏於腹中，為[[三十二相]]之一。`,

'陰魔', `五陰能毒害眾生的佛性，故喻之為魔。`,

'陰入界', `[[五陰]]、[[十二入]]、[[十八界]]。`,

'雪山', `喜馬拉雅山。`,

'雪山部', `小乘二十部之一。`,

'頂位', `見頂法條。`,

'頂法', `又名頂位，四善根之一。見四善根條。`,

'頂相', `如來的頭頂上有肉髻，一切人天不能見，故名無見頂相，為三十二相之一。`,

'頂禮', `頭頂著地禮拜於尊者之前，是一種最敬禮節。`,

'頂光', `佛菩薩頭頂上的圓光。`,

'頂光化佛', `佛頭頂上圓光所變化出來的佛。`,

'鹿車', `三車之一。見三車條。`,

'鹿苑', `鹿野苑的簡稱。`,

'鹿苑時', `[[天台宗]]所立[[五時]]之一。佛在菩提樹下說華嚴經之後，便到波羅奈國的鹿野苑對五比丘說阿含經，這是小乘三藏教之始，也是世人所說的鹿苑時。`,

'鹿野苑', `地名，在中印度的[[波羅奈國]]，是佛最初說[[四諦]]法度五比丘的地方。`,

'梁皇懺', `梁武帝為了亡后郗氏墮落蟒蛇身，乃作慈悲道場懺法十卷，請僧禮懺，以便超度，後世因名之為梁皇懺。`,

'野狐身', `見百丈野狐條。`
);


addTerms(12,

'惠能', `人名，為[[禪宗]]第六祖。六祖降生時，有異僧到他家中拜訪說：「夜來生兒，可名惠能！」惠能的父親叩問其義，僧說：「惠者，惠施眾生；能者，能作佛事。」言畢，飄然而去，此是六祖得名的由來。`,

'絕待', `絕諸對待。對待是兩方並峙的意思，如黑白、大小、善惡等是。絕待是真如平等，無法可得，故絕諸對待，簡稱絕待。`,

'童子', `經中常稱[[菩薩]]為童子，一因菩薩是法王之真子，二因無淫欲之念猶如世間之童子，並非指年幼為童子。`,

'傍生|畜生', `又作[[旁生]]，即[[畜生]]，旁者不正之義，言彼因行不正，故得不正之生。`,

'傍生趣', `[[五趣]]之一。`,

'勝因', `殊勝的善因。`,

'勝行', `指波羅蜜多的行法。`,

'勝果', `殊勝之果，即佛果。聲聞緣覺之果不圓滿，雖然是果但非勝，菩薩十地之法尚未圓滿，故雖勝而非果，只有佛果才是最究竟圓滿之果，所以稱為勝果。`,

'勝乘', `[[大乘]]的別名。`,

'勝處', `見[[八勝處]]與[[八背捨]]條。`,

'勝業', `殊勝的行業。`,

'勝義', `義理非常微妙的意思。`,

'勝義空', `勝義就是涅槃，勝義空就是涅槃微妙的空性，為[[十八空]]之一。`,

'勝義法', `指涅槃。`,

'勝義僧', `四種僧之一。`,

'勝義諦', `[[法相宗]]所立二諦之一，即[[真諦]]。`,

'善力', `１．修善的力量，２．由善而得的力量。`,

'善月', `指正五九之三長齋月，因這三個月是極宜特別修善之故。`,

'善巧', `各種巧妙的度人方法。`,

'善因', `招感善果的業因。`,

'善劫', `賢劫的別名。`,

'善法', `合理益世之法，如五戒十善是世間的善法，三學六度是出世間的善法。`,

'善果', `好的果報。`,

'善根', `好的根性。`,

'善神', `八部眾中護持正法的神。`,

'善業', `好的行為或造作，如五戒十善等善事是。`,

'善惡', `合於理的叫做善；乖於理的叫做惡。`,

'善惡無記三性', `[[善性]]、[[惡性]]、[[無記性]]。見三性條。`,

'善心', `很良善的心。`,

'善心所', `[[百法|五位百法]]中的[[心所有法]]，簡稱[[心所]]。有的心所，起此念，則今世他世，皆受其益，故名為善。善心所有十一種，即[[信]]、[[精進]]、[[慚]]、[[愧]]、[[無貪]]、[[無瞋]]、[[無痴]]、[[輕安]]、[[不放逸]]、[[行捨]]、[[不害]]。若[[五識心王]]任運起善，則此十一善心所，皆與之相應。`,

'善現', `[[須菩提]]的譯名。`,

'善現天', `[[五淨居天]]之第三天名，在色界之第四禪，因有善妙的果報顯現，故名善現。`,

'善逝', `[[如來十號]]之一，善是好，逝是去，佛修正道，入涅槃，向好的去處而去，故號善逝。`,

'善逝子', `大日如來。`,

'善士女', `歸依三寶並且受持五戒的在家信女。`,

'善見城', `又名[[喜見城]]，是[[帝釋]]天的宮城，在[[須彌山]]的絕頂。`,

'善男子', `佛稱呼信佛的男子為善男子。`,

'善女人', `佛稱呼信佛的女子為善女人。`,

'善知識', `能教眾生遠離惡法修行善法的人。`,

'善宿女', `受持八戒的女居士。`,

'善宿男', `受持八戒的男居士。`,

'善慧地', `[[菩薩十地]]中之第九地。`,

'善施長者', `即[[須達長者]]。`,

'喜受', `五受之一。見五受條。`,

'喜捨', `喜施財寶。`,

'喜樂', `五受之一。見五受條。`,

'喜見城', `[[忉利天]]主[[帝釋]]所住的宮城，在[[須彌山]]的絕頂。`,

'喜見天', `[[三十三天]]。`,

'喇嘛', `蒙古青海西藏等處叫和尚為喇嘛。`,

'喇嘛教', `佛教的一派，唐時自印度傳入西藏，至今有新舊兩派，新教著黃衣，稱為黃教，舊教著紅衣，稱為紅教。`,

'堪忍', `堪能忍受苦難，是梵語[[娑婆]]的譯義。`,

'堪忍地', `[[菩薩十地]]中[[初地]]的別名。`,

'報土', `四土之一。見四土條。`,

'報生', `依果報而生。`,

'報因', `產生果報的業因。`,

'報佛', `與報身佛同。見三佛條。`,

'報身', `[[佛三身]]之一，此身是諸佛修福慧功德圓滿時，所顯現的自受用內證法樂之身，亦即完成佛果之身。`,

'報得', `依果報自然而得。`,

'報通', `[[五種神通]]之一。`,

'報障', `三障之一。見三障條。`,

'報恩', `報答恩德。`,

'報恩田', `三福田之一。見三福田條。`,

'富樓那', `佛[[十大弟子]]之一，以說法第一著稱。`,

'寒山', `僧名，在唐朝與[[拾得]]大師隱居於天台山的國清寺，相傳寒山是文殊的化身，拾得是普賢的化身。`,

'寒冰地獄', `十六[[遊增地獄]]之一。`,

'尊者', `１．智德具尊的人。２．阿羅漢的尊稱。`,

'尊儀', `尊貴的儀容，指佛菩薩的相貌。`,

'尊特', `尊貴特別。`,

'尊特身', `尊貴特別的身體，指佛的報身。`,

'尋伺', `尋與伺。尋是尋求各種的事理，是一種粗相的動心；伺是伺察各種的事理，是一種細相的動心。`,

'強緣', `強力的因緣。`,

'遍計', `普遍計度一切的事物。`,

'遍照', `普遍照耀，指法身的光明。`,

'遍照金剛', `[[大日如來]]的密號。`,

'遍依圓三性', `見三性條。`,

'悲', `同情救拔他人痛苦的心。`,

'悲田', `三福田之一。見三福田條。`,

'悲門', `見悲智條。`,

'悲智', `[[慈悲]]與[[智慧]]，是佛菩薩所必備的二種德性，也叫做悲智二門。智是上求菩提，屬於自利；悲是下化眾生，屬於利他。`,

'悲智圓滿', `慈悲與智慧皆具足圓滿。`,

'悲無量心', `四無量心之一。見四無量心條。`,

'悲願金剛', `地藏菩薩的密號。`,

'惑', `迷惑錯誤，是貪瞋痴等煩惱的總稱。`,

'惑染', `煩惱能使身心污染不淨。`,

'惑障', `四障之一。見四障條。`,

'惑業苦', `貪瞋痴等煩惱叫做惑，因惑而造作種種的善惡業，因業而招感無數的生死和痛苦。經云：「因惑造業，因業受苦。」`,

'惡', `不合於情理的思想行為。`,

'惡口', `以惡毒的話罵人，是十惡之一。`,

'惡因', `招感惡果的業因。`,

'惡行', `惡劣的行為。`,

'惡見', `惡劣的見解，即我見、邊見、邪見、見取見、戒禁取見等五種。`,

'惡性', `三性之一。見三性條。`,

'惡果', `惡劣的果報。`,

'惡報', `惡劣的報因。`,

'惡道', `順著惡行而趣向的道途，如地獄、餓鬼、畜生等三惡道是。`,

'惡業', `惡劣的行為或作業。`,

'惡趣', `種惡因得惡果所趣向之處，與惡道同義。`,

'惡緣', `引誘人們做壞事的外界事物。`,

'惡露', `吾人身體中不淨的津液，如膿血大小便等是。`,

'惡覺', `惡劣的思想。`,

'惡魔', `障礙佛道的惡神。`,

'惡取空', `撥無因果的道理而說彼此皆空。[[止觀]]說：「<verse>寧起我見如須彌山，不惡取空。</verse>」`,

'惡知識', `教我做惡事的壞師友。`,

'惡鬼神', `指[[夜叉]][[羅剎]]等鬼神。`,

'散心', `１．散亂的心。２．放逸的心。`,

'散地', `指具散亂心的眾生所住的地方，即欲界。`,

'散善', `由散亂心所修的善。`,

'散業', `由散亂心所造的善業。`,

'普法', `法界諸法，一具一切，普遍圓融，叫做普法。`,

'普度', `普遍濟度。`,

'普眼', `普遍觀察一切眾生的眼，亦即觀世音的慈眼。`,

'普禮', `普遍敬禮一切如來。`,

'普賢', `菩薩名，於佛教四大菩薩中，以大行著稱。`,

'普賢十願', `[[普賢]]菩薩的十大行願，即[[敬禮諸佛]]、[[稱讚如來]]、[[廣修供養]]、[[懺悔業障]]、[[隨喜功德]]、[[請轉法輪]]、[[請佛住世]]、[[常隨佛學]]、[[恆順眾生]]、[[普皆迴向]]。`,

'智', `深明事理的智慧。`,

'智母|覺母', `智慧之母。與覺母同義。`,

'智光', `智慧的光芒。`,

'智果', `涅槃為斷果，菩提為智果。`,

'智門', `佛教有智悲二門，凡是自利的德行叫做智門，一切利他的德行叫做悲門。`,

'智度', `[[六度]]之一，即[[般若波羅蜜]]。`,

'智者', `[[天台]]大師[[智顗]]的德號。`,

'智旭', `人名，字[[蕅益]]，自號八不道人，初學儒，作闢佛論數十篇，十七歲閱蓮池大師著作後，取論燒掉，後來出家入徑山參禪，融會性相二宗，扶戒律，修淨土，著淨土十要，作願文，及求生淨土偈，寂年五十七。`,

'智海', `智慧廣大如海。`,

'智眼', `智慧之眼，能徹見真理。`,

'智智', `智中之智，亦即佛之一切智。`,

'智德', `１．諸佛三德之一。見三德條。２．智慧與德行。`,

'智斷', `智德與斷德。明白真理名智德，斷盡煩惱名斷德，亦即菩提與涅槃。`,

'智顗', `[[智者大師]]。他在天台山創立[[天台宗]]，世稱[[天台大師]]。`,

'智證', `以智慧證悟涅槃。`,

'智相', `智慧的相狀，亦即佛的光明，因佛的光明是佛智顯現於外的相狀。`,

'智相三昧', `生真實智慧的三昧。`,

'智境', `智與境。智是能觀的心；境是所對的法。`,

'智境冥一', `謂能觀的真智與所觀的真理，冥合一致。`,

'智慧', `[[智]]與[[慧]]。明白一切事相叫做智；瞭解一切事理叫做慧。`,

'智慧門', `進入智慧的門戶。`,

'智慧燈', `（喻）智慧能破除愚痴，好像燈光能破除黑暗一樣。`,

'智慧劍', `（喻）智慧能斷除煩惱和生死，好像利劍能切斷東西一樣。`,

'智慧光', `[[阿彌陀佛]]十二光之一。見十二光佛條。`,

'智慧光佛', `[[阿彌陀佛]]的別名。`,

'智慧觀照', `以智慧來照察事理，破諸迷惑。`,

'智慧波羅蜜', `六波羅蜜之一。見六波羅蜜條。`,

'智藏', `智慧廣大，含藏一切諸法。`,

'智藏海', `（喻）智藏深廣如海。`,

'智目行足', `智解在目，修行在足。`,

'智波羅蜜', `[[十波羅蜜]]之一。`,

'最上乘', `至高無上的教法，即圓頓教，亦即一佛乘。`,

'最上大悉地', `佛果。`,

'最正覺', `至高無上的正覺，亦即契合於真理的智慧，義與無上正等正覺同。`,

'最後心', `又名最後念，即灰身滅智將入無餘涅槃時最後一剎那的心。`,

'最後身', `在生死界中最後一次的身體。`,

'最後身菩薩', `又名最後身、最後有、後身菩薩，即在生死中最後一次受生的菩薩。`,

'最後品無明', `最細微的無明。最初的無明叫做無始無明、根本無明、或元品無朋，最後的無明即叫做最後品無明。`,

'減劫', `人壽由八萬四千歲起，每百年減一歲，減至只有十歲，在這減壽的時期，叫做減劫。`,

'無情', `指沒有情識活動的礦植物，如山河大地及草木等是。`,

'無減', `成就了佛果之後，其功德盡未來際不會減少。`,

'無痴', `無有愚痴，為三善根之一。`,

'無念', `無有妄念，正念的別名。`,

'無貪', `心無貪欲，為三善根之一。`,

'無倒', `無有顛倒。`,

'無上上', `佛的德號。`,

'無上士', `佛十號之一。見十號條。`,

'無上道', `至高無上的道法。`,

'無上忍', `[[十忍]]之一。`,

'無上乘', `至高無上的教法，亦即大乘的別名。`,

'無上輪', `無上的法輪，指佛所說的法。`,

'無上覺', `無上的正覺。`,

'無上正覺', `無上正等正覺的簡稱，亦即佛的覺悟。`,

'無上妙覺', `如來的覺悟，不可思議，故云妙，至高無上，故云無上。`,

'無上法', `即涅槃，因涅槃在一切法中是至高無上的。`,

'無上法王', `佛的尊稱，因佛於法很自在。`,

'無上法輪', `如來的說法。`,

'無上涅槃', `大乘的涅槃。`,

'無上菩提', `即[[阿耨多羅三藐三菩提]]，只有佛能證得。`,

'無上正等覺|無上正等正覺', `[[無上正等正覺]]的簡稱。`,

'無上正遍知', `[[阿耨多羅三藐三菩提]]的古譯。`,

'無上正遍道', `[[阿耨多羅三藐三菩提]]的古譯。`,

'無上正等正覺', `[[阿耨多羅三藐三菩提]]的新譯，意思是宇宙間至高無上真正平等普遍的覺悟，亦即究竟圓滿的佛果。`,

'無上正等菩提', `即[[無上正等正覺]]。菩提即是覺。`,

'無上慚愧衣', `[[袈裟]]的總稱。`,

'無生', `不生不滅的意思，也是涅槃的道理。`,

'無生忍', `把心安住在不生不滅的道理上。忍就是把心安住在道理上而不再動搖的意思。`,

'無生智', `１．阿羅漢果的智。２．菩薩證悟無生真理的智慧。`,

'無生法', `不生不滅之法，亦即真如涅槃的道理。`,

'無生法忍', `簡稱[[無生忍]]，即把心安住在不生不滅的道理上。`,

'無生法性', `謂諸法的本性，即是真如實相，原無生滅。`,

'無生之生', `諸佛已無生死，但為了渡眾生，無生而生，非滅示滅。`,

'無住', `無所住著的意思。法無自性，無自性故，無所住著，隨緣而生。`,

'無住心', `無所住著的心，亦即心不住於一切處。`,

'無住涅槃', `四種涅槃之一。見四種涅槃條。`,

'無住處涅槃|無住涅槃', `與無住涅槃同。`,

'無作', `無因緣的造作。與[[無為]]同義。`,

'無作三昧', `同[[無作解脫門]]。`,

'無作戒體', `謂用不著什麼作為，心體上自然就有清淨戒的德相。`,

'無作解脫門', `又名[[無願解脫門]]，三解脫門之一。見三解脫門條。`,

'無我', `１．無有實我。２．忘卻自己。`,

'無我印', `諸法無我印，為三法印之一。`,

'無我想', `無我的思想。`,

'無我觀', `觀察一切法都無有實我的觀法。`,

'無明', `不明白道理，亦即愚痴的別名。`,

'無明父', `無明與貪愛結合而生我，因此無明好比是父，貪愛好比是母。`,

'無明使', `十使之一。見十使條。`,

'無明惑', `[[天台宗]]所立三惑之一。見三惑條。`,

'無明漏', `三漏之一。見三漏條。`,

'無始', `１．無有元始。諸法皆由因緣生，因上有因，因因無始，如是展轉推究，一切眾生及諸法之原始，皆不可得，故云無始。２．指距今極遠的時間。`,

'無始空', `無始以來就是空，為[[十八空]]之一。`,

'無始生死', `無始以來的生死。由於人類的無明愚痴無始，所以人類的生死也是無始。`,

'無始無明', `無明罪業蒙蔽障礙我們的佛性已久，至今已無法計算其時日，所以叫做無始無明。`,

'無相', `１．於一切相，離一切相，即是無相。２．涅槃的別名，因涅槃離一切虛妄之相。`,

'無相宗', `即[[三論宗]]，因三論宗是以般若所說的諸法皆空為宗。`,

'無相教', `闡明萬法皆空的教法，如諸部般若經所說的是。`,

'無相觀', `見二空觀條。`,

'無相三昧', `又名無相解脫門。見三解脫門條。`,

'無相大乘', `[[三論宗]]的別名，因三論宗是以空理無相為宗。`,

'無相空教', `闡明一切法都是性空無相的教法，如[[般若經]]所說的是。`,

'無相菩提', `與三菩提中的真性菩提同，因性空無相，故名無相菩提。`,

'無相解脫門', `[[三解脫門]]之一。`,

'無畏', `心中無所怖畏。`,

'無畏施', `用種種的方法去消除別人的恐懼，為[[三施]]之一。`,

'無記', `非善非惡，無可記別。`,

'無記法', `非善非惡無可記別的法。`,

'無記空', `於善不善皆不可記別的空。`,

'無常', `無有常住。`,

'無常依', `如來的德號，因如來是一切眾生所依靠之處。`,

'無量', `多到不可計量。`,

'無量慧', `佛的德號，因佛具有無量的智慧。`,

'無量劫', `多到不可計量的劫數。`,

'無量義', `無量的義理。`,

'無量覺', `無量壽佛的簡稱。`,

'無量壽', `見阿彌陀佛條。`,

'無量壽佛', `即[[阿彌陀佛]]，因阿彌陀佛的壽命無量。`,

'無量壽如來', `即[[阿彌陀佛]]。`,

'無量光佛', `即[[阿彌陀佛]]，因阿彌陀佛的身光無量。`,

'無間', `無有間斷。`,

'無間修', `沒有間斷的修行，為四修之一。`,

'無間業', `受苦沒有間斷的五種大惡業。`,

'無間地獄', `受苦沒有間斷的地獄，為八熱地獄之一。`,

'無等', `無與倫比的意思，也是佛的尊號。`,

'無等等咒', `無與倫比的咒語。`,

'無等等乘', `無以倫比的教法，也是大乘的總稱。`,

'無為', `無因緣的造作，即真理的別名。`,

'無為舍', `謂無為（涅槃的境界）是人類最安樂的宅舍。`,

'無為法', `無因緣造作的理法，也就是無生滅變化而寂然常住之法。`,

'無為空', `一切無為法皆空無和不可得的意思，為[[十八空]]之一。`,

'無為生死', `聖人是無為的人，無為的人所受的生死，叫做無為生死。`,

'無為法身', `即法性身，因法性身寂滅無為。`,

'無為涅槃界', `無為的涅槃境界。`,

'無著', `１．沒有執著的意思。<br>２．菩薩名，佛滅九百年間出生於健陀羅國（在克什米爾之西），先從彌沙塞部出家，後信大乘，每夜昇兜率天，聽彌勒菩薩講瑜伽師地論，白天則對大眾開示，為[[法相宗]]之祖。`,

'無著行', `諸行圓融無礙的意思。`,

'無著果', `[[阿羅漢]]果的舊譯。`,

'無漏', `清淨沒有煩惱的意思。`,

'無漏法', `清淨無煩惱之法。出世間的一切無為法，都是清淨無煩惱之法，如三乘聖人所證得的戒定慧和涅槃，就是出世間的無漏法。`,

'無漏因', `無漏果的業因，如四諦中的道諦是。`,

'無漏果', `清淨無煩惱的道果，如[[四諦]]中[[滅諦]]的[[涅槃]]是。`,

'無漏界', `清淨無煩惱的世界，即[[涅槃]]。`,

'無漏通', `清淨無煩惱的神通。在[[六通]]中，前五通是有漏通，第六漏盡通才是無漏通。`,

'無漏智', `三乘人離諸煩惱的清淨智，此智有斷惑證真的功用。`,

'無漏道', `二道之一。見二道條。`,

'無漏慧', `清淨無煩惱的智慧。`,

'無漏後身', `清淨無煩惱叫做無漏，最後一次生死的身叫做後身，無漏後身就是二乘無學果的身。`,

'無慚', `沒有慚愧羞恥的心。`,

'無愧|無慚', `與[[無慚]]同。`,

'無盡', `沒有窮盡。`,

'無盡燈', `譬喻一人將法展轉開導百千萬人，甚至於無窮盡的人，如將一燈點燃起百千萬盞的燈，燈燈無盡，光光不絕。`,

'無盡慧', `無窮盡的智慧。`,

'無盡藏', `謂含藏無窮盡的功德。`,

'無盡法界', `重重無盡的法界緣起。`,

'無盡緣起', `又名法界緣起，謂一切事物，互相為緣，互相起法，為四種緣起之一。`,

'無諍', `安住於空的道理而與物無諍。`,

'無諍三昧', `安住於空的道理而與物無諍的禪定。`,

'無遮', `無遮止限制的意思。`,

'無遮會', `無遮法會。這種法會普同供養，如現在人打千僧齋，結萬人緣，誰都可以參加而無遮止限制。`,

'無緣', `沒有緣份。`,

'無緣法界', `無差別而平等的意思。`,

'無緣慈悲', `[[三種慈悲]]之一，即心無分別，普救一切，不但對一切人類拔苦與樂，甚至擴展至一切有情動物，皆起憐愍愛護的心。`,

'無緣大慈', `佛具大慈心，雖與眾生無緣，但是也發大慈心而救渡之。`,

'無餘', `無有殘餘。`,

'無餘依', `[[無餘依涅槃]]的簡稱。見二涅槃條。`,

'無餘修', `四修之一。見四修條。`,

'無餘涅槃', `二涅槃之一。見二種涅槃條。`,

'無學', `在[[聲聞]]乘四果中，前三果為有學，第四果阿羅漢為無學。有學是還要上進修學的意思，無學就是學道圓滿不更修學的意思。`,

'無學果', `證得無學果位的人，即阿羅漢。`,

'無礙', `沒有障礙。`,

'無礙智', `自在無礙的智慧，即佛的智慧。`,

'無礙解', `又名[[無礙辯]]。見四無礙解條。`,

'無礙光如來', `又名[[無礙光佛]]，即[[阿彌陀佛]]十二別名之一。`,

'無比法', `無與倫比的法。`,

'無色有', `無色界的果報實有，為三有之一。`,

'無色界', `三界之一。見三界條。`,

'無表色', `受戒時，以強盛三業，製造一種色體，此體亦由四大之色法而生，故名為色，外相不顯，故名無表，因有防非止惡的功能，故以之為生戒體。此無表色，雖不似他色之有質礙，然而由四大的色法生故，所以攝在色法之中，是乃小乘有宗的教義。`,

'無自性', `無有一定的自性。一切法因緣和合而生，都無一定的自性。`,

'無門宗', `[[佛心宗]]。無門即是佛心的別名，佛心宗即是[[禪宗]]。`,

'無沒識', `[[阿賴耶識]]的別名，因阿賴耶識是無始以來，一切有情生命所寄托，在一期無常中，最先來，最後去，並不隨生死而消失，故又名為無沒識。`,

'無垢衣', `無煩惱垢染的衣，即[[袈裟]]。`,

'無垢地', `[[離垢地]]的別名，是菩薩[[十地]]中之第二地名。`,

'無垢識', `[[阿賴耶]]識在佛位上，變成清淨無垢，為諸無漏法所依止，故名無垢識，又名[[菴摩羅識]]。`,

'無法相', `謂一切法都是緣生的，無真實之體，亦無真實之相。`,

'無財鬼', `見鬼條。`,

'無酒神', `八部眾之一，即[[阿修羅]]。`,

'無師智', `無師自通的智慧。`,

'無異想', `對一切眾生無遠近親疏的思想，是如來十八不共法之一。`,

'無煩天', `[[色界]]十八天中之第十四重天名。`,

'無所得', `沒有什麼法可以得到的意思，這是無相的道理。`,

'無所有', `又叫做[[無所得]]，[[空]]的別名。`,

'無義語', `沒有意義的言語。`,

'無熱天', `[[色界]][[五淨天]]之第二天名。`,

'無憂王', `見阿育王條。`,

'無想界', `無想天。`,

'無想定', `外道為了獲得無想天的果報而修一種泯滅一切心想的禪定。`,

'無想果', `又名無想報。見無想報條。`,

'無想報', `又名無想果，即外道修無想定者，命終生無想天，受五百大劫心心所滅，而身亦如枯木死灰，他們誤認是真涅槃境界，豈知過了五百大劫之後，又復動念，再入輪迴。`,

'無想天', `無想的眾生所居住之天，在[[色界]]之第四禪天。`,

'無想天難', `八難之一。見八難條。`,

'無央數劫', `無量數劫。`,

'無去無來', `如來的法身不去也不來，湛然常住。`,

'無佛世界', `沒有佛在世界上居住的時期，如[[釋迦佛|釋迦牟尼]]涅槃之後，彌勒佛尚未示現的這一段時期。此時期由地藏王菩薩負責教化眾生的工作。`,

'無問自說', `[[十二部經]]之一。`,

'無師之智', `無師而獨自覺悟的佛智。`,

'無尋無伺', `色界二禪以上，無尋的心所，亦無伺的心所。`,

'無稱光佛', `[[無量壽佛]]的別名，為[[十二光佛]]之一。`,

'無所住而生其心', `無所住是不滯住善惡、是非、空有、斷常、迷悟等等對待的兩邊，連中道亦不住。而生其心者，即是生其空寂靈知妙明真如的心。`,

'焰摩天', `[[夜摩天]]，在[[欲界天]]之第三重。`,

'焰慧地', `菩薩[[十地]]中之第四地。[[楞嚴經]]說：「<verse>明極覺滿，名焰慧地。</verse>」`,

'燃燈', `１．燃點燈燭。２．佛名。見燃燈佛條。`,

'燃燈佛', `又名錠光佛。[[釋迦佛|釋迦牟尼]]在因行中第二阿僧祇劫屆滿時，剛好此佛出世，他買了五莖蓮花去供佛，又以頭髮舖地給佛走路，佛即為他受未來成佛的記別。智度論說：「如然燈佛，生時一切身邊如燈，故名然燈太子，作佛亦名然燈。」`,

'琰魔王', `即[[閻羅王]]，簡稱[[閻王]]。見閻王條。`,

'琰魔界', `[[琰魔王]]的世界，在我們所住的[[南贍部洲]]東方鐵圍山下。`,

'琰魔使', `[[琰魔王]]的鬼卒。窮兇極惡的人，琰魔王就差遣這種鬼卒去引取他來治罪。`,

'異生', `[[凡夫]]的別名，因凡夫輪迴六道，受種種別異的果報而生。`,

'異生性', `凡夫之性，係指見惑的煩惱種子而言。俱舍論說：「云何異生性，謂不獲聖法。」`,

'異生羝羊心', `[[十住心]]之一。凡夫的愚痴，好像羝羊，羝羊即牡羊，終日只知思念食欲和淫欲。`,

'異相', `四相之一。見四相條。`,

'異熟', `[[果報]]的新譯，因為因與果必異時而熟，故云異熟。`,

'異熟因', `六因之一。見六因條。`,

'異熟果', `五果之一。見五果條。`,

'異熟障', `謂由於自然果報的障礙而不能修行佛法的地方，如三惡趣及無想天等是。`,

'異熟生', `異熟因所生。`,

'異熟識', `[[阿賴耶識]]的別名。`,

'異方便', `特殊的方便。`,

'異時而熟', `種因在先，受果在後，先後時間相差，或至無數劫，所以說異時而熟。`,

'登住', `登入菩薩[[十住]]之位。`,

'登地', `登上菩薩[[十地]]之位。要達到登地須經過一大阿僧祇劫的修行。`,

'登地菩薩', `登入[[初地]]（即[[歡喜地]]）之位的菩薩。`,

'發通', `開發神通。`,

'發願', `立下誓願。`,

'發露', `表白自己所犯的過失。`,

'發心', `發願求取無上菩提的心。`,

'發心住', `菩薩[[十住]]之第一位。`,

'發光地', `菩薩[[十地]]之第三地。`,

'發菩提心', `發求取正覺成佛的心。`,

'眾生', `又名[[有情]]，即一切有情識的動物。集眾緣所生，名為眾生，又歷眾多生死，名為眾生，十法界中，除佛之外，九界有情，皆名眾生。`,

'眾生心', `一切眾生所有的心。眾生心約有二種，即真心與妄心。見二心條。`,

'眾生見', `執著眾生實有的妄見，是我見的別名。`,

'眾生界', `[[十界]]之中，除去佛界，其他九界都叫做眾生界。`,

'眾生恩', `四恩之一。見四恩條。`,

'眾生相', `四相之一。見四相條。`,

'眾生相續', `三相續之一。見三相續條。`,

'眾生緣慈', `三慈之一。見三慈條。`,

'眾生世間', `三世間之一。見三世間條。`,

'眾生無邊誓願度', `四弘誓願之一。見四弘誓願條。`,

'眾合地獄', `[[八熱地獄]]之第三。`,

'等', `１．平等之義。２．等級之義。３．等類之義。`,

'等心', `１．平等心，即視一切眾生怨親平等。２．對諸法平等修行的心。`,

'等味', `平等一味。`,

'等至', `[[定]]的別名。身心平等安祥叫做等，以定力才能達至此種等的境界，所以叫做等至。`,

'等持', `[[定]]的別名。梵語三摩地，華譯為等持，即心安住於一境而平等維持之義。`,

'等智', `十智之一。見十智條。`,

'等慈', `平等的慈悲。`,

'等諦', `[[俗諦]]的別名。`,

'等觀', `平等觀念一切事理。`,

'等覺', `１．佛的別稱。等是平等，覺是覺悟，諸佛的覺悟，平等一如，故名等覺。<br>２．[[大乘]][[五十二階位]]中，第五十一位，名為等覺，即十地位滿，將證佛果之中間階段，因其智慧功德，等似妙覺，故名等覺，又名一生補處，或金剛心菩薩。`,

'等妙', `等覺與妙覺。大乘階位五十二級中，第五十一位即等覺，第五十二位即妙覺，亦即佛果。等覺猶如十四的月亮，妙覺則如十五的月亮。`,

'等妙覺王', `佛的尊稱。等是等覺，是顯因圓，妙是妙覺，是顯果滿，佛因圓果滿，故稱等妙覺王。`,

'等活地獄', `八熱地獄之第一。見八熱地獄條。`,

'等無間緣', `四緣之一。見四緣條。`,

'結', `繫縛的意思，是煩惱的別名，因煩惱能繫縛眾生的身心，使不能解脫，永淪生死。`,

'結印', `手結印契。密宗的修法，要手結印，口念咒，意觀想，這樣才能做到三密相應。`,

'結使', `結與使。結與使都是煩惱的別名，煩惱能繫縛身心，結成苦果，故稱為結，能使眾生沉溺於生死苦海，故又名為使。結有九結，使有十使。`,

'結夏|安居', `結夏安居。見安居條。`,

'結集', `佛滅後，五百大阿羅漢相聚一處，將佛過去所說的法，結合集成為佛教的三藏經典。`,

'結賊', `結是煩惱的別名，因為煩惱能為害智慧，故喻之為賊。`,

'結解', `結與解。結是煩惱所縛；解是證悟真理而得自在。`,

'結漏', `結與漏。結與漏都是煩惱的別名。`,

'結縛', `[[煩惱]]的別名，因煩惱能繫縛吾人的心身使不得解脫出離生死。`,

'結緣', `廣結善緣。`,

'結業', `指由煩惱而生的思想與行為。`,

'結跏趺坐', `佛陀的坐法，即盤膝而坐。略有二種：若先以右足置於左腿上，再以左足置於右腿上，叫做[[降魔坐]]；若先以左足置於右腿上，再以右足置於左腿上者，則叫做[[吉祥坐]]。`,

'給孤獨園', `給孤獨長者買祇陀太子的園林給佛講經說法，故其園名為給孤獨園。`,

'給孤獨長者', `中印度憍薩羅國的丞相，性情慈善，喜歡布施孤獨的人，所以獲得給孤獨之名。`,

'菩提', `華譯為[[覺]]，是指能覺法性的智慧說的，也就是漏盡人的智慧。`,

'菩提心', `求取正覺成佛的心。`,

'菩提心戒', `以菩提心之自性清淨為戒，是三昧耶戒的別名。`,

'菩提分', `１．佛陀從四諦的道諦中，開示出三十七種修習基本聖道的法門，叫做[[三十七道品]]，也叫做[[三十七菩提分法]]。２．即[[七菩提分]]，又名七覺分。見七覺分條。`,

'菩提樹', `原名[[畢缽羅]]樹，因釋尊在此樹下成道，故又名菩提樹。`,

'菩提達磨', `簡稱[[達磨]]，是中國[[禪宗]]的初祖。見達磨條。`,

'菩提薩埵', `見菩薩條。`,

'菩薩', `梵語菩提薩埵的簡稱，華譯為覺有情，就是覺悟的有情的意思，也就是上求佛道和下化眾生的大聖人。`,

'菩薩戒', `發大心修大乘法的行者所受持的戒律。依梵網經菩薩心地品，其戒相為十重戒，四十八輕戒，這是出家菩薩戒；若依優婆塞戒經受戒品，則列六重戒，二十八輕戒，這是在家菩薩戒。茲將上述二種戒本所說的重戒和輕戒戒目列表如下：
{{菩薩戒}}
`,

'菩薩行', `菩薩自利利他圓滿佛果的大行，也就是布施等六度。`,

'菩薩乘', `又名[[大乘]]，為五乘之一，即修六度萬行圓滿自他二利以達到佛界的教法。見大乘條。`,

'菩薩道', `菩薩所修之道，亦即自利利他。`,

'菩薩藏', `大乘經的總稱，為二藏之一。法華華嚴等一切大乘經中，含藏大乘菩薩修因證果的方法，故名菩薩藏。智度論說：佛滅後，文殊彌勒等諸大菩薩，請阿難於鐵圍山結集三藏，謂之菩薩藏，這也是大乘佛法的結集。`,

'菩薩僧', `受持菩薩戒的出家人。`,

'菩薩十地', `一、[[歡喜地]]，菩薩既滿初阿僧祇劫之行，初窺心性，破見惑，證二空理，成就檀波羅蜜，生大歡喜。二、[[離垢地]]，菩薩斷思惑，除毀犯之非，使身清淨，成就戒波羅蜜，離一切垢。三、[[發光地]]，菩薩滅無明闇，而得三明，成就忍波羅蜜，心光開發。四、[[焰慧地]]，菩薩於三十七道品，圓滿具足，進而修習力無畏，不共佛法，遠離懈怠，成就精進波羅蜜，使慧焰熾盛。五、[[極難勝地]]，菩薩為利益眾生，外習諸技藝，內成就禪波羅蜜，極難制勝。六、[[現前地]]，菩薩住解脫法門，修空無相無願三昧，成就般若波羅蜜，使現前差別盡泯。七、[[遠行地]]，菩薩斷諸業果細現行相，起殊勝行，廣化眾生，成就方便波羅蜜，備遠行資糧。八、[[不動地]]，菩薩住無生忍，斷諸功用，身心寂滅，猶如虛空，成就願波羅蜜，於涅槃心，湛然不動。九、[[善慧地]]，菩薩滅心相，證智自在，具大神通，善護諸佛法藏，成就力波羅蜜，善運慧解。十、[[法雲地]]，菩薩廣集無量道法，增長無邊福智，悉知一切眾生心行，依上中下根，為說三乘，成就智波羅蜜，有如大雲，雨大法雨。`,

'菩薩四無畏', `菩薩教化眾生之時有四種的無畏，即一、總持不忘，[[說法無畏]]；二、盡知法樂，和知道眾生根欲性心，[[說法無畏]]；三、善能問答，[[說法無畏]]；四、能斷物疑，[[說法無畏]]。`,

'菩薩淨戒', `菩薩所受持的清淨戒法。`,

'華臺', `蓮華的臺座，亦即佛菩薩的臺座。`,

'華藏界', `蓮華藏世界的簡稱。見華藏世界條。`,

'華藏世界', `[[蓮華藏世界]]的簡稱，是[[釋迦]]如來真身[[毘盧舍那]]佛淨土之名。佛經說，在風輪之上的香水海中有大蓮華，此蓮華中含藏著微塵數的世界，所以叫做蓮華藏世界。此世界總共有二十層，我們所住的娑婆世界，就在華藏世界的第十三層的中間。`,

'華嚴', `佛萬德譬如華，以如華之華德莊嚴法身，叫做華嚴。`,

'華嚴宗', `依[[華嚴經]]而立宗，故名華嚴宗。此宗以中國唐時杜順和尚為始祖，後來因為賢首國師所發揚，故又名[[賢首宗]]。此宗論一切萬法理事無礙，事事無礙，一切互不相礙互相融入。修法界觀，以高度平等的眼光，體察萬事萬物，這種心情證入一真法界即得佛智。`,

'華嚴時', `佛說[[華嚴經]]的時期，即佛初成道三七日間在菩提樹下說法的時期。`,

'華嚴三聖', `[[毘盧舍那佛]]、[[文殊菩薩]]、[[普賢菩薩]]。`,

'華嚴宗三觀', `見三觀條。`,

'菴摩羅識', `華譯為[[清淨識]]、[[無垢識]]、[[真如識]]等，為九識中之第九識，亦即佛的清淨識。`,

'虛無', `虛妄無實。`,

'虛空', `虛與空。虛與空都是無的別名。虛無形質，空無障礙，故名虛空。`,

'虛空界', `指眼睛所看到的天空。`,

'虛空藏', `菩薩名，因此菩薩含藏一切功德如虛空，故名虛空藏。`,

'虛妄', `虛假不實的意思，`,

'虛妄分別', `不確實的分別事理。`,

'補陀', `即[[普陀]]，又名[[普陀山]]，在浙江定海縣東海中。`,

'補陀落迦', `山名，華譯為[[光明山]]、[[海島山]]、[[小花樹山]]等，在印度的南海岸，相傳為[[觀音菩薩]]的道場。`,

'補處', `補到佛位的意思。`,

'補處彌勒', `一生補處的[[彌勒]]。彌勒菩薩將在五十六億七千萬年後成道，繼釋迦如來在此世界成佛，而補到佛位。`,

'超越證', `二證之一。見二證條。`,

'超越斷', `與超越證同。`,

'跏坐', `把腳放在腿上的坐法。有[[全跏]]和[[半跏]]兩種，全跏是兩足放在兩腿上，半跏是左足或右足放在另一方的腿上。經上所說的結跏趺坐，是指全跏坐。`,

'跏趺|結跏趺坐', `結跏趺坐。見結跏趺坐條。`,

'進具', `謂沙彌的年紀滿二十歲時，就可以進一步的受持比丘的具足戒。`,

'進如意足', `見四如意足條。`,

'都史天|兜率天', `[[都史多天]]的簡稱。`,

'都史多|兜率天', `兜率天。見兜率天條。`,

'都史宮', `[[都史多天]]（[[兜率天]]）的宮殿，亦即彌勒菩薩所住的地方。`,

'都率天|兜率天', `兜率天。`,

'鈍使', `性質很遲鈍的煩惱。見五鈍使條。`,

'鈍根', `愚鈍的根機，指領悟性不高的人。`,

'開士', `１．開悟之士，菩薩的德名。２．以法開導眾生之士，為和尚的尊稱。`,

'開光', `又叫做開眼，即佛像落成後，舉行儀式供奉之。`,

'開眼', `與開光同。`,

'開會', `開是開三乘教的方便門，會是三乘會歸一乘。與開顯同義。`,

'開葷', `又名開素。佛雖然制定酒肉五辛等不可食，但是遇到生病的人或是有利益的事時，卻可以飲食。`,

'開演', `說法。`,

'開悟', `開智明理。`,

'開遮', `開是允許的意思，遮是禁止的意思。`,

'開顯', `開權顯實的簡稱。權者方便，實者真實，開方便以顯真實，叫做開顯。[[法華經|妙法蓮華]]說：「開方便門，示真實相。」`,

'開經偈', `念經前所念誦的四句偈，其偈文是「<verse>無上甚深微妙法，百千萬劫難遭遇，我今見聞得受持，願解如來真實義。</verse>」`,

'開權顯實', `見開顯條。`,

'開示悟入', `開是開佛知見，示是示佛知見，悟是悟佛知見，入是入佛知見，此開示悟入乃是佛出世的本懷。`,

'開山祖師', `開山立寺始創基業的人。`,

'開三顯一', `開三乘方便法門以顯真實一乘的教法。`,

'開甘露門', `布施餓鬼。`,

'開緣說法', `為眾人廣開佛法因緣而說法要。`,

'間色', `中間色。縫製袈娑時要選用三種的壞色，即青之間色，黑之間色，和木蘭之間色。`,

'間色服', `[[袈裟]]的別名。`,

'須彌諸山', `指[[須彌山]]及其外圍的八個山。[[器世界]]的最下層為[[風輪]]（大氣層），其上為[[水輪]]（大海洋），再上為[[金輪]]（大地）。在金輪上有九個山八個海，互相間隔圍繞，以須彌山為中心，其外圍的八個山就是[[持雙]]、[[持軸]]、[[檐木]]、[[善見]]、[[馬耳]]、[[象鼻]]、[[持邊]]、[[鐵圍]]。`,

'須摩提', `簡稱[[須摩]]，華譯[[妙意]]、[[好意]]等，為[[西方極樂世界|極樂世界]]的別名。`,

'須彌山', `華譯[[妙高山]]，因此山是由金、銀、琉璃、水晶四寶所成，所以稱妙，諸山不能與之相比，所以稱高。又高有八萬四千由旬，闊有八萬四千由旬，為諸山之王，故得名妙高。此山為一小世界的中心，山形上下皆大，中央獨小，四王天居山腰四面，忉利天在山頂，山根有七重金山，七重香水海環繞之，在金山之外有鹹海，鹹海之外有大鐵圍山，四大部洲即在此鹹海的四方。`,

'須陀洹', `舊譯為[[入流]]，新譯為[[預流]]，是[[聲聞乘]]四果中的初果名。入流是初入聖人之流的意思，預流是預入聖者之流的意思。`,

'須陀洹向', `四向之一。見四向條。`,

'須陀洹果', `[[聲聞]]乘四果中的初果名。`,

'喘息', `禪定時，呼出吸進的氣很粗。`,

'順化', `又叫做順世，就是順世道而死化的意思，通常是指僧人去世。`,

'順世', `與順化同。`,

'順生受業', `此生造業再生才受報，為[[三業]]之一。`,

'順後受業', `此生造業於後數生才受報，為[[三業]]之一。`,

'順現受業', `此生造業此生即受報，為[[三業]]之一。`,

'奢摩他', `華譯[[為止]]，即止息一切雜念的意思。`,

'黑沙地獄', `十六[[遊增地獄]]之一。`,

'黑繩地獄', `[[八熱地獄]]之第二。`,

'黃檗', `唐斷際禪師希運，福建人，於黃檗山出家，後參江西百丈山海禪師而得道，後居洪州大安寺，法席甚盛，師嗜愛舊山，因以黃檗名之，後人便稱師為黃檗。`,

'黃面老子', `指[[釋迦如來|釋迦牟尼]]，因釋迦如來的身相現金黃色。`,

'提婆達多', `人名，為斛飯王之子，阿難之兄，佛的徒弟。出家學神通，身具三十相，誦六萬法藏，其本地為深位的菩薩，釋尊在法華會上，述往世為棄位國王，提婆達多為仙人，使他具足一切佛法，至於成佛。`
);


addTerms(13,

'亂心', `散亂的心。`,

'亂善', `亂心所做的善事。`,

'傳心', `見以心傳心條。`,

'傳戒', `傳授戒法。`,

'傳燈', `傳法於他人，如燈燈相傳，心心相印。`,

'勢速', `謂有為法刻刻生滅，其勢甚速。`,

'勢至', `[[大勢至]]菩薩的簡稱，因此菩薩的大智至一切處，故名大勢至。`,

'勢至觀', `[[觀無量壽經]]所說[[十六觀]]之第十一，即觀想[[大勢至]]菩薩身相的觀法。`,

'勤', `精進的意思。`,

'勤行', `勤行善法，亦即六波羅蜜中的精進波羅蜜。`,

'勤息', `梵語沙門，華譯勤息，即勤修眾善和止息諸惡之義。`,

'勤策', `即沙彌，因沙彌懷著要做比丘的希望，於是辛勤策勵自己。`,

'圓心', `求取涅槃圓果的心。`,

'圓行', `圓融的行持，也就是稱性而修，於事毫無執著，如念一佛，即是念一切佛，修一法，即是修無量法門，生極樂淨土，即是生諸佛淨土是。`,

'圓光', `佛菩薩頭上所發出來的圓形光圈。`,

'圓佛', `[[圓教]]的法身佛，即[[毘盧舍那佛|毘盧舍那]]。`,

'圓戒', `圓頓戒，即[[天台宗]]所傳的大乘戒。`,

'圓妙', `謂空假中三諦圓融而不可思議。`,

'圓解', `圓通的見解，即利根行人，知見超脫，稱性而談，於理無所執著。`,

'圓具', `具足戒的別名，因受持具足戒的人近於涅槃的圓果。`,

'圓空', `執著於空叫做偏空，連空亦空，更無所執著，叫做圓空，亦名第一義空。`,

'圓果', `圓滿的果德，即涅槃。`,

'圓宗', `[[天台宗]]的別稱，因天台宗以圓頓一實為宗旨。`,

'圓音', `圓妙的聲音，即佛的聲音。`,

'圓修', `１．在天台圓教是指同時兼修空假中三觀。２．圓滿的修習萬行。`,

'圓覺', `１．圓滿的覺性。具足眾德叫做圓，照破無明叫做覺。此圓覺，就是人人本具的真心。<br>２．對世間一切事理無不澈底了知其真相。`,

'圓悟', `圓滿覺悟真理。`,

'圓乘', `圓滿無缺的教法，即佛乘。`,

'圓寂', `梵語[[涅槃]]，華譯圓寂，即圓滿一切智德，寂滅一切惑業。`,

'圓實', `圓頓一實，是天台圓教的教理。一行圓融一切行，一位圓具一切位，而成佛頓速，叫做圓頓；這種道理只有一而無二三，是真實而非虛妄，叫做一實。`,

'圓成', `圓滿成就。`,

'圓成實性', `三性之一。見三性條。`,

'圓通', `道理圓融而無礙。`,

'圓通大士', `[[觀世音]]的別名。`,

'圓通懺法', `觀音懺法的別名，因觀音的別名就是圓通大士。`,

'圓教', `大乘究竟圓滿的教法，為[[天台]]所立[[四教]]之第四，或[[華嚴宗]]所立[[五教]]之第五。`,

'圓教四門', `[[天台宗]]說圓教有四門，即有門、空門、亦有亦空門、非有非空門。`,

'圓頓', `圓融諸法頓速成佛的意思。諸法本圓融，一法圓滿一切法，若一念開悟，便能頓入佛位，頓足佛法，這是[[天台宗]]的宗旨。`,

'圓頓戒', `指[[天台宗]]的戒法，天台宗以圓融諸法頓速成佛為宗旨，故其所依之戒便叫做圓頓戒。`,

'圓頓宗', `[[天台宗]]。`,

'圓頓教', `簡稱[[圓教]]，是大乘窮極的實教，若悟圓教之理，能頓入佛位，頓足佛法，故名圓頓。`,

'圓融', `圓通融合的意思，如煩惱即菩提，生死即涅槃，眾生即本覺，娑婆即寂光等都是圓融的道理。`,

'圓融三諦', `三諦是空假中，空假中圓融無礙，即空即假即中，叫做圓融三諦。`,

'圓明常寂照', `六祖[[惠能]]所說。謂心性本來是圓滿光明與真常不變的，雖然是寂靜不動，卻能夠遍照一切法界，雖然是遍照一切法界，卻仍舊還是寂靜無動，此乃是無上涅槃之相。`,

'塔', `一種形高而尖的建築物，由五級到十幾級不等，藏佛遺骨的叫做塔，不藏遺骨的則叫做支提。`,

'塔寺堅固', `[[五堅固]]之一。佛滅度後的第四個五百年，即是堅固造立塔寺的時期。`,

'塚間坐', `比丘在塚間坐臥，為十二[[頭陀]]行之一。`,

'微塵', `細微的灰塵。`,

'微塵數', `（喻）數量很多。`,

'微微心', `入滅盡定前剎那極微的心念。`,

'微細生死', `變易生死的別名。`,

'想蘊', `五蘊之一。見五蘊條。`,

'想顛倒', `三顛倒之一。見三顛倒條。`,

'想受滅無為', `生於無色界非想天，入滅盡定，想受俱滅，名想受滅無為`,

'意', `唯識學的第七[[末那識]]，華譯為意，思量之義，恆審思量第八[[阿賴耶識]]為我，有思考、辨別、判斷、分析、綜合等的作用。`,

'意三', `[[十惡]]中屬於心意的三惡，即[[貪欲]]、[[瞋恚]]、[[愚痴]]。`,

'意定', `攝心正念，清淨無染。`,

'意密', `三密之一。見三密條。`,

'意業', `三業之一。見三業條。`,

'意樂', `心意獲得滿足而生快樂。`,

'意輪', `三輪之一。見三輪條。`,

'意學', `[[禪宗]]的學問。禪學相當於身口意中之意業，故名意學。`,

'意識', `六識之一。見六識條。`,

'意根', `六根之一。見六根條。`,

'意馬', `（喻）心意外馳，好像奔馬。`,

'意馬心猿', `（喻）心神馳逐不定。`,

'意成', `又叫做[[意生]]，即由意之力而成身。`,

'意成身', `又叫做[[意生身]]，即由意之力而成身。`,

'意生身', `又叫做[[意成身]]，[[初地]]以上的菩薩，為了濟度眾生而如意受生之身。`,

'意生化身', `菩薩任意而生之變化身。`,

'愚痴', `三毒之一。見三毒條。`,

'愚法', `二種[[小乘]]之一。[[聲聞]][[緣覺]]二小乘，有的人迷執自法，而愚於大乘法空之妙理，名為愚法小乘，一旦瞭解大乘之理，迴心向大，便名為[[不愚法小乘]]。`,

'愚法二乘', `見愚法條。`,

'愛行', `二行之一，即愛欲之情多的人，若推理多的人，則叫做見行。行是心行，也就是心理活動。`,

'愛取', `愛與取。愛是喜歡的意思；取是要的意思。`,

'愛欲', `貪愛五欲。`,

'愛道', `又名[[大愛道]]，是佛的姨母。`,

'愛執', `愛惜執著。`,

'愛結', `九結之一。見九結條。`,

'愛著', `貪愛不捨的意思。`,

'愛語', `四攝法之一。見四攝法條。`,

'愛論', `貪愛的戲論，也就是被愛迷惑了心竅之後所生的種種不正確言論。`,

'愛縛', `恩愛的繫縛。`,

'愛繫', `恩愛的繫縛。`,

'愛見', `１．貪愛的見解。２．愛與見的二種煩惱，愛是指思惑，見是指見惑。[[智度論]]說：「<verse>煩惱有二種，一屬愛，二屬見。</verse>」`,

'愛見大悲', `自己雖未斷煩惱卻運用大悲以救濟眾生。愛是指思惑，見是指見惑。`,

'敬田', `三福田之一。見三福田條。`,

'敬禮', `恭敬禮拜。`,

'感果', `由所作的業因招感應得的果報。`,

'感應', `感是感召，應是應現，謂我對佛菩薩有什麼要求，如果心意至誠，便可以感召佛菩薩來應現，以滿我之所願。`,

'感應道交', `眾生之感與如來之應互相交流。`,

'會二歸一', `會二乘以歸一乘。`,

'會三歸一', `佛最初以聲聞緣覺菩薩等三乘法，教化眾生，到最後皆教令成佛，會三乘於一佛乘，是名會三歸一。`,

'極覺', `妙覺。`,

'極果', `至極的果位，即佛果。`,

'極樂世界', `[[阿彌陀佛]]的國土名，因其國只有快樂而無痛苦，故名。`,

'極熱地獄', `[[八大地獄]]之第七。`,

'極難勝地', `簡稱[[難勝地]]，是菩薩[[十地]]中之第五地名。`,

'楞伽', `在師子國（即今錫蘭島）的山名。楞伽是寶石名，因此山有楞伽寶石，故以寶名山。`,

'楞伽島', `錫蘭島的本名，也是佛說楞伽經的地方。`,

'楞伽懸記', `釋尊在楞伽山，懸記如來滅後，南天竺（印度）有大德比丘，名龍樹，宣說大乘無上妙法，初證歡喜她，應往生安樂國。`,

'楞嚴咒', `又叫做[[佛頂咒]]，是[[楞嚴經]]所說的神咒，有四百二十七句，其中最後的八句是心咒。`,

'業', `我們的一切善惡思想行為，都叫做業，如好的思想好的行為叫做善業，壞的思想壞的行為卻叫做惡業。`,

'業力', `業的力量。善業有生樂果的力量，惡業有生惡果的力量。`,

'業風', `１．惡業所感之猛風，指劫末所起的大風災及地獄所吹的風。２．（喻）業力如風，吹諸眾生輪迴三界。`,

'業有', `七有之一。見七有條。`,

'業因', `善惡果報的原因。善業是樂果的因，惡業是苦果的因。`,

'業果', `善惡業因所招感的苦樂果報。`,

'業感', `善惡業因能招感苦樂的果報。`,

'業海', `像大海一樣的種種惡因。`,

'業識', `有業凡夫的識。凡夫有業，所以智就變成了識，聖人沒有業，所以識就轉成了智。`,

'業通', `又名[[報通]]，即依宿業自然而得的神通。`,

'業障', `由前生所作的種種罪惡而生今生的種種障礙，如所作所為皆不如意，就是業障的緣故。`,

'業輪', `（喻）善惡業能使人輪轉於六趣。`,

'業緣', `善惡果報的因緣。善業是招感樂果的因緣，惡業是招感苦果的因緣。一切眾生，都是由業緣而生的。維摩經說：「是身如影，從業緣生。」`,

'業繫', `（喻）業好像繩子能將眾生繫縛在三界之牢獄中。`,

'業餘', `三餘之一。見三餘條。`,

'業報', `１．善惡業因所招感的苦樂果報。２．業因與果報。`,

'業報身', `十身之一。見十身條。`,

'滅', `１．梵語[[涅槃]]，華譯為滅，因涅槃之體，無為寂滅，故名。２．指[[四諦]]中的[[滅諦]]。３．即戒行，因戒行能滅除諸惡。`,

'滅定|滅盡定', `[[滅盡定]]的簡稱。`,

'滅度|涅槃', `即[[涅槃]]。滅是滅見思塵沙，無明三種惑，度是度分段變易兩種生死。`,

'滅後', `[[涅槃]]之後。`,

'滅理', `寂滅的真理，亦即[[涅槃]]。`,

'滅智', `徹底明瞭滅諦的道理的智慧。`,

'滅道', `[[滅諦]]與[[道諦]]。見四諦條。`,

'滅諦', `四諦之一。見四諦條。`,

'滅法', `寂滅一切相的道法，是[[無為法]]的別名。`,

'滅法忍|滅法智忍', `[[滅法智忍]]的簡稱。見八忍條。`,

'滅法智', `八智之一。見八智條。`,

'滅法智忍', `又名[[滅法忍]]。見八忍條。`,

'滅盡定', `又名[[滅受想定]]，或[[滅定]]，在此定中，以滅受想二心所為主，最後並六識心所亦滅，是九次第定的最後一定。`,

'滅盡三昧|滅盡定', `又名滅盡定。見滅盡定條。`,

'滅盡妙離', `滅是滅一切煩惱，盡是盡生死之業，妙是妙應真常，離是脫離三界諸苦。此滅盡妙離，是小乘涅槃的究竟境界。`,

'滅類忍|滅類智忍', `[[滅類智忍]]的簡稱。見八忍條。`,

'滅類智', `八智之一。見八智條。`,

'滅類智忍', `八忍之一。見八忍條。`,

'滅受想定|滅盡定', `滅盡定的別名。見滅盡定條。`,

'煖位', `指小乘行人修五停心觀及四念處觀已，進而專修四諦觀之位，為四善根之一。`,

'煖法', `行者修至此位，工夫已漸得力，如鑽木取火，雖未得火，已有煖氣上升，快要發火了。`,

'煩惱', `煩是擾義，惱是亂義，能擾亂眾生身心，令使心煩意亂的見思惑，叫做煩惱。`,

'煩惱習', `煩惱的習氣。`,

'煩惱障', `二障之一。見二障條。`,

'煩惱濁', `五濁之一。見五濁條。`,

'煩惱魔', `四魔之一。見四魔條。`,

'煩惱業苦', `又名惑業苦，謂吾人由於貪瞋痴等煩惱而造業，又因造業而受苦。`,

'煩惱即菩提', `見生死即涅槃條。`,

'犍度', `華譯為[[聚]]、[[蘊]]、[[結]]等，即律中篇章之名，一犍度即一篇或一章，或一品一節之義。`,

'獅子吼', `（喻）佛陀說法，毫無怖畏，聲震十方，群魔攝伏，好像獅子一叫，百獸都降伏一樣。`,

'獅子座', `佛是人中獅子，故不論其所坐者是床是地，都叫做獅子座。`,

'瑜伽', `相應的意思。相應有五義，即與境相應、與行相應、與理相應、與果相應、與機相應。`,

'瑜伽宗', `１．[[密教]]的總稱。２．中國的[[法相宗]]在印度叫做瑜伽宗。`,

'瑜伽教', `[[密教]]的總稱，因密教是以三密的瑜伽為宗。`,

'瑜伽三密', `三密相應。`,

'當來', `來世。`,

'當來導師', `指[[彌勒]]菩薩。`,

'當機', `契當眾生的根機。`,

'當機益物', `隨著眾生的根機而使之獲益。`,

'當體即空', `謂一切有為法都是因緣合成，其本體本來就是空無。`,

'當相即道', `謂於世間淺近的事相上，都有深妙的道理在。`,

'痴', `又名[[無明]]，不明白事理的意思，為三毒之一。`,

'痴取', `愚痴的煩惱。取就是煩惱的別名。`,

'痴使', `愚痴的煩惱。使就是煩惱的別名。`,

'痴定', `沒有智慧的禪定。`,

'痴毒', `三毒之一。見三毒條。`,

'痴愛', `[[愚痴]]和[[貪愛]]。愚痴為父，貪愛為母，和合而生出一切的煩惱惡業。`,

'痴慢', `[[愚痴]]和[[我慢]]。`,

'痴禪|痴定', `與痴定同。`,

'痴闇', `無明的闇味。`,

'睡', `[[十纏]]之一。`,

'睡眠', `一種使心靈闇昧的精神作用。`,

'睡眠欲', `五欲之一。見五欲條。`,

'睡眠蓋', `五蓋之一。見五蓋條。`,

'禁戒', `禁非戒惡。佛所制的禁戒有五戒八戒沙彌戒和具足戒等的分別。`,

'瑞應', `有祥瑞來應驗。`,

'稟具', `受持具足戒。`,

'稟教', `稟承佛的教法。`,

'經', `梵語[[修多羅]]，華譯為[[契經]]，即上契十方諸佛所說之理，下契一切聽經眾生的根機，又是線義，即貫串佛所說的法和道理，以免散失，為三藏之一。`,

'經行', `在一定的地方兜圈子，其目的在於避免坐禪時發生昏沉或睡眠。`,

'經宗', `依經而立的宗派叫做經宗，若依論而立的宗派則叫做[[論宗]]，如[[華嚴]][[天台]]是屬於經宗，如[[成實三論]]則屬於論宗。`,

'經論', `[[經藏]]與[[論藏]]。經是如來所說，論是菩薩所著。`,

'經藏', `１．指佛所說的一切大小乘經典。２．藏放經典的府庫。３．國家所寶藏的佛學書。`,

'經體', `經之體。大乘經以諸法實相為體，小乘經以三法印為體。`,

'經部', `經量部的簡稱。`,

'經量部', `又名[[說度部]]，或[[說轉部]]，[[小乘]][[十八部]]之一，是佛滅後四百年間，由說一切有部分出來的一個流派。在三藏之中，唯以經為正量，故名經量部。`,

'經律論', `見三藏條。`,

'經供養', `書寫經文以做佛事。經屬於三寶中之法寶，故經供養是供養法寶。`,

'罪性', `罪業的本性。罪業的本性空而不可得。`,

'罪根', `罪惡的根本，即無明。`,

'罪報', `罪惡的報應，即苦果。`,

'罪福', `罪與福。五逆十惡等是罪，五戒十善等是福。罪有苦報，福有樂果。`,

'罪障', `罪惡是獲得樂果的障礙。`,

'群生', `許多的眾生。`,

'群有', `許多的有。眾生的果報叫做有，有有三有、九有、二十五有等的分別。`,

'群迷', `許多迷惑的眾生。`,

'聖', `正的意思，證正道，名為聖。`,

'聖人', `指大小乘見道以上斷惑證理的人，亦即智慧最卓越，人格最完善，能力最高強的人。`,

'聖印', `聖道的法印，如三法印與實相印等是。`,

'聖行', `進入聖位的行為，即戒定慧。`,

'聖言', `正直的言語。聖言有四種，即言不見為不見、言不聞為不聞、言不覺為不覺、言不知為不知。`,

'聖典', `佛經。`,

'聖果', `依聖道而得之果，即菩提涅槃。`,

'聖財', `聖人的財產。[[大寶積經|大寶積]]說：「<verse>信、戒、聞、慚、愧、捨、慧，如是等法，是謂聖財。彼諸眾生，不獲此故，名極貧窮。</verse>」`,

'聖胎', `指[[十住]][[十行]][[十迴向]]等之三賢位。`,

'聖僧', `得道的高僧。`,

'聖諦', `聖人所見的真理，即[[苦集滅道]]。`,

'聖應', `佛陀的感應。`,

'聖眾', `指[[聲聞]]、[[緣覺]]、[[菩薩]]、[[佛]]等四種得道的大眾。`,

'聖教', `聖人的言教。`,

'聖教量', `聖是聖人，教是教法，是因有聖人的文教才知道的意思，為[[三量]]之一。`,

'萬', `[[卍]]字的讀音，是吉祥的意思。`,

'萬行', `一切的行為或修行。`,

'萬字', `佛胸前有一[[卍]]字，此卍字乃是吉祥的標誌。`,

'萬劫', `指極長久的時間。`,

'萬境', `一切的境界。`,

'萬法', `一切的事物。`,

'萬法一如', `一切事物都是因緣和合而生，其性皆空，沒有差別。`,

'萬法無滯', `一切諸法都以空無自性為性，空性是一如不變的，由此不變的緣故，所以萬法即真如而畢竟無滯了。`,

'萬法唯識', `一切事物都是由識而顯現，在它們的生起上，心識的影響力最大，也是最重要的因素。`,

'萬德洪名', `謂在一佛的名字上最具有萬種之德。`,

'著', `纏愛不捨的意思，如愛著，執著，貪著。`,

'著我', `在[[五蘊]]假合的身上，執著有一個實我。`,

'著法', `在因緣生的事物上，執著有事物的實體存在。`,

'葷辛', `葷是有臭味的蔬菜，辛是帶有辣性的蔬菜。`,

'解', `１．解釋文義。２．知解之義。`,

'解執', `見解的執著。`,

'解惑', `解與惑。解是智；惑是煩惱。`,

'解空', `了解諸法的空相。佛弟子中以須菩提為解空第一。`,

'解行', `知解與修行。`,

'解行地', `由知解而修行的地位，也就是還未證得真如之[[地前三賢菩薩]]的階位。`,

'解行相應', `知解與修行相應。`,

'解脫', `脫離束縛而得自在的意思，亦即涅槃的別名。`,

'解脫衣|解脫幢相衣', `[[解脫幢相衣]]的簡稱，即[[袈裟]]的別名。`,

'解脫身', `已經解脫煩惱障礙的佛身，為[[二佛身]]之一。`,

'解脫味', `涅槃的妙味。`,

'解脫門', `通向涅槃的門戶，指空、無相、無願之三種禪定，因此三種禪定乃是通向涅槃的門戶。`,

'解脫服', `又名[[解脫衣]]、[[解脫幢衣]]、[[解脫幢相衣]]等，是袈裟的別名，因袈裟是志求解脫的人所穿的衣服。`,

'解脫相', `三相之一。見三相條。`,

'解脫道', `１．四道之一。見四道條。２．佛道的總稱，因佛道乃是出離痛苦而得解脫的正道。`,

'解脫堅固', `[[大集經]]所說五堅固之一，即佛滅後的第一個五百年間，正法興盛，證道者多，是解脫堅固的時期。`,

'解脫深坑', `謂只求自己解脫的人，不能圓滿自利利他的德行，猶如墜落在深坑之中。`,

'解脫知見', `自己知道已經獲得解脫的智慧，也就是觀照常明通達無礙的後得智。`,

'解脫幢相衣', `[[袈裟]]的別名，因袈裟是志求解脫的人所穿的衣服，而且其條相與佛塔之幢相似。`,

'解境十佛', `[[眾生身]]、[[國土身]]、[[業報身]]、[[聲聞身]]、[[辟支佛身]]、[[菩薩身]]、[[如來身]]、[[智身]]、[[法身]]、[[虛空身]]。`,

'解滿成佛', `四滿成佛之一。見四滿成佛條。`,

'資糧', `資是資助，糧是糧食，修道亦如遠行，要有善根福德正法等糧食資助其身，才能到達。`,

'資糧位', `唯識五位之一。見五位條。`,

'路迦祇夜', `華譯[[重頌]]，是十二分教之一。`,

'路迦那他', `華譯為[[世尊]]，是佛的別號。`,

'辟支|辟支迦佛陀', `[[辟支迦佛陀]]的簡稱。`,

'辟支地', `通教十地之一，即辟支佛的地位。`,

'辟支佛|辟支迦佛陀', `[[辟支迦佛陀]]的簡稱。`,

'辟支迦佛陀', `簡稱辟支、辟支迦佛、辟支佛等，華話為緣覺，或獨覺，因觀飛花落葉或十二因緣而開悟證道，故名緣覺，又因無師友之教導，全靠自己之覺悟而成道，故又名獨覺。`,

'遊化', `到處遊行和教化世人。`,

'遊心法界', `使心遊於法界，觀察照見千差萬別的諸法。`,

'遊增地獄', `在[[八熱地獄]]之中，每一根本地獄各有四門，每一門出去，都各有[[塘煨]]、[[屍糞]]、[[鋒刃]]、[[烈河]]等四類地獄，所以每一根本地獄，有十六遊增地獄。因這十六地獄是根本地獄的增屬，而且有罪業的眾生遊此，倍增苦惱，所以叫做遊增地獄。`,

'遊戲神通', `佛菩薩以神通攝化眾生，能出入無礙，自由自在。`,

'遊戲三昧', `佛菩薩遊於神通，化人以自娛樂，叫做遊戲，三昧是專心的意思，諸佛菩薩以專心救濟眾生為遊戲，故曰遊戲三昧。`,

'運心', `用心的意思。`,

'運心供養', `１．只在心中作供養的觀想，並不在行為上表現出來。２．供養時運心作觀。`,

'遍行', `指心所的遍行，有的心所，遍於善惡無記三性，遍於三界九地，遍於有漏無漏，世出世間，遍與八識心王相應，因為遍於上述四者，所以名遍行。遍行心所有五種，即作意、觸、受、想、思，此五種皆與五識心王，初念相應。`,

'遍行因', `六因之一。見六因條。`,

'遍行惑', `普遍遊行的煩惱，亦即一切煩惱起因之根本煩惱。`,

'遍行真如', `十真如之一。見十真如條。`,

'遍淨天', `[[色界]]第三禪天之第三天名，因此天淨光周遍，故名。`,

'遍依圓', `[[唯識學]]所說之三性。見三性條。`,

'遍周法界', `普遍周滿整個法界，是指法身的功德而言。`,

'遍法界身', `指佛的真身，因佛的真身廣大無邊，周遍於法界。`,

'遍照如來', `[[大日如來]]的別名。`,

'遍計所執性', `三性之一。見三性條。`,

'過未', `過去和未來。`,

'過去', `三世之一。`,

'過去七佛', `[[毘婆尸佛]]、[[尸棄佛]]、[[毘舍浮佛]]、[[拘留孫佛]]、[[拘那含牟尼佛]]、[[迦葉佛]]、[[釋迦牟尼佛]]。`,

'過去莊嚴劫', `劫有大中小三種，現在的大劫叫做賢劫，過去的大劫叫做莊嚴劫，未來的大劫叫做星宿劫。`,

'道', `１．能通的道路。２．真理的意思。３．即梵語所說的菩提或涅槃。４．修行的方法。`,

'道士', `有道之士。`,

'道元', `道的根本。`,

'道力', `種種正當道理的力量。`,

'道心', `１．義理的心。２．求道的心。`,

'道行', `修道的功行。`,

'道具', `修道時所用的器物，如三衣什物等是。`,

'道俗', `道與俗。出家的人叫做道；在家的人叫做俗。`,

'道果', `證道得果。道是菩提；果是涅槃。`,

'道品', `道法的品類。見三十七道品條。`,

'道宣', `唐朝人，俗姓錢，因久居終南山以盛弘[[律宗]]，故律宗又名南山律宗。`,

'道前', `在未見道以前。`,

'道中', `正在見道之中。`,

'道後', `已經見道之後。`,

'道理', `道法的義理。`,

'道眼', `１．能見正道的眼。２．觀道之眼。`,

'道業', `修道的事業。可以召感人天果報的是福業，可以成就佛果的是道業。`,

'道樹', `菩提樹。本名畢波羅樹，因佛在此樹下成道，所以又叫做道樹。`,

'道諦', `四諦之一。見四諦條。`,

'道信', `湖北人，俗性司馬，拜僧璨為佛，是[[禪宗]]第四祖。`,

'道器', `可以修學佛道的根器。`,

'道場', `１．群眾學道的場所。２．佛寺。３．成道的地方。４．供養佛的地方。`,

'道場神', `守護道場的神。`,

'道觀', `道是化道，教化他人的意思，觀是空觀，即觀察萬法性空的道理。自己安住於空的道理而又向他人勸說教化，叫做道觀雙流。`,

'道觀雙流', `見道觀條。`,

'道共戒', `二戒之一。見二戒條。`,

'道種性', `[[瓔珞經]]所說六種性之一，即十迴向之位，在此位開始真正修習中道觀，故名為道，能產生佛果，故名為種。`,

'道種智', `[[智度論]]所說三智之一。見三智條。`,

'達磨', `１．華譯為[[法]]，指佛所覺悟的真理和覺悟的方法。<br>２．菩提達磨的簡稱，印度人，梁武帝時泛海到達中國的廣州，武帝迎至建業，因與帝話不投機，遂渡江入魏，在嵩山少林寺面壁九年，為中國禪宗之始祖，圓寂於東魏天平以前，葬熊耳山。`,

'達磨忌', `即十月初五日，因此日是[[禪宗]]始祖的入寂日子。`,

'違境', `違逆自己心意的境界。`,

'違順', `違境與順境。`,

'酪', `一種精製的牛乳。[[涅槃經]]說：「<verse>聲聞如乳，緣覺如酪。</verse>」`,

'酪味', `[[天台宗]]以酪譬喻第二時的小乘教，為[[五味]]之一。`,

'酪經', `指一切的小乘經。`,

'缽|缽多羅', `梵語缽多羅的簡稱。見缽多羅條。`,

'缽多羅', `簡稱[[缽]]，為[[比丘六物]]之一，即盛飯器。譯為應器，或應量器。應有三應：一色相應，缽要灰黑色，令不起愛染心；二體相應，缽體粗質，使人不起貪意；三大小相應，不過量也，乞食不過七家，令人不恣口腹。當時四大天王，持四缽供佛，佛以神力，把牠合為一缽，這是有缽的歷史。`,

'缽里薩囉伐拏', `華譯[[濾水囊]]，是[[比丘六物]]之一。`,

'電', `[[金剛經]]六喻之一。電之為物，忽生忽滅，以喻世相之無常迅速。`,

'電光石火', `（喻）焂忽消失。`,

'電光朝露', `（喻）身體之無常。`,

'預流向', `四向之一。見四向條。`,

'預流果', `四果之一。見四果條。`,

'頓大', `指[[華嚴經]]。頓是頓教，大是大乘教。華嚴經是佛初成道時，對頓入之菩薩而頓說大乘之教法。`,

'頓悟', `聞法即悟的意思。`,

'頓教', `不歷階梯漸次，直指本源，頓時開悟的教法。`,

'頓說', `頓教的說法，即沒有經過小乘的階梯而直接即說大乘，如華嚴經是。`,

'頓根', `具有頓悟的根機的人。`,

'頓漸', `[[頓教]]與[[漸教]]。頓教是立刻速成的教法；漸教是逐漸成功的教法。`,

'頓斷', `立刻斷除種種的煩惱。`,

'頓覺', `立刻覺悟。`,

'飲酒', `[[五戒]]之一。酒中含有麻醉性，飲者迷失理智，誤造種種的過失，所以佛教戒之。`,

'飲酒十過', `一、[[顏色惡]]，即飲酒的人，顏貌容色，因之變常，無有善相。二、[[下劣]]，即飲酒的人，威儀不整，舉動輕薄，人所賤惡。三、[[眼視不明]]，即恣飲而狂癡瞻視，昏瞀不辨色境。四、[[現瞋恚相]]，即飲酒的人，行不善法，不顧親屬賢善，隨意忿怒。五、[[壞田業資生]]，即恣飲放逸，破費產業，散失資產。六、[[致疾痛]]，即飲酒過度，則身體失調，以致疾痛。七、[[益鬥訟]]，即醉酒發狠，與人爭競，不惜身命，而鬥訟益增。八、[[惡名流布]]，即飲酒的人，多棄捨善法，而醜名惡聲，流布遠近。九、[[智慧減少]]，即飲酒昏迷，愚痴狂妄，而智慧減少。十、[[命終墮惡道]]，即邀朋飲酒，不修善行，則惡業日增，命終墮落於惡道。`,

'飲食欲', `欲界三欲之一。見三欲條。`,

'飲食供養', `五種供養之一。見五種供養條。`,

'鳩摩', `華譯[[童真]]，或[[童相]]，是[[八地]]以上的菩薩的稱呼。`,

'鳩摩羅什', `華譯[[童壽]]，本印度人，但生長於[[龜茲]]，出家後，通大乘經論，後秦姚興弘始三年（西元四○一年）到中國長安，在逍遙園翻譯經典，前後所譯經論，凡三百八十餘卷，在秦弘始十五年（西元四一三年）示寂於長安，寂後火化，舌頭不爛，表示他所翻譯的經典，絕對可靠無誤。`,

'塗香', `把香水一類的東西塗在身上。`,

'新歲', `結夏[[安居]]完了的第二日，即七月十六日，是比丘的新年元旦。`,

'新發意', `新發求取菩提之意的人。`,

'新發意菩薩', `新發求取菩提之意的菩薩，為二種菩薩之一。`,

'新學菩薩', `新發心學習佛道的菩薩。`,

'新舊兩譯', `新譯與舊譯。在唐玄奘三藏以前者是舊譯，在玄奘以後者是新譯。`,

'準提菩薩', `準提華譯為[[清淨]]，讚歎心性清淨之稱，[[禪宗]]以為觀音部的一尊，[[東密]]以為[[六觀音]]之一，現三目十八臂形像。`
);


addTerms(14,

'像末', `像法與末法。見正像末條。`,

'像法', `正像末[[三時]]之一，像者相似，在佛入滅後五百年為正法時代，其後一千年間所行之法，與正法相似而非正法，故名像法時代。`,

'像教', `１．像法的教化。２．佛像與經教。`,

'僧', `[[僧伽]]的簡稱，於義為眾。集受具足戒的比丘，三人或四人以上，方得稱僧。見僧伽條。`,

'僧戒', `出家人所受的戒律，如沙彌之十戒與比丘之具足戒是。`,

'僧物', `僧眾所共有之物。`,

'僧侶', `僧徒。`,

'僧殘', `律學篇聚名之一，即犯了重戒將墮未墮，如人犯重罪，將瀕於危，僅留殘命的情形。`,

'僧璨', `江蘇徐州人，拜慧可為師，為[[禪宗]]第三祖。`,

'僧伽', `和合眾的意思。比丘三人以上，身和同住，口和無諍，意和同悅，戒和同修，利和同均，見和同解，以這六和的和諧合聚的精神，團結生活在一起，叫做和合眾。`,

'僧伽梨', `比丘三衣之一。見三衣條。`,

'僧伽藍|僧伽藍摩', `[[僧伽藍摩]]的簡稱。`,

'僧伽藍摩', `簡稱[[僧伽藍]]，或[[伽藍]]，譯為[[眾園]]，或[[叢林]]，是僧眾所居住的園林或寺院的通稱。`,

'僧祇', `１．華譯為[[大眾]]。２．[[阿僧祇]]的簡稱，華譯為無數，或無量。`,

'僧祇物', `僧祇譯為眾，即比丘比丘尼之大眾，此大眾共有之物，名僧祇物。`,

'僧祇部', `[[摩訶僧祇部]]的簡稱，華譯為[[大眾部]]。佛滅之後，在結集經典時，窟外的結集名大眾部，窟內的結集名[[上座部]]。`,

'僧祇律', `[[摩訶僧祇律]]的簡稱，即大眾部的律藏。`,

'僧寶', `三寶之一。見三寶條。`,

'僧寶果', `指斷盡煩惱的阿羅漢。`,

'厭世', `厭惡世間而求出離。`,

'厭求', `厭苦求樂。`,

'塵', `指不淨和能污濁人們真性的一切事物，如四塵五塵六塵等是。`,

'塵妄', `不淨叫做塵，不實叫做妄，塵妄是指一切生死的境界。`,

'塵沙', `１．（喻）數量極多，如塵如沙。２．[[天台宗]]所立三惑之一。見三惑條。`,

'塵相', `六塵之相。`,

'塵剎', `如微塵數的世界。剎華譯即國土或世界。`,

'塵垢', `[[煩惱]]的通稱。`,

'塵勞', `心勞塵境，是煩惱的別名。`,

'塵道', `１．指穢土。２．依[[華嚴教]]之意，塵即微塵，於十方虛空界之每一微塵中都含有世界，叫做塵道世界。`,

'塵劫', `塵點劫的簡稱。見塵點劫條。`,

'塵點劫', `１．指三千塵點劫，即磨一三千大千世界所有之物而為墨，每經一三千大千世界便下一點，墨完了，而所經過的世界又全部碎為微塵，再以每一微塵當作一劫來計算，這是表顯大通智勝佛出世迄今非常久遠的比喻。<br>２．指五百塵點劫，即抹五百千萬億那由他阿僧祇之三千大千世界為微塵，每經過一五百千萬億那由他阿僧祇之國便下一微塵，微塵盡了，而所經過的世界又全碎為微塵，再以每一微塵當作一劫來計算，這是表顯釋迦如來成佛迄今非常久遠的比喻。`,

'境', `心所遊履和攀緣的境界，如色為眼識所遊履，叫做色境，法為意識所遊履，叫做法境等是。`,

'境智', `[[境]]與[[智]]。所觀之理叫做境；能觀之心叫做智。`,

'境行果', `[[境]]是所觀之境界，[[行]]是所修之聞思修三慧，[[果]]是所証之菩提妙果。`,

'境界般若', `五種[[般若]]之一。`,

'壽相', `我人四相之一。見四相條。`,

'壽命', `人的一期生命。`,

'壽者', `一期生命存在於世間。`,

'壽者相', `執一期生命的長短。此相一立，則不了知緣生如幻的道理，焚香祈禱，妄圖長命，永為三有束縛，而不得解脫。`,

'實有', `實在的有。世人不了知一切諸法都是緣生的，無有實性，因而妄執它為實有。`,

'實我', `實在的我。我本來是五蘊假合而有的，離開了五蘊，那裡有實我的存在。`,

'實空', `一切法皆因緣生，無有自性，故謂之實空。`,

'實性', `真如的別名。[[仁王經]]說：「<verse>諸法實性，清淨平等，非有非無。</verse>」`,

'實教', `見二教條。`,

'實眼', `指[[五眼]]中之佛眼。`,

'實智', `見二智條。`,

'實經', `指一乘的經典。`,

'實語', `真實的言語。`,

'實相', `又名[[佛性]]、[[法性]]、[[真如]]、[[法身]]、[[真諦]]等，凡所有相，皆是虛妄，惟此獨實，不變不壞，故名實相。`,

'實相印', `四法印之一，因實相是無始以來佛佛相傳的印璽，故名實相印，一切的小乘經皆以三法印印之，一切的大乘經則以此實相印印之。`,

'實相身', `諸佛三身之一。見三種身條。`,

'實相義', `諸法實相的深義。`,

'實相慧', `證悟諸法實相的智慧。`,

'實相觀', `又名[[理觀]]。見二觀條。`,

'實相法界', `又叫做[[法界實相]]。[[法華|妙法蓮華]]說實相，[[華嚴]]說法界，實相與法界，同體異名。見實相條。`,

'實相法身', `[[華嚴宗]]所立五種法身之一。見五種法身條。`,

'實相經典', `宣說實相妙理的經典。`,

'實相念佛', `三種[[念佛]]之一，所謂實相者，即指如來法身，眾生佛性，因這與萬法虛假的形相不同，故稱實相。念實相佛，即是念十方諸佛法身，亦即念我心中，本源自性天真佛。`,

'實相無相', `實相是宇宙萬有的本體，這種本體離諸一切之相，故說實相無相。`,

'實相般若', `二般若之一。見二般若條。`,

'實相無漏大海', `真如實相，離一切之妄染，故謂之無漏，是空真如。又因含藏一切之功德，故謂之海，是不空真如。`,

'實相為物二身', `實相身和為物身。實相身是理佛，也就是法性法身；為物身是事佛，也就是方便法身。`,

'實報土', `實報無障礙土的簡稱。見四土條。`,

'實報寂光', `實報無障礙土與常寂光土。見四土條。`,

'實際', `真實到極點的意思，是真如法性的別名。`,

'實際理地', `真如無相的境界。`,

'實化二身', `實色身和化色身。見二色身條。`,

'實乘菩薩', `指藏通別圓四教中之圓教的菩薩。`,

'對治', `針對病情而治療，亦即斷除煩惱的意思。`,

'對法', `１．梵語[[阿毘達磨]]，華譯為對法。對是對觀對向之義，法是四諦涅槃之法，以無漏聖道的智慧去對觀四諦的道理和對向於涅槃的果實，故稱對法。<br>２．三藏中之論藏，亦名對法。`,

'對法藏', `１．即[[論藏]]，為[[三藏]]之一。２．世親菩薩所造的[[俱舍論]]，梵名[[阿毘達磨俱舍]]，華譯為對法藏。`,

'慈', `願給一切眾生安樂的心，也就是仁愛心的無限擴大。`,

'慈氏', `[[彌勒]]菩薩。`,

'慈光', `佛菩薩偉大慈悲的光輝。`,

'慈忍', `慈悲與忍辱。`,

'慈門', `佛菩薩的慈悲法門。`,

'慈尊|彌勒', `慈氏菩薩，亦即[[彌勒]]菩薩。`,

'慈航', `渡人脫離苦海的意思。`,

'慈恩', `１．慈悲的恩德。２．唐朝[[法相宗]]的祖師玄奘，住在京兆大慈恩寺，後人叫他做[[慈恩大師]]。`,

'慈恩家', `唐朝慈恩大師以[[法相宗]]成立一家，世稱慈恩家。`,

'慈恩宗', `又名[[法相宗]]、[[唯識宗]]、[[相宗]]、[[有宗]]等，唐時玄奘到中印度，就學於戒賢論師，回來後住在慈恩寺，故號慈恩宗。見法相宗條。`,

'慈恩三觀', `見三觀條。`,

'慈恩八宗', `慈恩大師將佛教分為八宗，即一、[[我法空有宗]]，指犢子部等；二、[[有法無我宗]]，指有部宗等；三、[[法無去來宗]]，指大眾部等；四、[[現實假實宗]]，指說假部等，五、[[俗妄真實宗]]，指說出世部等；六、[[諸法但名宗]]，指一說部等；七、[[勝義皆空宗]]，指般若等空宗龍樹系；八、[[應理圓實宗]]，指華嚴法華等經及無著系。`,

'慈雲', `宋杭州天竺靈山寺靈應尊者，名遵式，真宗賜號慈雲，天台寧海人，於國清寺普賢像前燒一指，誓傳[[天台]]之道。`,

'慈雲懺主', `中國宋朝[[遵式法師]]，號慈雲，治定[[往生淨土懺儀]]，[[請觀音消伏毒害懺儀]]、[[金光明懺法]]等，因而後世稱為慈雲懺主。`,

'慈悲', `慈與悲。願給一切眾生安樂叫做慈；願拔一切眾生痛苦叫做悲。`,

'慈悲衣', `袈裟。`,

'慈悲觀', `慈悲一切眾生的觀法，為五停心之一。`,

'慈悲懺法', `釋氏通鑑說：梁武帝妃郗氏，其性酷妒，死後化為巨蛇，一夜入後宮通夢於帝，求為修功德使離苦，帝閱大藏，製慈悲懺法，請僧懺罪，後得化為天人，於空中謝帝，帝畢生不復立后。`,

'慈悲十二利', `有慈悲心的人將獲得十二種的利益，即福常隨身、臥安、覺安、不見惡夢、天護、人愛、不毒、不兵、水不喪、火不喪、在所得到、死昇梵天。`,

'慈心三昧', `興發慈悲心的禪定。`,

'慚', `心所名，即自己反省，羞恥自己罪過的精神作用。`,

'慚愧', `慚與愧。慚是對自己德學淺陋，常懷慚念而生善；愧是怕自己作惡受人譏評，生愧心而止惡。`,

'慢', `驕慢。`,

'慢見', `十種見之一。見十種見條。`,

'慢使', `十使之一。見十使條。`,

'慢結', `九結之一。見九結條。`,

'慢幢', `謂我慢心一起，便自高自大，好像幢旗高聳一樣。`,

'慳', `不捨得把自己的東西施給人家。`,

'慳貪', `慳與貪。自己的東西不捨得給人家叫做慳；看見人家的東西就想要叫做貪。`,

'慳結', `九結之一。見九結條。`,

'慳法七報', `不肯向人說法或是不捨得把東西給人家的人，後世將得七種的惡報，即[[生盲報]]、[[愚痴報]]、[[生惡眾報]]、[[胎夭報]]、[[物恐報]]、[[善人遠離報]]、[[無惡不作報]]。`,

'滿業', `又名別報業，二業之一。`,

'滿分戒', `具足戒的別名。`,

'滿字教', `半滿二教之一。見二教條。`,

'漏', `[[煩惱]]的別名，含[[有漏泄]]和[[漏落]]二義。貪瞋等煩惱，日夜由六根門頭漏泄流注而不止，所以叫做漏，又煩惱能使人漏落於三惡道之中，所以也叫做漏。一切有煩惱之法就叫做有漏法，無煩惱之法就叫做無漏法。`,

'漏戒', `漏失戒律，即破戒。`,

'漏業', `有漏的業因。`,

'漏質', `有漏的體質，即有煩惱垢染的身體。`,

'漏縛', `漏與縳。漏是漏失的意思，縛是繫縛的意思，兩者都是煩惱的別名。`,

'漏盡', `斷盡一切的煩惱。`,

'漏盡力', `十力之一。見十力條。`,

'漏盡明|漏盡智證明', `[[漏盡智證明]]的簡稱。見三明條。`,

'漏盡通|漏盡智證通', `[[漏盡智證通]]的簡稱。見六通條。`,

'漏盡智', `斷盡一切煩惱之阿羅漢的智。`,

'漏盡智證明', `三明之一。見三明條。`,

'漏盡智證通', `六通之一。見六通條。`,

'漏盡比丘', `斷盡一切煩惱的比丘，即阿羅漢。`,

'漏盡意解', `斷盡一切煩惱之後心意獲得解脫，這是小乘阿羅漢所證得之果。`,

'漏盡無畏|漏盡無所畏', `與漏盡無所畏同。`,

'漏盡無所畏', `[[四無所畏]]之一，即在大眾之中明言我已經斷盡一切煩惱而無所怖畏。`,

'漏盡阿羅漢', `斷盡一切煩惱的阿羅漢。`,

'漸悟', `逐漸覺悟。見二悟條。`,

'漸教', `由淺入深的教法，如先說小乘然後才說大乘是。`,

'漸斷', `逐漸的斷除。`,

'漸次觀', `[[天台宗]]三種止觀之一，即先修數息觀，漸進而修至極的實相觀。`,

'漸頓教', `漸教與頓教。漸教是由淺入深逐漸成功的教法；頓教是立刻速成的教法。在天台化儀四教中，藏通別三教屬漸教，圓教屬頓教。`,

'琉璃', `一種青色的寶石，是七寶之一。`,

'琉璃王', `舍衛國波斯匿王的兒子，他嗣王位後，便率兵消滅迦毘羅衛國的釋種，涅槃經叫他琉璃太子。`,

'疑', `狐疑不信，是六根本煩惱之一。`,

'疑見', `對真理懷著猶豫不決的見解，是十種見之一。`,

'疑使', `十使之一。見十使條。`,

'疑結', `九結之一。見九結條。`,

'疑蓋', `五蓋之一。見五蓋條。`,

'疑城胎宮', `[[阿彌陀佛]]的淨土的邊埵，有一座以七寶所莊嚴的宮殿，凡是懷著懷疑的心去念佛的人，將來就胎生到這宮殿中，可是在五百年間，不得聽聞三寶之名。因為是疑惑的人所居住的地方，所以叫做疑城，又因為是胎生的宮殿，所以叫做胎宮。`,

'盡形壽', `盡我們這一世的身形和壽命。`,

'盡未來際', `盡未來世的意思，亦即永恆之義。`,

'盡虛空界', `盡十方虛空以為界，虛空無界，故無窮盡。`,

'福分', `見二分條。`,

'福行', `見三行條。`,

'福因', `招感福報的業因，亦即布施持戒等之善根功德。`,

'福地', `寺院的德號，因寺院是生長福德之地。`,

'福足', `見二足條。`,

'福智', `福德與智慧。佛菩薩的化身，即以福德和智慧來作莊嚴。`,

'福業', `召感福報的業因。見三福業條。`,

'福慧', `福德和智慧，此二者是佛菩薩的二種莊嚴。`,

'福田', `田以生長為義，人若行善修慧，猶如農夫於田下種，能得福慧之報，故名福田。`,

'福田衣', `[[袈裟]]的別名。`,

'福德', `修人天善行所感得的福分。福德與功德不同，外修事功的有漏善是福德，內證佛性無漏智才是功德，福德功德俱修俱足，才是出離生死苦海乃至成佛作祖之道。`,

'福德莊嚴', `[[二種莊嚴]]之一，即修福德之善行以莊嚴佛果。`,

'種性', `各種的根性。`,

'種智|一切種智', `[[一切種智]]的簡稱。見一切種智條。`,

'種識|種子識', `[[種子識]]的簡稱，是第八識的別名。`,

'種覺', `佛證一切種智之後，便能大覺圓滿，故名種覺。`,

'種子', `[[法相宗]]將阿賴耶識中，能生一切法的功能，叫做種子，說它好像植物的種子能開花結果。`,

'種子識', `[[阿賴耶]]識的別名。`,

'種種界智力', `[[十力]]之一。`,

'種種勝解智力', `[[十力]]之一。`,

'稱念', `稱名念佛。`,

'稱名', `稱念佛的名號。`,

'稱名正行', `見五正行條。`,

'稱名雜行', `見五雜行條。`,

'精舍', `[[寺院]]的別名。`,

'精進', `又叫做[[勤]]，即努力向善向上。`,

'精進根', `[[五根]]之一。`,

'精進覺支', `見七覺分條。`,

'精進如意足', `[[四如意足]]之一。`,

'精進波羅蜜', `又名[[勤波羅蜜]]，見六波羅蜜條。`,

'維摩|維摩詰', `[[維摩詰]]的簡稱，華譯為[[淨名]]，淨是清淨無垢之義，名是聲名遠揚之義，相傳是金粟如來的化身，自妙喜國化生在此世上，以居士的身份輔助釋迦教化眾生。`,

'維摩詰|維摩條', `見維摩條。`,

'綺語', `說無禮義不正經的話，是[[十惡]]之一。`,

'緇素', `緇是紫黑色，素是白色，僧著紫黑衣，俗人多著白衣，故號僧俗為緇素。`,

'聞慧', `聽聞佛法能生智慧，為[[三慧]]之一。`,

'聞法', `聽聞佛的教法。`,

'聞法難', `很難有機會聽到正法，是[[四難]]之一。`,

'聞持', `聞佛的教法而憶持不忘，即[[陀羅尼]]。`,

'聞持陀羅尼', `簡稱聞陀羅尼，是[[四陀羅尼]]之一。`,

'聞思修', `見三慧條。`,

'聞成就', `見六成就條。`,

'蓋', `[[煩惱]]的別名，因煩惱能覆蓋行者的清淨心，使善心不能開發。`,

'蓋纏', `[[五蓋]]與[[十纏]]。`,

'誓願', `[[立誓]]和[[發願]]。諸佛菩薩都有總別的二種誓願，如[[四弘誓願]]是[[總誓願]]，如[[阿彌陀佛]]的[[四十八願]]與[[藥師佛]]的十二願是[[別誓願]]。`,

'誓願安樂行', `見四安樂行條。`,

'語密', `如來三密之一。見三密條。`,

'語業', `[[三業]]之一，即口之所語，如妄言綺語等是惡語業，如愛語實語等是善語業。`,

'說法', `演說佛的教義。`,

'說通', `能隨順眾生的根機，以巧方便為之說法，叫做說通。`,

'說因部', `[[說一切有部]]的別名。`,

'說假部', `[[小乘]][[二十部]]之一，於佛滅後二百年間由大眾部中分出。`,

'說轉部', `[[經量部]]的別名，小乘二十部之一。`,

'說出世部', `[[小乘]][[二十部]]之一，於佛滅後二百年由大眾部中分出。`,

'說一切有部', `簡稱[[有部]]，別名[[說因部]]，為小乘二十部之一。`,

'說障法無所畏', `見四無畏條。`,

'說障道無所畏', `見四無畏條。`,

'說出苦道無所畏', `見四無畏條。`,

'輕安', `輕鬆安祥。`,

'輕安覺支', `見七覺分條。`,

'遠師', `[[慧遠]]法師。`,

'遠行地', `菩薩[[十地]]中之第七地名。`,

'銀輪王', `四輪王之一。見轉輪王條。`,

'銅輪王', `四輪王之一。見轉輪王條。`,

'銅鍱部', `[[上座部]]的別名。`,

'障', `[[煩惱]]的別名，因煩惱能障礙聖道。`,

'障盡解脫', `見二解脫條。`,

'魂神', `[[心識]]的別名，俗稱為靈魂。`,

'魂魄', `[[心身]]的別名。魂是心識，有靈用但無形；魄是有形的身體，是心識的依處。`,

'鼻入', `[[十二入]]之一。`,

'鼻根', `[[六根]]之一。`,

'鼻識', `[[六識]]之一。`,

'嘉祥', `隋會稽嘉祥寺[[吉藏]]大師，以寺名稱為嘉祥，是[[三論宗]]之祖。`,

'漉水囊', `[[比丘六物]]之一，即濾水去蟲的器具。`
);


addTerms(15,

'增劫', `人壽由十歲起，每百年增一歲，增至八萬四千歲之間，叫做增劫。`,

'增悲', `在[[菩薩]]的種性中，有[[悲增]]和[[智增]]的二種，速斷煩惱而證佛果，叫做智增，不斷煩惱而永利眾生，叫做悲增。悲增智增又名增悲增智。`,

'增上', `增強其向上之勢。`,

'增上緣', `見四緣條。`,

'增上慢', `見七慢條。`,

'增上心', `１．強盛的心。２．定心的別名，因定心的勢力很強盛。`,

'增上心學', `即定學，[[三學]]之一。`,

'增上戒學', `即戒學，[[三學]]之一。`,

'增上慧學', `即慧學，[[三學]]之一。`,

'增長', `增進長大。`,

'增長天', `四王天中南方天之名。見四天王條。`,

'增長廣目', `[[增長天]]與[[廣目天]]。`,

'廣目天', `[[四天王天]]之一。`,

'廣果天', `[[色界]][[四禪]]八天中之第三天名。`,

'廣長舌', `佛[[三十二相]]之一，佛舌廣長，而且柔軟紅薄，能覆面至髮際。`,

'廣長輪相', `[[大日如來]]要說真言時，必先現其周遍法界之廣長舌，以證明其言誠實非虛，叫做如來廣長輪相。`,

'廣博身如來', `[[大日如來]]的別名。`,

'廣狹自在無礙門', `[[十玄門]]之一。`,

'影向眾|影響眾', `見影響眾條。`,

'影響眾', `又作[[影向眾]]，為[[四眾]]之一，諸佛與法身菩薩，為了贊助釋迦如來的教化，於是應現如影如響之身，以擁護釋迦如來的道場。`,

'德號', `表現佛功德的名號。`,

'慧', `叡智的意思，也就是確知諸法真相的智慧。`,

'慧力', `智慧有消除煩惱的力量，為[[五力]]之一。`,

'慧日', `（喻）佛的智慧如日能照明一切黑暗。`,

'慧可', `北魏洛陽人，初名[[神光]]，後在嵩山少林寺拜達摩為師，改名為慧可，承接[[達摩]]的[[衣缽]]，為[[禪宗]]之第二祖。`,

'慧目', `智慧的眼目。`,

'慧足', `見二足條。`,

'慧門', `通入智慧的法門。`,

'慧命', `把智慧當生命。修行人全靠智慧，所以修行人把智慧當做生命。`,

'慧能', `唐朝高僧，係中國[[禪宗]]之第六祖。見惠能條。`,

'慧根', `智慧的根性，為[[五根]]之一。`,

'慧學', `[[三學]]之一。`,

'慧劍', `（喻）智慧鋒利如刀劍，能斬斷一切的煩惱。`,

'慧遠', `中國東晉時人，居廬山，與劉遺民等同修淨土，為[[淨土宗]]之始祖。`,

'慧印', `又名智印，即是決定不變的意思，如來的智慧，因契合諸法的實相，而決定不變，所以叫做慧印。`,

'慧印三昧', `產生慧印的禪定。`,

'慧炬', `智慧的火炬。`,

'慧炬三昧', `[[法華經|妙法蓮華]]所說十六三昧之一，入此三昧，能興發智慧之火炬，照明世間的險難。`,

'慧無減', `[[十八不共法]]之一。`,

'憍', `憍慢自大。`,

'憍慢', `自大高傲的心理。`,

'憍陳如', `[[五比丘]]之一，也就是佛最初的弟子。`,

'摩頂', `佛用手撫摩弟子之頂。通常佛不是為了付囑大法而撫摩弟子之頂，就是為了授記而撫摩弟子之頂。`,

'摩頂授記', `摩頂是佛用手撫摩弟子之頂，授記是授將來成佛的預記。`,

'摩訶', `譯義為大、多、勝。`,

'摩訶衍', `[[摩訶衍那]]的簡稱，華譯為[[大乘]]。`,

'摩訶衍那', `華譯[[大乘]]。`,

'摩訶薩|摩訶薩埵', `[[摩訶薩埵]]的簡稱。`,

'摩訶薩埵', `華譯為[[大心]]，或[[大有情]]，指有作佛之大心願的眾生，亦即大菩薩。`,

'摩訶摩耶', `即摩耶夫人，她是淨飯王的夫人，也是釋尊的母親。`,

'摩訶迦葉', `[[摩訶迦葉波]]的簡稱，是佛[[十大弟子]]之一，以頭陀第一著稱。`,

'摩訶目犍連', `簡稱[[目犍連]]，或[[目連]]，是[[佛十大弟子]]之一，以神通第一著稱。`,

'摩訶般若', `華譯為[[大智慧]]，即佛照了諸法實相的智慧。`,

'摩訶般若波羅蜜多', `華譯為[[大智慧度]]，意謂乘此大智慧則能由生死苦海渡到涅槃彼岸。`,

'摩訶般涅槃那', `華譯為[[大滅度]]，或[[大圓寂入]]。見大般涅槃條。`,

'摩觸', `學法女六法之一。`,

'摩觸戒', `八波羅夷之一。見八波羅夷條。`,

'摩呼洛伽', `又譯作[[摩侯羅伽]]，八部眾之一，即大蟒神，其形人身而蛇首。`,

'摩侯羅伽', `見摩呼洛伽條。`,

'摩醯首羅天', `華譯為[[大自在天]]，在[[色界]]的最高處。`,

'敷具', `[[袈裟]]的別名。`,

'數門|數息門', `[[數息門]]的簡稱，即數息觀。`,

'數息門', `[[六妙門]]之一。`,

'數息觀', `默數呼吸的出入以停止心想散亂的觀法，為[[五停心觀]]之一。`,

'樂', `遇好緣好境而心情愉快。`,

'樂神', `即乾闥婆，為八部眾之一。`,

'樂邦', `安樂的邦土，通常是指西方極樂世界。`,

'樂果', `至樂之果，即涅槃。`,

'樂受', `[[三受]]之一。`,

'樂說', `[[四無礙]]之一。`,

'樂說無礙', `見無礙解條。`,

'樂說無礙智', `見四無礙智條。`,

'樂變化天', `[[欲界]]六天中之第五天名。`,

'潔齋', `謂停止淫事及斷除酒肉。`,

'熟酥味', `見五味條。`,

'熱惱', `因痛苦而身熱心惱。`,

'熱鐵地獄', `以熱鐵造成的地獄。`,

'瞋', `惱怒打罵傷害別人，為[[三毒]]之一。`,

'瞋火', `怒火。`,

'瞋心', `瞋恚無忍的心，為[[三毒]]之一。`,

'瞋毒', `[[三毒]]之一。`,

'瞋病', `[[三病]]之一。`,

'瞋縛', `[[三縛]]之一。`,

'瞋恚', `[[三毒]]之一。`,

'瞋恚火', `１．怒火。２．（喻）怒火能將人的一切功德燒毀。`,

'瞋恚使', `[[五鈍使]]之一。`,

'緣', `１．事物的相涉關係，如因緣。２．攀附的意思，如攀緣。`,

'緣力', `助緣的力量。`,

'緣心', `攀緣事物的心。`,

'緣日', `結緣的日子。`,

'緣因', `見二因緣。`,

'緣成', `眾緣和合而成。`,

'緣事', `信有因果報應的事實，叫做緣事，若信非因非果法性之妙理，則叫做緣理。`,

'緣理', `觀念真理。見緣事條。`,

'緣緣', `又名[[所緣緣]]，即所緣之緣，為四緣之一。`,

'緣生', `眾緣和合而生。`,

'緣起', `１．眾緣和合而生起，也就是各種條件和合而生的意思，一切有為法都是由眾緣和合而生起的。<br>２．事情起始的緣由。`,

'緣起門', `二門之一。見二門條。`,

'緣起中道', `緣起即性空，性空而能緣起，這即是中道義，中道即[[般若無分別慧]]，亦名[[無所得智]]。`,

'緣起性空', `緣起是說世間的一切事物都是由眾緣和合而生起的，性空是說眾緣合成的諸法，其性本空，無有真實的自體。`,

'緣缺不生', `謂雖然主因存在，但缺乏助緣，一切事物還是不能顯現。`,

'緣覺', `又名[[獨覺]]，或[[辟支佛]]，於佛世聽佛說[[十二因緣]]之理而悟道者，名為緣覺，若生於無佛之世，觀諸法生滅因緣而自行悟道者，名為獨覺。`,

'緣覺乘', `[[二乘]]或[[三乘]]之一，凡依[[十二因緣]]之理而起修和悟道者，總稱為緣覺乘。緣覺乘修十二因緣觀，自凡夫至辟支佛，論時間，速者四生，遲者一百劫，其修行重在悟證，悟所到處，便是證所到處，故無明顯的階位可言。`,

'緣覺法界', `[[十法界]]之一。`,

'緣覺菩提', `[[三菩提]]之一。`,

'緣慮心', `[[四種心]]之一，即攀緣境界而又思慮事物的心。`,

'緣縛斷', `斷所緣之縳。`,

'羯磨', `華譯作[[業]]，即作授戒懺悔等事業的一種宣告儀式，由此宣告儀式的宣告文，而成就所作之業。`,

'羯磨僧', `辦理授戒懺悔等事的師父。`,

'羯磨戒師|羯磨阿闍梨', `與[[羯磨阿闍梨]]同。`,

'羯磨阿闍梨', `又名[[羯磨戒師]]，或簡稱[[戒師]]，即授戒時讀羯磨文的師父，為授戒三師之一。`,

'蓮邦', `[[極樂世界]]的別名，因極樂世界的眾生都居住在蓮花之中。`,

'蓮剎', `[[極樂世界]]的別名。`,

'蓮胎', `念佛往生彌陀淨土的人，都在蓮花之中托生，因此蓮花好像母胎，所以叫蓮胎。`,

'蓮座', `蓮華的台座，即佛座。`,

'蓮眼', `青蓮華之眼，即[[佛眼]]。`,

'蓮宗', `[[淨土宗]]。`,

'蓮宗九祖', `[[淨土宗]]的九位祖師，即初祖圓悟大師廬山東林[[慧遠和尚]]，二祖長安光明[[善導和尚]]，三祖衝山般舟[[承遠大師]]，四祖衡州雲峰[[法照國師]]，五祖新定烏龍[[少康大師]]，六祖杭州永明[[延壽和尚]]，七祖武林昭慶[[省常和尚]]，八祖古杭雲棲[[蓮池大師]]，九祖鳳山梵天[[省庵法師]]。`,

'蓮華', `植物名。印度共有四種的蓮華，即[[優缽羅華]]、[[拘物頭華]]、[[波頭摩華]]、[[芬陀利華]]，亦即青黃赤白四種顏色的蓮華，通常所說的蓮華，是指芬陀利白蓮華。佛教以蓮華代表清淨，因蓮華出污泥而不染。`,

'蓮華子', `蓮華部的弟子。`,

'蓮華衣', `又名蓮花服，[[袈裟]]的別名，取清淨無染之義。`,

'蓮華坐', `１．半跏坐名[[吉祥坐]]，結跏趺坐即是蓮華坐。２．蓮華的臺座。`,

'蓮華部', `[[胎藏界三部]]之一，或[[金剛界五部]]之一。`,

'蓮華念誦', `五種念誦之一。見五種念誦條。`,

'蓮華勝會', `修行念佛的集會。`,

'蓮華藏世界', `簡稱[[華藏世界]]，即諸佛報身的淨土，因為是由寶蓮華所成，所以叫做蓮華藏世界。釋迦的華嚴，華嚴經所說者是，彌陀的華藏，觀經所說之極樂是，大日的華藏，大日經胎藏界密嚴經所說之密嚴國是。見華藏世界條。`,

'誹謗正法', `誹謗佛法。正法即佛法，誹謗佛法的人叫做謗法闡提，因其罪至重，故很難成佛。`,

'調御師', `[[佛]]的別名。見調御丈夫條。`,

'調御丈夫', `[[佛]][[十號]]之一，佛能調御一切可度的丈夫，使他們發心修道。`,

'論', `佛自己議論問答以辨別道理，或是佛弟子議論佛的說話或法相，只要與佛法相應的，都叫做論，為[[三藏]]之一。`,

'論部|論藏', `[[三藏]]中的[[論藏]]。`,

'論藏', `三藏之一。見三藏條。`,

'賢', `證悟真理的人叫做聖，比聖略遜一籌的人就叫做賢。`,

'賢人', `指證得各種果位，但還沒有證得法身的人，如聲聞乘預流果以前及菩薩乘初地以前的修行人，都叫做賢人。`,

'賢聖', `在凡夫之位的修行人叫做賢，已經斷惑證真的人即叫做聖。`,

'賢首', `１．比丘的尊稱，與賢者尊者同義。２．人名，為[[華嚴宗]]之第三祖。`,

'賢首宗', `[[華嚴宗]]，因此宗為[[賢首國師]]所發揚，故別名為賢首宗。`,

'賢劫', `過去的大劫叫[[莊嚴劫]]，未來的大劫叫[[星宿劫]]，賢劫即現在的大劫，因在此賢劫中，有一千尊佛出世，故稱為賢劫，又名[[善劫]]。`,

'賢劫千佛', `現在的住中劫，名叫[[賢劫]]，在此中劫的二十小劫中，有一千佛出世，始自[[拘留孫佛]]，終至[[樓至佛]]，是名賢劫千佛，本師[[釋迦牟尼]]佛，為其中之第四尊佛。`,

'賢冑部', `[[小乘]][[二十部]]之一，於佛滅後三百年，由犢子部中流出，但所說者與犢子部同。`,

'質多', `又作[[質多耶]]，或[[質帝]]，華譯為[[心]]，即慮知的心。`,

'質帝|質多', `見質多條。`,

'質多耶|質多', `見質多條。`,

'趣', `趣向的意思，眾生受報，皆由因趣果，故六道又名六趣。`,

'趣寂', `謂二乘人趣向於寂滅的涅槃。`,

'輪王', `[[轉輪聖王]]的簡稱，為世間第一有福之人。輪王有四種，在第十小劫的增劫，人壽增至二萬歲時，[[鐵輪王]]出現，統轄南贍部洲。增至四萬歲時，[[銅輪王]]出現，統轄南贍部及東勝身二洲。增至六萬歲時，[[銀輪王]]出現，統轄南贍部、東勝身和西牛貨三洲。增至八萬四千歲時，[[金輪王]]出現，統轄四天下。通常所說的輪王，是指金輪王。參考轉輪王條。`,

'輪迴', `謂眾生從無始以來，展轉生死於三界六道之中，如車輪一樣的旋轉，沒有脫出之期。`,

'輪寶', `[[轉輪王]]的寶器。這種寶器當輪王遊行時，必先自前進，以制伏四方，有金銀銅鐵四種，故有金銀銅鐵四種輪王的分別。`,

'輪轉|輪迴', `與[[輪迴]]同義。`,

'遮戒', `二種戒之一。見二種戒條。`,

'遮性', `遮戒與性戒。見二種戒條。`,

'遮惡', `遮止作惡。`,

'遮罪', `觸犯遮戒之罪。戒有性戒和遮戒二種，殺盜淫妄是性戒，飲酒等禁戒是遮戒。觸犯性戒之罪重，觸犯遮戒之罪輕。`,

'遮那', `又作[[舍那]]，[[毘盧遮那]]的簡稱。顯教用舍字，密教用遮字。`,

'遮那教主', `毘盧遮那如來是真言兩部的教主。`,

'溈山', `唐潭州溈山禪師，名靈祐，福州長谿人，參百丈懷海禪師，究明心法，值武宗毀佛，裹頭隱藏於民間，大中初，還為山，宏法四十餘年寂，壽八十三。`,

'澄觀', `人名，居五台山清涼寺，唐德宗誕辰，講經內殿，以妙法清涼帝心，賜號[[清涼法師]]，為[[華嚴宗]]之第四祖。`,

'劍山', `又名[[劍樹]]，為十六[[遊增地獄]]之一。`,

'劍樹地獄', `[[十六小地獄]]之一。`,

'撥無因果', `不相信有因果報應的道理。`,

'彈偏斥小', `彈呵二乘的偏空，排斥小乘的自利。`,

'歎大褒圓', `讚歎大乘，褒揚圓頓。`
);


addTerms(16,

'器界', `器物世界，是山河大地房屋及一切器用物品的總稱。與[[器世間]]同義。`,

'器世間', `指一切眾生依之而住的國土世界，因國土世界好像器物，能容納眾生居住。`,

'器世界|器世間', `與[[器世間]]同義。`,

'學', `修學戒定慧。在因位叫做有學，在果上則叫做無學。`,

'學人', `學道的人。`,

'學處', `１．修學之處，如五戒也叫五學處。２．科目，即修學佛法的科目。３．方法，即修學佛法的方法。`,

'學法女', `見式叉摩那尼條。`,

'學無學', `[[有學]]和[[無學]]。修正道以斷煩惱，叫做有學；悟真理而斷煩惱，再無可修學，叫做無學。小乘以前面之三果為有學，最後之阿羅漢果為無學，大乘則以菩薩之十地為有學，至高無上的佛果為無學。`,

'導師', `引導大眾進入佛道的人，是佛菩薩的通稱。`,

'憶持', `記憶和受持。`,

'懈怠', `懶惰。`,

'懈慢界', `又名[[懈慢國]]，此國位於我們此世界的西方十二億那由他之處，正好是去極樂世界的中途，生活在那裡的人，因貪戀其國土的快樂，人人生起一種懈怠憍慢的心理，不想再進一步的生到極樂世界去。`,

'擇滅', `[[涅槃]]的別名，因涅槃是人類最高智慧所選擇的寂滅法。`,

'擇法眼', `選擇正法之眼。`,

'擇法覺支', `見七覺支條。`,

'曇無|達磨', `又作[[達磨]]，華譯為[[法]]。`,

'曇摩|達磨', `見曇無條。`,

'樹想', `十六觀之一。`,

'樹下坐', `[[十二頭陀]]行之一。`,

'機', `１．根機。２．機緣。`,

'機性', `人的機根性質。`,

'機根', `機緣和根性。`,

'機教', `眾生的根機和佛的教法。`,

'機緣', `１．根機和因緣。２．從前結過的緣，現在到了熟的時候，也就是機會到了。`,

'橫起', `見橫出條。`,

'橫截', `橫截三界五趣生死之流，以便往生西方極樂世界。`,

'橫出', `淨土門易行道中有橫超與橫出的二道，聞悉如來的本願而不疑，憑此堅強的信念就會得到往生的益處，死後直接往生於真實的報土，叫做橫超，若是單憑自己的力量而修定散之諸行，將來死後往生於方便的化土，叫做橫出。`,

'濁劫', `濁惡的時期，也就是[[五濁]]中之[[劫濁]]，在減劫人壽二萬歲以後開始。`,

'濁惡', `五濁和十惡。五濁是[[見濁]]、[[煩惱濁]]、[[眾生濁]]、[[命濁]]、[[劫濁]]；十惡是[[殺]]、[[盜]]、[[淫]]、[[妄]]、[[惡口]]、[[兩舌]]、[[綺語]]、[[貪欲]]、[[瞋恚]]、[[邪見]]。`,

'濁惡處', `五濁十惡之處，即[[娑婆世界]]。`,

'燄口', `餓鬼名，因其口出火燄，故名。`,

'燈', `[[六種供具]]之一。`,

'燈明', `[[六種供具]]之一，即在佛前所供奉的燈火，它標誌佛的[[智波羅蜜]]。`,

'燈明佛', `[[日月燈明佛]]的簡稱。`,

'燃指', `把一隻手指在佛前燒去，意思是拿這隻手指來供佛。`,

'燃燈佛|然燈佛', `見然燈佛條。`,

'燒香', `五種供養或六種供養之一，按照[[世諦]]來說，目的是拂邪氣，請神靈，若按照第一義諦來說，則是使所修的功德，周遍於一切處。`,

'燒指', `自燒手指，以表示其信仰之虔誠。`,

'獨覺', `又名[[緣覺]]，或[[辟支佛]]，是於無佛之世靠自己覺悟的力量而脫離生死的人。`,

'獨覺捨悲障', `獨覺的行人，但能自度，無利他之心，故不能起大悲心以利益眾生，因此不能獲得至高無上的佛果，故曰捨悲障。`,

'獨散意識|獨散意識', `獨的意思，是它能獨起思構，獨自分別一切法，或獨作回憶過去的事，獨生出極猛利的勢用。散的意思，是凡夫心常散亂，故名獨散。因它不必和前五識俱起，故又名獨頭意識。`,

'獨頭意識', `與[[獨散意識]]同義。`,

'縛', `[[煩惱]]的別名，因煩惱能繫縛人們的身心，使不得自在。`,

'縛定印', `金剛部的入定印。`,

'蕅益', `名[[智旭]]，與[[永明]]、[[蓮池]]、[[憨山]]等為明末清初四大師。`,

'融通', `和洽的意思。`,

'遵式', `宋[[慈雲懺主]]的名字。見慈雲條。`,

'親緣', `淨土門所立三緣之一。見三緣條。`,

'睹史多天|兜率天', `[[兜率天]]。`,

'諦', `真實不虛妄的道理的意思，如俗事虛妄的道理，叫做俗諦，涅槃寂靜的道理叫做真諦。`,

'諦善巧', `[[十善巧]]之一。`,

'諦察法忍', `[[三忍]]之一。`,

'諸天', `指三界二十八天。見二十八天條。`,

'諸見', `一切的邪見。`,

'諸有', `一切之有。有有三有、四有、七有、九有、二十五有等的分別。`,

'諸宗', `一切的宗派。`,

'諸受', `苦樂捨等一切感受。`,

'諸相', `一切事物的形相。`,

'諸漏', `一切的煩惱。漏即煩惱的別名。`,

'諸趣', `六道的意思。`,

'諸蘊', `指色受想行識五蘊。見五蘊條。`,

'諸佛', `所有十方三世一切之佛。`,

'諸法', `指森羅萬象的一切事物。`,

'諸法真如', `以法空觀，觀法空之後，所得的真如，叫法空真如，若觀諸法皆空，即得諸法真如。`,

'諳法皆空', `謂諸法皆無自性，當體即空。`,

'諸法實相', `又名真如、法性、實際等，即一切事物的真相或真理。`,

'諸法無我', `三法印之一。見三法印條。`,

'諸法無相', `謂諸法都是因緣假合而生，無一定的形相。`,

'諸法因緣生', `一切事物都是由因緣和合而生。`,

'諸法寂滅相', `諸法的實相，是言語道斷，心行處滅，所以叫做寂滅相。`,

'諸法畢竟空', `有為無為諸法畢竟空無的意思。有為法乃因緣所生，只有假相幻用，空無自性，故畢竟空，無為法連假相幻用都無，是智觀上假說名義，所以也是畢竟空。`,

'諸上善人', `許多上等的善人。`,

'諸行無常', `三法印之一。見三印條。`,

'賴耶|阿賴耶', `[[阿賴耶]]的簡稱。`,

'賴耶識|阿賴耶', `[[阿賴耶]]識的簡稱。`,

'遶佛', `旋遶諸佛，是表示恭敬愛慕的意思。`,

'遶塔', `右遶佛塔，是表示歸敬的意思。`,

'醍醐', `經過多次製煉的乳酪，味中第一，也可作藥用醫眾病，在涅槃經中，把它比喻佛性，是[[五味]]之一。`,

'醍醐味', `五味之一。見五味條。`,

'醍醐經', `[[天台宗]]說[[法華|妙法蓮華]][[涅槃]]二經是醍醐味的經典。`,

'錫杖', `菩薩[[頭陀]][[十八物]]之一，上有四股十二環，表四諦十二因緣之義。比丘向人乞食，到門口，便振動錫杖上的小環作聲，以讓人知道。`,

'閻王', `即[[閻羅王]]，又譯作[[琰魔王]]，若譯義為[[雙世]]，言其苦樂並受。又為雙王，言兄妹二人並為王，兄治男事，妺治女事。据法苑珠林記載：閻羅王往昔為沙毘國王，與鄰國戰而敗，國王忿極，與諸大臣兵卒皆發願，願死後為地獄主，執鄰國諸惡人，一一投之地獄以洩忿。後此國王，死後為閻羅王，其大臣兵卒，亦皆為地獄官卒。`,

'閻魔卒', `呵責墮落地獄的罪人的獄卒。`,

'閻浮|閻浮提', `見閻浮提條。`,

'閻浮提|閻浮提', `華譯為[[贍部洲]]。閻浮是樹名，譯為贍部，因為此洲的中心，有閻浮樹的森林，依此樹的緣故，稱為贍部洲，贍部洲就是我們現在所住的娑婆世界。`,

'隨喜', `１．見人做善事或離苦得樂而心生歡喜。２．隨著自己的歡喜。`,

'隨喜功德', `隨順他人的歡喜，成為自己的歡喜，或見他人所做的功德善事，自己心生歡喜，好像是自己做的一樣，盡力去助他成功，都可以叫做隨喜功德。`,

'隨順', `隨之順之的意思。`,

'隨眠', `１．依小乘有部的宗義說是煩惱的別名，因煩惱隨逐眾生，而且它幽微難知猶如睡眠，故名。２．依大乘唯識的宗義說，煩惱的種子，隨逐眾生，眠伏於阿賴耶識中，故曰隨眠。`,

'隨分', `隨力量的大小。`,

'隨分果', `隨分覺的結果。`,

'隨分覺', `起信論所說四覺之一。見四覺條。`,

'隨緣', `隨著各種的因緣。`,

'隨緣假', `四假之一。見四假條。`,

'隨緣不變', `雖隨千差萬別的機緣，但本體不變。`,

'隨緣真如', `二種真如之一。見二種真如條。`,

'隨類', `佛菩薩隨著眾生的種類而現形垂教。`,

'隨類不定', `佛菩薩為了濟渡眾生，而示現不一定的身體。`,

'隨類應身', `隨著眾生的種類和根基，應現種種之身去化度。`,

'隨煩惱', `指隨逐六根本煩惱而起的煩惱，在[[大乘百法|五位百法]]中說有二十種，這二十種煩惱，隨逐於心，隨心而起，所以又名[[枝末煩惱]]，或[[隨惑]]。它可分為三大類；一、[[小隨煩惱]]，即[[忿]]、[[恨]]、[[覆]]、[[惱]]、[[嫉慳]]、[[誑]]、[[諂]]、[[害]]、[[憍]]十種；二、[[中隨煩惱]]，即[[無慚]]及[[無愧]]二種；三、[[大隨煩惱]]，即[[掉舉]]、[[惛沉]]、[[不信]]、[[懈怠]]、[[放逸]]、[[失念]]、[[散亂]]、[[不正知]]等八種。`,

'隨形好', `隨著佛三十二形相的八十種好。`,

'隨他意語', `隨著他人的機緣而說的方便教法。`,

'隨他權教', `佛隨自意語是實教，隨他意語是權教。權是方便的意思。`,

'隨自意語', `佛隨著自己之意而說自己親證的真理，是如來三語之一。`,

'隨自實教', `佛隨著自己之意而說的真實教法。`,

'靜力', `靜慮的力量，亦即禪定的力量。`,

'靜慮', `靜坐思惟，亦即禪定。`,

'頭光', `佛菩薩頭頂上所發放的圓光。`,

'頭陀', `華譯為[[抖擻]]，即抖擻衣服飲食住處等三種貪著的行法，修頭陀行者要遵守十二條規則，叫做[[十二頭陀]]。俗稱行腳乞食的僧人為頭陀，亦稱行者。`,

'頭陀行|十二頭陀', `頭陀的十二行法。見十二頭陀條。`,

'頭陀十八物', `頭陀所使用的十八種道具，即[[楊枝]]、[[澡豆]]、[[三衣]]、[[瓶]]、[[缽]]、[[坐具]]、[[錫杖]]、[[香爐]]、[[奩]]、[[漉水囊]]、[[手巾]]、[[刀子]]、[[火燧]]、[[鑷子]]、[[繩床]]、[[經律]]、[[佛像]]、[[菩薩像]]等。`,

'頭上安頭', `（喻）事情重複。如人本來已經有頭，若在頭上再安一個頭，那是多餘的，無此必要。`,

'頭北面西', `如來涅槃相。如來涅槃時，頭北面西，右𪊴而臥。`,

'頭面作禮', `以吾人之頭面去頂禮尊者之足。`,

'頻伽', `[[迦羅頻伽]]或[[迦陵頻伽]]的簡稱，鳥名，華譯為[[妙音鳥]]，是一種常住在極樂世界的鳥兒。`,

'頻來果', `又叫做[[一來果]]，即[[聲聞乘]][[四果]]中之第二果。`,

'餓鬼', `[[六道]]之一，即時常遭受饑餓的鬼類。其中略有威德的，成為山林塚廟之神，能得祭品或人間的棄食，無威德的，則常不得食，甚至口因渴出火。`,

'餓鬼因', `成為餓鬼的業因，即慳貪不捨。`,

'餓鬼道', `造作餓鬼業因的人所走的道途，是[[五道]]或[[六道]]之一。`,

'餓鬼趣', `造作餓鬼業因的人所趣向的道途，是[[五趣]]或[[六趣]]之一。`,

'餓鬼界', `餓鬼的世界，是[[十界]]之一。`,

'龍', `梵語叫做[[伽]]，[[八部眾]]之一，有神通力，能變化雲雨。`,

'龍王', `龍類之王。`,

'龍子', `大海龍子。龍子常為金翅鳥所食，龍王請佛，得袈裟一縷，因而得免於難。`,

'龍天', `１．八部中的龍眾與天眾。２．指龍樹菩薩與天親菩薩。`,

'龍河', `[[尼連禪河]]的別名，因此河中有龍居住。`,

'龍宮', `龍王的宮殿，在大海底下。`,

'龍猛|龍樹', `[[龍樹]]的譯名之一，龍樹的譯名共有三個，即[[龍樹]]、[[龍勝]]、龍猛。`,

'龍象', `指修行很勇猛而且具有大力的人，今作為出家人的尊稱。`,

'龍勝|龍樹', `[[龍樹]]菩薩的別名。`,

'龍樹', `菩薩名，人譯作[[龍猛]]，南天竺人，生於佛滅後八百年間，提倡中觀性空之學，著作很多。`,

'龍神', `[[八部眾]]之一。`,

'龍神八部', `在[[八部眾]]中以天與龍為首，所以常說[[天龍八部]]或是龍神八部。`,

'龍華', `古字華即是花，將來[[彌勒]]菩薩，坐龍華樹下成佛，因其花為龍所尚，故名龍花。又因其花似龍頭，故名。`,

'龍華會', `[[彌勒]]菩薩今在兜率天內院，將來下降人間成佛，在華林園龍華樹下開法會，普度人天，叫做龍華會。`,

'龍華樹', `將來[[彌勒]]佛成道時的道樹。`,

'龍華三會', `[[彌勒]]佛將來在華林園中龍華樹下成道，開三番法會，度盡上中下三根的眾生，叫做龍華三會。`
);


addTerms(17,

'優波離', `又作[[優婆離]]，華譯[[近取]]，或[[近執]]，是佛[[十大弟子]]之一，以持律第一著稱。`,

'優婆離|優波離', `見優波離條。`,

'優婆塞', `華譯為[[清信士]]、[[近事男]]、[[善宿男]]等，即在家親近奉事三寶和受持五戒的男居士，為四眾或七眾之一。`,

'優婆塞戒', `優婆塞所應受持的戒法，即不殺、不盜、不邪淫、不妄語、不飲酒等五戒是。`,

'優婆夷', `華譯為[[清淨女]]、[[清信女]]、[[近善女]]、[[近事女]]等，即親近奉事三寶和受持五戒的女居士，為四眾或七眾之一。`,

'優婆提舍', `華譯為[[論議]]，為[[十二部經]]之一。`,

'優曇華', `又名[[優曇缽華]]，華譯為[[靈瑞]]，或[[瑞應]]，是多年生草，莖高四五尺，花作紅黃色，產於喜馬位雅山麓及錫蘭等處，二千年開花一次，開時僅一現，故人們對於難見而易滅的事，稱為曇花一現。`,

'彌陀', `[[阿彌陀佛]]的簡稱。`,

'彌陀三尊', `中尊是[[阿彌陀佛]]，左脅侍是[[觀世音]]菩薩，右脅侍是[[大勢至]]菩薩。`,

'彌陀三部', `又叫做淨土三部，即佛說[[無量壽經]]、[[佛說觀無量壽經]]、[[佛說阿彌陀經]]。`,

'彌陀三聖', `[[阿彌陀佛]]、[[觀世音]]菩薩、[[大勢至]]菩薩。`,

'彌陀本願', `[[阿彌陀佛]]的[[四十八大願|四十八願]]。靠著這些大願，他成就了西方[[極樂世界]]以救濟一切眾生。`,

'彌陀名號', `彌陀為救濟一切眾生而成就的名號，其四字的名號是[[阿彌陀佛]]，六字的名號是[[南無阿彌陀佛]]，九字的名號是[[南無不可思議光如來]]，十字的名號是[[歸命盡十方無礙光如來]]。`,

'彌勒', `菩薩名，華譯為[[慈氏]]，現住在[[兜率天]]內院，是一生補處菩薩，將來當於[[住劫]]中的第十小劫，人壽減至八萬歲時，下生此界，繼[[釋迦牟尼]]佛之後，為[[賢劫]]之第五尊佛。`,

'彌勒出世', `彌勒佛在人間出世。彌勒佛是賢劫千佛中之第五尊佛，當於第十的減劫之時出世，以繼紹[[釋迦佛|釋迦牟尼]]的宏願，在龍華樹下以三會的說法，化度一切天上人間的眾生。`,

'彌勒淨土', `[[欲界]]六天中之第四天名[[兜率天]]，此天有內外二院，內院是補處菩薩的住處，因彌勒菩薩現在住在那裡，所以叫做彌勒淨土。`,

'彌勒三尊', `中尊是[[彌勒佛|彌勒]]，左是[[法花林菩薩]]，右是[[大妙相菩薩]]。`,

'彌勒三部', `[[佛說觀彌勒菩薩上生兜率天經]]，[[佛說彌勒下生經]]，[[佛說彌勒大成佛經]]。`,

'應人', `應受人天供養的人，即[[阿羅漢]]。`,

'應土', `又名[[化土]]，即應眾生之機緣而化現的國土，為二土或三土之一。`,

'應果', `[[阿羅漢果]]，阿羅漢一譯作應，即應受人天供養的意思。`,

'應供', `應受人天供養的人，是如來[[十號]]之一，又是阿羅漢的義譯。`,

'應跡', `應眾生之機緣而化現垂跡的身體。`,

'應現', `應眾生之機緣而現身。[[金光明經]]說：「<verse>佛真法身，猶如虛空，應物現形，如水中月。</verse>」`,

'應頌', `又名[[重頌]]，是[[十二分教]]之一。`,

'應器', `又名[[應量器]]，即比丘乞食時所用的鐵缽。見缽條。`,

'應法|如法', `與如法同義。`,

'應化', `應眾生之機緣而化現的佛身。`,

'應化身', `如來現佛身教化眾生，名[[應身]]，現九界身，皆名[[化身]]，合稱為應化身，為三身之一。`,

'應化聲聞', `見四種聲聞條。`,

'應化利生', `諸佛菩薩應現，都是為了向眾生說法，利益眾生。`,

'應化法身', `謂法身的佛菩薩應現無量的身體。`,

'應身', `佛[[三身]]之一，即應他之機緣而化現的佛身。`,

'應身土', `應身佛所居住的國土，亦即應眾生之機緣而變現的國土。`,

'應量器', `鐵缽。見缽條。`,

'應正遍知', `應與正遍知。應是應供的簡稱；正遍知又名正等覺。見十號條。`,

'應理圓實宗', `[[法相宗]]四名之一。`,

'戲論', `含有遊戲性和不切實際的言論。`,

'檀|檀那', `[[檀那]]的簡稱，華譯為[[布施]]。`,

'檀主', `施主。`,

'檀林', `旃檀之林，即[[寺院]]的尊稱。`,

'檀信', `施主的信仰。`,

'檀度', `布施度，是[[六度]]之一。`,

'檀越', `施主。`,

'檀那|檀越', `與[[檀越]]同義。`,

'檀波羅蜜', `[[布施波羅蜜]]，是[[六波羅蜜]]之一。`,

'濕生', `依濕氣而生的動物，如蚊蠅是，是[[四生]]之一。`,

'濕生化生', `[[濕生]]與[[化生]]。濕生是依濕氣而生長的動物，如蚊蠅是；化生是不靠父母之緣，自然變化而生的生命，如天人及地獄的眾生是。`,

'濟世', `救濟世人。`,

'濟度', `以佛法救濟超度眾生。`,

'禪', `[[禪那]]的簡稱，華譯為[[靜慮]]，即靜息念慮的意思。`,

'禪心', `寂定的心。`,

'禪行', `坐禪的行法。`,

'禪衣', `禪僧所穿的衣。`,

'禪戒', `１．禪定與戒法。２．禪宗與律宗。`,

'禪法', `修禪之法，有二種，即如來禪和祖師禪。如來禪者，如經論所說的四禪八定是；祖師禪者，經論之外，歷代祖師不立文字以心印心的禪法是。`,

'禪味', `禪定微妙的滋味，如入於禪定時，就有一種輕安寂靜的滋味是。`,

'禪宗', `以禪那為宗的宗派。因此宗偏重於修心，以心傳心，直傳佛祖的心印，故又名[[佛心宗]]。`,

'禪律', `[[禪宗]]和[[律宗]]。`,

'禪師', `專修禪定的出家人。`,

'禪德', `禪宗大德的簡稱，用以尊稱[[禪師]]。`,

'禪病', `１．指坐禪時縷縷不絕的妄念。２．坐禪不得其法，坐出毛病來。`,

'禪教', `１．禪宗的教法。２．禪與教。`,

'禪規', `禪寺所奉行的規則。因這些規則是由唐百丈山懷海禪師所制定，所以叫做百丈清規。`,

'禪寂', `修禪以寂靜念慮。`,

'禪慧', `[[禪定]]和[[智慧]]。`,

'禪觀', `坐禪以觀念真理。`,

'禪那', `華譯為[[思惟修]]，或[[靜慮]]，即住心一境而冥想妙理。`,

'禪那波羅蜜', `[[十波羅蜜]]之一。`,

'禪定', `即[[禪那]]，華譯為[[靜慮]]，即是止觀不二或定慧不二的境界。`,

'禪定堅固', `大集經所說五種堅固之一。見五五百年條。`,

'禪定波羅蜜', `又名[[靜慮波羅蜜]]。見六波羅蜜條。`,

'禪門', `１．禪定的法門，如三學中之定學與六波羅蜜中之禪波羅蜜是。２．禪宗的通稱。`,

'禪門五宗', `[[臨濟宗]]、[[溈仰宗]]、[[雲門宗]]、[[法眼宗]]、[[曹洞宗]]，以上五宗皆成於六祖之後。`,

'禪和', `又叫做[[禪和子]]，即參禪的人。`,

'禪和子|禪和', `見禪和條。`,

'禪悅', `入於禪定時所得的喜悅。`,

'禪悅食', `見二食條。`,

'禪波羅蜜', `[[六波羅蜜]]之一。`,

'糞掃衣', `糞掃衣有五種，一[[道路棄衣]]，二[[糞掃棄衣]]，三[[河邊棄衣]]，四[[蟻穿破衣]]，五[[破碎衣]]。又有五種，一[[火燒衣]]，二[[水漬衣]]，三[[鼠咬衣]]，四[[牛嚼衣]]，五[[嬭母棄衣]]。以上之衣，印度人諱忌，故棄之。因取人家此種棄之不用與拭糞穢物差不多的衣片來補納成衣，故名糞掃衣，又名[[納衣]]。`,

'總別', `１．[[總釋]]和[[別釋]]。２．[[總相]]和[[別相]]。３．[[總業]]和[[別業]]。`,

'總願', `諸佛有總願和別願二種，如[[四弘誓願]]是總願，如[[藥師十二願]]和[[彌陀四十八願]]是別願。`,

'總報業', `招感總報的業因。`,

'總觀想', `[[觀無量壽經]]所說[[十六觀]]之一。`,

'總持', `總一切法和持一切義的意思，是梵語陀羅尼的譯義。`,

'總持門', `總持的法門，亦即[[密教]]的法門。`,

'總相', `一切有為法都有總別的二種相，如無常無我，通於一切，叫做總相，如地有堅相水有濕相，叫做別相。`,

'總相戒', `如三聚戒與十善戒等叫做總相戒，如二百五十戒與十戒等則叫做別相戒。`,

'總相三寶', `佛法僧三寶都在一個會上現相，不是在幾處分開現相，叫做總相三寶。`,

'總相念處', `小乘行人修四念處時，每作一觀，即併作其餘三觀，如觀身不淨時，併觀此身是苦、無常、無我是。`,

'聲', `五塵之一，四大種所造，屬於色法，為耳根所對之境。`,

'聲音念誦', `出聲念佛或是誦經。`,

'聲入', `[[十二入]]之一。`,

'聲杖', `[[錫杖]]的別名。`,

'聲明', `[[五明]]之一。`,

'聲處', `[[十二處]]之一。`,

'聲量', `見三量條。`,

'聲聞', `聞佛說[[四諦法|四聖諦]]之音聲而悟道的人。`,

'聲聞乘', `[[二乘]]或[[三乘]]之一，凡是聞佛音聲和修[[四諦法門|四聖諦]]而悟道的人，總稱為聲聞乘。聲聞乘修四諦法，自[[凡夫]]至[[阿羅漢]]，論時間，速者三生，遲者六十劫，其修行的方便有七（即[[七方便]]），得果有四（即[[四果]]）。茲列表說明如下：
{{!聲聞乘}}`,

'聲聞僧', `二種僧之一。見二種僧條。`,

'聲聞藏', `二藏之一。見二藏條。`,

'聲聞菩提', `三種菩提之一。見三種菩提條。`,

'聲聞緣覺', `[[聲聞乘]]和[[緣覺乘]]。`,

'聲聞畏苦障', `聲聞乘行人因怖畏生死的痛苦，於是人人急著追求真空的涅槃，因而成為證悟無上佛果的障礙。`,

'臨濟', `唐鎮州臨濟義玄，曹州南華人，姓荊氏，是[[禪宗]][[五家]]之一的[[臨濟宗]]的祖師。`,

'臨濟宗', `[[禪宗]][[五家]]之一。`,

'臨終正念', `謂修行人到臨終的時候，心中沒有貪瞋痴的邪念，只是一心正念菩提，這種正念是由長時間的修行而得來的。`,

'臨終業成', `修行人到臨終的時候，往生的事業才能成辦。`,

'膿爛想', `九想之一。見九想條。`,

'膿血地獄', `十六[[遊增地獄]]之一。`,

'薄迦梵', `又作[[婆伽婆]]，華譯為[[世尊]]。`,

'薩埵', `１．華譯為[[有情]]，或[[眾生]]。２．[[菩提薩埵]]的簡稱。見菩薩條。`,

'薩婆若', `華譯為[[一切種智]]，就是諸佛究竟圓滿果位的大智慧。`,

'薩婆多部', `即說一切有部。見說一切有部條。`,

'薩迦耶見', `華譯為[[我見]]，即執著五蘊假合而有的身體為實我之見，亦即[[五見]]中之[[身見]]。`,

'謗', `用話攻擊他人。`,

'謗法闡提', `誹謗佛法而斷善根不能成佛的人。`,

'還相', `由淨土還來穢土以濟度一切眾生，為迴向二相之一。`,

'還俗', `出家人犯罪歸家叫做還俗，若是自願脫離出家人的生活，則叫做歸俗。`,

'還源', `轉迷成悟的意思。`,

'還滅', `還歸於寂滅，也就是修道證涅槃。`,

'還滅門', `於十二因緣法中分為流轉門與還滅門，流轉門是造業受生死，還滅門是修道證涅槃。`,

'闍梨|阿闍梨', `阿闍梨的簡稱。`,

'闍多伽|闍多伽', `見闍陀伽條。`,

'闍陀伽', `又作[[闍多伽]]，華譯為本生經，即佛說自身過去所經歷的事蹟的經文，為十二部經之一。`,

'齋', `１．正午以前的飯食。２．蔬食。`,

'齋七', `人死後七七日的齋會。`,

'齋月', `正月、五月、九月等三個月，諸天下降巡視人間，是最宜持齋及小心惡事的月份，謂之三長齋月。`,

'齋主', `布施齋食的施主。`,

'齋戒', `清除心的不淨叫做齋，禁身的過非叫做戒，齋戒就是守戒以屏絕一切嗜欲的意思。`,

'齋法', `過午不食的行法。`,

'齋時', `齋食之時，即清晨至正午之間。`,

'齋非時', `午前之食叫做時，午後之食叫做非時。`,

'繁興永處那伽定', `繁興就是繁雜多起的意思，永處猶言常在，那伽義譯為龍。吾人在行住坐臥的四威儀中，雖歷淨染多途而心源常在定中，就如龍之靜潛深淵，能現大變而不失定力，所以叫做龍定。`,

'旛', `一種窄長垂直掛著的旗子。`
);


addTerms(18,

'瞿曇', `釋尊俗家的古代族姓，華譯為[[日]]，或[[甘蔗]]。`,

'叢林', `大寺院。`,

'雙流', `[[化道]]與[[觀心]]二事並行。`,

'雙圓', `圓之又圓，是圓滿之極的意思。`,

'雙運', `解行並重或福慧雙修的意思。`,

'斷肉', `斷除肉食。`,

'斷見', `堅持人死之後身心斷滅不復再生的偏見，是[[五惡見]]之一。`,

'斷結', `斷煩惱。結就是煩惱的別名。`,

'斷智', `斷煩惱之智。`,

'斷滅', `指人死之後不復再生的邪見。`,

'斷德', `諸佛三德之一。見三德條。`,

'斷惑', `斷除一切貪瞋痴等煩惱。`,

'斷惑證真', `謂斷除一切貪瞋痴等的煩惱，才能證悟宇宙人生的真理。`,

'斷常二見', `斷見和常見。斷見是堅持人死之後身心斷滅不復再生的邪見；常見是堅持身心常住永恆不滅的邪見。`,

'斷善闡提', `極惡斷善根永不能成佛的人。`,

'歸元', `又名[[歸真]]、[[歸寂]]、[[歸化]]、[[歸本]]等，是圓寂的意思。`,

'歸戒', `[[三歸戒]]，即歸依佛法僧三寶的戒法。`,

'歸命', `梵語[[南無]]，華譯為歸命，即把身命奉獻給佛教。`,

'歸依', `歸投依靠的意思。`,

'歸依佛', `歸投依靠佛陀的指示而追求真理的意思。`,

'歸依法', `歸投依靠教義而求得真理的意思。`,

'歸依僧', `歸投依靠僧伽的引導而正信佛教的意思。`,

'禮懺', `禮拜三寶以懺悔過去所作的罪業。`,

'禮拜門', `淨土論所說五念門之一。見五念門條。`,

'穢土', `污穢的國土，即凡夫所住的娑婆世界。`,

'穢身', `污穢的身體，即凡夫的身體，因凡夫的身體污穢不淨。`,

'穢剎|穢土', `與[[穢土]]同義。`,

'薰修', `薰是[[薰習]]，修是[[修行]]，即以德薰身而修行的意思。`,

'薰習', `吾人身口所作的善惡業，或是意所作的善惡思想，其氣分都留在真如或阿賴耶識裡，叫做種子或習氣，這種種子或習氣在真如或阿賴耶識中存留其作用，即叫做薰習。起信論說：「薰習義者，如世間衣服實無於香，若人以香而薰習故，則有香氣。」`,

'醫王', `醫中之王，即佛。`,

'醫王善逝', `[[藥師如來]]的別名。`,

'醫方明', `五明之一。見五明條。`,

'藏', `蘊積的意思，經典能蘊積教義，所以叫做藏。`,

'藏經', `搜集佛教所有的經律論[[三藏]]，及歷代後賢的著作，聚集在一處，好像佛經的庫藏一樣，所以叫做藏經。`,

'藏識', `含藏一切善惡種子的識，即[[阿賴耶]]識。`,

'轉語', `參禪參到進退維谷處，請人代下一語，以為撥轉，而得轉身自在，乃至於轉迷開悟。`,

'轉法輪', `指佛說法。佛的教法，如車輪旋轉，能轉凡成聖，能碾摧一切的煩惱，叫做法輪，佛說法，度眾生即叫做轉法輪。`,

'轉輪王|轉輪聖王', `見轉輪聖王條。`,

'轉輪聖王', `簡稱[[轉輪王]]，或[[輪王]]，為世間第一有福之人，於人壽八萬四千歲時出現，統轄四天下。有四種福報：一、[[大富]]，珍寶、財物、田宅等眾多，為天下第一；二、[[形貌莊嚴端正]]，具三十二相；三、[[身體健康無病]]，安穩快樂；四、[[壽命長遠]]，為天下第一。轉輪王出現時，天下太平，人民安樂，沒有天災人禍。此乃由過去生中，多修福業，可惜不修出世慧業，所以僅成統治世界有福報之大王，卻不能修行悟道證果。參考輪王條。`,

'轉識', `１．[[唯識論]]說八識中的第八阿賴耶識為本識，其餘七識都叫做轉識，因由第八識轉生。<br>２．轉有漏的八識而成為無漏的四智。見轉識成智條。`,

'轉識成智', `轉凡夫有漏的[[八識]]成為佛的[[四智]]，即轉第八識為大圓鏡智，轉第七識為平等性智，轉第六識為妙觀察智，轉前五識為成所作智。`,

'轉四諦法輪', `佛說[[四聖諦]]，教[[小乘]]人[[知苦]]、[[斷集]]、[[慕滅]]、[[修道]]，使之證聲聞四果。`
);


addTerms(19,

'勸門', `勸誡二門之一。見勸誡條。`,

'勸誡', `教人行善叫做勸，制止為惡叫做誡。如來的教法不離此二門，經藏屬勸門，律藏屬誡門，諸惡莫作是誡門，眾善奉行是勸門。`,

'壞劫', `[[四劫]]之一，即三千大千世界進入破壞的時期。壞劫共有二十小劫，其初十九小劫壞有情世間，最後之一個小劫壞器世間。`,

'壞相', `六相之一。見六相條。`,

'壞苦', `三苦之一。見三苦條。`,

'壞色', `即[[袈裟]]，因袈裟避青黃赤白黑之五正色，而以不正色染壞之，故名壞色。有三種之壞色，即青壞色、黑壞色、木蘭壞色，這三種壞色是最合法的袈裟色。`,

'壞色衣', `[[袈裟]]。`,

'壞道沙門', `破戒和破壞佛道的沙門，是四沙門之一。`,

'懷海', `唐洪州百丈山大智禪師，名懷海，參馬祖得法，後居百丈山，作禪門的儀式，稱為[[百丈清規]]。`,

'懷靈', `[[有情]]的別名，與[[含識]]、[[含情]]、[[含靈]]同義。`,

'攀緣', `心隨外境而轉的意思。`,

'繫縛', `[[煩惱]]的別名，因煩惱如繩子能繫縛身心，使人不得自在。`,

'曠劫', `對很久遠的過去叫做曠劫，若對很久遠未來則叫做永劫。`,

'犢子部', `[[小乘]][[二十部]]之一，犢子原是一位外道，後來歸佛出家，叫做犢子比丘，他主張眾生有實我，其後門徒相傳不絕，名犢子部。`,

'羅剎', `惡鬼的總名，男的叫[[羅剎娑]]，女的叫[[羅剎私]]，或飛空，或地行，喜歡食人的血肉。`,

'羅剎國', `食人惡鬼的住處，在大海之中。`,

'羅剎鬼', `[[三十六鬼]]之一。`,

'羅漢|阿羅漢', `阿羅漢的簡稱。見阿羅漢條。`,

'羅侯羅', `佛的兒子，也是佛[[十大弟子]]之一，以密行第一著稱。他雖然已經證得阿羅漢果，但後來在法華會上回小向大。`,

'藥叉|夜叉', `夜叉。`,

'藥師', `[[葉師琉璃光如來]]的簡稱。見藥師琉璃光佛條。`,

'藥師三尊', `中尊[[藥師如來]]，左脅侍[[日光遍照菩薩]]，右脅侍[[月光遍照菩薩]]。`,

'藥師十二誓願', `一、[[自他身光明熾盛之願]]；二、[[威德巍巍開曉眾生之願]]；三、[[使眾生飽滿所欲而無乏少之願]]；四、[[使一切眾生安立大乘之願]]；五、[[使一切眾生行梵行具三聚戒之願]]；六、[[使一切不具者諸根完具之願]]；七、[[除一切眾生眾病]]，令身心安樂，證得無上菩提之願；八、[[轉女成男之願]]；九、[[使諸有情解脫天魔外道纏縛]]，邪思惡見稠林，引攝正見之願；十、[[使眾生解脫惡王劫賊等橫難之願]]；十一、[[使飢渴眾生得上食之願]]；十二、[[使貧乏無衣服者得妙衣之頂]]。`,

'藥師琉璃光佛', `簡稱[[藥師佛]]，是東方淨琉璃國的教主。此佛在行菩薩道時，曾發十二大願，其中第七願，願成佛時，若諸有情，眾病逼切，無救無歸，無醫無藥，無親無家，貧窮多苦，一聞其名號，眾病悉除，身心安樂，家屬資具，悉皆豐足乃至成佛，所以稱為藥師。又第二願，願成佛時，身如琉璃，內外明徹，淨無瑕穢，光明廣大，過於日月，所以稱為琉璃光。`,

'藥師琉璃光如來|藥師琉璃光佛', `見藥師琉璃光佛條。`,

'藥珠二身', `[[藥樹王身]]和[[如意珠王身]]。佛為了拔除眾生的苦難而化現之身叫做藥樹王身；為了給眾生安樂而化現之身叫做如意珠王身。`,

'藥樹王身', `佛菩薩為了拔除眾生的苦難而在六道之中化現的身。`,

'證', `即證果，亦即一般人所說的開悟或得道。`,

'證法', `俱舍論所說教證二法之一，即證悟各種果位的道法。`,

'證果', `即一般人所說的開悟或得道。`,

'證悟', `證知悟解。`,

'證智', `指菩薩於初地時證悟中道之理的無漏正智。`,

'證覺', `證是證得妙道，覺是覺悟真理。`,

'證入', `證得妙道而入於真理。`,

'證入成佛', `華嚴宗所立三生成佛之一。見三生成佛條。`,

'證信序', `每部經的通序，用如是我聞等六種成就以証明此經是佛親說，並非偽品。`,

'證大菩提', `謂證得佛的正覺。佛的正覺即叫做大菩提。`,

'證滿成佛', `四滿成佛之一。`,

'譏嫌', `被人家說壤話。`,

'譏嫌戒', `[[息世譏嫌戒]]的簡稱，亦即停止做讓人家說壞話的事的戒律。`,

'識', `[[心]]的別名，了別之義。心對於境而了別，叫做識。`,

'識心', `六識或八識之[[心王]]。`,

'識住', `識所安住或愛著的境界。見四識住條。`,

'識身', `心身。`,

'識食', `地獄和無色界的眾生全靠識來保持身體，謂之識食，為[[四食]]之一。`,

'識界', `[[十八界]]之一。`,

'識海', `真如是如來藏識，真如因隨緣而起諸法，好像大海掀起波濤一樣，所以叫做識海。`,

'識藏', `如來藏與無明和合而成阿賴耶識，生出一切萬法，故指如來藏為識藏。`,

'識蘊', `五蘊之一。見五蘊條。`,

'識變', `一切萬法唯識所變。`,

'識無邊處天', `[[無色界]]之第二天名，為[[四空處]]之一。`,

'識無邊處定', `見四空定條。`,

'邊見', `[[五見]]之一，即遍於一邊的惡見。如有人固執人死之後為斷滅，沒有後世，叫做斷見或無見。又有人固執人死之後仍是為人，豬馬牛羊死後仍是為豬馬牛羊，叫做常見或有見。這些執斷執常的見解，都遍於一邊，不合中道，故名邊見。`,

'邊界', `[[邊地懈慢界]]的簡稱。`,

'邊罪', `比丘犯了殺盜淫和大妄語等四重罪，叫做邊罪，因其罪深重，為佛法邊外的人。`,

'邊地', `邊隅之地。在西方極樂世界的邊隅，有地名懈慢界，又名胎宮，往生到那裡的人，五百歲間不得見聞三寶。`,

'邊執見|邊見', `簡稱邊見。見邊見條。`,

'邊際智', `指等覺菩薩的智慧，因這種智慧是居於妙覺位的邊際。`,

'願', `誓願。願有總願和別願兩種，如四弘誓願是總願，如彌陀的四十八願和藥師的十二願是別願。`,

'願土', `依阿彌陀佛的本願而成就的國土，即極樂淨土。`,

'願身', `佛十身之一。見十身條。`,

'願佛', `酬報因願之佛，亦即八相成道之化身佛，是十種佛之一。`,

'願度', `十度之一。見十度條。`,

'願食', `五食之一。見五食條。`,

'願海', `（喻）菩薩的誓願深廣如海。`,

'願船', `（喻）彌陀的本願如船，能將眾生渡到彼岸。`,

'願輪', `菩薩的誓願很堅固，能摧破一切的怨敵，好像輪王的輪寶一樣，所以叫做輪。`,

'願力', `誓願的力量。`,

'願力自然', `謂靠著阿彌陀佛本願的力量，眾生自然能夠往生淨土。`,

'願行', `誓願和修行。`,

'願行具足', `誓願和修行圓滿具足。`,

'願波羅蜜', `十波羅蜜之一。見十波羅蜜條。`,

'願波羅蜜十德', `[[盡成就一切眾生]]、[[盡莊嚴一切世界]]、[[盡供養一切諸佛]]、[[盡通達無障礙之法]]、[[盡修行遍法界之行]]、[[身恆住而盡未來劫]]、[[智盡知一切之心念]]、[[盡覺悟流轉還滅]]、[[盡示現一切之國土]]、[[盡證得如來之智慧]]。`,

'顛倒', `倒見事理的意思，如以無常為常，以苦為樂等是。`,

'顛倒心', `心思不定，顛顛倒倒，亂轉念頭。`,

'離蓋', `脫離五蓋，也就是脫離五種煩惱。見五蓋條。`,

'離垢', `脫離煩惱的垢染。`,

'離垢地', `菩薩十地之一。見菩薩十地條。`,

'離垢眼', `脫離煩惱之垢染的清淨法眼。`,

'離垢世界', `[[舍利弗]]將來成佛的國名。`,

'離相', `[[法華經|妙法蓮華]]所說三相之一。見三相條。`,

'離相戒', `又名[[無相戒]]，即持戒的人心無所著，視一切戒律，猶如虛空，了無持犯之相。`,

'離生', `脫離生死。`,

'離生性', `出離生死的正性，亦即得道之聖者通達諦理斷見思惑永離三界之生死的正性。`,

'離生喜樂地', `[[三界]][[九地]]之一，即[[色界]]之初禪天，因此天是脫離欲界之罪惡而生喜歡二受之處。`,

'離衣宿', `佛制僧尼不得三衣離身他處宿。`,

'離染服', `[[袈裟]]的別名。`,

'離欲地', `[[通教]]十地之一，即離欲界之地位，相等於藏教的不還果。`,

'離間語', `離間人家和好的言語，是十惡業之一。`,

'離塵服', `[[袈裟]]的別名。`,

'離縛斷', `四斷之一。見四斷條。`,

'離繫果', `脫離煩惱之繫縛的果位，即[[涅槃]]，是[[五果]]之一。`,

'離言真如', `二真如之一。見二真如條。`,

'離怖畏如來', `在施餓鬼之法中，五如來中北方如來之名，亦即釋迦如來。`,

'難陀', `１．比丘名，華譯為善歡喜，又名牧牛難陀，因問佛放牛十一事，知佛具一切智，後來跟佛出家，獲證阿羅漢果。<br>２．孫陀羅難陀的簡稱，是佛的堂弟，家有艷妻，因沉溺於其妻的美色，不樂出家，後來為佛方便度化，結果證得阿羅漢果。`,

'難度', `眾生剛強，很難濟度。`,

'難伏地', `佛地的別名，因無任何力量足以降伏佛。`,

'難行', `艱難修行的方法。`,

'難行道', `二道之一。見二道條。`,

'難勝地', `菩薩十地之第五。見菩薩十地條。`,

'難易二道', `難行道和易行道。見二道條。`
);


addTerms(20,

'嚴淨', `國土莊嚴清淨。`,

'寶印', `１．指三寶中的法寶。２．三法印。３．指諸佛菩薩種種的印契。`,

'寶地', `佛地。`,

'寶車', `以眾寶莊嚴的大白牛車，（喻）一乘佛法。`,

'寶性', `如來藏的別名，因如來藏在眾生之煩惱中，不失其真如清淨之本性。`,

'寶相', `謂佛像很莊嚴。`,

'寶王', `[[佛陀]]的尊稱，因佛陀是以諸功德作莊嚴。`,

'寶王三昧', `[[念佛三昧]]的美名，因念佛即是三昧中的至寶。`,

'寶樓觀', `[[觀經]]所說[[十六觀]]之一，即觀想極樂世界寶樓珠閣之相。`,

'寶樹觀', `[[觀經]]所說[[十六觀]]之一，即觀想極樂世界寶樹之相。`,

'寶池觀', `[[觀經]]所說[[十六觀]]之一，即觀想極樂世界八功德池之相。`,

'寶勝如來', `在施餓鬼之法中，五如來中南方寶生如來，叫做寶勝如來。`,

'懺', `梵語懺摩的簡稱，是悔過的意思。`,

'懺法', `拜懺的儀制，有慈悲懺法、水懺法、觀音懺法、阿彌陀懺法、圓通懺法、法華懺法、方等懺法、金光明懺法、吉祥懺法等等。`,

'懺儀', `懺法的儀式。有法華懺法、方等懺法、觀音懺法、彌陀懺法等之別。`,

'懺摩', `簡稱[[懺]]，是悔過的意思。見懺悔條。`,

'懺悔', `懺是發露過去所作的舊惡，悔是知錯以後不會再作。`,

'懺悔功德', `[[天台]]所立[[五悔]]之一。`,

'蘇怛羅', `又作[[蘇多羅]]、[[素呾纜]]、[[修多羅]]、[[修妒路]]等，華譯為[[綖線]]，又譯作[[經]]、[[契經]]、[[綖經]]，是經典的通稱。`,

'蘇悉地', `華譯為[[妙成就]]。`,

'蘇悉地羯羅', `華譯為[[妙成就作業]]，亦即成就一切世出世間作業的妙法。`,

'蘊', `積集之義。有色蘊（物質）與心蘊（精神）的分別。`,

'蘊界', `[[五蘊]]與[[十八界]]。`,

'蘊識', `１．蘊蓄心識的意思，與含識同義。２．識是[[五蘊]]之一，故名蘊識。`,

'蘊魔', `[[四魔]]之一。`,

'蘊善巧', `見十善巧條。`,

'蘊處界', `舊譯為陰、入、界。其中蘊即五蘊，又名五陰，即色、受、想、行、識，為眾生的心身。處即十二處，又名十二入，即六根對六塵之處。界即十八界，為六根對六塵，生起六識，三六共為十八，界即境界。此五蘊十二處十八界，通常叫做三科。`,

'覺', `梵語叫做菩提，是覺察或覺悟的意思。在事障上，一切煩惱，伺隙侵人，惟至聖能隨緣省察，不為所困，是覺察義；在理障上，凡夫痴迷，顛倒執著，惟至聖能朗然徹悟，燭照無遺，是覺悟義。`,

'覺心', `本覺的妙心，亦即覺悟不迷的心。`,

'覺王', `佛的尊稱，因佛是覺悟最徹底的人。`,

'覺分', `梵語叫做[[菩提分]]，即順於覺的支分，有三十七法，亦即[[三十七科的道品|三十七道品]]。`,

'覺支', `觀察吾人心術的偏正，叫做覺法，覺法不止一個，所以叫做支。`,

'覺他', `使他人覺悟的意思，是二覺之一。`,

'覺母', `[[文殊菩薩]]的德號，因文殊於智理二門中司智門，而諸佛皆由智慧而生。`,

'覺位', `[[正覺]]的地位，亦即成佛的地位。`,

'覺性', `１．覺悟的自性。２．覺知之性。`,

'覺岸', `覺悟的彼岸，即佛的境界。`,

'覺者', `覺悟的人的意思，梵語叫做[[佛陀]]。被稱為覺者的人，必須具有三個條件，即[[自覺]]、[[覺他]]、[[覺行圓滿]]，缺一就不可以被稱為覺者。`,

'覺海', `１．（喻）覺性深廣如海。２．佛教以覺悟為宗，故稱譽佛教的教義深廣猶如大海。`,

'覺照', `用覺悟的心來觀照一切。`,

'覺路', `正覺的道路，亦即菩提之道。`,

'覺滿', `覺悟圓滿的人，即是佛。`,

'覺樹', `菩提樹。菩提華譯即是覺。世尊在畢波羅樹下成菩提，故稱其樹為菩提樹。`,

'覺觀', `新譯作尋伺，舊譯作覺觀，麤思名覺，細思名觀，二者都能擾亂定心。`,

'覺道支', `[[七覺支]]與[[八正道]]。`,

'觸', `感觸。`,

'觸食', `[[四食]]之一。`,

'觸欲', `[[五欲]]之一。`,

'觸塵', `[[六塵]]之一。`,

'譯師', `翻譯經論的法師。`,

'譯經院', `翻譯佛經的道場。`,

'譬喻經', `[[十二部經]]之一。`,

'釋', `[[釋迦]]的簡稱，是世尊的姓。晉時道安法師提倡佛子應以世尊的姓為姓，即姓釋，後來大家見到阿含經說「<verse>四河入海，無復河名；四姓出家，皆稱釋種。</verse>」從此凡是出家人都姓釋。`,

'釋子', `[[釋迦佛|釋迦牟尼]]的弟子。`,

'釋典', `釋教的經典，即[[佛典]]。`,

'釋帝', `三十三天的帝王名叫[[釋羅]]，所以叫做釋帝，通常稱為[[帝釋天]]。`,

'釋尊', `釋迦牟尼佛世尊。`,

'釋迦', `釋迦牟尼佛世尊。`,

'釋迦牟尼', `佛名，華譯為[[能仁寂默]]，是開創佛教的教主，本是古印度[[迦毗羅衛]]國的王太子，父名[[淨飯]]，母名[[摩耶]]，因為了追求真理而出家修道成佛。降生於公元前六二三年，二十九歲出家，三十五歲成道，說法四十五年，談經三百餘會，所度人天，其數無量，約於公元前五四三年入滅，世壽八十歲。`,

'釋梵', `[[帝釋天]]和[[梵天]]。`,

'釋梵護法', `帝釋和梵天是護持世界佛法的天神。`,

'釋師子', `釋尊的德號，因佛在三界之中無畏自在，好像獸中的師子王。`,

'釋提桓因', `[[仞利天]]（三十三天）之主，簡稱[[釋帝]]，或[[帝釋]]。`,

'闡提|一闡提', `[[一闡提迦]]的簡稱，是極難成佛的意思，有二種：一、[[不信因果]]，造五逆十惡，斷諸善根，墜入阿鼻地獄的人，此種人極難成佛，名[[斷善闡提]]；二、[[大悲菩薩]]，發一切眾生成佛，然後成佛之願，因眾生至多，時間至久，故此種菩薩，亦極難成佛，名[[大悲闡提]]。通常所指的一闡提人，多數是指斷善闡提。`,

'露地坐', `在露地上坐禪，是[[十二頭陀]]行之一。`,

'鶖鷺子', `[[舍利弗]]的譯名。`
);

addTerms(21,

'攝心', `收攝散亂的心意。`,

'攝受', `又叫做攝取，就是佛以慈悲心去攝取眾生。`,

'攝摩騰', `又作迦葉摩騰，中天竺人，能解大小乘經，漢明帝遣蔡愔等往天竺求法，遇之，永平十年，與竺法蘭至洛陽，譯四十二章經，為印度高僧蒞華傳法之第一人。`,

'攝化利生', `攝受教化和利益眾生。`,

'攝化隨緣', `順著眾生的機緣而以種種的方法去攝受和教化。`,

'攝眾生戒', `三聚淨戒之一。見三聚戒條。`,

'攝律儀戒', `三聚淨戒之一。見三聚戒條。`,

'攝善法戒', `三聚淨戒之一。見三聚戒條。`,

'灌頂', `密教有灌頂法，灌者大悲護念義，頂者佛果最上義，謂諸佛以大悲水灌頂，能使功德圓滿之意，有種種不同的方法。`,

'灌頂住', `[[十住]]之一。`,

'灌佛', `又名浴佛，即以水灌浴佛像而拂拭之。`,

'灌佛會', `又名佛生會，於陽曆五月月圓日實行之。`,

'瓔珞', `梵語叫做枳由羅，是一種似玉的寶石。`,

'纏', `[[煩惱]]的別名，因煩惱能纏縛人們的身心，使不得自在。`,

'纏眠', `纏指現行，眠指種子。`,

'纏縛', `[[十纏]]和[[四縛]]。纏縛是指一切的煩惱，因煩惱能纏縛眾生於三界六道之中。`,

'纏蓋', `纏與蓋。纏與蓋都是煩惱的別名，纏有[[十纏]]，蓋有[[五蓋]]。`,

'羼底', `華譯為[[忍辱]]。`,

'羼提', `華譯為[[忍辱]]，[[六度]]之一。`,

'羼提波羅蜜', `忍辱波羅蜜，[[六波羅蜜]]之一。`,

'蘭若|`[[', `[[阿蘭若]]的簡稱，是僧人所住的地方。`,

'護念', `保護和憶念。`,

'護世者', `見護世四天王條。`,

'護世四天王', `又名護世者，四天王是[[持國]]、[[增長]]、[[廣目]]、[[多聞]]，因此四天王是守護世界的善神，所以叫做護世四天王。`,

'護法', `１．護持自己所修成的善法。２．擁護佛陀的正法。`,

'護法神', `守護正法和行者的善神。`,

'護法阿羅漢', `六種阿羅漢之一。`,

'護戒神', `守護佛所制戒的善神。已經三歸依的人，有三十六部的善神保護他，又受持五戒的人，因每戒各有五神，所以一共有二十五位善神保護他。`,

'護國四王', `又名護世四天王，即[[持國]]、[[增長]]、[[廣目]]、[[多聞]]之四天王，他們住在須彌山四方的山腰，時常護持四天下，故名護世，又名護國。`,

'辯才', `善巧說法的才幹。共有四種，叫做四無礙辯。見四無礙辯條。`,

'辯才天', `妙音天。`,

'辯才妙音', `辯才天就是妙音天。`,

'辯無礙解', `四無礙解之一。見四無礙解條。`,

'鐵樹', `（喻）無開花結果的希望。`,

'鐵缽', `缽是出家人乞食時所使用的器物，用鐵製成的缽叫做鐵缽，若用瓦或石製成的缽，則叫做瓦缽或石缽。`,

'鐵輪王', `四輪王之一。見四輪王條。`,

'鐵圍山', `圍繞鹹海而劃分一小世界的鐵山。`,

'鐵圍結集', `傳說彌勒菩薩等率領阿難於鐵圍山結集大乘的經典。`,

'鐵丸地獄', `十六[[遊增地獄]]之一，此地獄有熱鐵丸，獄卒驅使罪人用手攝之，手足全部爛壞，故名。`,

'鐵剌林地獄', `犯邪淫的人所墮落的地獄。`,

'饑饉災', `中劫末期所發生的[[小三災]]之一。小三災是[[刀兵]]、[[疾疫]]、[[飢饉]]。`,

'饑餓地獄', `十六[[遊增地獄]]之一。`,

'饒王', `世饒王佛的簡稱。見饒王佛條。`,

'饒王佛', `又名世自在王佛，阿彌陀佛曾向此佛誓立四十八大願。`,

'饒益', `給人豐富的利益。`,

'饒益有情戒', `三聚淨戒之一。見三聚戒條。`,

'驅烏', `指七歲至十三歲的小沙彌，因這些小沙彌負責驅逐烏鳥，不使奪僧食。`,

'驅烏沙彌', `三沙彌之一，即驅逐烏鳥不使掠奪比丘之食物的小沙彌。`,

'鬘', `花鬘，以香草結成花鬘供佛。`,

'魔', `梵語[[魔羅]]的簡稱，華譯為[[能奪命]]、[[障礙]]、[[擾亂]]、[[破壞]]等，即能害人性命和障礙擾亂人們修道的餓鬼，欲界第六天之天主即是魔王。`,

'魔王', `魔中之王，即欲界第六天他化自在天的天主，他的名字叫做[[波旬]]，時常率領其眷屬向人界的修道者作種種的障礙和干擾。`,

'魔天', `惡魔所住的天界，即[[欲界]]頂上之[[他化自在天]]。`,

'魔戒', `謂比丘為求名聞利養而持戒。`,

'魔界', `又名[[魔道]]，即惡魔的境界。`,

'魔事', `惡魔所作的事，如干擾障礙人們修道是。`,

'魔佛', `天魔和佛陀。天魔是代表極惡，佛陀是代表至善。`,

'魔梵', `欲界第六天之魔王與色界之梵天王。`,

'魔病', `天魔使人所生的病惱。[[止觀]]說：「<verse>魔病者與鬼亦不異。鬼但病身殺身；魔則破觀心，破法身慧命，起邪念想，奪人功德，與鬼無異。</verse>」`,

'魔軍', `惡魔的軍兵。`,

'魔道', `魔鬼的道途。[[楞嚴經]]說：「<verse>縱有多智禪定現前，如不斷淫，必落魔女，上品魔王，中品魔民，下品魔女。</verse>」`,

'魔障', `惡魔所作的障礙。`,

'魔羅|魔', `簡稱魔。見魔條。`,

'魔羅道|魔道', `簡稱魔道。見魔道條。`,

'魔波旬', `魔是天魔，[[波旬]]是魔王的名字。`
);

addTerms(22,

'歡喜', `１．環境順意時，心生喜悅。２．[[釋迦佛|釋迦牟尼]]的弟子阿難陀，華譯為歡喜，或慶喜。`,

'歡喜日', `諸佛歡喜的日子，即農曆七月十五日，因此日僧眾結夏安居完畢，人人道業增進，所以諸佛歡喜。`,

'歡喜地', `十地之第一地。見菩薩十地條。`,

'歡喜會', `[[盂蘭盆會]]的別名，因此日由於供養自恣僧的功德而使到目連尊者的母親得免於餓鬼的痛苦，故取歡喜之意而名之。`,

'歡喜園', `又名歡喜苑，或歡樂園，或喜林苑，為[[忉利天]][[帝釋]]四園之一，在[[喜見城]]外之北方，一切天人一到此地，就自然的生起歡喜的心情。`,

'權', `方便的別名，即暫時用之最後則廢之的教法。`,

'權化', `佛菩薩以神通力方便示現種種的身體或是種種的事物。`,

'權門', `方便門。`,

'權教', `方便的教法。華嚴天台等一乘家判法相三論之三乘教為權教，而華嚴天台自己的一乘教為實教。又以天台所立的四教來說，藏通別等三教是權教，圓教是實教。`,

'權智', `相機說法的方便智，是二智之一。`,

'權智實智之一心三觀', `如來所證的一心三觀，是實智的一心三觀，而如來所說的一心三觀，卻是權智的一心三觀。`,

'權實', `適宜於一時的教法叫做權，究竟而不變的教法叫做實。`,

'權實二智', `權智和實智。見二智條。`,

'權實二教', `權教和實教。見權實條。`,

'權實不二門', `十[[不二門]]之一。`,

'權乘菩薩', `指藏通別三教的菩薩，因他們的功行尚淺，實在還沒有達到真實菩薩的地位。`,

'聽衣', `見二衣條。`,

'聽教', `在佛所說的三藏中，只有律藏有制聽二教，依理而制的法叫做制教，隨緣計情而聽許的法叫做聽教。如四重禁是制教，如[[十二頭陀]]法是聽教。又三衣是制教，三衣以外的餘衣是聽教。`,

'讀誦', `對著文字唸叫做讀，背文字叫做誦。`
);

addTerms(23,

'變化', `轉換舊的形狀叫做變，由無而忽有叫做化。變化是指佛菩薩的神通力能夠變化出種種的事物。`,

'變化土', `三土之一。見三佛土條。`,

'變化生', `不須父母之緣而忽然而生之身，亦即四生中之化生。`,

'變化法身', `五種法身之一。見五種法身條。`,

'變易', `變易生死。這種生死是菩薩於三界外心念上生滅遷變轉易的生死，是屬於精神上的生死，與三界內凡夫肉體上的分段生死不同。`,

'變易身', `變易生死的身體，是三乘聖人在三界外淨土所受的正報。`,

'變易生死', `見變易條。`,

'變易而熟', `謂一切法的種子，熏習成熟，由因位變易而入於果位。`,

'顯示', `顯是顯露，示是曉示。`,

'顯正', `顯示中正的義理。`,

'顯宗', `顯教的宗旨。`,

'顯密', `顯教和密教。見二教條。`,

'顯教', `顯明易懂的教法，是二教之一。`,

'顯識', `[[阿賴耶識]]的別名，因阿賴耶識含藏一切善惡的種子，能顯現一切的境界。`,

'顯色', `顯然可見之色，如[[青]]、[[黃]]、[[赤]]、[[白]]、[[雲]]、[[煙]]、[[塵]]、[[霧]]、[[影]]、[[光]]、[[明]]、[[闇]]之十二色是。此中青黃赤白四色是[[本色]]，其餘八色是此四色的[[差別色]]。`,

'體', `一切事物的本體，與界、性等同義。`,

'體大', `起信論所說三大之一。見三大條。`,

'體用', `真如法身為體，現象應身為用，體用就是由真如法身之體所生起的種種應化眾生的妙用。`,

'體性', `體是本體，性是本性。體與性，同體而異名。`,

'體滅', `有為法的事物，由緣而生，剎那剎那，其體衰滅，叫做體滅。但此體滅並非斷滅，而會待緣再生，故體滅是指當體滅而已。`,

'體空', `諸法因緣和合而有，當體即空。`,

'體空教', `闡明體空的教門，如方等部般若部及涅槃經等是。`,

'體空觀', `徹見體空的觀法。`,

'體相', `體與相。實質為體；差別為相。`,

'體相用', `即起信論所說之三大。見三大條。`,

'鷲山|靈鷲山', `又名[[靈鷲山]]，因此山的山頭似鷲，故名。`,

'鷲峰|靈鷲山', `[[靈鷲山]]的別名。`,

'鷲頭山|靈鷲山', `靈鷲山。`
);

addTerms(24,

'靈光', `指人人本有的佛性，因其靈靈昭昭常放光明，故名。`,

'靈骨', `即佛的舍利子，是戒定慧薰馥所成的結晶體。`,

'靈感', `有靈驗或感應的意思。`,

'靈山|靈鷲山', `舊稱[[耆闍崛山]]，新稱[[靈鷲山]]或[[靈山]]，因山形似鷲，而且山上鷲島又多，故名。位於摩竭陀國，王舍城東北。`,

'靈山會上', `在靈鷲山[[釋迦佛|釋迦牟尼]]說[[法華經|妙法蓮華]]的法會上。`,

'靈鷲山', `簡稱靈山。見靈山條。`
);

addTerms(25,

'觀', `以正慧觀察事理的意思。`,

'觀心', `觀察自己的心性。`,

'觀行', `１．先觀事理，然後起行。２．觀心的修行方法。`,

'觀法', `觀念真理的方法。`,

'觀空', `觀察諸法體空的道理。`,

'觀門', `１．教觀二門之一。見二門條。２．六妙門之一。見六妙門條。`,

'觀智', `觀察真理的正智。`,

'觀解', `觀念真理和悟解真理。`,

'觀慧', `觀察真理的智慧。`,

'觀音|觀世音', `觀世音的簡稱。見觀世音條。`,

'觀音觀', `[[觀經]]所說[[十六觀]]之一，即觀想極樂世界觀音菩薩的身相。`,

'觀音本地', `觀音的本來地位，即已成正覺的[[正法明如來]]。`,

'觀音懺法', `宋天台遵式法師，治定請觀音消伏毒害懺儀，即今所流行之觀音懺法。此懺法勸請觀世音及一切三寶加被，消除三業，以成就現當之二利。因此法以觀音為道場之主，故名觀音懺法。`,

'觀照', `觀察照見，即用心光向心中看，向心中照，是一種修慧的方法。`,

'觀照般若', `觀察照見一切實相真理的智慧，是[[三種般若]]之一。`,

'觀想', `觀察想念。`,

'觀想念佛', `四種念佛之一。見四種念佛條。`,

'觀世音', `簡稱觀音，菩薩名，因此菩薩時常觀察世人稱念他的名號或痛苦的聲音而去垂救，故名。`,

'觀世自在', `[[觀世音]]菩薩的別名，因此菩薩時常觀察世界而自在拔苦與樂。`,

'觀自在', `１．[[觀音菩薩]]的別名，因觀音菩薩無論是自利或利人，都能得到大自在。２．觀一切法很自在的意思。`,

'觀念念佛', `觀想憶念阿彌陀佛。`,

'觀佛三昧', `觀想佛的相好到一心不亂的境界。此三昧成就，即見佛來示現。`,

'觀察門', `[[五念門]]之一，即觀想極樂世界莊嚴相的法門。`,

'觀察正行', `[[淨土宗]]所立五行之一。見五正行條。`,

'觀察法忍', `二忍之一。見二忍條。`,

'觀像念佛', `四種念佛之一。見四種念佛條。`
);

addTerms(26,
'讚佛', `讚嘆佛的功德相好。`,
'讚嘆門', `[[淨土宗]]五念門之一。見五念門條。`
);

addTerms(33,
'麤人', `修小乘的人叫做麤人，修大乘的人則叫做細人。`,
'麤惡語', `[[十惡業]]之一，即[[惡口]]，亦即粗話罵人。`
);
