//tableCharts.config = {
//  bgColor:"#ffe"
//};
// Different background colors (all very light)
var PINK   = { bgColor:"#fde" };
var YELLOW = { bgColor:"#ffe" };

createGP('二十八天').setLayout(`
〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇（非天諸趣）
〇〇〇〇〇〇〇〇四王天〇〇〇〇〇〇〇〇〇地居天
〇〇〇〇欲〇〇〇忉利天
〇〇〇〇界〇〇〇夜摩天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五趣雜居地 
〇〇〇〇天〇〇〇兜率天
〇〇〇〇〇〇〇〇化樂天〇〇〇〇〇〇〇〇〇空居天
〇〇〇〇〇〇〇〇他化自在天
〇〇〇〇〇〇〇〇〇〇〇〇〇梵眾天
〇〇〇〇〇〇〇〇初禪〇〇〇梵輔天〇〇〇〇〇〇〇〇〇〇〇〇禪離生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇大梵天
〇〇〇〇〇〇〇〇〇〇〇〇〇少光天
〇〇〇〇〇〇〇〇二禪〇〇〇無量光〇〇〇〇〇〇〇〇〇〇〇〇禪定生喜樂地
〇〇〇〇〇〇〇〇〇〇〇〇〇光音天
二〇〇〇色〇〇〇〇〇〇〇〇少淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇九
十〇〇〇界〇〇〇三禪〇〇〇無量淨〇〇〇〇〇〇〇〇〇〇〇〇禪離喜妙樂地
八〇〇〇天〇〇〇〇〇〇〇〇遍淨天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇地
天〇〇〇〇〇〇〇〇〇〇〇〇無雲天
〇〇〇〇〇〇〇〇〇〇〇〇〇福生天
〇〇〇〇〇〇〇〇〇〇〇〇〇廣果天
〇〇〇〇〇〇〇〇〇〇〇〇〇無想天
〇〇〇〇〇〇〇〇四禪〇〇〇無煩天〇〇〇〇〇〇〇〇〇〇〇〇禪捨念清淨地
〇〇〇〇〇〇〇〇〇〇〇〇〇無熱天〇〇〇〇五
〇〇〇〇〇〇〇〇〇〇〇〇〇善見天〇〇〇〇淨
〇〇〇〇〇〇〇〇〇〇〇〇〇善現天〇〇〇〇居
〇〇〇〇〇〇〇〇〇〇〇〇〇色究竟天〇〇〇天
〇〇〇〇無〇〇〇空無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇空無邊處地
〇〇〇〇色〇〇〇識無邊處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識無邊處地
〇〇〇〇界〇〇〇無所有處天〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇無所有處地
〇〇〇〇天〇〇〇非想非非想處天〇〇〇〇〇〇〇〇〇〇〇〇〇非想非非想處地`)
  .shiftPoint(5, [3,4,5], 0, 0.5)
  .shiftPoint(1, [14,'-',17], 0, -0.5)
  .shiftPoint([3,6], 4, 0, 0.5)
  .shiftPoint([3,6], 27, 0, 0.5)
  .shiftPoint(1,[4,27],0,0.5).shiftPoint(1,[13,18],0,-0.5) // 二十八天
  .line([1,4],  "%r2").line([1,27], "%r2")
  .line([1,4],[1,13]).line([1,18],[1,27])
  .line([7,2],  "%r1")  //   欲界天 fanout
  .line([7,3],  "%r1")
  .line([7,4],  "%r1")
  .line([6,4],  "%r1")
  .line([7,5],  "%r1")
  .line([7,6],  "%r1")
  .line([7,7],  "%r1")
  .line([7,2],  "%d5")
  .shiftPoint(21, 2, 0, 0.5) //  地居天 fanin
  .shiftPoint(19, 5, 0, -2.5)
  .line([18,2], "%r1")
  .line([18,3], "%r1")
  .line([19,2], "%d1")
  .line([19,5], "%r1")
  .line([18,4], "%r1")       //   天居天
  .line([19,4], "%d8")
  .line([19,6], "%r1")
  .line([7,9],  "%r1")  //   色界天 fanout
  .line([7,12], "%r1")
  .line([6,15], "%r2")
  .line([7,21], "%r1")
  .line([7,9],  "%d12")
  .line([12,8], "%r1")  //     初禪 fanout
  .line([11,9], "%r2")
  .line([12,10], "%r1")
  .line([12,8], "%d2")
  .line([12,11], "%r1") //     二禪 fanout
  .line([11,12], "%r2")
  .line([12,13], "%r1")
  .line([12,11], "%d2")
  .line([12,14], "%r1") //     三禪 fanout
  .line([11,15], "%r2")
  .line([12,16], "%r1")
  .line([12,14], "%d2")
  .line([12,17], "%r1") //     四禪 fanout
  .line([12,18], "%r1")
  .line([12,19], "%r1")
  .line([12,20], "%r1")
  .line([11,21], "%r2")
  .line([12,22], "%r1")
  .line([12,23], "%r1")
  .line([12,24], "%r1")
  .line([12,25], "%r1")
  .line([12,17], "%d8")
  .line([7,26],  "%r1") //   無色界天 fanout
  .line([7,27],  "%r1")
  .line([7,28],  "%r1")
  .line([7,29],  "%r1")
  .line([7,26],  "%d3")
  .line([6,27],  "%r1")
  .shiftPoint(21, [22,'-',25], 0, -0.5) // 五淨居天 fanin
  .line([18,21], "%r1")
  .line([18,25], "%r1")
  .line([19,21], "%d4")
  .line([19,23], "%r1")
  .line([27,1], "%l2").line([27,7], "%l2").line([27,1],[27,7]).line([27,4],"%r1")      // 五趣雜居地
  .line([27,8], "%l2").line([27,10], "%l2").line([27,8],[27,10]).line([27,9],"%r1")    // 禪離生喜樂地
  .line([27,11], "%l2").line([27,13], "%l2").line([27,11],[27,13]).line([27,12],"%r1") // 禪定生喜樂地
  .line([27,14], "%l2").line([27,16], "%l2").line([27,14],[27,16]).line([27,15],"%r1") // 禪離喜妙樂地
  .line([27,17], "%l2").line([27,25], "%l2").line([27,17],[27,25]).line([27,21],"%r1") // 禪捨念清淨地
  .line([25,26], "%r3") // 空無邊處地
  .line([25,27], "%r3") // 識無邊處地
  .line([25,28], "%r3") // 無所有處地
  .line([25,29], "%r3") // 非想非非想處地
  .line([38,4],"%l2").line([38,29],"%l2").line([38,4],[38,13]).line([38,17],[38,29])   // 九地
;

createGP('七十五法') // compare: 五位百法
.setLayout(`
五七〇〇〇〇〇〇〇〇〇五根：眼、耳、鼻、舌、身
位十〇〇〇色〇法〇〇〇五境：色、聲、香、味、觸〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇十一
〇五〇〇〇〇〇〇〇〇〇無表色
〇法〇〇〇心〇法：眼識、耳識、鼻識、舌識、身識、意識〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇一
〇〇〇〇〇〇〇〇〇〇〇遍大地法：受、想、思、觸、欲、慧、念、作意、勝解、三摩地〇〇〇十
〇〇有為法〇〇〇〇〇〇大善地法：信、不放逸、輕安、捨、慚、愧、無貪、無瞋、不害、勤〇十〇〇七
〇〇〇〇〇心所法〇〇〇大煩惱地法：癡、放逸、懈怠、不信、昏沉、掉舉〇〇〇〇〇〇〇〇〇六〇〇十
宇〇〇〇〇〇〇〇〇〇〇大不善地法：無慚、無愧〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇二〇〇五
宙〇〇〇〇〇〇〇〇〇〇小煩惱地法：忿、覆、慳、嫉、惱、害、恨、諂、誑、憍〇〇〇〇〇〇十〇〇法
萬〇〇〇〇〇〇〇〇〇〇不定地法：尋、伺、睡眠、惡作、貪、瞋、慢、疑〇〇〇〇〇〇〇〇〇八
有〇〇〇〇不相應行法：得、非得、同分、無想果、無想定、滅盡定、命根、
〇〇〇〇〇〇〇〇〇〇〇生、住、異、滅、文身、名身、句身〇〇〇〇〇〇〇〇〇〇〇〇〇〇十四
〇〇無為法：擇滅無為、非擇滅無為、虛空無為〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇三`)
  .line([1,7],"%u1").line([1,6],"%r1")   // 宇宙萬有 fanout
  .line([1,12],"%d1").line([1,13],"%r1")
  .line([4,2],"%d3").line([4,2],"%r1")   // 有為法 fanout
  .line([4,7],"%d4").line([4,11],"%r1")
  .line([9,2],"%r2").line([10,1],"%d2")  // 色法 fanout
  .line([10,1],"%r1").line([10,3],"%r1")
  .line([10,5],"%d5").line([10,5],"%r1") // 心所法 fanout
                     .line([10,6],"%r1")
                     .line([10,7],"%r1")
                     .line([10,8],"%r1")
                     .line([10,9],"%r1")
                     .line([10,10],"%r1")
  .shiftPoint([6,9],7,0,0.5).line([9,7],"%r1") // for "心所法"
  // counts
  .line([25,1],"%r1").line([26,1],"%d2").line([26,3],"%l1").line([25,2],"%r16")
  .line([27,4],"%r14")
//.line([40,5],"%r1")
  .line([35,7],"%r6")
  .line([23,8],"%r18")
  .line([37,9],"%r4")
  .line([35,10],"%r6")
  .shiftPoint(35,12,0,-0.5).line([35,12],"%r6")
  .shiftPoint(35,14,0,-1.7).shiftPoint(35,11,0,-0.3).line([35,11],[35,14])
  .line([22,13],"%r19")
  .line([44,2],"%r2").line([46,2],"%d3")
  .line([44,13],"%r2").line([46,13],"%u3")
  .shiftPoint(42,12,0,-0.5)
;

createGP('八識').setLayout(`
〇〇１眼識〇〇眼根緣色塵
〇〇２耳識〇〇耳根緣聲塵
〇〇３鼻識〇〇鼻根緣香塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識（了別為義）
〇〇４舌識〇〇舌根緣味塵
〇〇５身識〇〇身根緣觸塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇七
八〇６意識〇〇意根緣法塵〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇轉
識〇〇〇末〇〇是第六意識所依之根〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識
〇〇７〇那〇〇常隨四煩惱：我癡、我見、我愛、我慢〇〇〇〇意（思量為義）
〇〇〇〇識〇〇向內執取阿賴耶為我，向外認識境界為實法
〇〇〇〇〇〇〇〇〇〇〇〇〇能藏：能含藏一切法的種子
〇〇〇〇阿〇〇華譯藏識〇〇所藏：受第七識所薰習〇〇〇〇〇〇〇〇〇〇〇〇〇〇根
〇〇８〇賴〇〇〇〇〇〇〇〇執藏：受第七識所執取〇〇〇〇〇心（集起為義）〇〇本
〇〇〇〇耶〇〇無覆無記〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇識
〇〇〇〇〇〇〇種子現行時，善惡分明，業報相續`)
  .line([1,5],[1,1]).line([1,1],[2,1])                         // 八識
  .line([1,8],[1,12]).line([1,12],[2,12])
  .line([6,1],"%r1").line([6,2],"%r1").line([6,3],"%r1")       // 六識
  .line([6,4],"%r1").line([6,5],"%r1").line([6,6],"%r1")
  .line([6,7],"%r1").line([6,9],"%r1").line([6,7],"%d2")       // 末那識
  .shiftPoint(5,[7,8,9],-0.5,0)
  .line([6,11],"%r1").line([6,14],"%r1").line([6,11],"%d3")    // 阿賴耶
  .shiftPoint(5,[11,12,13],-0.5,0)
  .line([12,10],"%r1").line([12,12],"%r1").line([12,10],"%d2") // 藏識
  .line([15,1],"%l2").line([15,2],"%l2").line([15,3],"%l2")    // 識（了別為義）
  .line([15,4],"%l2").line([15,5],"%l2").line([15,6],"%l2")
  .line([15,1],"%d5")
  .shiftPoint(15,7,0,-3.5).line([15,7],"%r13")
  .shiftPoint(29,3,0,0.5) // the text
  .line([27,7],"%r1").line([28,7],"%d2").line([27,9],"%r1")    // 意（思量為義）
  .line([27,10],"%r1").line([28,10],"%d4").line([27,14],"%r1") // 心（集起為義）
  .shiftPoint([36,37],3,0,0.5)
  .line([36,3],"%r1").line([36,8],"%r1").line([37,3],[37,8])
  .shiftPoint(38,[5,6,7],0,-0.5)
  .shiftPoint(36,12,-0.5,0).line([36,12],[37,12])              // 根本識
;

createGP('八段五篇').setLayout(`
〇〇〇〇（名目）〇（比丘戒）〇（比丘尼戒）〇〇〇（名目）
〇〇第一〇波羅夷〇〇〇〇四〇〇〇〇〇〇八〇〇〇〇〇波羅夷
〇〇第二〇僧〇殘〇〇〇十三〇〇〇〇〇十七〇〇〇〇〇僧〇殘
〇〇第三〇不〇定〇〇〇〇二〇〇〇〇〇〇無
八〇第四〇捨〇墮〇〇〇三十〇〇〇〇〇三十〇〇〇〇〇〇墮〇〇五
段〇第五〇單〇墮〇〇〇九十〇〇〇〇一七八〇〇〇〇〇〇〇〇〇篇
〇〇第六〇提舍尼〇〇〇〇四〇〇〇〇〇〇八〇〇〇〇〇提舍尼
〇〇第七〇眾〇學〇〇〇一百〇〇〇〇〇一百
〇〇第八〇滅〇諍〇〇〇〇七〇〇〇〇〇〇七〇〇〇〇〇突吉羅
〇〇〇〇〇（共計）二百五十戒〇三百四十八戒`)
  .line([1,2],"%r1").line([1,2],[1,4])       // 八段
  .line([1,9],"%r1").line([1,9],[1,7])
  .line([22,2],"%r3")                        // 波羅夷
  .line([22,3],"%r3")                        // 僧殘
  .shiftPoint(23,5,0.7).shiftPoint(24,5,0.3) // 墮
  .line([22,5],[23,5]).shiftPoint(26,5,-0.2).line([24,5],[26,5])
  .line([22,6],"%r1").line([23,6],"%u1")
  .shiftPoint(23,7,0.7).shiftPoint(24,7,0.3) // 提舍尼
  .line([22,7],[23,7]).line([24,7],[25,7])
  .line([22,9],"%r3")                        // 突吉羅
  .line([22,8],"%r2")
  .line([22,4],"%r2").line([24,4],"%d5")
  .line([29,2],[30,2]).line([30,2],[30,4])   // 五篇
  .line([30,7],[30,9]).line([30,9],"%l1")
;

createGP('十二因緣').setLayout(`
〇〇〇〇〇〇〇過去二因〇〇〇１〇〇無明〇（貪瞋痴等煩惱）〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇２〇〇行〇〇（造作諸業）〇〇〇〇〇〇〇業 ▾
〇〇〇〇〇〇〇〇〇〇〇〇〇〇３〇〇識〇〇（業識投胎）〇〇〇〇〇〇〇苦 ✗◂
十二因緣〇〇〇〇〇〇〇〇〇〇４〇〇名色〇（但有胎形六根未具）〇〇〇苦 ✗◂
〇〇〇〇〇〇〇現在五果〇〇〇５〇〇六入〇（長成眼等六根人形）〇〇〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇６〇〇觸〇〇（出胎與外境接觸）〇〇〇〇苦 ✗◂
三世因果〇〇〇〇〇〇〇〇〇〇７〇〇受〇〇（與外境接觸生苦樂感受）〇苦 ✗◂
〇〇〇〇〇〇〇〇〇〇〇〇〇〇８〇〇愛〇〇（對境生愛欲）〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇現在三因〇〇〇９〇〇取〇〇（追求造作）〇〇〇〇〇〇〇惑 ▿
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１０〇有〇〇（成業因能招未來果報）〇〇業 ▾
〇〇〇〇〇〇〇未來二果〇〇〇１１〇生〇〇（再受未來五蘊身）〇〇〇〇苦 ▸✗
〇〇〇〇〇〇〇〇〇〇〇〇〇〇１２〇老死〇（未來之身又漸老而死）〇〇苦 ▸✗`)
  .line([6,1],[6,11])
  .shiftPoint([6,8,12],1,0,0.5).shiftPoint([6,8,12],11,0,0.5)
  .line([6,1],"%r1").line([6,5],"%r1").line([6,9],"%r1").line([6,11],"%r1") // left
  .line([5,4],"%r1").line([5,7],"%r1")
  .line([13,1],"%r1").line([13,1],[13,2]).line([13,2],"%r1")     // 過去二因
  .line([12,1],"%r1")
  .line([13,3],"%r1").line([13,7],"%r1")                         // 現在五果
  .line([13,3],[13,7]).line([12,5],"%r1")
  .line([13,8],"%r1").line([13,10],"%r1")                        // 現在五果
  .line([13,8],[13,10]).line([12,9],"%r1")
  .line([13,3],[13,7]).line([12,5],"%r1")
  .line([13,11],"%r1").line([13,11],[13,12]).line([13,12],"%r1") // 未來二果
  .line([12,11],"%r1")
;

createGP('三觀').setLayout(`
〇〇〇〇〇（修三觀）〇〇（破三惑）〇〇〇（證三智）〇〇〇（成三德）

〇〇生〇〇〇修空觀〇〇〇〇破見思惑〇〇〇〇證一切智〇〇〇〇成般若德〇〇〇菩
〇〇死〇〇〇修假觀〇〇〇〇破塵沙惑〇〇〇〇證道種智〇〇〇〇成解脫德〇〇〇提
〇〇煩〇〇〇修中觀〇〇〇〇破無明惑〇〇〇〇證一切種智〇〇〇成法身德〇〇〇涅
〇〇惱〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇槃`)
  .line([10,3],"%r3").line([10,4],"%r3").line([10,5],"%r3")  // middle
  .line([18,3],"%r3").line([18,4],"%r3").line([18,5],"%r3")
  .line([26,3],"%r3").line([26,4],"%r3").line([27,5],"%r2")
  .line([5,3],"%r1").line([5,5],"%r1").line([5,3],[5,5])     // left
  .line([4,4],"%r1")
  .line([34,3],"%r1").line([34,5],"%r1").line([35,3],[35,5]) // right
  .line([35,4],"%r1")
  .shiftPoint(3,[3,'-',6],0,-0.5)                   // 生死煩惱
  .shiftPoint(37,[3,'-',6],0,-0.5)                  // 菩提涅槃
;

createGP('三轉法輪').setLayout(`
〇〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是苦，逼迫性
〇〇〇〇苦諦〇〇苦果〇〇〇次轉〇〇勸修：此是苦，汝應知
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是苦，我已知
三〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是集，招感性〇〇〇〇〇三
轉〇〇〇集諦〇〇苦因〇〇〇次轉〇〇勸修：此是集，汝應斷〇〇〇〇〇轉
四〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是集，我已斷〇〇〇〇又十
聖〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是滅，可證性〇〇〇〇稱二
諦〇〇〇滅諦〇〇樂果〇〇〇次轉〇〇勸修：此是滅，汝應證〇〇〇〇〇法
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是滅，我已證〇〇〇〇〇輪
〇〇〇〇〇〇〇〇〇〇〇〇〇初轉〇〇示相：此是道，可修性
〇〇〇〇道諦〇〇樂因〇〇〇次轉〇〇勸修：此是道，汝應修
〇〇〇〇〇〇〇〇〇〇〇〇〇三轉〇〇作證：此是道，我已修`)
  .line([7,2],"%r1").line([11,2],"%r2")                    // 苦諦
  .line([12,1],"%r1").line([12,3],"%r1").line([12,1],"%d2")
  .line([7,5],"%r1").line([11,5],"%r2")                    // 集諦
  .line([12,4],"%r1").line([12,6],"%r1").line([12,4],"%d2")
  .line([7,8],"%r1").line([11,8],"%r2")                    // 滅諦
  .line([12,7],"%r1").line([12,9],"%r1").line([12,7],"%d2")
  .line([7,11],"%r1").line([11,11],"%r2")                  // 道諦
  .line([12,10],"%r1").line([12,12],"%r1").line([12,10],"%d2")
  .line([29,1],"%r1").line([29,12],"%r1").line([30,1],[30,12]) // right
  .shiftPoint(30,6,0,0.5).line([30,6],"%r1")
  .line([3,2],"%r1").line([3,11],"%r1").line([3,2],[3,11]) // left
  .shiftPoint(2,6,0,0.5).line([2,6],"%r1")
  .shiftPoint(1,[4,5,6,7,8],0,0.5)
;

createGP('大乘') // 唯識宗所立。比較律宗所立之「四位」。
.setLayout(`
〇〇〇十住（第一發心住內，包括十信，
〇〇〇〇〇〇由凡夫修十信成就，〇〇〇〇〇資
〇〇〇〇〇〇須經一萬大劫）〇〇〇〇〇〇〇糧
初〇〇十行〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇位
僧〇〇十迴向
祇〇〇〇暖〇〇〇〇〇〇四尋思觀
劫〇〇〇頂〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇加
〇〇〇〇忍〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇行
〇〇〇〇世〇第一〇〇〇四如實智〇〇〇〇〇位

〇〇〇〇〇〇〇〇入心〇〇〇〇〇〇〇〇通達位
〇〇〇初地〇〇〇住心〇〇〇〇〇〇〇〇（見道位）
〇〇〇〇〇〇〇〇出心
二〇〇二地
僧〇〇三地
祇〇〇四地
劫〇〇五地〇〇〇〇〇〇〇〇〇〇〇〇〇修習位
〇〇〇六地〇〇〇〇〇〇〇〇〇〇〇〇〇（修道位）
〇〇〇七地

三〇〇八地
僧〇〇九地
祇〇〇十地
劫〇〇等覺

〇〇〇妙覺〇〇〇〇〇〇〇〇〇〇〇〇〇究竟位`)
  .line([2,1],"%r1").line([2,9],"%r1").line([2,1],[2,9])     // 初僧祇劫
  .line([2,12],"%r1").line([2,19],"%r1").line([2,12],[2,19]) // 二僧祇劫
  .line([2,21],"%r1").line([2,24],"%r1").line([2,21],[2,24]) // 二僧祇劫
  .line([19,1],"%r1").line([7,5],[20,5]).line([20,1],[20,5]) // 資糧位
  .line([6,6],"%r4").line([6,7],"%r4").line([10,6],[10,7])   // 四尋思觀
  .shiftPoint(12,6,0,0.5) // for text
  .shiftPoint(10,5,0,1.5).line([10,5],"%r1")
  .line([6,8],"%r4").line([9,9],"%r1").line([10,8],[10,9])   // 四如實智
  .shiftPoint(12,9,0,-0.5) // for text
  .shiftPoint(10,10,0,-1.5).line([10,10],"%r1")
  .shiftPoint([16,20],6,0,0.5).shiftPoint([16,20],9,0,-0.5)    // 加行位
  .shiftPoint(21,[7,8,9],0,-0.5)
  .line([16,6],"%r4").line([16,9],"%r4").line([20,6],[20,9])
  .line([6,12],"%r2").line([7,11],"%r1").line([7,13],"%r1")  // 初地
  .line([7,11],"%d2")
  .line([11,11],"%r7")                                            // 通達位
  .line([11,12],"%r7").line([6,24],[18,24]).line([18,12],[18,24]) // 修習位 
  .line([6,26],[18,26])                                           // 究竟位
;

createGP('五位百法') // compare: 七十五法
.setLayout(`
〇〇心法：〇〇〇〇眼識、耳識、鼻識、舌識、身識、意識、末那識、阿賴耶識〇〇〇〇〇〇〇〇〇八
〇〇〇〇遍行：〇〇觸、作意、受、想、思〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五
〇〇〇〇別境：〇〇欲、勝解、念、定、慧〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇五〇五
〇〇心〇善：〇〇〇信、精進、慚、愧、無貪、無瞋、無癡、輕安、不放逸、行捨、不害〇〇〇〇十一〇十
〇〇所〇根本煩惱：貪、瞋、癡、慢、疑、惡見〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇六〇一
宇〇法〇隨煩惱：〇小十：忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，中二：無慚、無愧，〇〇〇〇〇心〇百
宙〇〇〇〇〇〇〇〇大八：不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂〇〇〇〇〇〇〇〇廿〇所
萬〇〇〇不定：〇〇睡眠、惡作、尋、伺〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇〇四〇〇〇法
有〇色法：〇〇〇〇眼、耳、鼻、舌、身、色、聲、香、味、觸、法處所攝色〇〇〇〇〇〇〇〇〇十一
〇〇不相應法〇〇〇得、命根、眾同分、異生性、無想定、滅盡定、無想報、
〇〇〇行法：〇〇〇名身、句身、文身、生、住、老、無常、流轉、定異、〇〇〇〇〇〇〇〇〇〇廿四
〇〇〇〇〇〇〇〇〇相應、勢速、次第、時、方、數、和合性、不和合性
〇〇無為法：〇〇〇虛空無為、擇滅無為、非擇滅無為、不動滅無為、想受滅無為、真如無為〇〇〇六`)
  .setStyle('.ail { font-size:12px; opacity:0.5 }')
  .shiftPoint(1,[5,'-',10],0,-0.5)                // 宇宙萬有
  .line([1,1],"%r1").line([1,1],[1,5])
  .line([1,13],"%r1").line([1,13],[1,10])
  .line([3,2],"%r1").line([3,2],"%d1")            // 心所法
  .line([3,8],"%r1").line([3,8],"%u1")
  .shiftPoint(3,10,0,0.5).shiftPoint(4,11,0,0.5)  // 不相應法行法
  .shiftPoint(9,10,0,-0.25)
  .line([9,10],"%d2.5", 'stroke-dasharray="5 2" stroke-opacity="0.5" stroke="black"')
  .line([49,1],"%l3").line([49,1],[49,5])         // 百法
  .line([49,13],"%l3").line([49,13],[49,9])
  .line([47,2],"%l1").line([47,2],"%d0.3")        // 五十一心所
  .line([47,8],"%l1").line([47,8],"%d-0.3")
  .line([36,1],[43,1])                            // counts
  .line([20,2],[43,2])
  .line([20,3],[43,3])
  .line([40,4],[43,4])
  .line([22,5],[43,5])
  .line([19,8],[43,8])
  .line([36,9],[43,9])
  .shiftPoint([45,35],7,0,-0.5) // 廿
  .shiftPoint(41,7,0,-0.5).line([41,7],"%r2")
  .shiftPoint(41,6,0,-0.25).shiftPoint(41,8,0,-0.75).line([41,6],[41,8])
  .shiftPoint(36,10,0,-0.25).shiftPoint(36,12,0,0.25)  // 廿四
  .line([36,10],[36,12])
  .line([36,11],[43,11])
  .line([42,13],[43,13])        // 六
  .setText(10, 6, '<tspan class="ail">小十：</tspan>忿、恨、惱、覆、誑、諂、憍、害、嫉、慳，<tspan class="ail">中二：</tspan>無慚、無愧，')
  .setText(10, 7, '<tspan class="ail">大八：</tspan>不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂');
;
/*
createGP('五位百法👀', PINK).setLayout(`
┌〇心法：〇〇〇眼識、耳識、鼻識、舌識、身識、意識、末那識、阿賴耶識〇〇〇〇〇〇〇───八〇┐
│〇┌〇遍行：〇觸、作意、受、想、思〇〇〇〇〇〇〇〇〇〇〇〇〇─────────────五〇│
│〇│〇別境：〇欲、勝解、念、定、慧〇〇〇〇〇〇〇〇〇〇〇〇〇─────────────五〇│
│〇心〇善：〇〇信、精進、慚、愧、無貪、無瞋、無癡、輕安、不放逸、行捨、不害〇〇〇──十一〇│
│〇所〇煩惱：〇貪、瞋、癡、慢、疑、惡見〇〇〇〇〇〇〇〇〇〇〇〇〇───────────六〇│
宇〇法〇隨煩惱：忿、恨、惱、覆、誑、諂、憍、害、嫉、慳、無慚、無愧、│〇〇〇〇〇〇〇〇〇〇〇百
宙〇│〇〇〇〇〇不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂〇〇│〇〇〇〇〇〇〇〇〇廿
萬〇└〇不定：〇睡眠、惡作、尋、伺〇〇〇〇〇〇〇〇〇〇〇〇〇──────────────四〇法
有〇色法：〇〇〇眼、耳、鼻、舌、身、色、聲、香、味、觸、法處所攝色〇〇〇〇〇〇〇〇──十一〇│
││不相應法〇〇得、命根、眾同分、異生性、無想定、滅盡定、無想報、〇│〇〇〇〇〇〇〇〇〇〇〇│
││〇行法：〇〇名身、句身、文身、生、住、老、無常、流轉、定異、〇〇│〇〇〇〇〇〇〇〇廿四〇│
││〇〇〇〇〇〇相應、勢速、次第、時、方、數、和合性、不和合性〇〇〇│〇〇〇〇〇〇〇〇〇〇〇│
└〇無為法：〇〇虛空無為、擇滅無為、非擇滅無為、不動滅無為、想受滅無為、真如無為〇───六〇┘`)
;

createGP('五位百法✗', PINK).setLayout(`
┌〇心法：眼識、耳識、鼻識、舌識、身識、意識、末那識、阿賴耶識〇〇〇〇〇〇──八〇┐
│〇〇〇〇┌遍行：觸、作意、受、想、思〇〇〇〇〇〇〇─────────────五〇│
│〇〇〇〇│別境：欲、勝解、念、定、慧〇〇〇〇〇〇〇─────────────五〇│
│〇〇〇〇│善：〇信、精進、慚、愧、無貪、無瞋、無癡、〇〇〇〇〇〇〇〇〇〇〇〇〇〇│
│〇心所法┤〇〇〇輕安、不放逸、行捨、不害〇〇〇〇〇〇〇──────────十一〇│
宇〇〇〇〇│煩惱：貪、瞋、癡、慢、疑、惡見〇〇〇〇〇〇〇───────────六〇│
宙〇〇〇〇│隨煩惱：忿、恨、惱、覆、誑、諂、憍、害、嫉、慳、無慚、無愧、〇〇〇〇〇百
萬〇〇〇〇│〇〇〇〇不信、懈怠、放逸、昏沉、掉舉、失念、不正知、散亂〇〇〇〇─廿〇法
有〇〇〇〇└不定：睡眠、惡作、尋、伺〇〇〇〇〇〇〇──────────────四〇│
│〇色法：眼、耳、鼻、舌、身、色、聲、香、味、觸、法處所攝色〇〇〇〇〇〇──十一〇│
│〇不相應法行法：得、命根、眾同分、異生性、無想定、滅盡定、無想報、名身、〇〇〇〇│
│〇〇〇〇〇〇〇〇句身、文身、生、住、老、無常、流轉、定異、相應、勢速、〇〇〇〇〇│
│〇〇〇〇〇〇〇〇次第、時、方、數、和合性、不和合性〇〇〇〇〇〇〇〇────廿四〇│
└〇無為法：虛空無為、擇滅無為、非擇滅無為、不動滅無為、想受滅無為、真如無為─六〇┘`);
*/

createGP('五重唯識').setLayout(`
五〇〇〇１遣虛存寶（空有相對，遣空存有）
重〇〇〇２捨濫留純（心境相對，捨境留心）〇〇〇唯識相
唯〇〇〇３攝末歸本（體用相對，攝用歸體）
識〇〇〇４隱劣顯勝（王所相對，隱所顯王）
觀〇〇〇５遣相證性（事理相對，遣事證理）〇〇〇唯識性`)
  .line([2,3],"%r1")    // 五重唯識觀
  .line([3,1],"%r1").line([3,5],"%r1").line([3,1],[3,5])
  .line([21,1],"%r1").line([21,4],"%r1").line([22,1],[22,4]) // 唯識相
  .shiftPoint([22,24],2,0,0.5).line([22,2],"%r1")
  .line([21,5],"%r2")   // 唯識性
;

createGP('六相').setLayout(`
〇〇〇〇〇〇〇總〇〇〇〇〇〇〇〇〇（理法界）
〇〇〇〇體
〇〇〇〇〇〇〇別
六〇〇〇〇〇〇〇〇〇〇〇〇〇平等門（圓融門）
〇〇〇〇〇〇〇同
〇〇〇〇相
〇〇〇〇〇〇〇異
相〇〇〇〇〇〇〇〇〇〇〇〇〇差別門（行布門）
〇〇〇〇〇〇〇成
〇〇〇〇用
〇〇〇〇〇〇〇壞〇〇〇〇〇〇〇〇〇（事法界）`)
  .shiftPoint(6,[2,'-',10],-0.5)
  .shiftPoint(7,[2,'-',10],0.25)
  .shiftPoint(9,[1,'-',11],-0.5)
  .shiftPoint(14,[4,'-',8],0.25)
  .shiftPoint(2,1,0,-0.5)
  .shiftPoint(2,11,0,0.5)
  .line([2,1],"%r1").line([2,11],"%r1").line([2,1],[2,11]) // 六相
  .line([6,2],[7,1]).line([6,2],[7,3])    // 體
  .line([6,6],[7,5]).line([6,6],[7,7])    // 相
  .line([6,10],[7,9]).line([6,10],[7,11]) // 用
  .line([9,1],[14,4]).line([9,5],[14,4]).line([9,9],[14,4])  // 平等門
  .line([9,3],[14,8]).line([9,7],[14,8]).line([9,11],[14,8]) // 差別門
  .line([20,2],"%d1").line([20,9],"%d1")
;

createGP('六即').setLayout(`
〇〇（十位階）〇〇〇〇〇〇〇〇〇〇〇〇（六種即佛）
〇１〇凡夫位（對於佛法，聞信全無）───理〇即佛
〇２〇凡夫位（對於佛法，有聞有信）───名字即佛
〇３〇五品弟子位───（外凡位）────觀行即佛
〇４〇十信位─────（內凡位）────相似即佛
〇５〇十住位───┐
〇６〇十行位〇〇〇│
〇７〇十迴向位〇〇├─（菩薩位）────分證即佛
〇８〇十地位〇〇〇│
〇９〇等覺位───┘
１０〇妙覺位─────（佛〇位）────究竟即佛`)
  .line([18,2],[20,2])    // 理即佛
  .line([18,3],[20,3])    // 名字即佛
  .line([17,4],[20,4])    // 觀行即佛
  .line([17,5],[20,5])    // 相似即佛
  .line([17,8],[20,8])    // 分證即佛
  .line([17,11],[20,11])  // 究竟即佛
  .line([7,6],[10,6]).line([7,10],[10,10]) // 菩薩位
  .line([10,6],[10,10])
  .shiftPoint(11,8,0.5).line([10,8],[11,8])
;

createGP('六根本煩惱')
  .setMarks('ABCD')
  .setLayout(`
　　┌　１貪──貪愛五欲────────────────┐
　　│　２瞋──瞋恚無忍────────────────│　五
六　│　３癡──愚癡無明────────────────├─鈍─┐
根　│　４慢──驕慢自大────────────────│　使　│
本─A　５疑──狐疑猜忌────────────────┘　　　├─十　
煩　│　　　┌─１身見（薩迦邪見）執取五蘊根身─────┐　　　│　使
惱　│　　不│　２邊見──────執取常斷二見─────│　五　│
　　└─６正│　３邪見──────謗無因果，壞諸善事──├─利─┘
　　　　　見│　４見取見─────執持成見，非果非果──│　使
　　　　　　└─５戒禁取見────執持不正戒，非因計因─┘`)
  .line([3,1],"%r1").line([3,8],"%r1").line([3,1],[3,8])  // 六根本煩惱
  .line('A',"%l1")
  .shiftPoint(33,5,0,0.5).line([33,5],"%r1") // 十使
  .line([33,3],"%l1").line([33,8],"%l1").line([33,3],[33,8])
  .line([7,1],"%r1").line([13,1],[29,1])   // 五鈍使
  .line([7,2],"%r1").line([13,2],[29,2])
  .line([7,3],"%r1").line([13,3],[30,3])
  .line([7,4],"%r1").line([13,4],[29,4])
  .line([7,5],"%r1").line([13,5],[29,5])
  .line([29,1],[29,5])
  .line([24,6],[29,6])                     // 五利使
  .line([12,7],[17,7]).line([24,7],[29,7])
  .line([12,8],[17,8]).line([27,8],[30,8])
  .line([13,9],[17,9]).line([27,9],[29,9])
  .line([14,10],[17,10]).line([28,10],[29,10])
  .line([29,6],[29,10])
  .line([7,6],"%r1").line([7,10],"%r1")    // 不正見
  .line([7,6],[7,10])
;
 
createGP('六和敬').setLayout(`
　理　和───證擇滅
　　　　　┌　身口同住
　　　　　│　口和無諍
　事　和　│　意和同悅
（六和敬）│　戒和同修
　　　　　│　見和同解
　　　　　└　利和同均`)
  .shiftPoint(5,4,0,0.5)
  .line([5,1],"%r2")                       // 理和
  .line([5,4],"%r1")
  .line([6,2],"%r1").line([6,3],"%r1").line([6,4],"%r1")
  .line([6,5],"%r1").line([6,6],"%r1").line([6,7],"%r1")
  .line([6,2],[6,7])
;

createGP('六度').setLayout(`
　　　　　　　　　　　六
　　　　　　　　　　　度
　┌─────────┴─────────┐
　６　　　５　　　４　　　３　　　２　　　１
　般　　　禪　　　精　　　忍　　　持　　　布
　若　　　定　　　進　　　辱　　　戒　　　施
　│　　　│　　　│　　　│　　　│　　　│
┌┴┐　┌┴┐　┌┴┐　┌┴┐　┌┴┐　┌┴┐
一法生　意口身　求修斷　無法生　饒攝律　無法財
切空空　定定定　化精精　生忍忍　益善儀　畏施施
智智智　　　　　精進進　法　　　有法戒　施
智　　　　　　　進　　　忍　　　情戒
　　　　　　　　　　　　　　　　戒
└┬┘　└┬┘　└┬┘　└┬┘　└┬┘　└┬┘
　│　　　│　　　│　　　│　　　│　　　│
　度　　　度　　　度　　　度　　　度　　　度
　愚　　　散　　　懈　　　瞋　　　毀　　　慳
　癡　　　亂　　　怠　　　恚　　　犯　　　貪 `)
  .line([2,3],[22,3])                         // 六度
  .line([12,3],"%u0.5")
  .line([2,3],"%d0.5").line([22,3],"%d0.5")
  // set a macro for drawing one silo
  .setMacro('silo', (gp,x,y) => { // Eg 布施 [x,y]=[22,8]
     // top (down) fork
     gp.line([x-1,y],"%d0.5").line([x+1,y],"%d0.5")
       .line([x-1,y],[x+1,y]).line([x,y],"%u1.25");
     y += 6; // bottom fork
     gp.line([x,y],"%d1.25").line([x-1,y],[x+1,y])
       .line([x-1,y],"%u0.5").line([x+1,y],"%u0.5")
   })
  .macro('silo', 22, 8) // 布施
  .macro('silo', 18, 8) // 持戒
  .macro('silo', 14, 8) // 忍辱
  .macro('silo', 10, 8) // 精進
  .macro('silo',  6, 8) // 禪定
  .macro('silo',  2, 8) // 般若
;

createGP('四位') // compare: 大乘
  .setLayout(`
　　┌　願樂位　　願樂信解，自利利他，　　　　　　　　為第一阿僧祇劫所修
四　│　　　　　　此當十信、十住、十行、十回向。
　─┤　見位　　　為見道位，此當初地。　　　　　　　　為第二阿僧祇劫所修
位　│　修位　　　為修道位，此當二至七地。
　　└　究竟位　　漸進至於佛地，此當八地至妙覺。　　　為第三阿僧祇劫所修`)
  .line([3,1],"%r1").line([3,5],"%r1").line([3,1],[3,5]) // 四位
  .line([3,3],"%l1")
  .shiftPoint(28,1,0, 0.5)               // 第一阿僧祇劫
  .line([25,1],"%r1").line([25,2],"%r1")
  .line([26,1],[26,2])
  .shiftPoint(27,1,-1,0.5).line([27,1],"%r1")
  .shiftPoint(28,3,0, 0.5)               // 第二阿僧祇劫
  .line([25,3],"%r1").line([25,4],"%r1")
  .line([26,3],[26,4])
  .shiftPoint(27,3,-1,0.5).line([27,3],"%r1")
;

createGP('四諦十六行相')
  .setMarks('A')
  .setLayout(`
　　　　　　　　┌　苦：　（觀此身是苦）
　　　　　　　　│　空：　（觀因緣所生故空。）
　　┌　苦　諦─┤　無常：（觀因緣假成，故生滅無常。）
　　│　　　　　└　無我：（觀因緣假成，故無我體。）
　　│　　　　　┌　集：　（觀招集苦果。）
四　│　　　　　│　因：　（觀苦果之因。）
諦　│　集　諦─┤　生：　（觀苦果生，相繼存在。）
十　│　　　　　└　緣：　（觀諸緣成就苦果。）
六─A　　　　　┌　滅：　（觀諸漏已盡，生死斷滅。）
行　│　　　　　│　靜：　（觀三毒皆無，此心不亂，有明照作用，故靜。）
相　│　滅　諦─┤　妙：　（觀出離三界，無諸憂患，故妙。）
　　│　　　　　└　離：　（觀一切災害，皆已遠離。）
　　│　　　　　┌　道：　（觀八正道，可至涅槃。）
　　│　　　　　│　如：　（道契正理，故如。）
　　└　道　諦─┤　行：　（由此萬行，以趣涅槃。）
　　　　　　　　└　出：　（由此聖道，以出生死。）`)
  .shiftPoint(3,[3,15],0,-0.5)    // 四諦十六行相
  .line([3,3],"%r1").line([3,15],"%r1").line([3,3],[3,15])
  .shiftPoint('A',0,-0.5).line('A',"%l1")
  .setMacro('item', (gp,x,y) => { // Eg 苦諦: [x,y]=[9,1]
     gp.line([x,y],"%r1").line([x,y+3],"%r1").line([x,y],"%d3")
       .shiftPoint([x,x-2,x-4],y+2,0,-0.5)
       .line([x,y+2],"%l1")
   })
  .macro('item',9,1)  // 苦諦
  .macro('item',9,5)  // 集諦
  .macro('item',9,9)  // 滅諦
  .macro('item',9,13) // 道諦
;

createGP('四分律').setLayout(`
　　┌　初分前部─────────僧戒本───┬───止持
四　│　　　　　　　　　　　　　　　　　　　　│
分─┤　初分後部至第二分前部───尼戒本───┘
律　│　
　　└　第二分後部至第四分────二十犍度──────作持`)
  .line([3,1],"%r1").line([3,5],"%r1").line([3,1],[3,5]).line([3,3],"%l1")
  .line([9,1],"%r8").line([21,1],"%r6")
  .line([15,3],"%r2").line([21,3],"%r3").line([24,3],"%u2")
  .line([14,5],"%r3").line([22,5],"%r5")
;

createGP('四聖諦').setLayout(`
　　┌　苦　諦（迷的果，即苦果）　┐
四　│　集　諦（迷的因，即苦因）　┘───世間的因果
聖─┤　滅　諦（悟的果，即樂果）　┐
諦　└　道　諦（悟的因，即樂因）　┘───出世間的因果`)
  .line([3,1],"%r1").line([3,4],"%r1").line([3,1],"%d3") // 四聖諦
  .shiftPoint(3,3,0,-0.5).line([3,3],"%l1")
  .shiftPoint(1,[2,3,4],0,-0.5)
  .shiftPoint(17,[1,'-',4],-0.5)
  .line([18,1],[17,1]).line([18,2],[17,2]).line([18,1],"%d1") // 世間的因果
  .shiftPoint([19,22],2,-1,-0.5).line([19,2],"%r2")
  .line([18,3],[17,3]).line([18,4],[17,4]).line([18,3],"%d1") // 出世間的因果
  .shiftPoint([19,22],4,-1,-0.5).line([19,4],"%r2")
;

createGP('聲聞乘').setLayout(`
　　┌　五停心觀　┐
　　│　別相念處　├─三　賢　┐
　　│　總相念處　┘　　　　　├─七方便　┐　　　三
　　│　暖────┐　　　　　│　　　　　│　　　生
聲　│　頂　　　　├─四善根　┘　　　　　│　修　乃
　─┤　忍　　　　│　　　　　　　　　　　├─四　至
聞　│　世第一法─┘　　　　　　　　　　　│　聖　六
　　│　預流果　　┐　　　　　　　　　　　│　諦　十
　　│　一來果　　├─四　果───────┘　　　劫
　　│　不還果　　│
　　└　阿羅漢果　┘`)
  .line([3,1],"%r1").line([3,11],"%r1").line([3,1],[3,11])     // 聲聞
  .line([3,6],"%l1")
  .line([10,1],"%l1").line([10,3],"%l1").line([10,1],[10,3])   // 三賢
  .line([10,2],"%r1")
  .line([10,4],"%l1").line([10,7],"%l1").line([10,4],[10,7])   // 四善根
  .shiftPoint(10,[5,9],0,0.5).line([10,5],"%r1")
  .shiftPoint(12,5,0,0.5) // text
  .line([10,8],"%l1").line([10,11],"%l1").line([10,8],[10,11]) // 四果
  .line([10,9],"%r1")
  .shiftPoint([12,14,22],9,0,0.5) // text
  .line([16,2],"%l1").line([16,5],"%l1")                       // 七方便
  .shiftPoint(16,5,0,0.5).line([16,2],[16,5])
  .shiftPoint([16,18,22],3,0,0.75).line([16,3],"%r1")
  .line([22,3],"%l1").line([22,9],"%l7").line([22,3],[22,9])   // right
  .shiftPoint(22,6,0,0.5).line([22,6],"%r1")
  .shiftPoint(26,[3,'-',9],0,0.5) // 三生乃至六十劫
;
