function partnum() { return simpleSeq(seqNext('_p01')); } 

SC.volNum = 1;
SC.text = `
/SECTION/世主妙嚴品第一之一

如是我聞：

一時，佛在摩竭提國阿蘭若法菩提場中，始成正覺。其地堅固，金剛所成；上妙寶輪，及眾寶華、清淨摩尼，以為嚴飾；諸色相海，無邊顯現；摩尼為幢，常放光明，恆出妙音，眾寶羅網，妙香華纓，周匝垂布；摩尼寶王，變現自在，雨無盡寶及眾妙華分散於地；寶樹行列，枝葉光茂。佛神力故，令此道場一切莊嚴於中影現。其菩提樹高顯殊特：金剛為身，琉璃為幹；眾雜妙寶以為枝條；寶葉扶疏，垂蔭如雲；寶華雜色，分枝布影，復以摩尼而為其果，含輝發焰，與華間列。其樹周圍咸放光明，於光明中雨摩尼寶，摩尼寶內，有諸菩薩，其眾如雲，俱時出現。又以如來威神力故，其菩提樹恆出妙音，說種種法，無有盡極。如來所處宮殿樓閣，廣博嚴麗充遍十方，眾色摩尼之所集成，種種寶華以為莊校；諸莊嚴具流光如雲，從宮殿間萃影成幢。無邊菩薩道場眾會咸集其所，以能出現諸佛光明不思議音。摩尼寶王而為其網，如來自在神通之力所有境界皆從中出；一切眾生居處屋宅，皆於此中現其影像。又以諸佛神力所加，一念之間，悉包法界。其師子座，高廣妙好：摩尼為臺，蓮華為網，清淨妙寶以為其輪，眾色雜華而作瓔珞。堂榭、樓閣、階砌、戶牖，凡諸物像，備體莊嚴；寶樹枝果，周迴間列。摩尼光雲，互相照耀；十方諸佛，化現珠玉；一切菩薩髻中妙寶，悉放光明而來瑩燭。復以諸佛威神所持，演說如來廣大境界，妙音遐暢，無處不及。

爾時，世尊處於此座，於一切法成最正覺，智入三世悉皆平等，其身充滿一切世間，其音普順十方國土。譬如虛空具含眾像，於諸境界無所分別；又如虛空普遍一切，於諸國土平等隨入。身恆遍坐一切道場，菩薩眾中威光赫奕，如日輪出，照明世界。三世所行，眾福大海，悉已清淨，而恆示生諸佛國土。無邊色相，圓滿光明，遍周法界，等無差別；演一切法，如布大雲。一一毛端，悉能容受一切世界而無障礙，各現無量神通之力，教化調伏一切眾生；身遍十方而無來往，智入諸相，了法空寂。三世諸佛所有神變，於光明中靡不咸睹；一切佛土不思議劫所有莊嚴，悉令顯現。

有十佛世界微塵數<key>菩薩摩訶薩</key>所共圍遶，其名曰：${partnum()}
/I/普賢 菩薩摩訶薩、　　　　　　普德最勝燈光照 菩薩摩訶薩、　普光師子幢 菩薩摩訶薩、　　普寶焰妙光 菩薩摩訶薩、
/I/普音功德海幢 菩薩摩訶薩、　　普智光照如來境 菩薩摩訶薩、　普寶髻華幢 菩薩摩訶薩、　　普覺悅意聲 菩薩摩訶薩、
/I/普清淨無盡福光 菩薩摩訶薩、　普光明相 菩薩摩訶薩、　　　　海月光大明 菩薩摩訶薩、　　雲音海光無垢藏 菩薩摩訶薩、
/I/功德寶髻智生 菩薩摩訶薩、　　功德自在王大光 菩薩摩訶薩、　善勇猛蓮華髻 菩薩摩訶薩、　普智雲日幢 菩薩摩訶薩、
/I/大精進金剛臍 菩薩摩訶薩、　　香焰光幢 菩薩摩訶薩、　　　　大明德深美音 菩薩摩訶薩、　大福光智生 菩薩摩訶薩……。
/L/如是等而為上首，有十佛世界微塵數。此諸菩薩，往昔皆與毘盧遮那如來共集善根，修菩薩行；皆從如來善根海生，諸波羅蜜悉已圓滿；慧眼明徹，等觀三世；於諸三昧，具足清淨；辯才如海，廣大無盡；具佛功德，尊嚴可敬；知眾生根，如應化伏；入法界藏，智無差別；證佛解脫，甚深廣大；能隨方便，入於一地，而以一切願海所持，恆與智俱盡未來際；了達諸佛希有廣大祕密之境，善知一切佛平等法，已踐如來普光明地，入於無量三昧海門；於一切處，皆隨現身；世法所行，悉同其事；總持廣大，集眾法海；辯才善巧，轉不退輪；一切如來功德大海，咸入其身；一切諸佛所在國土，皆隨願往；已曾供養一切諸佛，無邊際劫，歡喜無倦；一切如來得菩提處，常在其中，親近不捨；恆以所得普賢願海，令一切眾生智身具足。成就如是無量功德。

復有佛世界微塵數<key>執金剛神</key>，所謂：${partnum()}
/I/妙色那羅延 執金剛神、　日輪速疾幢 執金剛神、　須彌華光 執金剛神、　　清淨雲音 執金剛神、　諸根美妙 執金剛神、
/I/可愛樂光明 執金剛神、　大樹雷音 執金剛神、　　師子王光明 執金剛神、　密焰勝目 執金剛神、　蓮華光摩尼髻 執金剛神……。
/L/如是等而為上首，有佛世界微塵數，皆於往昔無量劫中恆發大願，願常親近供養諸佛；隨願所行，已得圓滿，到於彼岸；積集無邊清淨福業，於諸三昧所行之境悉已明達；獲神通力，隨如來住，入不思議解脫境界；處於眾會，威光特達，隨諸眾生所應現身而示調伏；一切諸佛化形所在，皆隨化往；一切如來所住之處，常勤守護。

復有佛世界微塵數<key>身眾神</key>，所謂：${partnum()}
/I/華髻莊嚴 身眾神、　光照十方 身眾神、　海音調伏 身眾神、　淨華嚴髻 身眾神、　無量威儀 身眾神、
/I/最上光嚴 身眾神、　淨光香雲 身眾神、　守護攝持 身眾神、　普現攝取 身眾神、　不動光明 身眾神……。
/L/如是等而為上首，有佛世界微塵數，皆於往昔成就大願，供養承事一切諸佛。

復有佛世界微塵數<key>足行神</key>，所謂：${partnum()}
/I/寶印手 足行神、　　蓮華光 足行神、　　清淨華髻 足行神、　攝諸善見 足行神、　妙寶星幢 足行神、
/I/樂吐妙音 足行神、　栴檀樹光 足行神、　蓮華光明 足行神、　微妙光明 足行神、　積集妙華 足行神……。
/L/如是等而為上首，有佛世界微塵數，皆於過去無量劫中，親近如來，隨逐不捨。

復有佛世界微塵數<key>道場神</key>，所謂：${partnum()}
/I/淨莊嚴幢 道場神、　須彌寶光 道場神、　雷音幢相 道場神、　雨華妙眼 道場神、　華纓光髻 道場神、
/I/雨寶莊嚴 道場神、　勇猛香眼 道場神、　金剛彩雲 道場神、　蓮華光明 道場神、　妙光照耀 道場神……。
/L/如是等而為上首，有佛世界微塵數，皆於過去值無量佛，成就願力，廣興供養。

復有佛世界微塵數<key>主城神</key>，所謂：${partnum()}
/I/寶峰光耀 主城神、　妙嚴宮殿 主城神、　清淨喜寶 主城神、　離憂清淨 主城神、　華燈焰眼 主城神、
/I/焰幢明現 主城神、　盛福光明 主城神、　清淨光明 主城神、　香髻莊嚴 主城神、　妙寶光明 主城神……。
/L/如是等而為上首，有佛世界微塵數，皆於無量不思議劫，嚴淨如來所居宮殿。

復有佛世界微塵數<key>主地神</key>，所謂：${partnum()}
/I/普德淨華 主地神、　堅福莊嚴 主地神、　妙華嚴樹 主地神、　普散眾寶 主地神、　淨目觀時 主地神、
/I/妙色勝眼 主地神、　香毛髮光 主地神、　悅意音聲 主地神、　妙華旋髻 主地神、　金剛嚴體 主地神……。
/L/如是等而為上首，有佛世界微塵數，皆於往昔發深重願，願常親近諸佛如來，同修福業。

復有無量<key>主山神</key>，所謂：${partnum()}
/I/寶峰開華 主山神、　華林妙髻 主山神、　高幢普照 主山神、　離塵淨髻 主山神、　光照十方 主山神、
/I/大力光明 主山神、　威光普勝 主山神、　微密光輪 主山神、　普眼現見 主山神、　金剛密眼 主山神……。
/L/如是等而為上首，其數無量，皆於諸法得清淨眼。

復有不可思議數<key>主林神</key>，所謂：${partnum()}
/I/布華如雲 主林神、　擢幹舒光 主林神、　生芽發耀 主林神、　吉祥淨葉 主林神、　垂布焰藏 主林神、
/I/清淨光明 主林神、　可意雷音 主林神、　光香普遍 主林神、　妙光迴耀 主林神、　華果光味 主林神……。
/L/如是等而為上首，不思議數，皆有無量可愛光明。

復有無量<key>主藥神</key>，所謂：${partnum()}
/I/吉祥 主藥神、　　　栴檀林 主藥神、　　清淨光明 主藥神、　名稱普聞 主藥神、　毛孔光明 主藥神、
/I/普治清淨 主藥神、　大發吼聲 主藥神、　蔽日光幢 主藥神、　明見十方 主藥神、　益氣明目 主藥神……。
/L/如是等而為上首，其數無量，性皆離垢，仁慈祐物。

復有無量<key>主稼神</key>，所謂：${partnum()}
/I/柔軟勝味 主稼神、　時華淨光 主稼神、　色力勇健 主稼神、　增長精氣 主稼神、　普生根果 主稼神、
/I/妙嚴環髻 主稼神、　潤澤淨華 主稼神、　成就妙香 主稼神、　見者愛樂 主稼神、　離垢淨光 主稼神……。
/L/如是等而為上首，其數無量，莫不皆得大喜成就。

復有無量<key>主河神</key>，所謂：${partnum()}
/I/普發迅流 主河神、　普潔泉澗 主河神、　離塵淨眼 主河神、　十方遍吼 主河神、　救護眾生 主河神、
/I/無熱淨光 主河神、　普生歡喜 主河神、　廣德勝幢 主河神、　光照普世 主河神、　海德光明 主河神……。
/L/如是等而為上首，有無量數，皆勤作意利益眾生。

復有無量<key>主海神</key>，所謂：${partnum()}
/I/出現寶光 主海神、　成金剛幢 主海神、　遠塵離垢 主海神、　普水宮殿 主海神、　吉祥寶月 主海神、
/I/妙華龍髻 主海神、　普持光味 主海神、　寶焰華光 主海神、　金剛妙髻 主海神、　海潮雷聲 主海神……。
/L/如是等而為上首，其數無量，悉以如來功德大海充滿其身。

復有無量<key>主水神</key>，所謂：${partnum()}
/I/普興雲幢 主水神、　海潮雲音 主水神、　妙色輪髻 主水神、　善巧漩澓 主水神、　離垢香積 主水神、
/I/福橋光音 主水神、　知足自在 主水神、　淨喜善音 主水神、　普現威光 主水神、　吼音遍海 主水神……。
/L/如是等而為上首，其數無量，常勤救護一切眾生而為利益。

復有無數<key>主火神</key>，所謂：${partnum()}
/I/普光焰藏 主火神、　普集光幢 主火神、　　　　　大光普照 主火神、　眾妙宮殿 主火神、　無盡光髻 主火神、
/I/種種焰眼 主火神、　十方宮殿如須彌山 主火神、　威光自在 主火神、　光明破暗 主火神、　雷音電光 主火神……。
/L/如是等而為上首，不可稱數，皆能示現種種光明，令諸眾生熱惱除滅。

復有無量<key>主風神</key>，所謂：${partnum()}
/I/無礙光明 主風神、　普現勇業 主風神、　飄擊雲幢 主風神、　淨光莊嚴 主風神、　力能竭水 主風神、
/I/大聲遍吼 主風神、　樹杪垂髻 主風神、　所行無礙 主風神、　種種宮殿 主風神、　大光普照 主風神……。
/L/如是等而為上首，其數無量，皆勤散滅我慢之心。

復有無量<key>主空神</key>，所謂：${partnum()}
/I/淨光普照 主空神、　普遊深廣 主空神、　生吉祥風 主空神、　離障安住 主空神、　廣步妙髻 主空神、
/I/無礙光焰 主空神、　無礙勝力 主空神、　離垢光明 主空神、　深遠妙音 主空神、　光遍十方 主空神……。
/L/如是等而為上首，其數無量，心皆離垢，廣大明潔。

復有無量<key>主方神</key>，所謂：${partnum()}
/I/遍住一切 主方神、　普現光明 主方神、　光行莊嚴 主方神、　周行不礙 主方神、　永斷迷惑 主方神、
/I/普遊淨空 主方神、　大雲幢音 主方神、　髻目無亂 主方神、　普觀世業 主方神、　周遍遊覽 主方神……。
/L/如是等而為上首，其數無量，能以方便，普放光明，恆照十方，相續不絕。

復有無量<key>主夜神</key>，所謂：${partnum()}
/I/普德淨光 主夜神、　喜眼觀世 主夜神、　護世精氣 主夜神、　寂靜海音 主夜神、　普現吉祥 主夜神、
/I/普發樹華 主夜神、　平等護育 主夜神、　遊戲快樂 主夜神、　諸根常喜 主夜神、　出生淨福 主夜神……。
/L/如是等而為上首，其數無量，皆勤修習，以法為樂。

復有無量<key>主晝神</key>，所謂：${partnum()}
/I/示現宮殿 主晝神、　發起慧香 主晝神、　樂勝莊嚴 主晝神、　香華妙光 主晝神、　普集妙藥 主晝神、
/I/樂作喜目 主晝神、　普現諸方 主晝神、　大悲光明 主晝神、　善根光照 主晝神、　妙華瓔珞 主晝神……。
/L/如是等而為上首，其數無量，皆於妙法能生信解，恆共精勤嚴飾宮殿。

復有無量<key>阿脩羅王</key>，所謂：${partnum()}
/I/羅睺 阿脩羅王、　毘摩質多羅 阿脩羅王、　　巧幻術 阿脩羅王、　　大眷屬 阿脩羅王、　　大力 阿脩羅王、
/I/遍照 阿脩羅王、　堅固行妙莊嚴 阿脩羅王、　廣大因慧 阿脩羅王、　出現勝德 阿脩羅王、　妙好音聲 阿脩羅王……。
/L/如是等而為上首，其數無量，悉已精勤摧伏我慢及諸煩惱。

復有不可思議數<key>迦樓羅王</key>，所謂：${partnum()}
/I/大速疾力 迦樓羅王、　無能壞寶髻 迦樓羅王、　清淨速疾 迦樓羅王、　心不退轉 迦樓羅王、　大海處攝持力 迦樓羅王、
/I/堅固淨光 迦樓羅王、　巧嚴冠髻 迦樓羅王、　　普捷示現 迦樓羅王、　普觀海 迦樓羅王、　　普音廣目 迦樓羅王……。
/L/如是等而為上首，不思議數，悉已成就大方便力，善能救攝一切眾生。

復有無量<key>緊那羅王</key>，所謂：${partnum()}
/I/善慧光明天 緊那羅王、　妙華幢 緊那羅王、　　　種種莊嚴 緊那羅王、　悅意吼聲 緊那羅王、　寶樹光明 緊那羅王、
/I/見者欣樂 緊那羅王、　　最勝光莊嚴 緊那羅王、　微妙華幢 緊那羅王、　動地力 緊那羅王、　　攝伏惡眾 緊那羅王……。
/L/如是等而為上首，其數無量，皆勤精進，觀一切法，心恆快樂，自在遊戲。

復有無量<key>摩睺羅伽王</key>，所謂：${partnum()}
/I/善慧 摩睺羅伽王、　　　　　　清淨威音 摩睺羅伽王、　　勝慧莊嚴髻 摩睺羅伽王、　妙目主 摩睺羅伽王、
/I/如燈幢為眾所歸 摩睺羅伽王、　最勝光明幢 摩睺羅伽王、　師子臆 摩睺羅伽王、　　　眾妙莊嚴音 摩睺羅伽王、
/I/須彌堅固 摩睺羅伽王、　　　　可愛樂光明 摩睺羅伽王……。
/L/如是等而為上首，其數無量，皆勤修習廣大方便，令諸眾生永割癡網。

復有無量<key>夜叉王</key>，所謂：${partnum()}
/I/毘沙門 夜叉王、　自在音 夜叉王、　嚴持器仗 夜叉王、　大智慧 夜叉王、　焰眼主 夜叉王、
/I/金剛眼 夜叉王、　勇健臂 夜叉王、　勇敵大軍 夜叉王、　富資財 夜叉王、　力壞高山 夜叉王……。
/L/如是等而為上首，其數無量，皆勤守護一切眾生。

復有無量諸<key>大龍王</key>，所謂：${partnum()}
/I/毘樓博叉 龍王、　娑竭羅 龍王、　雲音妙幢 龍王、　焰口海光 龍王、　普高雲幢 龍王、
/I/德叉迦 龍王、　　無邊步 龍王、　清淨色 龍王、　　普運大聲 龍王、　無熱惱 龍王……。
/L/如是等而為上首，其數無量，莫不勤力興雲布雨，令諸眾生熱惱消滅。

復有無量<key>鳩槃荼王</key>，所謂：${partnum()}
/I/增長 鳩槃荼王、　　　龍主 鳩槃荼王、　　善莊嚴幢 鳩槃荼王、　普饒益行 鳩槃荼王、　　甚可怖畏 鳩槃荼王、
/I/美目端嚴 鳩槃荼王、　高峰慧 鳩槃荼王、　勇健臂 鳩槃荼王、　　無邊淨華眼 鳩槃荼王、　廣大天面阿脩羅眼 鳩槃荼王……。
/L/如是等而為上首，其數無量，皆勤修學無礙法門，放大光明。

復有無量<key>乾闥婆王</key>，所謂：${partnum()}
/I/持國 乾闥婆王、　　　　樹光 乾闥婆王、　　　　淨目 乾闥婆王、　　　　華冠 乾闥婆王、　　　　普音 乾闥婆王、
/I/樂搖動妙目 乾闥婆王、　妙音師子幢 乾闥婆王、　普放寶光明 乾闥婆王、　金剛樹華幢 乾闥婆王、　樂普現莊嚴 乾闥婆王……。
/L/如是等而為上首，其數無量，皆於大法深生信解，歡喜愛重，勤修不倦。

復有無量<key>月天子</key>，所謂月天子：${partnum()}
/I/華王髻光明 天子、　眾妙淨光明 天子、　安樂世間心 天子、　樹王眼光明 天子、　示現清淨光 天子、
/I/普遊不動光 天子、　星宿王自在 天子、　淨覺月 天子、　　　大威德光明 天子……。
/L/如是等而為上首，其數無量，皆勤顯發眾生心寶。

復有無量<key>日天子</key>，所謂日天子：${partnum()}
/I/光焰眼 天子、　　　須彌光可畏敬幢 天子、　離垢寶莊嚴 天子、　勇猛不退轉 天子、　妙華纓光明 天子、
/I/最勝幢光明 天子、　寶髻普光明 天子、　　　光明眼 天子、　　　持勝德 天子、　　　普光明 天子……。
/L/如是等而為上首，其數無量，皆勤修習，利益眾生，增其善根。

復有無量<key>三十三天王</key>，所謂：${partnum()}
/I/釋迦因陀羅 天王、　普稱滿音 天王、　慈目寶髻 天王、　　　寶光幢名稱 天王、　發生喜樂髻 天王、　可愛樂正念 天王、　
/I/須彌勝音 天王、　　成就念 天王、　　可愛樂淨華光 天王、　智日眼 天王、　　　自在光明能覺悟 天王……。
/L/如是等而為上首，其數無量，皆勤發起一切世間廣大之業。

復有無量<key>須夜摩天王</key>，所謂：${partnum()}
/I/善時分 天王、　　　可愛樂光明 天王、　無盡慧功德幢 天王、　善變化端嚴 天王、　總持大光明 天王、
/I/不思議智慧 天王、　輪臍 天王、　　　　光焰 天王、　　　　　光照 天王、　　　　普觀察大名稱 天王……。
/L/如是等而為上首，其數無量，皆勤修習廣大善根，心常喜足。

復有不可思議數<key>兜率陀天王</key>，所謂：${partnum()}
/I/知足 天王、　　　喜樂海髻 天王、　　最勝功德幢 天王、　寂靜光 天王、　　　可愛樂妙目 天王、
/I/寶峰淨月 天王、　最勝勇健力 天王、　金剛妙光明 天王、　星宿莊嚴幢 天王、　可愛樂莊嚴 天王……。
/L/如是等而為上首，不思議數，皆勤念持一切諸佛所有名號。

復有無量<key>化樂天王</key>，所謂：${partnum()}
/I/善變化 天王、　　寂靜音光明 天王、　變化力光明 天王、　莊嚴主 天王、　　念光 天王、
/I/最上雲音 天王、　眾妙最勝光 天王、　妙髻光明 天王、　　成就喜慧 天王、　華光髻 天王、　普見十方 天王……。
/L/如是等而為上首，其數無量，皆勤調伏一切眾生，令得解脫。${partnum()}

復有無數<key>他化自在天王</key>，所謂：${partnum()}
/I/得自在 天王、　妙目主 天王、　　　妙冠幢 天王、　　　勇猛慧 天王、　　　妙音句 天王、
/I/妙光幢 天王、　寂靜境界門 天王、　妙輪莊嚴幢 天王、　華蕊慧自在 天王、　因陀羅力妙莊嚴光明 天王……。
/L/如是等而為上首，其數無量，皆勤修習自在方便廣大法門。

復有不可數<key>大梵天王</key>，所謂：${partnum()}
/I/尸棄 天王、　　　　慧光 天王、　　　善慧光明 天王、　普雲音 天王、　　　觀世言音自在 天王、
/I/寂靜光明眼 天王、　光遍十方 天王、　變化音 天王、　　光明照耀眼 天王、　悅意海音 天王……。
/L/如是等而為上首，不可稱數，皆具大慈，憐愍眾生，舒光普照，令其快樂。

復有無量<key>光音天王</key>，所謂：${partnum()}
/I/可愛樂光明 天王、　清淨妙光 天王、　能自在音 天王、　最勝念智 天王、　　可愛樂清淨妙音 天王、
/I/善思惟音 天王、　　普音遍照 天王、　甚深光音 天王、　無垢稱光明 天王、　最勝淨光 天王……。
/L/如是等而為上首，其數無量，皆住廣大寂靜喜樂無礙法門。

復有無量<key>遍淨天王</key>，所謂：${partnum()}
/I/清淨名稱 天王、　　最勝見 天王、　　寂靜德 天王、　　　　須彌音 天王、　淨念眼 天王、　　　可愛樂最勝光照 天王、
/I/世間自在主 天王、　光焰自在 天王、　樂思惟法變化 天王、　變化幢 天王、　星宿音妙莊嚴 天王……。
/L/如是等而為上首，其數無量，悉已安住廣大法門，於諸世間勤作利益。

復有無量<key>廣果天王</key>，所謂：${partnum()}
/I/愛樂法光明幢 天王、　清淨莊嚴海 天王、　最勝慧光明 天王、　自在智慧幢 天王、　樂寂靜 天王、
/I/普智眼 天王、　　　　樂旋慧 天王、　　　善種慧光明 天王、　無垢寂靜光 天王、　廣大清淨光 天王……。
/L/如是等而為上首，其數無量，莫不皆以寂靜之法而為宮殿安住其中。

復有無數<key>大自在天王</key>，所謂：${partnum()}
/I/妙焰海 天王、　　自在名稱光 天王、　清淨功德眼 天王、　可愛樂大慧 天王、　不動光自在 天王、
/I/妙莊嚴眼 天王、　善思惟光明 天王、　可愛樂大智 天王、　普音莊嚴幢 天王、　極精進名稱光 天王……。
/L/如是等而為上首，不可稱數，皆勤觀察無相之法，所行平等。

${simpleTOC('世主妙嚴品第一', 1, 5, 1)}
/END/世主妙嚴品第一`;
