// Pin-7

function p07FromOther(dir,world,buda,pusa) {
  return `/I/${c(dir)}方過十佛剎微塵數世界，有世界，名：${c(world)}，佛號：${c(buda)}。彼世界中，有菩薩，名：${c(pusa)}，
/I/　與十佛剎微塵數諸菩薩俱，來詣佛所，到已作禮，即於${dir}方化作蓮華藏師子之座，結跏趺坐。`;
}

var ttgtInWorlds = {};
function ttgtW(world) { return ttgtInWorlds[world].write(); }

(() => {
  class TathagataNames {
    constructor(lead, names) {
      this.names = names;
      this.parseLead(lead);
      ttgtInWorlds[this.world || SAHA] = this;
    }
    parseLead(s) {
      this.lead = s;
      this.tail = '如是等，其數十千，令諸眾生各別知見。';
      var colonIdx = s.lastIndexOf('：'), commaIdx = s.indexOf('，'), startIdx;
      if (colonIdx > 0) this.world = s.substring(colonIdx+1);
      if (s.startsWith('此娑婆世界'))     startIdx = 5;
      else if (s.startsWith('此四天下'))  startIdx = 4;
      else if (s != '如來於此四天下中，') throw `TathagataNames ERROR: ${s}`;
      if (startIdx)
        this.lead = s.substring(0,startIdx) + c(s.substring(startIdx,commaIdx)) +
                    s.substring(commaIdx,colonIdx+1) + c(this.world) + '。如來於彼，';
      else
        this.tail = '如是等百億萬種種名號，令諸眾生各別知見。';
    }
    write() {
      return `「諸佛子！${this.lead}
/I/${或名list(this.names.split('\|'))}……。
/L/${this.tail}
`;
    }

  } // end of TathagaNames.

  var data = `
#如來於此四天下中，
一切義成|圓滿月|師子吼|釋迦牟尼|第七仙|毘盧遮那|瞿曇氏|大沙門|最勝|導師

#此四天下東，次有世界，名為：善護
金剛|自在|有智慧|難勝|雲王|無諍|能為主|心歡喜|無與等|斷言論

#此四天下南，次有世界，名為：難忍
帝釋|寶稱|離垢|實語|能調伏|具足喜|大名稱|能利益|無邊|最勝

#此四天下西，次有世界，名為：親慧
水天|喜見|最勝王|調伏天|真實慧|到究竟|歡喜|法慧|所作已辦|善住。

#此四天下北，次有世界，名：有師子
大牟尼|苦行|世所尊|最勝田|一切智|善意|清淨|瑿羅跋那|最上施|苦行得

#此四天下東北方，次有世界，名：妙觀察
調伏魔|成就|息滅|賢天|離貪|勝慧|心平等|無能勝|智慧音|難出現

#此四天下東南方，次有世界，名為：喜樂
極威嚴|光焰聚|遍知|祕密|解脫|性安住|如法行|淨眼王|大勇健|精進力

#此四天下西南方，次有世界，名：甚堅牢
安住|智王|圓滿|不動|妙眼|頂王|自在音|一切施|持眾仙|勝須彌

#此四天下西北方，次有世界，名為：妙地
普遍|光焰|摩尼髻|可憶念|無上義|常喜樂|性清淨|圓滿光|脩臂|住本

#此四天下次下方，有世界，名為：焰慧
集善根|師子相|猛利慧|金色焰|一切知識|究竟音|作利益|到究竟|真實天|普遍勝

#此四天下次上方，有世界，名曰：持地
有智慧|清淨面|覺慧|上首|行莊嚴|發歡喜|意成滿|如盛火|持戒|一道

#此娑婆世界東，次有世界，名為：密訓
平等|殊勝|安慰|開曉意|聞慧|真實語|得自在|最勝身|大勇猛|無等智

#此娑婆世界南，次有世界，名曰：豐溢
本性|勤意|無上尊|大智炬|無所依|光明藏|智慧藏|福德藏|天中天|大自在

#此娑婆世界西，次有世界，名為：離垢
意成|知道|安住本|能解縛|通達義|樂分別|最勝見|調伏行|眾苦行|具足力

#此娑婆世界北，次有世界，名曰：豐樂
薝蔔華色|日藏|善住|現神通|性超邁|慧日|無礙|如月現|迅疾風|清淨身

#此娑婆世界東北方，次有世界，名為：攝取
永離苦|普解脫|大伏藏|解脫智|過去藏|寶光明|離世間|無礙地|淨信藏|心不動

#此娑婆世界東南方，次有世界，名為：饒益
現光明|盡智|美音|勝根|莊嚴蓋|精進根|到分別彼岸|勝定|簡言辭|智慧海

#此娑婆世界西南方，次有世界，名為：鮮少
牟尼主|具眾寶|世解脫|遍知根|勝言辭|明瞭見|根自在|大仙師|開導業|金剛師子

#此娑婆世界西北方，次有世界，名為：歡喜
妙華聚|栴檀蓋|蓮華藏|超越諸法|法寶|復出生|淨妙蓋|廣大眼|有善法|專念法|網藏

#此娑婆世界次下方，有世界，名為：關𨷲
發起焰|調伏毒|帝釋弓|無常所|覺悟本|斷增長|大速疾|常樂施|分別道|摧伏幢

#此娑婆世界次上方，有世界，名曰：振音
勇猛幢|無量寶|樂大施|天光|吉興|超境界|一切主|不退輪|離眾惡|一切智
`;

  var a = data.split('\n'), len = a.length;
  for (var i=0; i<len; ++i) {
    var ln = a[i];
    if (ln[0] == '#')
      new TathagataNames(ln.substring(1), a[++i]);
  }
})();

// Pin-8
var casInWorlds = {};
function casW(world) { return casInWorlds[world].write(); }

(() => {
  class CatuAriaSaccani {
    constructor(world,duk,sam,nir,mag) { // i.e. the names of [catu-aria-saccani] in [world]
      casInWorlds[world] = this;
      this.world = (world == SAHA) ? null : world;
      this.catu = [duk,sam,nir,mag]; // each is |-separeted, no spaces
      this.CATU = [ '苦', '苦滅', '苦集', '苦滅道' ];
    }
    write() {
      this.buf = new Buffer();
      var leads;
      var w = c(this.world || '娑婆');
      if (!this.world) // in Sahā, are called...
        leads = [ `${this.CATU[0]}聖諦，此${w}世界中，`,
                  `${this.CATU[1]}聖諦，此${w}世界中，`,
                  `${this.CATU[2]}聖諦，此${w}世界中，`,
                  `${this.CATU[3]}聖諦，此${w}世界中，`,
                  '此娑婆世界說四聖諦' ];
      else { // what's in Sahā are called in that world as...
        leads = [ `此娑婆世界所言${this.CATU[0]}聖諦者，彼${w}世界中，`,
                  `所言${this.CATU[1]}聖諦者，彼${w}世界中，`,
                  `所言${this.CATU[2]}聖諦者，彼${w}世界中，`,
                  `所言${this.CATU[3]}聖諦者，彼${w}世界中，`,
                  `${w}世界說四聖諦` ];
      }
      this.writeNames(`「諸佛子！${leads[0]}`,  0);
      this.writeNames(`/L/諸佛子！${leads[1]}`, 1);
      this.writeNames(`/L/諸佛子！${leads[2]}`, 2);
      this.writeNames(`/L/諸佛子！${leads[3]}`, 3);
      return this.buf.w(`/L/諸佛子！${leads[4]}，有如是等四百億十千名；隨眾生心，悉令調伏。\n`)
                     .render();
    }
    writeNames(lead, num) {
      var a = this.catu[num].split('\|');
      this.buf.w(lead, '\n/I/', 或名list(a), '。\n');
    }

  } // end of CatuAriaSaccani {

  var data = `
#${SAHA}
罪|逼迫|變異|攀緣|聚|刺|依根|虛誑|癰瘡處|愚夫行
繫縛|滅壞|愛著義|妄覺念|趣入|決定|網|戲論|隨行|顛倒根
無諍|離塵|寂靜|無相|無沒|無自性|無障礙|滅|體真實|住自性
一乘|趣寂|導引|究竟無分別|平等|捨擔|無所趣|隨聖意|仙人行|十藏

#密訓
營求根|不出離|繫縛本|作所不應作|普鬥諍|分析悉無力|作所依|極苦|躁動|形狀物
順生死|染著|燒然|流轉|敗壞根|續諸有|惡行|愛著|病源|分數
第一義|出離|可讚歎|安隱|善入處|調伏|一分|無罪|離貪|決定
猛將|上行|超出|有方便|平等眼|離邊|了悟|攝取|最勝眼|觀方

#最勝
恐怖|分段|可厭惡|須承事|變異|招引怨|能欺奪|難共事|妄分別|有勢力
所言苦集聖諦者，彼最勝
敗壞|癡根|大怨|利刃|滅味|仇對|非己物|惡導引|增黑闇|壞善利
大義|饒益|義中義|無量|所應見|離分別|最上調伏|常平等|可同住|無為
能燒然|最上品|決定|無能破|深方便|出離|不下劣|通達|解脫性|能度脫

#離垢
悔恨|資待|展轉|住城|一味|非法|居宅|妄著處|虛妄見|無有數
無實物|但有語|非潔白|生地|執取|鄙賤|增長|重擔|能生|粗獷
無等等|普除盡|離垢|最勝根|稱會|無資待|滅惑|最上|畢竟|破印
堅固物|方便分|解脫本|本性實|不可毀|最清淨|諸有邊|受寄全|作究竟|淨分別

#豐溢
愛染處|險害根|有海分|積集成|差別根|增長|生滅|障礙|刀劍本|數所成
可惡|名字|無盡|分數|不可愛|能攫噬|粗鄙物|愛著|器|動
相續斷|開顯|無文字|無所修|無所見|無所作|寂滅|已燒盡|捨重擔|已除壞
寂滅行|出離行|勤修證|安隱去|無量壽|善了知|究竟道|難修習|至彼岸|無能勝

#攝取
能劫奪|非善友|多恐怖|種種戲論|地獄性|非實義|貪慾擔|深重根|隨心轉|根本空
貪著|惡成辦|過惡|速疾|能執取|想|有果|無可說|無可取|流轉
不退轉|離言說|無相狀|可欣樂|堅固|上妙|離癡|滅盡|遠惡|出離
離言|無諍|教導|善迴向|大善巧|差別方便|如虛空|寂靜行|勝智|能了義

#饒益
重擔|不堅|如賊|老死|愛所成|流轉|疲勞|惡相狀|生長|利刃
敗壞|渾濁|退失|無力|喪失|乖違|不和合|所作|取|意欲
出獄|真實|離難|覆護|離惡|隨順|根本|捨因|無為|無相續
達無所有|一切印|三昧藏|得光明|不退法|能盡有|廣大路|能調伏|有安隱|不流轉根

#鮮少
險樂欲|繫縛處|邪行|隨受|無慚恥|貪慾根|恆河流|常破壞|炬火性|多憂惱
廣地|能趣|遠慧|留難|恐怖|放逸|攝取|著處|宅主|連縛
充滿|不死|無我|無自性|分別盡|安樂住|無限量|斷流轉|絕行處|不二
大光明|演說海|揀擇義|和合法|離取著|斷相續|廣大路|平等因|淨方便|最勝見

#歡喜
流轉|出生|失利|染著|重擔|差別|內險|集會|惡舍宅|苦惱性
地|方便|非時|非實法|無底|攝取|離戒|煩惱法|狹劣見|垢聚
破依止|不放逸|真實|平等|善淨|無病|無曲|無相|自在|無生
入勝界|斷集|超等類|廣大性|分別盡|神力道|眾方便|正念行|常寂路|攝解脫

#關𨷲
敗壞相|如壞器|我所成|諸趣身|數流轉|眾惡門|性苦|可棄捨|無味|來去
行|憤毒|和合|受支|我心|雜毒|虛稱|乖違|熱惱|驚駭
無積集|不可得|妙藥|不可壞|無著|無量|廣大|覺分|離染|無障礙
安隱行|離欲|究竟實|入義|性究竟|淨現|攝念|趣解脫|救濟|勝行

#振音
匿疵|世間|所依|傲慢|染著性|駛流|不可樂|覆藏|速滅|難調
須制伏|心趣|能縛|隨念起|至後邊|共和合|分別|門|飄動|隱覆
無依處|不可取|轉還|離諍|小|大|善淨|無盡|廣博|無等價
觀察|能摧敵|了知印|能入性|難敵對|無限義|能入智|和合道|恆不動|殊勝義
`;

  var a = data.split('\n'), len = a.length;
  for (var i=0; i<len; ++i) {
    var ln = a[i];
    if (ln[0] == '#')
      new CatuAriaSaccani(ln.substring(1), a[++i], a[++i], a[++i], a[++i]);
  }
})();

// -------------------------------------------------
SC.volNum = 12;
SC.text = `
/TEXT030C/如來名號品第七　　<a#p08>四聖諦品第八</a>

/SECTION/如來名號品第七

爾時，世尊在摩竭提國阿蘭若法菩提場中，始成正覺，於普光明殿坐蓮華藏師子之座，妙悟皆滿，二行永絕；達無相法，住於佛住；得佛平等，到無障處；不可轉法，所行無礙；立不思議，普見三世。與十佛剎微塵數諸菩薩俱，莫不皆是一生補處，悉從他方而共來集，普善觀察諸眾生界、法界、世界、涅槃界，諸業果報、心行次第、一切文義，世、出世間，有為、無為，過、現、未來。

時，諸菩薩作是思惟：「若世尊見愍我等，願隨所樂，開示
/I/佛剎、　　　佛住、　　　佛剎莊嚴、　佛法性、　　佛剎清淨、　<cil>（依報；清涼法師配對）</cil>
/I/佛所說法、　佛剎體性、　佛威德、　　佛剎成就、　佛大菩提。　<cil>（正報）</cil>
/L/如十方一切世界諸佛世尊，為成就一切菩薩故，令如來種性不斷故，救護一切眾生故，令諸眾生永離一切煩惱故，了知一切諸行故，演說一切諸法故，淨除一切雜染故，永斷一切疑網故，拔除一切希望故，滅壞一切愛著處故，說諸菩薩
/I/十住、　十行、　十迴向、　十藏、　十地、　十願、　十定、　十通、　十頂，
/L/及說
/I/如來地、　如來境界、　如來神力、　如來所行、　如來力、　如來無畏、　如來三昧、　如來神通、　如來自在、　如來無礙、
/I/如來眼、　如來耳、　　如來鼻、　　如來舌、　　如來身、　如來意、　　如來辯才、　如來智慧、　如來最勝。
/L/願佛世尊，亦為我說！」

爾時，世尊知諸菩薩心之所念，各隨其類，為現神通。現神通已，
${p07FromOther('東', '金色', '不動智', '文殊師利')}
${p07FromOther('南', '妙色', '無礙智', '覺首')}
${p07FromOther('西', '蓮華色', '滅暗智', '財首')}
${p07FromOther('北', '薝蔔華色', '威儀智', '寶首')}
${p07FromOther('東北', '優缽羅華色', '明相智', '功德首')}
${p07FromOther('東南', '金色', '究竟智', '目首')}
${p07FromOther('西南', '寶色', '最勝智', '精進首')}
${p07FromOther('西北', '金剛色', '自在智', '法首')}
${p07FromOther('下', '玻璃色', '梵智', '智首')}
${p07FromOther('上', '平等色', '觀察智', '賢首')}

爾時，文殊師利菩薩摩訶薩，承佛威力，普觀一切菩薩眾會而作是言：

「此諸菩薩甚為希有！諸佛子！佛國土不可思議，佛住、佛剎莊嚴、佛法性、佛剎清淨、佛說法、佛出現、佛剎成就、佛阿耨多羅三藐三菩提皆不可思議。何以故？諸佛子！十方世界一切諸佛，知諸眾生樂欲不同，隨其所應，說法調伏，如是乃至等法界、虛空界。

「諸佛子！如來於此娑婆世界諸四天下，種種身、種種名、種種色相、種種修短、種種壽量、種種處所、種種諸根、種種生處、種種語業、種種觀察，令諸眾生各別知見。

${ttgtW(SAHA)}
${ttgtW('善護')}
${ttgtW('難忍')}
${ttgtW('親慧')}
${ttgtW('有師子')}
${ttgtW('妙觀察')}
${ttgtW('喜樂')}
${ttgtW('甚堅牢')}
${ttgtW('妙地')}
${ttgtW('焰慧')}
${ttgtW('持地')}
此娑婆世界有百億四天下，如來於中，有百億萬種種名號，令諸眾生各別知見。

${ttgtW('密訓')}
${ttgtW('豐溢')}
${ttgtW('離垢')}
${ttgtW('豐樂')}
${ttgtW('攝取')}
${ttgtW('饒益')}
${ttgtW('鮮少')}
${ttgtW('歡喜')}
${ttgtW('關𨷲')}
${ttgtW('振音')}
「諸佛子！如娑婆世界，如是東方百千億無數無量，無邊無等，不可數、不可稱、不可思、不可量、不可說，盡法界、虛空界、諸世界中，如來名號，種種不同；南、西、北方，四維、上、下，亦復如是。如世尊昔為菩薩時，以種種談論、種種語言、種種音聲，種種業，種種報，種種處，種種方便、種種根，種種信解、種種地位而得成熟，亦令眾生如是知見而為說法。」
${inPageStart('四聖諦品第八　　<cil>(Catu-ariya-saccāni: Dukkha- Samudaya- Nirodha- Magga-sacca)</cil>', 'p08', '如來名號品第七')}

爾時，文殊師利菩薩摩訶薩告諸菩薩言：

${casW(SAHA)}
${casW('密訓')}
${casW('最勝')}
${casW('離垢')}
${casW('豐溢')}
${casW('攝取')}
${casW('饒益')}
${casW('鮮少')}
${casW('歡喜')}
${casW('關𨷲')}
${casW('振音')}
「諸佛子！如此娑婆世界中，說四聖諦，有四百億十千名。如是，東方百千億無數無量、無邊無等、不可數、不可稱、不可思、不可量、不可說，盡法界、虛空界、所有世界，彼一一世界中，說四聖諦，亦各有四百億十千名；隨眾生心，悉令調伏。如東方，南、西、北方，四維、上、下，亦復如是。諸佛子！如娑婆世界，有如上所說；十方世界，彼一切世界亦各有如是。十方世界，一一世界中，說苦聖諦有百億萬種名，說集聖諦、滅聖諦、道聖諦亦各有百億萬種名；皆隨眾生心之所樂，令其調伏。」
/END/四聖諦品第八`;
