SC.volNum = 45;
SC.text = `
/TEXT030C/阿僧祇品第三十　　<a#p31>壽量品第三十一</a>　　<a#p32>諸菩薩住處品第三十二</a>
/SECTION/阿僧祇品第三十

爾時，心王菩薩白佛言：「世尊！諸佛如來演說阿僧祇無量、無邊、無等、不可數、不可稱、不可思、不可量、不可說、不可說不可說。世尊！云何阿僧祇乃至不可說不可說耶？」佛告心王菩薩言：「善哉善哉！善男子！汝今為欲令諸世間入佛所知數量之義，而問如來、應、正等覺。善男子！諦聽諦聽！善思念之！當為汝說。」時，心王菩薩唯然受教。

佛言：「善男子！<ail>（縱向順序）</ail>
${COL_START}
/L/一百洛叉<dim>為</dim>一俱胝，
/L/俱胝俱胝<dim>為</dim>一阿庾多，
/L/阿庾多阿庾多<dim>為</dim>一那由他，
/L/那由他那由他<dim>為</dim>一頻婆羅，
/L/頻婆羅頻婆羅<dim>為</dim>一矜羯羅，
/L/矜羯羅矜羯羅<dim>為</dim>一阿伽羅，
/L/阿伽羅阿伽羅<dim>為</dim>一最勝，
/L/最勝最勝<dim>為</dim>一摩婆<ail>(上聲呼)</ail>羅，
/L/摩婆羅摩婆羅<dim>為</dim>一阿婆<ail>(上)</ail>羅，
/L/阿婆羅阿婆羅<dim>為</dim>一多婆<ail>(上)</ail>羅，
/L/多婆羅多婆羅<dim>為</dim>一界分，
/L/界分界分<dim>為</dim>一普摩，
/L/普摩普摩<dim>為</dim>一禰摩，
/L/禰摩禰摩<dim>為</dim>一阿婆<ail>(上)</ail>鈐，
/L/阿婆鈐阿婆鈐<dim>為</dim>一彌伽<ail>(上)</ail>婆，
/L/彌伽婆彌伽婆<dim>為</dim>一毘拿伽，
/L/毘拿伽毘拿伽<dim>為</dim>一毘伽<ail>(上)</ail>婆，
/L/毘伽婆毘伽婆<dim>為</dim>一僧羯邏摩，
/L/僧羯邏摩僧羯邏摩<dim>為</dim>一毘薩羅，
/L/毘薩羅毘薩羅<dim>為</dim>一毘贍婆，
/L/毘贍婆毘贍婆<dim>為</dim>一毘盛<ail>(上)</ail>伽，
/L/毘盛伽毘盛伽<dim>為</dim>一毘素陀，
/L/毘素陀毘素陀<dim>為</dim>一毘婆訶，
/L/毘婆訶毘婆訶<dim>為</dim>一毘薄底，
/L/毘薄底毘薄底<dim>為</dim>一毘佉擔，
/L/毘佉擔毘佉擔<dim>為</dim>一稱量，
/L/稱量稱量<dim>為</dim>一一持，
/L/一持一持<dim>為</dim>一異路，
/L/異路異路<dim>為</dim>一顛倒，
/L/顛倒顛倒<dim>為</dim>一三末耶，
/L/三末耶三末耶<dim>為</dim>一毘睹羅，
/L/毘睹羅毘睹羅<dim>為</dim>一奚婆<ail>(上)</ail>羅，
/L/奚婆羅奚婆羅<dim>為</dim>一伺察，
/L/伺察伺察<dim>為</dim>一周廣，
/L/周廣周廣<dim>為</dim>一高出，
/L/高出高出<dim>為</dim>一最妙，
/L/最妙最妙<dim>為</dim>一泥羅婆，
/L/泥羅婆泥羅婆<dim>為</dim>一訶理婆，
/L/訶理婆訶理婆<dim>為</dim>一一動，
/L/一動一動<dim>為</dim>一訶理蒲，
/L/訶理蒲訶理蒲<dim>為</dim>一訶理三，
${COL_DIV}
/L/訶理三訶理三<dim>為</dim>一奚魯伽，
/L/奚魯伽奚魯伽<dim>為</dim>一達拿步陀，
/L/達拿步陀達拿步陀<dim>為</dim>一訶魯那，
/L/訶魯那訶魯那<dim>為</dim>一摩魯陀，
/L/摩魯陀摩魯陀<dim>為</dim>一懺慕陀，
/L/懺慕陀懺慕陀<dim>為</dim>一瑿拿陀，
/L/瑿拿陀瑿拿陀<dim>為</dim>一摩魯摩，
/L/摩魯摩摩魯摩<dim>為</dim>一調伏，
/L/調伏調伏<dim>為</dim>一離憍慢，
/L/離憍慢離憍慢<dim>為</dim>一不動，
/L/不動不動<dim>為</dim>一極量，
/L/極量極量<dim>為</dim>一阿麼怛羅，
/L/阿麼怛羅阿麼怛羅<dim>為</dim>一勃麼怛羅，
/L/勃麼怛羅勃麼怛羅<dim>為</dim>一伽麼怛羅，
/L/伽麼怛羅伽麼怛羅<dim>為</dim>一那麼怛羅，
/L/那麼怛羅那麼怛羅<dim>為</dim>一奚麼怛羅，
/L/奚麼怛羅奚麼怛羅<dim>為</dim>一鞞麼怛羅，
/L/鞞麼怛羅鞞麼怛羅<dim>為</dim>一缽羅麼怛羅，
/L/缽羅麼怛羅缽羅麼怛羅<dim>為</dim>一屍婆麼怛羅，
/L/屍婆麼怛羅屍婆麼怛羅<dim>為</dim>一翳羅，
/L/翳羅翳羅<dim>為</dim>一薜羅，
/L/薜羅薜羅<dim>為</dim>一諦羅，
/L/諦羅諦羅<dim>為</dim>一偈羅，
/L/偈羅偈羅<dim>為</dim>一窣步羅，
/L/窣步羅窣步羅<dim>為</dim>一泥羅，
/L/泥羅泥羅<dim>為</dim>一計羅，
/L/計羅計羅<dim>為</dim>一細羅，
/L/細羅細羅<dim>為</dim>一睥羅，
/L/睥羅睥羅<dim>為</dim>一謎羅，
/L/謎羅謎羅<dim>為</dim>一娑拿荼，
/L/娑拿荼娑拿荼<dim>為</dim>一謎魯陀，
/L/謎魯陀謎魯陀<dim>為</dim>一契魯陀，
/L/契魯陀契魯陀<dim>為</dim>一摩睹羅，
/L/摩睹羅摩睹羅<dim>為</dim>一娑母羅，
/L/娑母羅娑母羅<dim>為</dim>一阿野娑，
/L/阿野娑阿野娑<dim>為</dim>一迦麼羅，
/L/迦麼羅迦麼羅<dim>為</dim>一摩伽婆，
/L/摩伽婆摩伽婆<dim>為</dim>一阿怛羅，
/L/阿怛羅阿怛羅<dim>為</dim>一醯魯耶，
/L/醯魯耶醯魯耶<dim>為</dim>一薜魯婆，
/L/薜魯婆薜魯婆<dim>為</dim>一羯羅波，
${COL_DIV}
/L/羯羅波羯羅波<dim>為</dim>一訶婆婆，
/L/訶婆婆訶婆婆<dim>為</dim>一毘婆<ail>(上)</ail>羅，
/L/毘婆羅毘婆羅<dim>為</dim>一那婆<ail>(上)</ail>羅，
/L/那婆羅那婆羅<dim>為</dim>一摩拿羅，
/L/摩拿羅摩拿羅<dim>為</dim>一娑婆<ail>(上)</ail>羅，
/L/娑婆羅娑婆羅<dim>為</dim>一迷拿普，
/L/迷拿普迷拿普<dim>為</dim>一者麼羅，
/L/者麼羅者麼羅<dim>為</dim>一馱麼羅，
/L/馱麼羅馱麼羅<dim>為</dim>一缽拿麼陀，
/L/缽拿麼陀缽拿麼陀<dim>為</dim>一毘伽摩，
/L/毘伽摩毘伽摩<dim>為</dim>一烏波跋多，
/L/烏波跋多烏波跋多<dim>為</dim>一演說，
/L/演說演說<dim>為</dim>一無盡，
/L/無盡無盡<dim>為</dim>一出生，
/L/出生出生<dim>為</dim>一無我，
/L/無我無我<dim>為</dim>一阿畔多，
/L/阿畔多阿畔多<dim>為</dim>一青蓮華，
/L/青蓮華青蓮華<dim>為</dim>一缽頭摩，
/L/缽頭摩缽頭摩<dim>為</dim>一僧祇，
/L/僧祇僧祇<dim>為</dim>一趣，
/L/趣趣<dim>為</dim>一至，
/L/至至<dim>為</dim>一阿僧祇，
/L/阿僧祇阿僧祇<dim>為</dim>一阿僧祇轉，
/L/阿僧祇轉阿僧祇轉<dim>為</dim>一無量，
/L/無量無量<dim>為</dim>一無量轉，
/L/無量轉無量轉<dim>為</dim>一無邊，
/L/無邊無邊<dim>為</dim>一無邊轉，
/L/無邊轉無邊轉<dim>為</dim>一無等，
/L/無等無等<dim>為</dim>一無等轉，
/L/無等轉無等轉<dim>為</dim>一不可數，
/L/不可數不可數<dim>為</dim>一不可數轉，
/L/不可數轉不可數轉<dim>為</dim>一不可稱，
/L/不可稱不可稱<dim>為</dim>一不可稱轉，
/L/不可稱轉不可稱轉<dim>為</dim>一不可思，
/L/不可思不可思<dim>為</dim>一不可思轉，
/L/不可思轉不可思轉<dim>為</dim>一不可量，
/L/不可量不可量<dim>為</dim>一不可量轉，
/L/不可量轉不可量轉<dim>為</dim>一不可說，
/L/不可說不可說<dim>為</dim>一不可說轉，
/L/不可說轉不可說轉<dim>為</dim>一不可說不可說，
/L/此又不可說不可說<dim>為</dim>一不可說不可說轉。」
${COL_END}

爾時，世尊為心王菩薩而說頌曰：

/gatha/
「不可言說不可說，　充滿一切不可說，　不可言說諸劫中，　說不可說不可盡。
　不可言說諸佛剎，　皆悉碎末為微塵，　一塵中剎不可說，　如一一切皆如是。
　此不可說諸佛剎，　一念碎塵不可說，　唸唸所碎悉亦然，　盡不可說劫恆爾。
　此塵有剎不可說，　此剎為塵說更難，　以不可說算數法，　不可說劫如是數。
　以此諸塵數諸劫，　一塵十萬不可說，　爾劫稱讚一普賢，　無能盡其功德量。
　於一微細毛端處，　有不可說諸普賢，　一切毛端悉亦爾，　如是乃至遍法界。
　一毛端處所有剎，　其數無量不可說，　盡虛空量諸毛端，　一一處剎悉如是。
　彼毛端處諸國土，　無量種類差別住，　有不可說異類剎，　有不可說同類剎。
　不可言說毛端處，　皆有淨剎不可說，　種種莊嚴不可說，　種種奇妙不可說。
　於彼一一毛端處，　演不可說諸佛名，　一一名有諸如來，　皆不可說不可說。
　一一諸佛於身上，　現不可說諸毛孔，　於彼一一毛孔中，　現眾色相不可說。
　不可言說諸毛孔，　咸放光明不可說，　於彼一一光明中，　悉現蓮華不可說。
　於彼一一蓮華內，　悉有眾葉不可說，　不可說華眾葉中，　各現色相不可說。
　彼不可說諸色內，　復現眾葉不可說，　葉中光明不可說，　光中色相不可說。
　此不可說色相中，　一一現光不可說，　光中現月不可說，　月復現月不可說。
　於不可說諸月中，　一一現光不可說，　於彼一一光明內，　復現於日不可說。
　於不可說諸日中，　一一現色不可說，　於彼一一諸色內，　又現光明不可說。
　於彼一一光明內，　現不可說師子座，　一一嚴具不可說，　一一光明不可說。
　光中妙色不可說，　色中淨光不可說，　於彼一一淨光內，　復現種種妙光明。
　此光復現種種光，　不可言說不可說，　如是種種光明內，　各現妙寶如須彌。
　一一光中所現寶，　不可言說不可說，　彼如須彌一妙寶，　現眾剎土不可說。
　盡須彌寶無有餘，　示現剎土皆如是，　以一剎土末為塵，　一塵色相不可說。
　眾剎為塵塵有相，　不可言說不可說，　如是種種諸塵相，　皆出光明不可說。
　光中現佛不可說，　佛所說法不可說，　法中妙偈不可說，　聞偈得解不可說。
　不可說解唸唸中，　顯了真諦不可說，　示現未來一切佛，　常演說法無窮盡。
　一一佛法不可說，　種種清淨不可說，　出妙音聲不可說，　轉正法輪不可說。
　於彼一一法輪中，　演修多羅不可說；　於彼一一修多羅，　分別法門不可說；
　於彼一一法門中，　又說諸法不可說；　於彼一一諸法中，　調伏眾生不可說。
　或復於一毛端處，　不可說劫常安住，　如一毛端餘悉然，　所住劫數皆如是。
　其心無礙不可說，　變化諸佛不可說，　一一變化諸如來，　復現於化不可說。
　彼佛法身不可說，　彼佛分身不可說，　莊嚴無量不可說，　往詣十方不可說，
　周行國土不可說，　觀察眾生不可說，　清淨眾生不可說，　調伏眾生不可說。
　彼諸莊嚴不可說，　彼諸神力不可說，　彼諸自在不可說，　彼諸神變不可說。
　所有神通不可說，　所有境界不可說，　所有加持不可說，　所住世間不可說。
　清淨實相不可說，　說修多羅不可說，　於彼一一修多羅，　演說法門不可說；
　於彼一一法門中，　又說諸法不可說；　於彼一一諸法中，　所有決定不可說；
　於彼一一決定中，　調伏眾生不可說。　不可言說同類法，　不可言說同類心，
　不可言說異類法，　不可言說異類心，　不可言說異類根，　不可言說異類語，
　唸唸於諸所行處，　調伏眾生不可說。　所有神變不可說，　所有示現不可說，
　於中時劫不可說，　於中差別不可說，　菩薩悉能分別說，　諸明算者莫能辨。
　一毛端處大小剎，　雜染清淨粗細剎，　如是一切不可說，　一一明瞭可分別。
　以一國土碎為塵，　其塵無量不可說，　如是塵數無邊剎，　俱來共集一毛端。
　此諸國土不可說，　共集毛端無迫隘，　不使毛端有增大，　而彼國土俱來集。
　於中所有諸國土，　形相如本無雜亂，　如一國土不亂餘，　一切國土皆如是。
　虛空境界無邊際，　悉布毛端使充滿，　如是毛端諸國土，　菩薩一念皆能說。
　於一微細毛孔中，　不可說剎次第入，　毛孔能受彼諸剎，　諸剎不能遍毛孔。
　入時劫數不可說，　受時劫數不可說，　於此行列安住時，　一切諸劫無能說。
　如是攝受安住已，　所有境界不可說，　入時方便不可說，　入已所作不可說，
　意根明瞭不可說，　遊歷諸方不可說，　勇猛精進不可說，　自在神變不可說，
　所有思惟不可說，　所有大願不可說，　所有境界不可說，　一切通達不可說，
　身業清淨不可說，　語業清淨不可說，　意業清淨不可說，　信解清淨不可說，
　妙智清淨不可說，　妙慧清淨不可說，　了諸實相不可說，　斷諸疑惑不可說，
　出離生死不可說，　超昇正位不可說，　甚深三昧不可說，　了達一切不可說，
　一切眾生不可說，　一切佛剎不可說，　知眾生身不可說，　知其心樂不可說，
　知其業果不可說，　知其意解不可說，　知其品類不可說，　知其種性不可說，
　知其受身不可說，　知其生處不可說，　知其正生不可說，　知其生已不可說，
　知其解了不可說，　知其趣向不可說，　知其言語不可說，　知其作業不可說。
　菩薩如是大慈悲，　利益一切諸世間，　普現其身不可說，　入諸佛剎不可說，
　見諸菩薩不可說，　發生智慧不可說，　請問正法不可說，　敷揚佛教不可說，
　現種種身不可說，　詣諸國土不可說，　示現神通不可說，　普遍十方不可說，
　處處分身不可說，　親近諸佛不可說，　作諸供具不可說，　種種無量不可說，
　清淨眾寶不可說，　上妙蓮華不可說，　最勝香鬘不可說，　供養如來不可說，
　清淨信心不可說，　最勝悟解不可說，　增上志樂不可說，　恭敬諸佛不可說，
　修行於施不可說，　其心過去不可說，　有求皆施不可說，　一切悉施不可說，
　持戒清淨不可說，　心意清淨不可說，　讚歎諸佛不可說，　愛樂正法不可說，
　成就諸忍不可說，　無生法忍不可說，　具足寂靜不可說，　住寂靜地不可說，
　起大精進不可說，　其心過去不可說，　不退轉心不可說，　不傾動心不可說，
　一切定藏不可說，　觀察諸法不可說，　寂然在定不可說，　了達諸禪不可說，
　智慧通達不可說，　三昧自在不可說，　了達諸法不可說，　明見諸佛不可說，
　修無量行不可說，　發廣大願不可說，　甚深境界不可說，　清淨法門不可說，
　菩薩法力不可說，　菩薩法住不可說，　彼諸正念不可說，　彼諸法界不可說，
　修方便智不可說，　學甚深智不可說，　無量智慧不可說，　究竟智慧不可說，
　彼諸法智不可說，　彼淨法輪不可說，　彼大法雲不可說，　彼大法雨不可說，
　彼諸神力不可說，　彼諸方便不可說，　入空寂智不可說，　唸唸相續不可說，
　無量行門不可說，　唸唸恆住不可說，　諸佛剎海不可說，　悉能往詣不可說，
　諸剎差別不可說，　種種清淨不可說，　差別莊嚴不可說，　無邊色相不可說，
　種種間錯不可說，　種種妙好不可說，　清淨佛土不可說，　雜染世界不可說，
　了知眾生不可說，　知其種性不可說，　知其業報不可說，　知其心行不可說，
　知其根性不可說，　知其解欲不可說，　雜染清淨不可說，　觀察調伏不可說，
　變化自在不可說，　現種種身不可說，　修行精進不可說，　度脫眾生不可說，
　示現神變不可說，　放大光明不可說，　種種色相不可說，　令眾生淨不可說，
　一一毛孔不可說，　放光明網不可說，　光網現色不可說，　普照佛剎不可說，
　勇猛無畏不可說，　方便善巧不可說，　調伏眾生不可說，　令出生死不可說，
　清淨身業不可說，　清淨語業不可說，　無邊意業不可說，　殊勝妙行不可說，
　成就智寶不可說，　深入法界不可說，　菩薩總持不可說，　善能修學不可說，
　智者音聲不可說，　音聲清淨不可說，　正念真實不可說，　開悟眾生不可說，
　具足威儀不可說，　清淨修行不可說，　成就無畏不可說，　調伏世間不可說，
　諸佛子眾不可說，　清淨勝行不可說，　稱歎諸佛不可說，　讚揚無盡不可說，
　世間導師不可說，　演說讚歎不可說，　彼諸菩薩不可說，　清淨功德不可說，
　彼諸邊際不可說，　能住其中不可說，　住中智慧不可說，　盡諸劫住無能說，
　欣樂諸佛不可說，　智慧平等不可說，　善入諸法不可說，　於法無礙不可說，
　三世如空不可說，　三世智慧不可說，　了達三世不可說，　住於智慧不可說，
　殊勝妙行不可說，　無量大願不可說，　清淨大願不可說，　成就菩提不可說，
　諸佛菩提不可說，　發生智慧不可說，　分別義理不可說，　知一切法不可說，
　嚴淨佛剎不可說，　修行諸力不可說，　長時修習不可說，　一念悟解不可說，
　諸佛自在不可說，　廣演正法不可說，　種種神力不可說，　示現世間不可說，
　清淨法輪不可說，　勇猛能轉不可說，　種種開演不可說，　哀愍世間不可說。
　不可言說一切劫，　讚不可說諸功德，　不可說劫猶可盡，　不可說德不可盡。
　不可言說諸如來，　不可言說諸舌根，　歎佛不可言說德，　不可說劫無能盡。
　十方所有諸眾生，　一切同時成正覺，　於中一佛普能現，　不可言說一切身。
　此不可說中一身，　示現於頭不可說；　此不可說中一頭，　示現於舌不可說；
　此不可說中一舌，　示現於聲不可說；　此不可說中一聲，　經於劫住不可說。
　如一如是一切佛，　如一如是一切身，　如一如是一切頭，　如一如是一切舌，
　如一如是一切聲，　不可說劫恆讚佛，　不可說劫猶可盡，　歎佛功德無能盡。
　一微塵中能悉有，　不可言說蓮華界，　一一蓮華世界中，　賢首如來不可說。
　乃至法界悉周遍，　其中所有諸微塵，　世界若成若住壞，　其數無量不可說。
　一微塵處無邊際，　無量諸剎普來入，　十方差別不可說，　剎海分佈不可說。
　一一剎中有如來，　壽命劫數不可說，　諸佛所行不可說，　甚深妙法不可說，
　神通大力不可說，　無障礙智不可說，　入於毛孔不可說，　毛孔因緣不可說，
　成就十力不可說，　覺悟菩提不可說，　入淨法界不可說，　獲深智藏不可說。
　種種數量不可說，　如其一切悉了知；　種種形量不可說，　於此靡不皆通達。
　種種三昧不可說，　悉能經劫於中住，　於不可說諸佛所，　所行清淨不可說。
　得不可說無礙心，　往詣十方不可說，　神力示現不可說，　所行無際不可說，
　往詣眾剎不可說，　了達諸佛不可說，　精進勇猛不可說，　智慧通達不可說。
　於法非行非不行，　入諸境界不可說，　不可稱說諸大劫，　恆遊十方不可說。
　方便智慧不可說，　真實智慧不可說，　神通智慧不可說，　唸唸示現不可說。
　於不可說諸佛法，　一一了知不可說，　能於一時證菩提，　或種種時而證入。
　毛端佛剎不可說，　塵中佛剎不可說，　如是佛剎皆往詣，　見諸如來不可說。
　通達一實不可說，　善入佛種不可說，　諸佛國土不可說，　悉能往詣成菩提。
　國土眾生及諸佛，　體性差別不可說，　如是三世無有邊，　菩薩一切皆明見。」
//
${inPageStart('壽量品第三十一', 'p31', '阿僧祇品第三十')}

爾時，心王菩薩摩訶薩於眾會中告諸菩薩言：「佛子！
/I/此娑婆世界釋迦牟尼佛剎一劫，於極樂世界阿彌陀佛剎　　　　　　　　　<dim>為</dim>一日一夜；
/I/極樂世界　　　　　　　一劫，於袈裟幢世界金剛堅佛剎　　　　　　　　<dim>為</dim>一日一夜；
/I/袈裟幢世界　　　　　　一劫，於不退轉音聲輪世界善勝光明蓮華開敷佛剎<dim>為</dim>一日一夜；
/I/不退轉音聲輪世界　　　一劫，於離垢世界法幢佛剎　　　　　　　　　　<dim>為</dim>一日一夜；
/I/離垢世界　　　　　　　一劫，於善燈世界師子佛剎　　　　　　　　　　<dim>為</dim>一日一夜；
/I/善燈世界　　　　　　　一劫，於妙光明世界光明藏佛剎　　　　　　　　<dim>為</dim>一日一夜；
/I/妙光明世界　　　　　　一劫，於難超過世界法光明蓮華開敷佛剎　　　　<dim>為</dim>一日一夜；
/I/難超過世界　　　　　　一劫，於莊嚴慧世界一切神通光明佛剎　　　　　<dim>為</dim>一日一夜；
/I/莊嚴慧世界　　　　　　一劫，於鏡光明世界月智佛剎　　　　　　　　　<dim>為</dim>一日一夜。
/L/佛子！如是次第，乃至過百萬阿僧祇世界，最後世界一劫，於勝蓮華世界賢勝佛剎為一日一夜，普賢菩薩及諸同行大菩薩等充滿其中。」
${inPageStart('諸菩薩住處品第三十二', 'p32', '壽量品第三十一')}

爾時，心王菩薩摩訶薩於眾會中告諸菩薩言：

「佛子！
/L/東方有處，　名：仙人山，從昔已來，諸菩薩眾於中止住；現有菩薩，名：　金剛勝，與其眷屬、諸菩薩眾三百人俱，　常在其中而演說法。
/L/南方有處，　名：勝峰山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：法慧，　與其眷屬、諸菩薩眾五百人俱，　常在其中而演說法。
/L/西方有處，名：金剛焰山，從昔已來，諸菩薩眾於中止住；現有菩薩，名：精進無畏行，與其眷屬、諸菩薩眾三百人俱，常在其中而演說法。
/L/北方有處，　名：香積山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：香象，　與其眷屬、諸菩薩眾三千人俱，　常在其中而演說法。
/L/東北方有處，名：清涼山，從昔已來，諸菩薩眾於中止住；現有菩薩，名：文殊師利，與其眷屬、諸菩薩眾一萬人俱，　常在其中而演說法。
/L/海中有處，　名：金剛山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：法起，　與其眷屬、諸菩薩眾千二百人俱，常在其中而演說法。
/L/東南方有處，名：支提山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：天冠，　與其眷屬、諸菩薩眾一千人俱，　常在其中而演說法。
/L/西南方有處，名：光明山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：賢勝，　與其眷屬、諸菩薩眾三千人俱，　常在其中而演說法。
/L/西北方有處，名：香風山，從昔已來，諸菩薩眾於中止住；現有菩薩，名曰：香光，　與其眷屬、諸菩薩眾五千人俱，　常在其中而演說法。

「
/L/大海之中復有住處，　名：　莊嚴窟，從昔已來，諸菩薩眾於中止住。
/L/毘捨離南有一住處，　名：　善住根，從昔已來，諸菩薩眾於中止住。
/L/摩度羅城有一住處，　名：　滿足窟，從昔已來，諸菩薩眾於中止住。
/L/俱珍那城有一住處，　名曰：法座，從昔已來，諸菩薩眾於中止住。
/L/清淨彼岸城有一住處，名：　目真鄰陀窟，從昔已來，諸菩薩眾於中止住。
/L/摩蘭陀國有一住處，　名：　無礙龍王建立，從昔已來，諸菩薩眾於中止住。
/L/甘菩遮國有一住處，　名：　出生慈，從昔已來，諸菩薩眾於中止住。
/L/震旦國有一住處，　　名：　那羅延窟，從昔已來，諸菩薩眾於中止住。
/L/疏勒國有一住處，　　名：　牛頭山，從昔已來，諸菩薩眾於中止住。
/L/迦葉彌羅國有一住處，名曰：次第，從昔已來，諸菩薩眾於中止住。
/L/增長歡喜城有一住處，名：　尊者窟，從昔已來，諸菩薩眾於中止住。
/L/菴浮梨摩國有一住處，名：　見億藏光明，從昔已來，諸菩薩眾於中止住。
/L/乾陀羅國有一住處，　名：　苫婆羅窟，從昔已來，諸菩薩眾於中止住。」
/END/諸菩薩住處品第三十二`;
