SC.volNum = 53;
SC.text = 'CALL setSCText().';

function setSCText() {
  qnum = 1;
  SC.text = `
/SECTION/離世間品第三十八之一

爾時，世尊在摩竭提國阿蘭若法菩提場中普光明殿，坐蓮華藏師子之座，
/I/妙悟皆滿，二行永絕，達無相法；
/I/住於佛住，得佛平等，到無障處不可轉法；
/I/所行無礙，立不思議，普見三世；
/I/身恆充遍一切國土，智恆明達一切諸法；
/I/了一切行，盡一切疑，無能測身；
/I/一切菩薩等所求智，到佛無二究竟彼岸，具足如來平等解脫，證無中邊佛平等地，盡於法界等虛空界。
/L/與不可說百千億那由他佛剎微塵數菩薩摩訶薩俱，皆一生當得阿耨多羅三藐三菩提，各從他方種種國土而共來集，悉具菩薩方便智慧。所謂：
/I/善能觀察一切眾生，以方便力，令其調伏，住菩薩法；
/I/善能觀察一切世界，以方便力，普皆往詣；
/I/善能觀察涅槃境界，思惟籌量永離一切戲論分別，而修妙行無有間斷；
/I/善能攝受一切眾生，善入無量諸方便法，知諸眾生空無所有而不壞業果；
/I/善知眾生心使、諸根境界方便，種種差別悉能受持；
/I/三世佛法，自得解了，復為他說；
/I/於世、出世無量諸法，皆善安住，知其真實；
/I/於有為、無為一切諸法，悉善觀察，知無有二；
/I/於一念中，悉能獲得三世諸佛所有智慧；
/I/於唸唸中，悉能示現成等正覺，令一切眾生發心成道；
/I/於一眾生心之所緣，悉知一切眾生境界；
/I/雖入如來一切智地，而不捨菩薩行諸所作業，智慧方便而無所作；
/I/為一一眾生住無量劫，而於阿僧祇劫難可值遇，轉正法輪調伏眾生皆不唐捐，三世諸佛清淨行願悉已具足；
/I/成就如是無量功德，一切如來於無邊劫說不可盡。
/L/其名曰：
/I/普賢菩薩、　普眼菩薩、　普化菩薩、　普慧菩薩、　普見菩薩、
/I/普光菩薩、　普觀菩薩、　普照菩薩、　普幢菩薩、　普覺菩薩……。
/L/如是等十不可說百千億那由他佛剎微塵數，皆悉成就普賢行願，深心大願皆已圓滿；
/I/一切諸佛出興世處，悉能往詣請轉法輪；
/I/善能受持諸佛法眼，不斷一切諸佛種性；
/I/善知一切諸佛興世授記次第、名號、國土、成等正覺、轉於法輪；
/I/無佛世界現身成佛，能令一切雜染眾生皆悉清淨；
/I/能滅一切菩薩業障，入於無礙清淨法界。

爾時，普賢菩薩摩訶薩入廣大三昧，名：佛華莊嚴；入此三昧時，十方所有一切世界六種、十八相動，出大音聲靡不皆聞；然後從其三昧而起。

爾時，普慧菩薩知眾已集，問普賢菩薩言：「佛子！願為演說：
${q200.asking()}
/L/善哉！佛子！如是等法，願為演說！」

/TEXT339/爾時，普賢菩薩告普慧等諸菩薩言：

${bef()}
/I/以菩提心為依，恆不忘失故；
/I/以善知識為依，和合如一故；
/I/以善根為依，修集增長故；
/I/以波羅蜜為依，具足修行故；
/I/以一切法為依，究竟出離故；
/I/以大願為依，增長菩提故；
/I/以諸行為依，普皆成就故；
/I/以一切菩薩為依，同一智慧故；
/I/以供養諸佛為依，信心清淨故；
/I/以一切如來為依，如慈父教誨不斷故。
/L/${aft()}

${bef()}
/I/於一切善根生自善根想；
/I/於一切善根生菩提種子想；
/I/於一切眾生生菩提器想；
/I/於一切願生自願想；
/I/於一切法生出離想；
/I/於一切行生自行想；
/I/於一切法生佛法想；
/I/於一切語言法生語言道想；
/I/於一切佛生慈父想；
/I/於一切如來生無二想。
/L/${aft()}

${bef()}
/I/一切眾生行，普令成熟故；
/I/一切求法行，咸悉修學故；
/I/一切善根行，悉使增長故；
/I/一切三昧行，一心不亂故；
/I/一切智慧行，無不了知故；
/I/一切神通行，變化自在故；
/I/一切修習行，無不能修故；
/I/一切佛剎行，皆悉莊嚴故；
/I/一切善友行，恭敬供養故；
/I/一切如來行，尊重承事故。
/L/${aft()}

${bef()}
/I/令住菩提心善知識；
/I/令生善根善知識；
/I/令行諸波羅蜜善知識；
/I/令解說一切法善知識；
/I/令成熟一切眾生善知識；
/I/令得決定辯才善知識；
/I/令不著一切世間善知識；
/I/令於一切劫修行無厭倦善知識；
/I/令安住普賢行善知識；
/I/令入一切佛智所入善知識。
/L/${aft()}

${bef()}
/I/教化一切眾生勤精進；
/I/深入一切法勤精進；
/I/嚴淨一切世界勤精進；
/I/修行一切菩薩所學勤精進；
/I/滅除一切眾生惡勤精進；
/I/止息一切三惡道苦勤精進；
/I/摧破一切眾魔勤精進；
/I/願為一切眾生作清淨眼勤精進；
/I/供養一切諸佛勤精進；
/I/令一切如來皆悉歡喜勤精進。
/L/${aft()}

${bef()}
/I/自住菩提心，亦當令他住菩提心，心得安隱；
/I/自究竟離忿諍，亦當令他離忿諍，心得安隱；
/I/自離凡愚法，亦令他離凡愚法，心得安隱；
/I/自勤修善根，亦令他勤修善根，心得安隱；
/I/自住波羅蜜道，亦令他住波羅蜜道，心得安隱；
/I/自生在佛家，亦當令他生於佛家，心得安隱；
/I/自深入無自性真實法，亦令他入無自性真實法，心得安隱；
/I/自不誹謗一切佛法，亦令他不誹謗一切佛法，心得安隱；
/I/自滿一切智菩提願，亦令他滿一切智菩提願，心得安隱；
/I/自深入一切如來無盡智藏，亦令他入一切如來無盡智藏，心得安隱。
/L/${aft()}

${bef()}
/I/以佈施成就眾生；
/I/以色身成就眾生；
/I/以說法成就眾生；
/I/以同行成就眾生；
/I/以無染著成就眾生；
/I/以開示菩薩行成就眾生；
/I/以熾然示現一切世界成就眾生；
/I/以示現佛法大威德成就眾生；
/I/以種種神通變現成就眾生；
/I/以種種微密善巧方便成就眾生。
/L/${aft()}

${bef()}
/I/不捨菩提心戒；
/I/遠離二乘地戒；
/I/觀察利益一切眾生戒；
/I/令一切眾生住佛法戒；
/I/修一切菩薩所學戒；
/I/於一切法無所得戒；
/I/以一切善根迴向菩提戒；
/I/不著一切如來身戒；
/I/思惟一切法離取著戒；
/I/諸根律儀戒。
/L/${aft()}

${bef()}
/I/以殊勝意發菩提心，自知受記；
/I/永不厭捨諸菩薩行，自知受記；
/I/住一切劫行菩薩行，自知受記；
/I/修一切佛法，自知受記；
/I/於一切佛教一向深信，自知受記；
/I/修一切善根皆令成就，自知受記；
/I/置一切眾生於佛菩提，自知受記；
/I/於一切善知識和合無二，自知受記；
/I/於一切善知識起如來想，自知受記；
/I/恆勤守護菩提本願，自知受記。
/L/${aft()}

${bef()}
/I/入本願；
/I/入行；
/I/入聚；
/I/入諸波羅蜜；
/I/入成就；
/I/入差別願；
/I/入種種解；
/I/入莊嚴佛土；
/I/入神力自在；
/I/入示現受生。
/L/${aft()}

${bef()}
/I/入無邊成正覺；
/I/入無邊轉法輪；
/I/入無邊方便法；
/I/入無邊差別音聲；
/I/入無邊調伏眾生；
/I/入無邊神力自在；
/I/入無邊種種差別身；
/I/入無邊三昧；
/I/入無邊力、無所畏；
/I/入無邊示現涅槃。
/L/${aft()}

${bef()}
/I/入一切眾生過去行；
/I/入一切眾生未來行；
/I/入一切眾生現在行；
/I/入一切眾生善行；
/I/入一切眾生不善行；
/I/入一切眾生心行；
/I/入一切眾生根行；
/I/入一切眾生解行；
/I/入一切眾生煩惱習氣行；
/I/入一切眾生教化調伏時、非時行。
/L/${aft()}

${bef()}
/I/入染世界；
/I/入淨世界；
/I/入小世界；
/I/入大世界；
/I/入微塵中世界；
/I/入微細世界；
/I/入覆世界；
/I/入仰世界；
/I/入有佛世界；
/I/入無佛世界。
/L/${aft()}

${bef()}
/I/入過去劫；
/I/
/I/
/I/
/I/
/I/
/I/入未來劫；
/I/入現在劫；
/I/入可數劫；
/I/入不可數劫；
/I/入可數劫即不可數劫；
/I/入不可數劫即可數劫；
/I/入一切劫即非劫；
/I/入非劫即一切劫；
/I/入一切劫即一念。
/L/${aft()}

${bef()}
/I/過去世說過去世；
/I/過去世說未來世；
/I/過去世說現在世；
/I/未來世說過去世；
/I/未來世說現在世；
/I/未來世說無盡；
/I/現在世說過去世；
/I/現在世說未來世；
/I/現在世說平等；
/I/現在世說三世即一念。
/L/${aft()}

${bef()}
/I/知諸安立；
/I/知諸語言；
/I/知諸談議；
/I/知諸軌則；
/I/知諸稱謂；
/I/知諸制令；
/I/知其假名；
/I/知其無盡；
/I/知其寂滅；
/I/知一切空。
/L/${aft()}

${bef()}
/I/供養一切諸佛無疲厭心；
/I/親近一切善知識無疲厭心；
/I/求一切法無疲厭心；
/I/聽聞正法無疲厭心；
/I/宣說正法無疲厭心；
/I/教化調伏一切眾生無疲厭心；
/I/置一切眾生於佛菩提無疲厭心；
/I/於一一世界經不可說不可說劫行菩薩行無疲厭心；
/I/遊行一切世界無疲厭心；
/I/觀察思惟一切佛法無疲厭心。
/L/${aft()}

${bef()}
/I/知眾生差別智；
/I/知諸根差別智；
/I/知業報差別智；
/I/知受生差別智；
/I/知世界差別智；
/I/知法界差別智；
/I/知諸佛差別智；
/I/知諸法差別智；
/I/知三世差別智；
/I/知一切語言道差別智。
/L/${aft()}

${bef()}
/I/聞持陀羅尼，持一切法不忘失故；
/I/修行陀羅尼，如實巧觀一切法故；
/I/思惟陀羅尼，了知一切諸法性故；
/I/法光明陀羅尼，照不思議諸佛法故；
/I/三昧陀羅尼，普於現在一切佛所聽聞正法心不亂故；
/I/圓音陀羅尼，解了不思議音聲語言故；
/I/三世陀羅尼，演說三世不可思議諸佛法故；
/I/種種辯才陀羅尼，演說無邊諸佛法故；
/I/出生無礙耳陀羅尼，不可說佛所說之法悉能聞故；
/I/一切佛法陀羅尼，安住如來力、無畏故。
/L/${aft()}

${bef()}
/I/成正覺佛；
/I/　願　佛；
/I/　業報佛；
/I/　住持佛；
/I/　涅槃佛；
/I/　法界佛；
/I/　心　佛；
/I/　三昧佛；
/I/　本性佛；
/I/　隨樂佛。
/L/${aft()}

${bef()}
/I/發大慈心，救護一切眾生故；
/I/發大悲心，代一切眾生受苦故；
/I/發一切施心，悉捨所有故；
/I/發念一切智為首心，樂求一切佛法故；
/I/發功德莊嚴心，學一切菩薩行故；
/I/發如金剛心，一切處受生不忘失故；
/I/發如海心，一切白淨法悉流入故；
/I/發如大山王心，一切惡言皆忍受故；
/I/發安隱心，施一切眾生無怖畏故；
/I/發般若波羅蜜究竟心，巧觀一切法無所有故。
/L/${aft()}

${bef()}
/I/願住未來一切劫普賢行法；
/I/願供養恭敬未來一切佛普賢行法；
/I/願安置一切眾生於普賢菩薩行普賢行法；
/I/願積集一切善根普賢行法；
/I/願入一切波羅蜜普賢行法；
/I/願滿足一切菩薩行普賢行法；
/I/願莊嚴一切世界普賢行法；
/I/願生一切佛剎普賢行法；
/I/願善觀察一切法普賢行法；
/I/願於一切佛國土成無上菩提普賢行法。
/L/${aft()}

${bef()}
/I/觀察眾生無依無怙而起大悲；
/I/觀察眾生性不調順而起大悲；
/I/觀察眾生貧無善根而起大悲；
/I/觀察眾生長夜睡眠而起大悲；
/I/觀察眾生行不善法而起大悲；
/I/觀察眾生欲縛所縛而起大悲；
/I/觀察眾生沒生死海而起大悲；
/I/觀察眾生長嬰疾苦而起大悲；
/I/觀察眾生無善法欲而起大悲；
/I/觀察眾生失諸佛法而起大悲。
/L/${aft()}

${bef()}
/I/為教化調伏一切眾生故，發菩提心；
/I/為除滅一切眾生苦聚故，發菩提心；
/I/為與一切眾生具足安樂故，發菩提心；
/I/為斷一切眾生愚癡故，發菩提心；
/I/為與一切眾生佛智故，發菩提心；
/I/為恭敬供養一切諸佛故，發菩提心；
/I/為隨如來教，令佛歡喜故，發菩提心；
/I/為見一切佛色身相好故，發菩提心；
/I/為入一切佛廣大智慧故，發菩提心；
/I/為顯現諸佛力、無所畏故，發菩提心。
/L/${aft()}

${bef()}
/I/起給侍心、
/I/　歡喜心、
/I/　無違心、
/I/　隨順心、
/I/　無異求心、
/I/　一向心、
/I/　同善根心、
/I/　同願心、
/I/　如來心、
/I/　同圓滿行心。
/L/${aft()}

${bef()}
/I/深心清淨，到於究竟無失壞故；
/I/色身清淨，隨其所宜為示現故；
/I/音聲清淨，了達一切諸語言故；
/I/辯才清淨，善說無邊諸佛法故；
/I/智慧清淨，捨離一切愚癡暗故；
/I/受生清淨，具足菩薩自在力故；
/I/眷屬清淨，成就過去同行眾生諸善根故；
/I/果報清淨，除滅一切諸業障故；
/I/大願清淨，與諸菩薩性無二故；
/I/諸行清淨，以普賢乘而出離故。
/L/${aft()}

${bef()}
/I/施波羅蜜，悉捨一切諸所有故；
/I/戒波羅蜜，淨佛戒故；
/I/忍波羅蜜，住佛忍故；
/I/精進波羅蜜，一切所作不退轉故；
/I/禪波羅蜜，念一境故；
/I/般若波羅蜜，如實觀察一切法故；
/I/智波羅蜜，入佛力故；
/I/願波羅蜜，滿足普賢諸大願故；
/I/神通波羅蜜，示現一切自在用故；
/I/法波羅蜜，普入一切諸佛法故。
/L/${aft()}

${bef()}
/I/一切世界無量差別智隨覺；
/I/一切眾生界不可思議智隨覺；
/I/一切諸法一入種種種種入一智隨覺；
/I/一切法界廣大智隨覺；
/I/一切虛空界究竟智隨覺；
/I/一切世界入過去世智隨覺；
/I/一切世界入未來世智隨覺；
/I/一切世界入現在世智隨覺；
/I/一切如來無量行願皆於一智而得圓滿智隨覺；
/I/三世諸佛皆同一行而得出離智隨覺。
/L/${aft()}

${bef()}
/I/知一切法一相；
/I/知一切法無量相；
/I/知一切法在一念；
/I/知一切眾生心行無礙；
/I/知一切眾生諸根平等；
/I/知一切眾生煩惱習氣行；
/I/知一切眾生心使行；
/I/知一切眾生善、不善行；
/I/知一切菩薩願行自在住持變化；
/I/知一切如來具足十力成等正覺。
/L/${aft()}

${bef()}
/I/入一切法自性力；
/I/入一切法如化力；
/I/入一切法如幻力；
/I/入一切法皆是佛法力；
/I/於一切法無染著力；
/I/於一切法甚明解力；
/I/於一切善知識恆不捨離尊重心力；
/I/令一切善根順至無上智王力；
/I/於一切佛法深信不謗力；
/I/令一切智心不退善巧力。
/L/${aft()}

${bef()}
/I/於一切眾生平等、
/I/　一切法平等、
/I/　一切剎平等、
/I/　一切深心平等、
/I/　一切善根平等、
/I/　一切菩薩平等、
/I/　一切願平等、
/I/　一切波羅蜜平等、
/I/　一切行平等、
/I/　一切佛平等。
/L/${aft()}

${bef()}
/I/一切法但有名；
/I/一切法猶如幻；
/I/一切法猶如影；
/I/一切法但緣起；
/I/一切法業清淨；
/I/一切法但文字所作；
/I/一切法實際；
/I/一切法無相；
/I/一切法第一義；
/I/一切法法界。
/L/${aft()}

${bef()}
/I/說甚深法；
/I/說廣大法；
/I/說種種法；
/I/說一切智法；
/I/說隨順波羅蜜法；
/I/說出生如來力法；
/I/說三世相應法；
/I/說令菩薩不退法；
/I/說讚歎佛功德法；
/I/說一切菩薩學一切佛平等、一切如來境界相應法。
/L/${aft()}

${bef()}
/I/持所集一切福德善根；
/I/持一切如來所說法；
/I/持一切譬諭；
/I/持一切法理趣門；
/I/持一切出生陀羅尼門；
/I/持一切除疑惑法；
/I/持成就一切菩薩法；
/I/持一切如來所說平等三昧門；
/I/持一切法照明門；
/I/持一切諸佛神通遊戲力。
/L/${aft()}

${bef()}
/I/於一切法無分別辯才；
/I/於一切法無所作辯才；
/I/於一切法無所著辯才；
/I/於一切法了達空辯才；
/I/於一切法無疑暗辯才；
/I/於一切法佛加被辯才；
/I/於一切法自覺悟辯才；
/I/於一切法文句差別善巧辯才；
/I/於一切法真實說辯才；
/I/隨一切眾生心令歡喜辯才。
/L/${aft()}

${bef()}
/I/教化調伏一切眾生自在；
/I/普照一切法自在；
/I/修一切善根行自在；
/I/廣大智自在；
/I/無所依戒自在；
/I/一切善根迴向菩提自在；
/I/精進不退轉自在；
/I/智慧摧破一切眾魔自在；
/I/隨所樂欲令發菩提心自在；
/I/隨所應化現成正覺自在。
/L/${aft()}

${bef()}
/I/於一切世界無著；
/I/於一切眾生無著；
/I/於一切法無著；
/I/於一切所作無著；
/I/於一切善根無著；
/I/於一切受生處無著；
/I/於一切願無著；
/I/於一切行無著；
/I/於一切菩薩無著；
/I/於一切佛無著。
/L/${aft()}

${bef()}
/I/積集一切功德平等心；
/I/發一切差別願平等心；
/I/於一切眾生身平等心；
/I/於一切眾生業報平等心；
/I/於一切法平等心；
/I/於一切淨穢國土平等心；
/I/於一切眾生解平等心；
/I/於一切行無所分別平等心；
/I/於一切佛力無畏平等心；
/I/於一切如來智慧平等心。
/L/${aft()}

${bef()}
/I/知一切眾生解出生智慧；
/I/知一切佛剎種種差別出生智慧；
/I/知十方網分齊出生智慧；
/I/知覆仰等一切世界出生智慧；
/I/知一切法一性、種種性廣大住出生智慧；
/I/知一切種種身出生智慧；
/I/知一切世間顛倒妄想悉無所著出生智慧；
/I/知一切法究竟皆以一道出離出生智慧；
/I/知如來神力能入一切法界出生智慧；
/I/知三世一切眾生佛種不斷出生智慧。
/L/${aft()}

${bef()}
/I/一切眾生變化；
/I/一切身變化；
/I/一切剎變化；
/I/一切供養變化；
/I/一切音聲變化；
/I/一切行願變化；
/I/一切教化調伏眾生變化；
/I/一切成正覺變化；
/I/一切說法變化；
/I/一切加持變化。
/L/${aft()}

${bef()}
/I/佛力持；
/I/法力持；
/I/眾生力持；
/I/業力持；
/I/行力持；
/I/願力持；
/I/境界力持；
/I/時力持；
/I/善力持；
/I/智力持。
/L/${aft()}

${simpleTOC('離世間品第三十八', 53, 59, 1)}`;
}
