SC.volNum = 53;
SC.text = 'CALL setSCText().';

function setSCText() {
  SC.text = `
/SECTION/離世間品第三十八之一

爾時，世尊在摩竭提國阿蘭若法菩提場中普光明殿，坐蓮華藏師子之座，
/I/妙悟皆滿，二行永絕，達無相法；
/I/住於佛住，得佛平等，到無障處不可轉法；
/I/所行無礙，立不思議，普見三世；
/I/身恆充遍一切國土，智恆明達一切諸法；
/I/了一切行，盡一切疑，無能測身；
/I/一切菩薩等所求智，到佛無二究竟彼岸，具足如來平等解脫，證無中邊佛平等地，盡於法界等虛空界。
與不可說百千億那由他佛剎微塵數菩薩摩訶薩俱，皆一生當得阿耨多羅三藐三菩提，各從他方種種國土而共來集，悉具菩薩方便智慧。所謂：
/I/善能觀察一切眾生，以方便力，令其調伏，住菩薩法；
/I/善能觀察一切世界，以方便力，普皆往詣；
/I/善能觀察涅槃境界，思惟籌量永離一切戲論分別，而修妙行無有間斷；
/I/善能攝受一切眾生，善入無量諸方便法，知諸眾生空無所有而不壞業果；
/I/善知眾生心使、諸根境界方便，種種差別悉能受持；
/I/三世佛法，自得解了，復為他說；
/I/於世、出世無量諸法，皆善安住，知其真實；
/I/於有為、無為一切諸法，悉善觀察，知無有二；
/I/於一念中，悉能獲得三世諸佛所有智慧；
/I/於唸唸中，悉能示現成等正覺，令一切眾生發心成道；
/I/於一眾生心之所緣，悉知一切眾生境界；
/I/雖入如來一切智地，而不捨菩薩行諸所作業，智慧方便而無所作；
/I/為一一眾生住無量劫，而於阿僧祇劫難可值遇，轉正法輪調伏眾生皆不唐捐，三世諸佛清淨行願悉已具足；
/I/成就如是無量功德，一切如來於無邊劫說不可盡。
其名曰：
/I/普賢菩薩、　普眼菩薩、　普化菩薩、　普慧菩薩、　普見菩薩、
/I/普光菩薩、　普觀菩薩、　普照菩薩、　普幢菩薩、　普覺菩薩……。
如是等十不可說百千億那由他佛剎微塵數，皆悉成就普賢行願，深心大願皆已圓滿；
/I/一切諸佛出興世處，悉能往詣請轉法輪；
/I/善能受持諸佛法眼，不斷一切諸佛種性；
/I/善知一切諸佛興世授記次第、名號、國土、成等正覺、轉於法輪；
/I/無佛世界現身成佛，能令一切雜染眾生皆悉清淨；
/I/能滅一切菩薩業障，入於無礙清淨法界。

爾時，普賢菩薩摩訶薩入廣大三昧，名：佛華莊嚴；入此三昧時，十方所有一切世界六種、十八相動，出大音聲靡不皆聞；然後從其三昧而起。

爾時，普慧菩薩知眾已集，問普賢菩薩言：「佛子！願為演說：
${q200.asking()}
善哉！佛子！如是等法，願為演說！」

/TEXT339/爾時，普賢菩薩告普慧等諸菩薩言：

${qaList(1,41)}

${simpleTOC('離世間品第三十八', 53, 59, 1)}`;
}
