SC.volNum = 56;
SC.text = 'CALL setSCText().';

function setSCText() {
  qnum = 83;
  SC.text = `
/SECTION/離世間品第三十八之四

/TEXT339/「佛子！菩薩摩訶薩有十種無礙用。何等為十？所謂：眾生無礙用；國土無礙用；法無礙用；身無礙用；願無礙用；境界無礙用；智無礙用；神通無礙用；神力無礙用；力無礙用。

/TEXT339/「佛子！云何為菩薩摩訶薩眾生等無礙用？

${bef()}
/I/知一切眾生無眾生無礙用；
/I/知一切眾生但想所持無礙用；
/I/為一切眾生說法未曾失時無礙用；
/I/普化現一切眾生界無礙用；
/I/置一切眾生於一毛孔中而不迫隘無礙用；
/I/為一切眾生示現他方一切世界令其悉見無礙用；
/I/為一切眾生示現釋、梵、護世諸天身無礙用；
/I/為一切眾生示現聲聞、辟支佛寂靜威儀無礙用；
/I/為一切眾生示現菩薩行無礙用；
/I/為一切眾生示現諸佛色身相好、一切智力、成等正覺無礙用。
/L/${aft()}

${bef()}
/I/一切剎作一剎無礙用；
/I/一切剎入一毛孔無礙用；
/I/知一切剎無有盡無礙用；
/I/一身結跏坐充滿一切剎無礙用；
/I/一身中現一切剎無礙用；
/I/震動一切剎不令眾生恐怖無礙用；
/I/以一切剎莊嚴具莊嚴一剎無礙用；
/I/以一剎莊嚴具莊嚴一切剎無礙用；
/I/以一如來一眾會遍一切佛剎示現眾生無礙用；
/I/一切小剎、中剎、大剎、廣剎、深剎、仰剎、覆剎、側剎、正剎，遍諸方網，無量差別，以此普示一切眾生無礙用。
/L/${aft()}

${bef()}
/I/知一切法入一法、一法入一切法，而亦不違眾生心解無礙用；
/I/從般若波羅蜜出生一切法，為他解說悉令開悟無礙用；
/I/知一切法離文字，而令眾生皆得悟入無礙用；
/I/知一切法入一相，而能演說無量法相無礙用；
/I/知一切法離言說，能為他說無邊法門無礙用；
/I/於一切法善轉普門字輪無礙用；
/I/以一切法入一法門而不相違，於不可說劫說不窮盡無礙用；
/I/以一切法悉入佛法，令諸眾生皆得悟解無礙用；
/I/知一切法無有邊際無礙用；
/I/知一切法無障礙際，猶如幻網無量差別，於無量劫為眾生說不可窮盡無礙用。
/L/${aft()}

${bef()}
/I/以一切眾生身入己身無礙用；
/I/以己身入一切眾生身無礙用；
/I/一切佛身入一佛身無礙用；
/I/一佛身入一切佛身無礙用；
/I/一切剎入己身無礙用；
/I/以一身充遍一切三世法示現眾生無礙用；
/I/於一身示現無邊身入三昧無礙用；
/I/於一身示現眾生數等身成正覺無礙用；
/I/於一切眾生身現一眾生身、於一眾生身現一切眾生身無礙用；
/I/於一切眾生身示現法身、於法身示現一切眾生身無礙用。
/L/${aft()}

${bef()}
/I/以一切菩薩願作自願無礙用；
/I/以一切佛成菩提願力示現自成正覺無礙用；
/I/隨所化眾生自成阿耨多羅三藐三菩提無礙用；
/I/於一切無邊際劫大願不斷無礙用；
/I/遠離識身，不著智身，以自在願現一切身無礙用；
/I/捨棄自身成滿他願無礙用；
/I/普教化一切眾生而不捨大願無礙用；
/I/於一切劫行菩薩行而大願不斷無礙用；
/I/於一毛孔現成正覺，以願力故，充遍一切諸佛國土，於不可說不可說世界，為一一眾生如是示現無礙用；
/I/說一句法遍一切法界，興大正法雲，耀解脫電光，震實法雷音，雨甘露味雨，以大願力充洽一切諸眾生界無礙用。
/L/${aft()}

${bef()}
/I/在法界境界而不捨眾生境界無礙用；
/I/在佛境界而不捨魔境界無礙用；
/I/在涅槃境界而不捨生死境界無礙用；
/I/入一切智境界而不斷菩薩種性境界無礙用；
/I/住寂靜境界而不捨散亂境界無礙用；
/I/住無去、無來、無戲論、無相狀、無體性、無言說、如虛空境界而不捨一切眾生戲論境界無礙用；
/I/住諸力解脫境界而不捨一切諸方所境界無礙用；
/I/入無眾生際境界而不捨教化一切眾生無礙用；
/I/住禪定解脫、神通明智、寂靜境界而於一切世界示現受生無礙用；
/I/住如來一切行莊嚴成正覺境界而現一切聲聞、辟支佛寂靜威儀無礙用。
/L/${aft()}

${bef()}
/I/無盡辯才無礙用；
/I/一切總持無有忘失無礙用；
/I/能決定知、決定說一切眾生諸根無礙用；
/I/於一念中以無礙智知一切眾生心之所行無礙用；
/I/知一切眾生欲樂、隨眠、習氣、煩惱病，隨應授藥無礙用；
/I/一念能入如來十力無礙用；
/I/以無礙智知三世一切劫及其中眾生無礙用；
/I/於唸唸中現成正覺示現眾生無有斷絕無礙用；
/I/於一眾生想知一切眾生業無礙用；
/I/於一眾生音解一切眾生語無礙用。
/L/${aft()}

${bef()}
/I/於一身示現一切世界身無礙用；
/I/於一佛眾會聽受一切佛眾會中所說法無礙用；
/I/於一眾生心念中成就不可說無上菩提開悟一切眾生心無礙用；
/I/以一音現一切世界差別言音，令諸眾生各得解了無礙用；
/I/一念中現盡前際一切劫所有業果種種差別，令諸眾生悉得知見無礙用；
/I/一微塵出現廣大佛剎無量莊嚴無礙用；
/I/令一切世界具足莊嚴無礙用；
/I/普入一切三世無礙用；
/I/放大法光明現一切諸佛菩提、眾生行願無礙用；
/I/善守護一切天、龍、夜叉、乾闥婆、阿脩羅、迦樓羅、緊那羅、摩睺羅伽、釋、梵、護世、聲聞、獨覺、菩薩、所有如來十力、
/I/　菩薩善根無礙用。
/L/${aft()}

${bef()}
/I/以不可說世界置一塵中無礙用；
/I/於一塵中現等法界一切佛剎無礙用；
/I/以一切大海水置一毛孔，周旋往返十方世界，而於眾生無所觸嬈無礙用；
/I/以不可說世界內自身中，示現一切神通所作無礙用；
/I/以一毛繫不可數金剛圍山，持以遊行一切世界，不令眾生生恐怖心無礙用；
/I/以不可說劫作一劫，一劫作不可說劫，於中示現成壞差別，不令眾生心有恐怖無礙用；
/I/於一切世界現水、火、風災種種變壞而不惱眾生無礙用；
/I/一切世界三災壞時，悉能護持一切眾生資生之具不令損缺無礙用；
/I/以一手持不思議世界，擲不可說世界之外，不令眾生有驚怖想無礙用；
/I/說一切剎同於虛空，令諸眾生悉得悟解無礙用。
/L/${aft()}

${bef()}
/I/眾生力無礙用，教化調伏不捨離故；
/I/剎力無礙用，示現不可說莊嚴而莊嚴故；
/I/法力無礙用，令一切身入無身故；
/I/劫力無礙用，修行不斷故；
/I/佛力無礙用，覺悟睡眠故；
/I/行力無礙用，攝取一切菩薩行故；
/I/如來力無礙用，度脫一切眾生故；
/I/無師力無礙用，自覺一切諸法故；
/I/一切智力無礙用，以一切智成正覺故；
/I/大悲力無礙用，不捨一切眾生故。
/L/${aft()}

/TEXT339/「佛子！如是名為：菩薩摩訶薩十種無礙用。若有得此十無礙用者，於阿耨多羅三藐三菩提欲成、不成，隨意無違，雖成正覺而亦不斷行菩薩行。何以故？菩薩摩訶薩發大誓願，入無邊無礙用門，善巧示現故。

${bef()}
/I/以眾生身作剎身，而亦不壞眾生身，是菩薩遊戲；
/I/以剎身作眾生身，而亦不壞於剎身，是菩薩遊戲；
/I/於佛身示現聲聞、獨覺身，而不損減如來身，是菩薩遊戲；
/I/於聲聞、獨覺身示現如來身，而不增長聲聞、獨覺身，是菩薩遊戲；
/I/於菩薩行身示現成正覺身，而亦不斷菩薩行身，是菩薩遊戲；
/I/於成正覺身示現修菩薩行身，而亦不減成菩提身，是菩薩遊戲；
/I/於涅槃界示現生死身，而不著生死，是菩薩遊戲；
/I/於生死界示現涅槃，亦不究竟入於涅槃，是菩薩遊戲；
/I/入於三昧而示現行、住、坐、臥一切業，亦不捨三昧正受，是菩薩遊戲；
/I/在一佛所聞法受持，其身不動，而以三昧力，於不可說諸佛會中各各現身，亦不分身，亦不起定，而聞法受持相續不斷，
/I/　如是唸唸於一一三昧身各出生不可說不可說三昧身，如是次第一切諸劫猶可窮盡，而菩薩三昧身不可窮盡，是菩薩遊戲。
/L/${aft()}

${bef()}
/I/示現無邊法界門，令眾生得入，是菩薩境界；
/I/示現一切世界無量妙莊嚴，令眾生得入，是菩薩境界；
/I/化往一切眾生界，悉方便開悟，是菩薩境界；
/I/於如來身出菩薩身，於菩薩身出如來身，是菩薩境界；
/I/於虛空界現世界，於世界現虛空界，是菩薩境界；
/I/於生死界現涅槃界，於涅槃界現生死界，是菩薩境界；
/I/於一眾生語言中，出生一切佛法語言，是菩薩境界；
/I/以無邊身現作一身，一身作一切差別身，是菩薩境界；
/I/以一身充滿一切法界，是菩薩境界；
/I/於一念中，令一切眾生發菩提心，各現無量身成等正覺，是菩薩境界。
/L/${aft()}

${bef()}
/I/深心力，不雜一切世情故；
/I/增上深心力，不捨一切佛法故；
/I/方便力，諸有所作究竟故；
/I/智力，了知一切心行故；
/I/願力，一切所求令滿故；
/I/行力，盡未來際不斷故；
/I/乘力，能出生一切乘，而不捨大乘故；
/I/神變力，於一一毛孔中，各各示現一切清淨世界一切如來出興世故；
/I/菩提力，令一切眾生發心成佛無斷絕故；
/I/轉法輪力，說一句法悉稱一切眾生諸根性慾故。
/L/${aft()}

${bef(1)}
/I/佛子！菩薩摩訶薩悉能聞持一切言說，作如是念：『設有眾生無量無邊從十方來，以百千大法而問於我。我於彼問不見微少難可答相；
/I/　以不見故，心得無畏，究竟到彼大無畏岸，隨其所問悉能酬對，斷其疑惑無有怯弱。』是為菩薩第一無畏。
/I/佛子！菩薩摩訶薩得如來灌頂無礙辯才，到於一切文字言音開示祕密究竟彼岸，作如是念：『設有眾生無量無邊從十方來，
/I/　以無量法而問於我。我於彼問不見微少難可答相；以不見故，心得無畏，究竟到彼大無畏岸，隨其所問悉能酬對，
/I/　斷其疑惑無有恐懼。』是為菩薩第二無畏。
/I/佛子！菩薩摩訶薩知一切法空，離我、離我所，無作、無作者，無知者，無命者，無養育者，無補伽羅，離蘊、界、處，永出諸見，
/I/　心如虛空，作如是念：『不見眾生有微少相能損惱我身、語、意業。』何以故？菩薩遠離我、我所故，不見諸法有少性相。
/I/　以不見故，心得無畏，究竟到彼大無畏岸，堅固勇猛，不可沮壞，是為菩薩第三無畏。
/I/佛子！菩薩摩訶薩佛力所護、佛力所持，住佛威儀，所行真實，無有變易，作如是念：『我不見有少分威儀，令諸眾生生訶責相。』
/I/　以不見故，心得無畏，於大眾中安隱說法，是為菩薩第四無畏。
/I/佛子！菩薩摩訶薩身、語、意業皆悉清淨，鮮白柔和，遠離眾惡，作如是念：『我不自見身、語、意業而有少分可訶責相。』
/I/　以不見故，心得無畏，能令眾生住於佛法，是為菩薩第五無畏。
/I/佛子！菩薩摩訶薩，金剛力士、天、龍、夜叉、乾闥婆、阿脩羅、帝釋、梵王、四天王等常隨侍衛，一切如來護念不捨。
/I/　菩薩摩訶薩作如是念：『我不見有眾魔外道有見眾生能來障我行菩薩道少分之相。』以不見故，心得無畏，究竟到彼大無畏岸，
/I/　發歡喜心行菩薩行，是為菩薩第六無畏。
/I/佛子！菩薩摩訶薩已得成就第一念根，心無忘失佛所悅可，作如是念：『如來所說成菩提道文字句法，我不於中見有少分忘失之相。』
/I/　以不見故，心得無畏，受持一切如來正法行菩薩行，是為菩薩第七無畏。
/I/佛子！菩薩摩訶薩智慧方便悉已通達，菩薩諸力皆得究竟，常勤教化一切眾生，恆以願心繫佛菩提，而為悲愍眾生故，成就眾生故，
/I/　於煩惱濁世示現受生、種族尊貴、眷屬圓滿、所欲從心、歡娛快樂，而作是念：『我雖與此眷屬聚會，不見少相而可貪著，廢我修行
/I/　禪定、解脫，及諸三昧、總持、辯才、菩薩道法。』何以故？菩薩摩訶薩於一切法已得自在到於彼岸，修菩薩行誓不斷絕，不見世間
/I/　有一境界而能惑亂菩薩道者。以不見故，心得無畏，究竟到彼大無畏岸，以大願力於一切世界示現受生，是為菩薩第八無畏。
/I/佛子！菩薩摩訶薩恆不忘失薩婆若心，乘於大乘行菩薩行，以一切智大心勢力，示現一切聲聞、獨覺寂靜威儀，作是念言：
/I/　『我不自見當於二乘而取出離少分之相。』以不見故，心得無畏，到彼無上大無畏岸，普能示現一切乘道，究竟滿足平等大乘，
/I/　是為菩薩第九無畏。
/I/佛子！菩薩摩訶薩成就一切諸白淨法，具足善根，圓滿神通，究竟住於諸佛菩提，滿足一切諸菩薩行，於諸佛所受一切智灌頂之記，
/I/　而常化眾生行菩薩道，作如是念：『我不自見有一眾生應可成熟而不能現諸佛自在而成熟相。』以不見故，心得無畏，
/I/　究竟到彼大無畏岸，不斷菩薩行，不捨菩薩願，隨所應化一切眾生現佛境界而化度之，是為菩薩第十無畏。
/L/${aft()}

${bef(1)}
/I/佛子！菩薩摩訶薩不由他教，自然修行六波羅蜜——常樂大施，不生慳吝；恆持淨戒，無所毀犯；具足忍辱，心不動搖；
/I/　有大精進，未曾退轉；善入諸禪，永無散亂；巧修智慧，悉除惡見。是為第一不由他教隨順波羅蜜道修六度不共法。
/I/佛子！菩薩摩訶薩普能攝受一切眾生。所謂：以財及法而行惠施，正念現前，和顏愛語，其心歡喜，示如實義，令得悟解諸佛菩提，
/I/　無有憎嫌，平等利益。是為第二不由他教順四攝道勤攝眾生不共法。
/I/佛子！菩薩摩訶薩善巧迴向，所謂：不求果報迴向、順佛菩提迴向、不著一切世間禪定三昧迴向、為利益一切眾生迴向、
/I/　為不斷如來智慧迴向。是為第三不由他教為諸眾生發起善根求佛智慧不共法。
/I/佛子！菩薩摩訶薩到善巧方便究竟彼岸，心恆顧復一切眾生，不厭世俗凡愚境界，不樂二乘出離之道，不著己樂，唯勤化度，
/I/　善能入出禪定解脫，於諸三昧悉得自在，往來生死如遊園觀，未曾暫起疲厭之心；或住魔宮，或為釋天、梵王、世主，
/I/　一切生處靡不於中而現其身；或於外道眾中出家，而恆遠離一切邪見；一切世間文詞、咒術、字印、算數，乃至遊戲、歌舞之法，
/I/　悉皆示現，無不精巧；或時示作端正婦人，智慧才能世中第一；於諸世間、出世間法能問能說，問答斷疑皆得究竟；一切世間、
/I/　出世間事亦悉通達到於彼岸，一切眾生恆來瞻仰；雖現聲聞、辟支佛威儀，而不失大乘心；雖唸唸中示成正覺，而不斷菩薩行。
/I/　是為第四不由他教方便善巧究竟彼岸不共法。
/I/佛子！菩薩摩訶薩善知權實雙行道，智慧自在，到於究竟。所謂：住於涅槃而示現生死，知無眾生而勤行教化，究竟寂滅而現起煩惱，
/I/　住一堅密智慧法身而普現無量諸眾生身，常入深禪定而示受欲樂，常遠離三界而不捨眾生，常樂法樂而現有采女歌詠嬉戲，
/I/　雖以眾相好莊嚴其身而示受醜陋貧賤之形，常積集眾善無諸過惡而現生地獄、畜生、餓鬼，雖已到於佛智彼岸而亦不捨菩薩智身。
/I/　菩薩摩訶薩成就如是無量智慧，聲聞、獨覺尚不能知，何況一切童蒙眾生！是為第五不由他教權實雙行不共法。
/I/佛子！菩薩摩訶薩身、口、意業，隨智慧行皆悉清淨。所謂：具足大慈永離殺心，乃至具足正解無有邪見。
/I/　是為第六不由他教身、口、意業隨智慧行不共法。
/I/佛子！菩薩摩訶薩具足大悲，不捨眾生，代一切眾生而受諸苦，所謂：地獄苦、畜生苦、餓鬼苦。為利益故，不生勞倦，
/I/　唯專度脫一切眾生，未曾耽染五欲境界，常為精勤滅除眾苦。是為第七不由他教常起大悲不共法。
/I/佛子！菩薩摩訶薩常為眾生之所樂見，梵王、帝釋、四天王等一切眾生見無厭足。何以故？菩薩摩訶薩久遠世來，行業清淨無有過失，
/I/　是故眾生見者無厭。是為第八不由他教一切眾生皆悉樂見不共法。
/I/佛子！菩薩摩訶薩於薩婆若大誓莊嚴志樂堅固，雖處凡夫、聲聞、獨覺險難之處，終不退失一切智心明淨妙寶。
/I/佛子！如有寶珠，名：淨莊嚴，置泥澇中光色不改，能令濁水悉皆澄淨。菩薩摩訶薩亦復如是，雖在凡愚雜濁等處，
/I/　終不失壞求一切智清淨寶心，而能令彼諸惡眾生遠離妄見、煩惱、穢濁，得求一切智清淨心寶。
/I/　是為第九不由他教在眾難處不失一切智心寶不共法。
/I/佛子！菩薩摩訶薩成就自覺境界智，無師自悟，究竟自在到於彼岸，離垢法繒以冠其首，而於善友不捨親近，於諸如來常樂尊重，
/I/　是為第十不由他教得最上法不離善知識、不捨尊重佛不共法。
/L/${aft()}

${bef()}
/I/一切世界業，悉能嚴淨故；
/I/一切諸佛業，悉能供養故；
/I/一切菩薩業，同種善根故；
/I/一切眾生業，悉能教化故；
/I/一切未來業，盡未來際攝取故；
/I/一切神力業，不離一世界遍至一切世界故；
/I/一切光明業，放無邊色光明，一一光中有蓮華座，各有菩薩結跏趺坐而顯現故；
/I/一切三寶種不斷業，諸佛滅後，守護住持諸佛法故；
/I/一切變化業，於一切世界說法教化諸眾生故；
/I/一切加持業，於一念中隨諸眾生心之所欲皆為示現，令一切願悉成滿故。
/L/${aft()}

${bef()}
/I/不來身，於一切世間不受生故；
/I/不去身，於一切世間求不得故；
/I/不實身，一切世間如實得故；
/I/不虛身，以如實理示世間故；
/I/不盡身，盡未來際無斷絕故；
/I/堅固身，一切眾魔不能壞故；
/I/不動身，眾魔外道不能動故；
/I/具相身，示現清淨百福相故；
/I/無相身，法相究竟悉無相故；
/I/普至身，與三世佛同一身故。
/L/${aft()}

${bef()}
/I/一身充滿一切世界身業；
/I/於一切眾生前悉能示現身業；
/I/於一切趣悉能受生身業；
/I/遊行一切世界身業；
/I/往詣一切諸佛眾會身業；
/I/能以一手普覆一切世界身業；
/I/能以一手磨一切世界金剛圍山碎如微塵身業；
/I/於自身中現一切佛剎成壞示於眾生身業；
/I/以一身容受一切眾生界身業；
/I/於自身中普現一切清淨佛剎，一切眾生於中成道身業。
/L/${aft()}

${bef()}
/I/諸波羅蜜身，悉正修行故；
/I/四攝身，不捨一切眾生故；
/I/大悲身，代一切眾生受無量苦無疲厭故；
/I/大慈身，救護一切眾生故；
/I/福德身，饒益一切眾生故；
/I/智慧身，與一切佛身同一性故；
/I/法身，永離諸趣受生故；
/I/方便身，於一切處現前故；
/I/神力身，示現一切神變故；
/I/菩提身，隨樂、隨時成正覺故。
/L/${aft()}

${bef()}
/I/柔軟語，使一切眾生皆安隱故；
/I/甘露語，令一切眾生悉清涼故；
/I/不誑語，所有言說皆如實故；
/I/真實語，乃至夢中無妄語故；
/I/廣大語，一切釋、梵、四天王等皆尊敬故；
/I/甚深語，顯示法性故；
/I/堅固語，說法無盡故；
/I/正直語，發言易了故；
/I/種種語，隨時示現故；
/I/開悟一切眾生語，隨其欲樂令解了故。
/L/${aft()}

${bef()}
/I/樂聽聞如來音聲淨修語業；
/I/樂聞說菩薩功德淨修語業；
/I/不說一切眾生不樂聞語淨修語業；
/I/真實遠離語四過失淨修語業；
/I/歡喜踴躍讚歎如來淨修語業；
/I/如來塔所高聲讚佛如實功德淨修語業；
/I/以深淨心施眾生法淨修語業；
/I/音樂歌頌讚歎如來淨修語業；
/I/於諸佛所聽聞正法不惜身命淨修語業；
/I/捨身承事一切菩薩及諸法師而受妙法淨修語業。
/L/${aft()}

${bef()}
/I/天王為首，一切天眾而為守護；
/I/龍王為首，一切龍眾而為守護；
/I/夜叉王為首，
/I/乾闥婆王為首，
/I/阿脩羅王為首，
/I/迦樓羅王為首，
/I/緊那羅王為首，
/I/摩睺羅伽王為首，
/I/梵王為首，一一皆與自己徒眾而為守護；
/I/如來法王為首，一切法師皆悉守護。
/L/${aft()}

${bef()}
/I/一切眾生皆令歡喜，
/I/一切世界悉能往詣，
/I/一切諸根皆能了知，
/I/一切勝解悉令清淨，
/I/一切煩惱皆令除斷，
/I/一切習氣皆令捨離，
/I/一切欲樂皆令明潔，
/I/一切深心悉使增長，
/I/一切法界悉令周遍，
/I/一切涅槃普令明見。
/L/${aft()}

${bef()}
/I/如大地心，能持、能長一切眾生諸善根故；
/I/如大海心，一切諸佛無量無邊大智法水悉流入故；
/I/如須彌山王心，置一切眾生於出世間最上善根處故；
/I/如摩尼寶王心，樂欲清淨無雜染故；
/I/如金剛心，決定深入一切法故；
/I/如金剛圍山心，諸魔外道不能動故；
/I/如蓮華心，一切世法不能染故；
/I/如優曇缽華心，一切劫中難值遇故；
/I/如淨日心，破闇障故；
/I/如虛空心，不可量故。
/L/${aft()}

${bef()}
/I/發我當度脫一切眾生心；
/I/發我當令一切眾生除斷煩惱心；
/I/發我當令一切眾生消滅習氣心；
/I/發我當斷除一切疑惑心；
/I/發我當除滅一切眾生苦惱心；
/I/發我當除滅一切惡道諸難心；
/I/發我當敬順一切如來心；
/I/發我當善學一切菩薩所學心；
/I/發我當於一切世間一一毛端處現一切佛成正覺心；
/I/發我當於一切世界擊無上法鼓，令諸眾生隨其根欲悉得悟解心。
/L/${aft()}

${bef()}
/I/周遍一切虛空心，發意廣大故；
/I/周遍一切法界心，深入無邊故；
/I/周遍一切三世心，一念悉知故；
/I/周遍一切佛出現心，於入胎、誕生、出家、成道、轉法輪、般涅槃悉明瞭故；
/I/周遍一切眾生心，悉知根、欲、習氣故；
/I/周遍一切智慧心，隨順了知法界故；
/I/周遍一切無邊心，知諸幻網差別故；
/I/周遍一切無生心，不得諸法自性故；
/I/周遍一切無礙心，不住自心、他心故；
/I/周遍一切自在心，一念普現成佛故。
/L/${aft()}

${bef()}
/I/歡喜根，見一切佛信不壞故；
/I/希望根，所聞佛法皆悟解故；
/I/不退根，一切作事皆究竟故；
/I/安住根，不斷一切菩薩行故；
/I/微細根，入般若波羅蜜微妙理故；
/I/不休息根，究竟一切眾生事故；
/I/如金剛根，證知一切諸法性故；
/I/金剛光焰根，普照一切佛境界故；
/I/無差別根，一切如來同一身故；
/I/無礙際根，深入如來十種力故。
/L/${aft()}

${bef()}
/I/不染一切世間法深心；
/I/不雜一切二乘道深心；
/I/了達一切佛菩提深心；
/I/隨順一切智智道深心；
/I/不為一切眾魔外道所動深心；
/I/淨修一切如來圓滿智深心；
/I/受持一切所聞法深心；
/I/不著一切受生處深心；
/I/具足一切微細智深心；
/I/修一切諸佛法深心。
/L/${aft()}

${bef()}
/I/不退轉增上深心，積集一切善根故；
/I/離疑惑增上深心，解一切如來密語故；
/I/正持增上深心，大願大行所流故；
/I/最勝增上深心，深入一切佛法故；
/I/為主增上深心，一切佛法自在故；
/I/廣大增上深心，普入種種法門故；
/I/上首增上深心，一切所作成辦故；
/I/自在增上深心，一切三昧神通變化莊嚴故；
/I/安住增上深心，攝受本願故；
/I/無休息增上深心，成熟一切眾生故。
/L/${aft()}

${bef()}
/I/佈施勤修，悉捨一切，不求報故；
/I/持戒勤修，頭陀苦行，少欲知足，無所欺故；
/I/忍辱勤修，離自他想，忍一切惡，畢竟不生恚害心故；
/I/精進勤修，身、語、意業未曾散亂，一切所作皆不退轉，至究竟故；
/I/禪定勤修，解脫三昧，出現神通，離一切欲煩惱鬥諍諸眷屬故；
/I/智慧勤修，修習積聚一切功德無厭倦故；
/I/大慈勤修，知諸眾生無自性故；
/I/大悲勤修，知諸法空，普代一切眾生受苦無疲厭故；
/I/覺悟如來十力勤修，了達無礙示眾生故；
/I/不退法輪勤修，轉至一切眾生心故。
/L/${aft()}

${bef()}
/I/最上決定解，種植尊重善根故；
/I/莊嚴決定解，出生種種莊嚴故；
/I/廣大決定解，其心未曾狹劣故；
/I/寂滅決定解，能入甚深法性故；
/I/普遍決定解，發心無所不及故；
/I/堪任決定解，能受佛力加持故；
/I/堅固決定解，摧破一切魔業故；
/I/明斷決定解，了知一切業報故；
/I/現前決定解，隨意能現神通故；
/I/紹隆決定解，一切佛所得記故；
/I/自在決定解，隨意、隨時成佛故。
/L/${aft()}

${bef()}
/I/知一切世界入一世界；
/I/知一世界入一切世界；
/I/知一切世界，一如來身、一蓮華座皆悉周遍；
/I/知一切世界皆如虛空；
/I/知一切世界具佛莊嚴；
/I/知一切世界菩薩充滿；
/I/知一切世界入一毛孔；
/I/知一切世界入一眾生身；
/I/知一切世界，一佛菩提樹、一佛道場皆悉周遍；
/I/知一切世界一音普遍，令諸眾生各別了知，心生歡喜。
/L/${aft()}

${bef()}
/I/知一切眾生界本性無實；
/I/知一切眾生界悉入一眾生身；
/I/知一切眾生界悉入菩薩身；
/I/知一切眾生界悉入如來藏；
/I/知一眾生身普入一切眾生界；
/I/知一切眾生界悉堪為諸佛法器；
/I/知一切眾生界，隨其所欲，為現釋、梵、護世身；
/I/知一切眾生界，隨其所欲，為現聲聞、獨覺寂靜威儀；
/I/知一切眾生界，為現菩薩功德莊嚴身；
/I/知一切眾生界，為現如來相好寂靜威儀，開悟眾生。
/L/${aft()}

${simpleTOC('離世間品第三十八', 53, 59, 4)}`;
}
