const this_book = new MyBookInfo('佛說阿彌陀佛根本祕密神呪經•增插部分')
.addContent(
`
又舍利弗阿彌陀佛有根本祕密陀羅尼神呪是名拔一切業障根本得生極樂淨土神呪即說呪曰

南無阿彌多婆夜哆（一）他伽跢（二）夜哆地（三）夜他阿彌利（四）都婆毗（五）阿彌利哆（六）悉耽婆毗（七）阿彌利哆（八）毗迦蘭諦（九）阿彌利哆（十）毗迦蘭哆（十一）伽彌膩（十二）伽伽那（十三）枳多迦隸（十四）莎婆訶（十五）

佛言若有善男子善女人能誦此呪者阿彌陀佛常住其頂日夜擁護無令怨家而得其便現世常得安穩臨命終時任運往生極樂國土

又舍利弗阿彌陀佛名號具足無量無邊不可思議甚深祕密殊勝微妙無上功德所以者何阿彌陀佛三字中有十方三世一切諸佛一切諸菩薩聲聞阿羅漢一切諸經陀羅尼神呪無量行法是故彼佛名號即是為無上真實至極大乘之法即是為無上殊勝清淨了義妙行即是為無上最勝微妙陀羅尼而說偈曰

#　　阿字十方三世佛　彌字一切諸菩薩/
#　　陀字八萬諸聖教　三字之中是具足

舍利弗若有眾生聞說阿彌陀佛不可思議功德歡喜踊躍至心稱念深信不懈於現在身受無比樂或轉貧賤獲得富貴或得果免宿業所追病患之苦或轉短命得壽延長或怨家變恨得子孫繁榮身心安樂如意滿足如是功德不可稱計
`
);
